Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: If you're teaching this in a classroom, this is a good place to go over the schedule. Note that there is an exercise at the end of each segment, followed by a break. Plan to cover the exercise solution after the break. The times listed here are a suggestion in order to keep the course on schedule. Feel free to be flexible and adjust as necessary!
fa: اگر این را در کلاس درس تدریس می کنید، اینجا مکان خوبی برای مرور برنامه است. توجه داشته باشید که در پایان هر بخش یک تمرین و سپس یک استراحت وجود دارد. برای پوشاندن محلول تمرین بعد از استراحت برنامه ریزی کنید. زمان های ذکر شده در اینجا یک پیشنهاد برای حفظ دوره در برنامه است. با خیال راحت انعطاف پذیر باشید و در صورت لزوم تنظیم کنید!
ja: 教室で教える場合は、ここでスケジュールを確認することをおすすめします。各セグメントの終わりに演習を行い、休憩を挟んでから答え合わせをしてください。上記の時間配分は、あくまでコースを予定どおりに進めるための目安ですので、必要に応じて柔軟に調整してください。
pt_br: Se você estiver ensinando isso em uma sala de aula, este é um bom lugar para revisar a agenda. Observe que há um exercício no final de cada segmento, seguido por uma pausa. Planeje cobrir a solução do exercício após a pausa. Os horários listados aqui são uma sugestão para manter o curso no horário. Sinta-se à vontade para ser flexível e ajustar conforme necessário!
uk: Якщо ви викладаєте цей курс у класі, це гарний момент, щоб ознайомитися з розкладом. Зверніть увагу, що в кінці кожного сегмента є вправа, після якої слідує перерва. Плануйте розглянути рішення вправи після перерви. Час, вказаний тут, є рекомендацією для того, щоб тримати курс за розкладом. Не соромтеся бути гнучкими і вносити корективи за потреби!

source: minutes: 10
uk: хвилин: 10

source: Rust is a new programming language which had its [1.0 release in 2015](https://blog.rust-lang.org/2015/05/15/Rust-1.0.html):
es: Rust es un nuevo lenguaje de programación que lanzó su versión [1.0 en el 2015](https://blog.rust-lang.org/2015/05/15/Rust-1.0.html):
fa: ‏Rust یک زبان برنامه‌نویسی جدید است که [نسخه 1.0 آن در سال 2015 منتشر شد](https://blog.rust-lang.org/2015/05/15/Rust-1.0.html):
ja: Rustは[2015年に1.0版がリリース](https://blog.rust-lang.org/2015/05/15/Rust-1.0.html)された新しいプログラミング言語です：
ko: 러스트는 2015년에 [버전 1.0](https://blog.rust-lang.org/2015/05/15/Rust-1.0.html)을 릴리즈 한 새로운 프로그램 언어입니다:
pt_br: Rust é uma nova linguagem de programação que teve sua [versão 1.0 lançada em 2015](https://blog.rust-lang.org/2015/05/15/Rust-1.0.html):
uk: Rust — це нова мова програмування, яка мала [1.0 випуск у 2015 році](https://blog.rust-lang.org/2015/05/15/Rust-1.0.html):

source: Rust is a statically compiled language in a similar role as C++
es: Rust es un lenguaje compilado estático similar a C++
fa: زبان Rust, یک زبان کامپایل شده ایستا است که نقشی مشابه <span dir=ltr>C++</span> دارد
ja: RustはC++と同様に、静的にコンパイルされる言語です
ko: 러스트는 C++와 유사한 정적 컴파일 언어입니다
pt_br: Rust é uma linguagem compilada estaticamente e tem um papel semelhante ao C++
uk: Rust — це статично скомпільована мова, яка виконує таку саму роль, як C++

source: `rustc` uses LLVM as its backend.
es: `rustc` usa LLVM como backend.
fa: `rustc` از `LLVM` به عنوان بک‌اند خود استفاده می‌کند.
ja: `rustc`はバックエンドにLLVMを使用しています。
ko: `rustc`는 LLVM을 백엔드로 사용합니다.
pt_br: `rustc` usa o LLVM como seu backend.
uk: `rustc` використовує LLVM як бекенд.

source: Rust supports many [platforms and architectures](https://doc.rust-lang.org/nightly/rustc/platform-support.html):
es: Rust es compatible con muchas [plataformas y arquitecturas](https://doc.rust-lang.org/nightly/rustc/platform-support.html):
fa: راست از بسیاری از [بسترها و معماری‌ها](https://doc.rust-lang.org/nightly/rustc/platform-support.html) پشتیبانی می کند :
ja: Rustは多くの[プラットフォームとアーキテクチャ](https://doc.rust-lang.org/nightly/rustc/platform-support.html)をサポートしています：
ko: 러스트는 다양한 플랫폼과 아키텍쳐를 지원합니다:
pt_br: Rust suporta muitas [plataformas e arquiteturas](https://doc.rust-lang.org/nightly/rustc/platform-support.html):
uk: Rust підтримує багато [платформ і архітектур](https://doc.rust-lang.org/nightly/rustc/platform-support.html):

source: Rust is used for a wide range of devices:
es: Rust se utiliza en una gran variedad de dispositivos:
fa: زبان Rust برای طیف گسترده‌ای از دستگاه‌ها استفاده می‌شود:
ja: Rustは様々なデバイスで使用されています：
ko: 러스트는 다양한 장치에서 사용될 수 있습니다:
pt_br: Rust é usado em uma ampla gama de dispositivos:
uk: Rust використовується для широкого спектру пристроїв:

source: firmware and boot loaders,
es: firmware y cargadores de inicio,
fa: میان‌افزار (firmware) و بوت‌لودرها (boot loaders)
ja: ファームウェアやブートローダ、
ko: 펌웨어와 부트로더(임베디드)
pt_br: firmware e carregadores de boot,
uk: прошивки та завантажувачі,

source: smart displays,
es: pantallas inteligentes,
fa: نمایشگر‌های هوشمند,
ja: スマートディスプレイ、
ko: 스마트 디스플레이,
uk: розумні дисплеї,

source: mobile phones,
es: teléfonos móviles,
fa: تلفن‌های همراه,
ja: 携帯電話、
ko: 스마트폰,
pt_br: celulares,
uk: мобільні телефони,

source: desktops,
es: ordenadores,
fa: رایانه‌های رومیزی,
ja: デスクトップ、
ko: 데스크탑,
uk: робочі станції,

source: servers.
es: servidores.
fa: سرورها.
ja: サーバ。
ko: 서버.
pt_br: servidores.
uk: сервери.

source: Rust fits in the same area as C++:
es: Rust satisface las mismas necesidades que C++:
fa: Rust در همان حوزه <span dir=ltr>C++</span> قرار می‌گیرد:
ja: RustとC++が似ているところ:
ko: 러스트는 C++가 사용되는 대부분의 곳에서 사용 가능합니다:
pt_br: Rust se encaixa na mesma área que C++:
uk: Rust вписується в ту ж саму область, що й C++:

source: High flexibility.
es: Gran flexibilidad.
fa: انعطاف پذیری بالا.
ja: 高い柔軟性。
ko: 높은 유연성.
pt_br: Alta flexibilidade.
uk: Висока гнучкість.

source: High level of control.
es: Nivel alto de control.
fa: سطح کنترل بالا.
ja: 高度な制御性。
ko: 높은 수준의 제어.
pt_br: Alto nível de controle.
uk: Високий рівень контролю.

source: Can be scaled down to very constrained devices such as microcontrollers.
es: Se puede reducir verticalmente a dispositivos muy limitados, como los microcontroladores.
fa: می‌تواند به دستگاه‌های بسیار محدود مانند میکروکنترلرها مقیاس‌بندی شود.
ko: 마이크로컨트롤러 같은 매우 제한된 장치로 스케일 다운 가능.
pt_br: Pode ser reduzido para dispositivos com menor poder computacional, tais como microcontroladores.
uk: Може бути зменьшений до дуже обмежених пристроїв, таких як мікроконтролери.

source: Has no runtime or garbage collection.
es: No tiene _runtime_ ni _garbage collection_.
fa: فاقد ران‌تایم (runtime) یا جمع‌آوری زباله (garbage collection) است.
ja: ランタイムやガベージコレクションがない。
ko: 별도의 런타임을 필요로 하지 않으며, 가비지 컬렉션도 없음.
pt_br: Não possui _runtime_ ou coletor de lixo (_garbage collection_).
uk: Не має часу виконання або збирання сміття.

source: Focuses on reliability and safety without sacrificing performance.
es: Se centra en la fiabilidad y la seguridad sin sacrificar el rendimiento.
fa: بر قابلیت اطمینان و ایمنی بدون قربانی کردن عملکرد تمرکز دارد.
ja: パフォーマンスを犠牲にせず、信頼性と安全性に焦点を当てている。
ko: 성능을 타협하지 않으면서도 안정성과 안전에 중점을 둠.
pt_br: Concentra-se em confiabilidade e segurança sem sacrificar o desempenho.
uk: Зосереджений на надійності та безпеці без шкоди для продуктивності.

source: minutes: 3
uk: хвилин: 3

source: Some unique selling points of Rust:
es: Estas son algunas de las ventajas competitivas de Rust:
fa: برخی از نقاط قوت منحصر به فرد زبان Rust:
ja: Rustのユニークなセールスポイントをいくつか紹介します：
ko: 러스트만의 독특한 세일즈 포인트(장점):
pt_br: Alguns pontos exclusivos do Rust:
uk: Деякі унікальні переваги Rust:

source: _Compile time memory safety_ - whole classes of memory bugs are prevented at compile time
fa: _ایمنی حافظه زمان کامپایل_ - کل کلاس های باگ حافظه در زمان کامپایل جلوگیری می شود
ja: _コンパイル時のメモリ安全性_ - クラス全体のメモリのバグをコンパイル時に防止します。
pt_br: _Segurança de memória em tempo de compilação_ - classes inteiras de bugs de memória são prevenidas em tempo de compilação
uk: _Безпека пам'яті під час компіляції_ - цілі класи помилок пам'яті запобігаються на етапі компіляції

source: No uninitialized variables.
es: No hay variables no inicializadas.
fa: هیچ متغیر مقدار‌دهی نشده‌ای (`uninitialized`) وجود ندارد.
ja: 未初期化の変数がない。
ko: 초기화되지 않는 변수가 없습니다.
pt_br: Sem variáveis não inicializadas.
uk: Немає неініціалізованих змінних.

source: No double-frees.
es: No hay errores double free.
fa: هیچ آزادسازی دوباره‌ای وجود ندارد.
ja: 二重解放が起きない。
ko: 메모리 이중 해제가 원천적으로 불가능 합니다.
pt_br: Sem _double-frees_.
uk: Ніяких подвійних звільнень.

source: No use-after-free.
es: No hay errores use-after-free.
fa: هیچ استفاده‌ای پس از آزادسازی وجود ندارد.
ja: 解放済みメモリ使用（use-after-free）がない。
ko: 메모리 해제 후 사용이 원천적으로 불가능 합니다.
pt_br: Sem _use-after-free_.
uk: Немає використання після звільнення.

source: No `NULL` pointers.
es: No hay punteros `NULL`.
fa: هیچ اشاره‌گر `NULL` وجود ندارد.
ja: `NULL`（ヌル）ポインタがない。
ko: `NULL`포인터는 없습니다.
pt_br: Sem ponteiros `NULL`.
uk: Немає вказівників `NULL`.

source: No forgotten locked mutexes.
es: No se olvidan las exclusiones mutuas bloqueadas.
fa: هیچ موتکس قفل شدهِ فراموش شده‌ای وجود ندارد.
ja: ミューテックス（mutex）のロックの解除忘れがない。
ko: 뮤텍스를 잠궈 놓고 여는 것을 잊는 실수를 할 수 없습니다.
pt_br: Sem _mutexes_ bloqueados esquecidos.
uk: Немає забутих заблокованих м'ютексів.

source: No data races between threads.
es: No hay condiciones de carrera de datos entre hilos.
fa: هیچ وضعیت رقابتی (`data races`) بین رشته‌ها وجود ندارد.
ja: スレッド間でデータ競合しない。
ko: 스레드간 데이터 레이스를 막아줍니다.
pt_br: Sem concorrência de dados entre _threads_.
uk: Немає перегонів даних між потоками.

source: No iterator invalidation.
es: No se invalidan los iteradores.
fa: تکرارکننده‌ها (`iterators`) هیچگاه نامعتبر نمی‌شوند..
ja: イテレータが無効化されない。
ko: 반복자가 갑자기 무효화 되는 경우가 없습니다.
pt_br: Sem invalidação de iteradores.
uk: Немає недійсності ітератора.

source: _No undefined runtime behavior_ - what a Rust statement does is never left unspecified
fa: _بدون رفتار زمان اجرا تعریف نشده_ - کاری که دستور Rust انجام می دهد هرگز نامشخص باقی نمی ماند
ja: _未定義のランタイム動作がない_ - Rust ステートメントで行われる処理が未規定のまま残ることはありません。
pt_br: _Sem comportamento indefinido em tempo de execução_ - o que uma instrução Rust executa nunca é deixado indefinido
uk: _Ніякої невизначеної поведінки під час виконання_ - те, що робить оператор Rust, ніколи не залишається невизначеним

source: Array access is bounds checked.
es: Se comprueban los límites de acceso a los arrays.
fa: دسترسی به آرایه با بررسی محدوده چک می‌شود.
ja: 配列へのアクセスには境界チェックが行われる。
ko: 배열 접근시 경계 체크.
pt_br: O acesso a matrizes tem limites verificados.
uk: Доступ до масиву перевірено на межі.

source: Integer overflow is defined (panic or wrap-around).
es: Se define el desbordamiento de enteros (_panic_ o _wrap-around_).
fa: سرریز عدد صحیح تعریف شده است (پانیک یا `wrap-around`).
ko: 정수형 타입의 변수에서 오버플로우 발생시 동작이 잘 정의되어있습니다.
pt_br: Estouro de números inteiros é definido ("pânico" ou _wrap-around_).
uk: Поведінка цілочисельного переповнення визначена (паніка або обертання).

source: _Modern language features_ - as expressive and ergonomic as higher-level languages
fa: _ویژگی های زبان مدرن_ - به اندازه زبان های سطح بالاتر گویا و ارگونومیک است
ja: _最新の言語機能_ - 高水準言語に匹敵する表現力があり、人間が使いやすい機能を備えています。
pt_br: _Recursos de linguagem modernos_ - tão expressivos e ergonômicos quanto linguagens de alto nível
uk: _Можливості сучасної мови_ - така ж виразна та ергономічна, як і мови вищих рівнів

source: Enums and pattern matching.
es: Enumeraciones (_Enums_) y coincidencia de patrones.
fa: Enumها و تطابق الگوها.
ja: 列挙型とパターンマッチング
ko: 열거형과 패턴 매칭.
pt_br: Enums e correspondência de padrões.
uk: Переліки та зіставлення шаблонів.

source: Generics.
es: Genéricos
fa: جنریک‌ها.
ja: ジェネリクス
ko: 제네릭.
pt_br: Genéricos (_Generics_).
uk: Узагальнені типи.

source: No overhead FFI.
es: Sin _overhead_ de FFI.
fa: FFI بدون سربار.
ja: オーバーヘッドのないFFI
ko: FFI 런타임 오버헤드 없음.
pt_br: FFI sem _overhead_.
uk: FFI без накладних витрат.

source: Zero-cost abstractions.
es: Abstracciones sin coste.
fa: انتزاع‌هایی بدون هزینه.
ja: ゼロコスト抽象化
ko: 비용이 들지 않는 추상화.
pt_br: Abstrações de custo zero.
uk: Абстракції без витрат.

source: Great compiler errors.
es: Excelentes errores de compilación.
fa: خطاهای کامپایل عالیست.
ja: 優秀なコンパイルエラー。
ko: 친절한 컴파일러 오류메시지.
pt_br: Excelentes mensagens de erro do compilador.
uk: Чудово деталізовані помилки компілятора.

source: Built-in dependency manager.
es: Gestor de dependencias integrado.
fa: مدیر وابستگی درون-ساختی.
ja: 組み込みの依存関係マネージャ。
ko: 내장 종속성 관리자.
pt_br: Gerenciador de dependências integrado.
uk: Вбудований менеджер залежностей.

source: Built-in support for testing.
es: Asistencia integrada para pruebas.
fa: پشتیبانی درون-ساختی از تست نویسی.
ja: 組み込みのテストサポート。
ko: 내장 테스트 지원.
pt_br: Suporte integrado para testes.
uk: Вбудована підтримка тестування.

source: Excellent Language Server Protocol support.
es: Compatibilidad excelente con el protocolo del servidor de lenguaje.
fa: پشتیبانی عالی از LSP‌.
ja: Language Server Protocol（LSP）のサポート。
ko: LSP (Language Server Protocol, 언어 서버 프로토콜) 지원이 잘되어 있음.
pt_br: Excelente suporte ao protocolo de servidor de linguagem (LSP).
uk: Чудова підтримка протоколу мовного сервера (LSP).

source: Do not spend much time here. All of these points will be covered in more depth later.
fa: وقت زیادی را اینجا صرف نکنید. تمام این نکات بعداً با عمق بیشتری پوشش داده خواهد شد.
ja: ここにはあまり時間をかけないでください。これらのポイントについては、後ほど詳しく説明します。
pt_br: Não gaste muito tempo aqui. Todos esses pontos serão abordados em maior profundidade mais tarde.
uk: Не витрачайте тут багато часу. Всі ці пункти будуть розглянуті більш детально пізніше.

source: Make sure to ask the class which languages they have experience with. Depending on the answer you can highlight different features of Rust:
es: Asegúrate de preguntar a la clase en qué lenguajes tienen experiencia. Dependiendo de la respuesta puedes destacar diferentes características de Rust:
fa: حتما از کلاس بپرسید که با چه زبان‌هایی تجربه دارند. بسته به پاسخ، می توانید ویژگی‌های مختلف Rust را برجسته کنید::
ja: 受講者にどの言語の経験があるかを尋ねてください。回答に応じて、Rustのさまざまな特徴を強調することができます：
ko: 수강생들에게 어떤 프로그래밍 언어를 사용했는지 물어보시기 바랍니다. 어떤 언어를 사용했느냐에 따라 러스트에서 어떤 점을 강조해야 할지를 고민해 보세요:
pt_br: Certifique-se de perguntar à classe com quais linguagens de programação eles têm experiência. Dependendo da resposta você pode destacar diferentes características do Rust:
uk: Обов’язково запитайте клас, з якими мовами вони мають досвід. Залежно від відповіді ви можете виділити різні особливості Rust:

source: Experience with C or C++: Rust eliminates a whole class of _runtime errors_ via the borrow checker. You get performance like in C and C++, but you don't have the memory unsafety issues. In addition, you get a modern language with constructs like pattern matching and built-in dependency management.
es: Experiencia con C o C++: Rust elimina una clase completa de _errores de runtime_ mediante el _borrow checker_. Obtienes un rendimiento similar al de C y C++, pero no tienes problemas de seguridad en la memoria. Además, obtienes un lenguaje moderno con elementos como la coincidencia de patrones y la gestión de dependencias integrado.
fa: تجربه با C یا <span dir=ltr>C++</span> : زبان Rust با استفاده از بررسی کننده قرض‌گیری (اشاره به مبحث قرض گرفتن یا `borrow`) ، یک سری کامل از _خطاهای زمان اجرا_ را از بین می‌برد .t عملکردی مانند C و <span dir=ltr>C++</span> را دارید اما مشکلات عدم ایمنی حافظه را ندارید. علاوه بر این، شما یک زبان مدرن با ساختارهایی مانند تطابق الگو و مدیریت وابستگی داخلی دریافت می‌کنید.
ja: CまたはC++の経験がある場合： Rustは借用チェッカーを介して実行時エラーの一部を排除してくれます。それに加え、CやC++と同等のパフォーマンスを得ることができ、メモリ安全性の問題はありません。さらに、パターンマッチングや組み込みの依存関係管理などの構造要素を含む現代的な言語です。
ko: C/C++: 러스트는 '빌림'검사기를 통해서 수행중에 발생할 수 있는 모든 에러를 제거합니다. 러스트는 C와 C++과 비슷한 수준의 성능을 보여주면서도, 그 언어들에서 종종 발생하는 메모리 관련 오류가 없습니다. 또한, 패턴 매칭이나, 기본적으로 제공되는 종속성 관리와 같은 현대적인 언어의 기능들을 제공합니다.
pt_br: Experiência com C ou C++: Rust elimina toda uma classe de _erros em tempo de execução_ através do verificador de empréstimos (_borrow checker_). Você obtém desempenho como em C e C++, mas sem os problemas de insegurança de memória. Além disso, você tem uma linguagem com funcionalidades modernas como correspondência de padrões e gerenciamento de dependência integrado.
uk: Досвід роботи з C або C++: Rust усуває цілий клас _помилок виконання_ за допомогою засобу перевірки запозичень. Ви отримуєте продуктивність, як у C і C++, але у вас немає проблем із небезпекою пам’яті. Крім того, ви отримуєте сучасну мову з такими конструкціями, як зіставлення шаблонів і вбудоване керування залежностями.

source: Experience with Java, Go, Python, JavaScript...: You get the same memory safety as in those languages, plus a similar high-level language feeling. In addition you get fast and predictable performance like C and C++ (no garbage collector) as well as access to low-level hardware (should you need it).
fa: تجربه با Java، Go، Python، JavaScript...: شما همان ایمنی حافظه (memory safety ) را مانند آن زبان‌ها دریافت می‌کنید، به علاوه یک احساس زبان سطح بالا مشابه را تجربه خواهید کرد. علاوه بر این، شما عملکرد سریع و قابل پیش‌بینی مانند C و <span dir=ltr>C++</span> (بدون garbage collector) و همچنین دسترسی به سخت‌افزار سطح پایین (در صورت نیاز) دریافت می‌کنید.
uk: Досвід роботи з Java, Go, Python, JavaScript...: Ви отримуєте таку саму безпеку пам’яті, що й у цих мовах, а також подібне відчуття мови високого рівня. Крім того, ви отримуєте швидку та передбачувану продуктивність як C і C++ (без збиральника сміття), а також доступ низького рівня до апаратного забезпечення (якщо воно вам знадобиться)

source: minutes: 2
uk: хвилин: 2

source: The [Rust Playground](https://play.rust-lang.org/) provides an easy way to run short Rust programs, and is the basis for the examples and exercises in this course. Try running the "hello-world" program it starts with. It comes with a few handy features:
fa: [Rust Playground](https://play.rust-lang.org/) یک راه آسان برای اجرای برنامه های Rust کوتاه ارائه می دهد و پایه ای برای مثال ها و تمرین های این دوره است. برنامه "Hello-world" را که با آن شروع می شود اجرا کنید. دارای چند ویژگی مفید است:
ja: このコースの例や演習には、短い Rust プログラムを簡単に実行できる [Rust プレイグラウンド](https://play.rust-lang.org/) を使用します。最初の「hello-world」プログラムを実行してみましょう。次のような便利な機能があります。
uk: [Rust Playground](https://play.rust-lang.org/) надає простий спосіб виконання коротких Rust-програм і є основою для прикладів і вправ у цьому курсі. Спробуйте запустити програму "hello-world", з якої він починається. Вона має декілька зручних можливостей:

source: Under "Tools", use the `rustfmt` option to format your code in the "standard" way.
fa: در زیر "ابزارها"، از گزینه "rustfmt" برای قالب بندی کد خود به روش "استاندارد" استفاده کنید.
ja: 「Tools」 にある `rustfmt` オプションを使用して、コードを「standard」の形式でフォーマットします。
pt_br: Em "Tools", use a opção `rustfmt` para formatar seu código da maneira "padrão".
uk: У розділі "Інструменти" скористайтеся опцією `rustfmt` для форматування вашого коду у "стандартний" спосіб.

source: Rust has two main "profiles" for generating code: Debug (extra runtime checks, less optimization) and Release (fewer runtime checks, lots of optimization). These are accessible under "Debug" at the top.
fa: Rust دارای دو "نمایه" اصلی برای تولید کد است: Debug (بررسی های زمان اجرا اضافی، بهینه سازی کمتر) و Release (بررسی های زمان اجرا کمتر، بهینه سازی زیاد). اینها در قسمت «اشکال‌زدایی» در بالا قابل دسترسی هستند.
ja: Rust には、コードを生成するための主要な「プロファイル」が 2 つあります。1 つは Debug（追加のランタイムチェックがあり、最適化が少ない）で、もう 1 つは Release（ランタイムチェックが少なく、最適化が多い）です。これらは上部の [Debug] からアクセスできます。
pt_br: Rust tem dois principais "perfis" (_profiles_) para gerar código: _Debug_ (verificações de tempo de execução extras, menos otimização) e _Release_ (menos verificações de tempo de execução, muita otimização). Estes são acessíveis em "Debug" no topo.
uk: Rust має два основних "профілі" для генерації коду: Налагодження (додаткові перевірки під час виконання, менше оптимізації) та Випуску (менше перевірок під час виконання, багато оптимізацій). Вони доступні у розділі "Налагодження" у верхній частині вікна.

source: If you're interested, use "ASM" under "..." to see the generated assembly code.
fa: اگر علاقه مند هستید، از "ASM" در زیر "..." برای دیدن کد اسمبلی تولید شده استفاده کنید.
ja: 興味がある場合は、「...」 の下にある 「ASM」 を使用すると、生成されたアセンブリ コードを確認できます。
pt_br: Se você estiver interessado, use "ASM" em "..." para ver o código assembly gerado.
uk: Якщо вам цікаво, скористайтеся командою "ASM" в "...", щоб переглянути згенерований асемблерний код.

source: As students head into the break, encourage them to open up the playground and experiment a little. Encourage them to keep the tab open and try things out during the rest of the course. This is particularly helpful for advanced students who want to know more about Rust's optimizations or generated assembly.
fa: هنگامی که دانش آموزان به سمت استراحت می روند، آنها را تشویق کنید تا playground را باز کنند و کمی تجربه کنند. آنها را تشویق کنید که برگه را باز نگه دارند و در بقیه دوره چیزهایی را امتحان کنند. این به ویژه برای دانش‌آموزان پیشرفته که می‌خواهند درباره بهینه‌سازی‌های Rust یا مونتاژ تولید شده بیشتر بدانند مفید است.
ja: 受講者が休憩に入ったら、プレイグラウンドを開いていろいろ試してみるよう促します。タブを開いたままにして、コースの残りの部分で学習したことを試すようすすめましょう。これは、Rust の最適化や生成されたアセンブリについて詳しく知りたい受講者に特に役立ちます。
pt_br: Conforme os alunos se dirigem para o intervalo, incentive-os a abrir o playground e experimentar um pouco. Incentive-os a manter a guia aberta e experimentar durante o resto do curso. Isso é particularmente útil para alunos avançados que desejam saber mais sobre as otimizações do Rust ou assembly gerado.
uk: Коли студенти підуть на перерву, заохотьте їх відкрити майданчик і трохи поекспериментувати. Заохочуйте їх залишати вкладку відкритою і пробувати щось протягом решти курсу. Це особливо корисно для досвідчених студентів, які хочуть дізнатися більше про оптимізацію Rust або згенеровану збірку.

source: minutes: 5
uk: хвилин: 5

source: Let us jump into the simplest possible Rust program, a classic Hello World program:
es: Vamos a hablar del programa Rust más simple, un clásico Hola Mundo:
fa: بیایید به ساده ترین برنامه Rust ممکن یعنی یک برنامه Hello World کلاسیک بپردازیم:
ja: さっそく一番シンプルなプログラムである定番のHello Worldからみてみましょう：
ko: 가장 간단한 러스트 프로그램으로써, 고전적인 Hello World 를 작성해 보겠습니다:
pt_br: Vamos pular para o programa em Rust mais simples possível, o clássico "Olá Mundo":
uk: Перейдемо до найпростішої програми Rust, класичної програми Hello World:

source: "Hello 🌍!"
fa: "سلام 🌍!"
uk: "Привіт 🌍!"

source: What you see:
es: Lo que ves:
fa: آنچه شما می‌بینید:
ja: プログラムの中身：
ko: 확인할 수 있는 것들:
pt_br: O que você vê:
uk: Що ви бачите:

source: Functions are introduced with `fn`.
es: Las funciones se introducen con `fn`.
fa: توابع با `fn` معرفی می‌شوند.
ja: 関数は`fn`で導入されます。
ko: 함수는 `fn`으로 선언합니다.
pt_br: Funções são introduzidas com `fn`.
uk: Функції вводяться за допомогою `fn`.

source: Blocks are delimited by curly braces like in C and C++.
es: Los bloques se delimitan con llaves, como en C y C++.
fa: بلوک‌ها با پرانتزهای باز و بسته مانند C و <span dir=ltr>C++</span> محدود می‌شوند.
ja: CやC++と同様に、ブロックは波括弧で囲みます。
ko: C/C++ 와 마찬가지로 중괄호`{}`로 블록을 표시합니다.
pt_br: Os blocos são delimitados por chaves como em C e C++.
uk: Блоки розділені фігурними дужками, як у C і C++.

source: The `main` function is the entry point of the program.
es: La función `main` es el punto de entrada del programa.
fa: تابع `main` نقطه ورود برنامه است.
ja: `main`関数はプログラムのエントリーポイントになります。
ko: `main` 함수는 프로그램 진입점입니다.
pt_br: A função `main` é o ponto de entrada do programa.
uk: Функція `main` є точкою входу в програму.

source: Rust has hygienic macros, `println!` is an example of this.
es: Rust tiene macros higiénicas, como por ejemplo `println!`.
fa: زبان Rust دارای ماکروهای hygienic است، <span dir=ltr>`println!`</span> یک نمونه از این است.
ja: Rustには衛生的なマクロがあり、`println!`はその一例です。
ko: 러스트는 똑똑한 매크로(hygienic macros) 시스템을 가지고 있습니다. `println!`는 그 예시입니다.
pt_br: Rust tem macros "higiênicas", `println!` é um exemplo disso.
uk: Rust має гігієнічні макроси, `println!` є прикладом цього.
