Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: [Beginner's Series to Rust](https://docs.microsoft.com/en-us/shows/beginners-series-to-rust/) and [Take your first steps with Rust](https://docs.microsoft.com/en-us/learn/paths/rust-first-steps/): two Rust guides aimed at new developers. The first is a set of 35 videos and the second is a set of 11 modules which covers Rust syntax and basic constructs.
es: [Beginner's Series to Rust](https://docs.microsoft.com/es/shows/beginners-series-to-rust/) y [Take your first steps with Rust](https://docs.microsoft.com/es/learn/paths/rust-first-steps/): dos guías de Rust dirigidas a nuevos desarrolladores. La primera es un conjunto de 35 vídeos y la segunda es un conjunto de 11 módulos que cubren la sintaxis y las construcciones básicas de Rust.
fa: ‏ [Beginner's Series to Rust](https://docs.microsoft.com/en-us/shows/beginners-series-to-rust/) و [اولین قدم های خود را با Rust بردارید](https://docs.microsoft. com/en-us/learn/paths/rust-first-steps/): دو راهنمای Rust با هدف توسعه‌دهندگان جدید می‌باشد. اولی مجموعه‌ای از ۳۵ ویدیو و دومی مجموعه‌ای از ۱۱ ماژول است که دستور Rust و ساختارهای اولیه را پوشش می‌دهد.
ja: [Beginner's Series to Rust](https://docs.microsoft.com/ja-jp/shows/beginners-series-to-rust/) および [Take your first steps with Rust](https://docs.microsoft. com/en-us/learn/paths/rust-first-steps/): 初心者のデベロッパーを対象とした 2 つの Rust ガイドです。1 つ目は 35 個の動画で構成され、2 つ目は Rust の構文と基本的な構造を説明する 11 のモジュールで構成されています。
ko: [Beginner's Series to Rust](https://docs.microsoft.com/en-us/shows/beginners-series-to-rust/), [Take your first steps with Rust](https://docs.microsoft.com/en-us/learn/paths/rust-first-steps/): 첫번째는 35개의 시리즈 영상이며 두번째는 러스트의 문법과 구조를 다루는 11개의 모듈 세트입니다.
pt_br: [Beginner's Series to Rust](https://docs.microsoft.com/en-us/shows/beginners-series-to-rust/) e [Take your first steps with Rust](https://docs.microsoft.com/en-us/learn/paths/rust-first-steps/): dois guias Rust voltados para novos desenvolvedores. O primeiro é um conjunto de 35 vídeos e o o segundo é um conjunto de 11 módulos que cobrem a sintaxe Rust e as construções básicas.
uk: [Серія для початківців до Rust](https://docs.microsoft.com/en-us/shows/beginners-series-to-rust/) і [Зробіть перші кроки з Rust](https://docs.microsoft.com/en-us/learn/paths/rust-first-steps/): два посібники з Rust, призначені для нових розробників. Перший — це набір із 35 відео, а другий — набір із 11 модулів, які охоплюють синтаксис і базові конструкції Rust.

source: [Learn Rust With Entirely Too Many Linked Lists](https://rust-unofficial.github.io/too-many-lists/): in-depth exploration of Rust's memory management rules, through implementing a few different types of list structures.
es: [Learn Rust With Entirely Too Many Linked Lists](https://rust-unofficial.github.io/too-many-lists/): exploración detallada de las reglas de gestión de la memoria de Rust a través de la implementación de algunos tipos diferentes de estructuras de listas.
fa: ‏ [Learn Rust With Entirely Too Linked Lists]‌(https://rust-unofficial.github.io/too-many-lists/): کاوش عمیق قوانین مدیریت حافظه Rust، از طریق اجرای چند نوع مختلف list structure.
ja: [Learn Rust With Entirely Too Many Linked Lists](https://rust-unofficial.github.io/too-many-lists/): いくつかの異なるタイプのリスト構造の実装を通じて、Rust のメモリ管理ルールを深く掘り下げています。
ko: [Learn Rust With Entirely Too Many Linked Lists](https://rust-unofficial.github.io/too-many-lists/): 몇가지 유형의 리스트 자료구조를 구현해보면서 러스트의 메모리 관리 규칙들을 깊이있게 탐색합니다.
pt_br: [Learn Rust With Entirely Too Many Linked Lists](https://rust-unofficial.github.io/too-many-lists/): exploração aprofundada das regras de gerenciamento de memória do Rust, através da implementação de alguns tipos diferentes de estruturas de lista.
uk: [Вивчіть Rust із надто великою кількістю пов’язаних списків](https://rust-unofficial.github.io/too-many-lists/): поглиблене вивчення правил керування пам’яттю Rust за допомогою реалізації кількох різних типів структур списків .

source: Please see the [Little Book of Rust Books](https://lborb.github.io/book/) for even more Rust books.
es: Consulta [The Little Book of Rust Books](https://lborb.github.io/book/) para ver más libros de Rust.
fa: لطفاً [Little Book of Rust Books]‌(https://lborb.github.io/book/) را برای کتاب‌های بیشتر در مورد Rust ببینید.
ja: Rust に関するその他の書籍については、[Little Book of Rust Books](https://lborb.github.io/book/) をご覧ください。
ko: [Little Book of Rust Books](https://lborb.github.io/book/)에서 더 많은 러스트 북을 확인해보세요.
pt_br: Consulte o [Little Book of Rust Books](https://lborb.github.io/book/) para ainda mais livros sobre Rust.
uk: Будь ласка, перегляньте [Маленьку книгу Rust книжок](https://lborb.github.io/book/), щоб отримати ще більше книг Rust.

source: The material here builds on top of the many great sources of Rust documentation. See the page on [other resources](other-resources.md) for a full list of useful resources.
es: Este material se basa en las numerosas fuentes de documentación sobre Rust. Consulta la página de [otros recursos](other-resources.md) para ver una lista completa de recursos útiles.
fa: مطالب در اینجا بر روی بسیاری از منابع عالی مستندات Rust ساخته شده است. برای فهرست کامل منابع مفید به صفحه [دیگر منابع]‌(other-resources.md) مراجعه کنید.
ja: ここで紹介する教材は、多くの優れた Rust ドキュメントのソースに基づいています。役立つリソースの一覧については、[その他のリソース](other-resources.md) のページをご覧ください。
ko: 이 자료는 많은 훌륭한 러스트 문서들의 도움을 받아 작성되었습니다. 유용한 자료의 전체 목록은 [other resources](other-resources.md)에서 살펴보시기 바랍니다.
pt_br: O material aqui se baseia em muitas fontes excelentes de documentação do Rust. Consulte a página em [outros recursos](other-resources.md) para obter uma lista completa de recursos úteis .
uk: Цей матеріал базується на багатьох чудових джерелах документації Rust. Перегляньте сторінку [інші ресурси](other-resources.md), щоб отримати повний список корисних ресурсів.

source: The material of Comprehensive Rust is licensed under the terms of the Apache 2.0 license, please see [`LICENSE`](https://github.com/google/comprehensive-rust/blob/main/LICENSE) for details.
es: El material de Comprehensive Rust está sujeto a los términos de la licencia Apache 2.0. Para obtener más información, consulta [`LICENSE`](https://github.com/google/comprehensive-rust/blob/main/LICENSE).
fa: محتوای Comprehensive Rust تحت مجوز Apache 2.0 مجوز دارند، لطفاً برای جزئیات بیشتر به ['LICENSE'](https://github.com/google/comprehensive-rust/blob/main/LICENSE) مراجعه کنید.
ja: Comprehensive Rust の教材は、Apache 2.0 ライセンスの規約により使用が許諾されています。詳細については、[`LICENSE`](https://github.com/google/comprehensive-rust/blob/main/LICENSE) をご覧ください。
pt_br: O material do Comprehensive Rust é licenciado sob os termos da licença Apache 2.0 , consulte [`LICENSE`](https://github.com/google/comprehensive-rust/blob/main/LICENSE) para obter detalhes.
uk: Матеріали Comprehensive Rust надаються згідно з умовами ліцензії Apache 2.0, будь ласка, дивіться [`LICENSE`](https://github.com/google/comprehensive-rust/blob/main/LICENSE) для отримання детальної інформації.

source: Rust by Example
fa: ‏ Rust به‌همراه مثال
uk: Rust на прикладі

source: Some examples and exercises have been copied and adapted from [Rust by Example](https://doc.rust-lang.org/rust-by-example/). Please see the `third_party/rust-by-example/` directory for details, including the license terms.
es: Algunos ejemplos y ejercicios se han copiado y adaptado del libro [Rust by Example](https://doc.rust-lang.org/rust-by-example/). Consulta el directorio `third_party/rust-by-example/` para obtener más información, incluidos los términos de la licencia.
fa: ‏ برخی از مثال‌ها و تمرین‌ها از [Rust by Example]‌(https://doc.rust-lang.org/rust-by-example/) کپی و اقتباس شده‌اند. لطفاً برای جزئیات، از جمله شرایط license، به دایرکتوری `third_party/rust-by-example/` مراجعه کنید.
ja: 一部の例と演習は、[Rust by Example](https://doc.rust-lang.org/rust-by-example/) からコピーして編集したものです。ライセンス規約などの詳細については、`third_party/rust-by-example/` ディレクトリを参照してください。
ko: 일부 예제와 연습문제는 [Rust by Example](https://doc.rust-lang.org/rust-by-example/)을 참조하였습니다. 라이선스 조항을 포함하여 저장소의 `third_party/rust-by-example/` 폴더를 참조하시기 바랍니다.
pt_br: Alguns exemplos e exercícios foram copiados e adaptados de [Rust by Exemplo](https://doc.rust-lang.org/rust-by-example/). por favor veja o diretório `third_party/rust-by-example/` para detalhes, incluindo os termos de licença.
uk: Деякі приклади та вправи скопійовано та адаптовано з [Rust на прикладі](https://doc.rust-lang.org/rust-by-example/). Будь ласка, перегляньте каталог `third_party/rust-by-example/` для отримання детальної інформації, включно з умовами ліцензії.

source: Some exercises have been copied and adapted from [Rust on Exercism](https://exercism.org/tracks/rust). Please see the `third_party/rust-on-exercism/` directory for details, including the license terms.
es: Se han copiado y adaptado algunos ejercicios del recurso [Rust on Exercism](https://exercism.org/tracks/rust). Consulta el directorio `third_party/rust-on-exercism/` para obtener más información, incluidos los términos de la licencia.
fa: برخی تمرین‌‌ا از [Rust on Exercism]‌(https://exercism.org/tracks/rust) کپی و اقتباس شده‌اند. لطفاً برای جزئیات، از جمله شرایط license، به دایرکتوری `third_party/rust-on-exercism/` مراجعه کنید.
ja: 一部の演習は、[Rust on Exercism](https://exercism.org/tracks/rust) をコピーして編集したものです。ライセンス規約などの詳細については、`third_party/rust-on-exercism/` ディレクトリを参照してください。
ko: 일부 연습문제는 [Rust on Exercism](https://exercism.org/tracks/rust)을 참조하였습니다. 라이선스 조항을 포함하여 저장소의 `third_party/rust-on-exercism/`폴더를 참조하시기 바랍니다.
pt_br: Alguns exercícios foram copiados e adaptados de [Rust on Exercism](https://exercism.org/tracks/rust). por favor veja o diretório `third_party/rust-on-exercism/` para obter detalhes, incluindo os termos licença.
uk: Деякі вправи скопійовано та адаптовано з [Rust on Exercism](https://exercism.org/tracks/rust). Будь ласка, перегляньте каталог `third_party/rust-on-exercism/`, щоб отримати докладніші відомості, включно з умовами ліцензії.

source: The [Interoperability with C++](android/interoperability/cpp.md) section uses an image from [CXX](https://cxx.rs/). Please see the `third_party/cxx/` directory for details, including the license terms.
es: En la sección [Interoperabilidad con C++](android/Interop/cpp.md) se usa una imagen de [CXX](https://cxx.rs/). Consulta el directorio `third_party/cxx/` para obtener más información, incluidos los términos de la licencia.
fa: بخش [Interoperability with C++](android/interoperability/cpp.md) از تصویری از [CXX](https://cxx.rs/) استفاده می‌کند. لطفاً برای جزئیات، از جمله شرایط license، دایرکتوری `third_party/cxx/` را ببینید.
ja: [C++ との相互運用性](android/interoperability/cpp.md) セクションでは、[CXX](https://cxx.rs/) の画像を使用しています。ライセンス規約などの詳細については、`third_party/cxx/` ディレクトリを参照してください。
ko: 4일차 오후 강의 중 [Interoperability with C++](android/interoperability/cpp.md)에서는 [CXX](https://cxx.rs/)의 이미지를 사용하였습니다. 라이선스 조항을 포함하여 저장소의 `third_party/cxx/`폴더를 참조하시기 바랍니다.
pt_br: A seção [Interoperabilidade com C++](android/interoperability/cpp.md) usa uma imagem de [CXX](https://cxx.rs/). Consulte o diretório `third_party/cxx/` para obter detalhes, incluindo os termos da licença.
uk: У розділі [Взаємодія з C++](android/interoperability/cpp.md) використовується зображення з [CXX](https://cxx.rs/). Будь ласка, дивіться каталог `third_party/cxx/` для отримання детальної інформації, включно з умовами ліцензії.

source: `impl Trait`
ko: 트레잇 구현하기(`impl Trait`)
pt_br: Trait `impl`

source: `thiserror` and `anyhow`
fa: `thiserror` و `anyhow`
ja: `thiserror` と `anyhow`
pt_br: `thiserror` e `anyhow`

source: Unsafe
fa: ناایمن
pt_br: Inseguro (_Unsafe_)

source: Rust Bridge
ja: Rustブリッジ
pt_br: _Bridge_ Rust

source: C++ Bridge
fa: پل ++C
ja: C++ ブリッジ
pt_br: Bridge C++

source: [Concurrency](concurrency.md): a whole-day class on concurrency in Rust. We cover both classical concurrency (preemptively scheduling using threads and mutexes) and async/await concurrency (cooperative multitasking using futures).
es: [Concurrencia](concurrency.md): una clase de un día sobre concurrencia en Rust. Abordaremos tanto la concurrencia clásica (programación interrumpible mediante hilos y exclusiones mutuas), como la concurrencia async / await (multitarea cooperativa mediante traits future).
ko: [동시성](concurrency.md): Rust의 동시성에 관한 종일 과정입니다. 여기서는 고전적인 동시성(스레드와 뮤텍스를 사용하여 선점형 스케줄링을 하는 것)과 async/await 동시성(future를 사용하는 협력적인 멀티태스킹)을 모두 다룹니다.
pt_br: [Concorrência](concurrency.md): uma aula de um dia inteiro sobre concorrência em Rust. Nós cobrimos tanto concorrência clássica (escalonamento preemptivo utilizando threads e mutexes) quanto concorrência async/await (multitarefa cooperativa utilizando _futures_).

source: The [Concurrency in Rust](../concurrency.md) deep dive is a full day class on classical as well as `async`/`await` concurrency.
es: [Concurrencia en profundidad](../concurrency.md) es una clase de un día sobre la concurrencia clásica y la concurrencia `async`/`await`.
pt_br: [Concorrência em Rust](../concurrency.md) é uma aula de um dia sobre concorrência clássica e concorrência `async`/`await`.

source: Arrow-Left
es: Flecha izquierda
ko: 왼쪽 화살표
pt_br: Seta para a esquerda

source: : Navigate to the previous page.
es: : ir a la página anterior.
ja: ： 前のページに移動
ko: : 이전 페이지로 이동합니다.
pt_br: : Vai para a página anterior.

source: Arrow-Right
es: Flecha derecha
ko: 오른쪽 화살표
pt_br: Seta para a direita

source: : Navigate to the next page.
es: : ir a la página siguiente.
ja: ： 次のページに移動。
ko: : 다음 페이지로 이동합니다.
pt_br: : Vai para a próxima página.

source: : Execute the code sample that has focus.
es: : ejecutar el código de ejemplo seleccionado.
ja: ： フォーカスを持つコードサンプルを実行
ko: : 현재 포커스를 받은 코드 샘플 블록을 실행합니다.
pt_br: : Executa o exemplo de código que tem o foco.

source: : Activate the search bar.
es: : activar la barra de búsqueda.
ja: ： 検索バーを起動
ko: : 검색창을 활성화합니다.(mdBook 문제로 23.01.19 기준 영어로만 가능합니다.)
pt_br: : Ativa a barra de pesquisa.

source: You can use
es: Puedes usar
ja: ボックス内にフォーカスがある状態で
ko: 코드 블록에 포커스를 두고
pt_br: Você pode usar

source: to execute the code when focus is in the text box.
es: para ejecutar el código cuando el cursor esté en el cuadro de texto.
ko: 를 눌러 실행해 볼 수 있습니다.
pt_br: para executar o código quando o foco estiver na caixa de texto.

source: When `if` is used in an expression, the expression must have a `;` to separate it from the next statement. Remove the `;` before `println!` to see the compiler error.
ja: 式で `if` を使用する場合、次のステートメントと区切るために、式に `;` を含める必要があります。`println!` の前にある `;` を削除すると、コンパイラ エラーが表示されます。
pt_br: Quando `if` é usado em uma expressão, a expressão deve ter um `;` para separá-la da próxima instrução. Remova o `;` antes de `println!` para ver o erro do compilador.

source: "Final x: {x}"
fa: "خروجی x: {x}"
pt_br: "X final: {x}"

source: If you want to exit any kind of loop early, use [`break`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#break-expressions). For `loop`, this can take an optional expression that becomes the value of the `loop` expression.
pt_br: Se você quiser sair de qualquer loop cedo, use [`break`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#break-expressions). Para `loop`, isso pode receber uma expressão opcional que se torna o valor da expressão `loop`.

source: Note that `loop` is the only looping construct which returns a non-trivial value. This is because it's guaranteed to be entered at least once (unlike `while` and `for` loops).
es: Ten en cuenta que `loop` es la única construcción de bucle que devuelve un valor no trivial. Esto se debe a que es inevitable que se introduzca al menos una vez (a diferencia de los bucles `while` y `for`).
ja: 注意が必要なのは、`loop` が唯一、非自明な値を返すことができるループ構造であるという点です。これは、`loop` が少なくとも一度は必ず実行されることが保証されているからです（これに対して、while や for ループは必ずしも実行されるわけではありません）。
ko: `loop`는 non-trivial 값을 반환하는 유일한 반복문입니다. 이는 `while` 및 `for` 반복문과 달리 최소한 한 번은 루프문을 수행하는 것이 보장되기 때문입니다.
pt_br: Observe que `loop` é a única construção de loop que retorna um valor não trivial . Isso ocorre porque é garantido que ele será executado pelo menos uma vez (diferente de loops `while` e `for`).

source: Shadowing is different from mutation, because after shadowing both variable's memory locations exist at the same time. Both are available under the same name, depending where you use it in the code.
ja: シャドーイング後は両方の変数のメモリ位置が同時に存在するため、シャドーイングはミューテーションとは異なります。どちらも、コードで使用する場所に応じて同じ名前で使用できます。
pt_br: _Shadowing_ é diferente da mutação, porque após a sobreposição (_shadowing_), os locais de memória de ambas as variáveis existem ao mesmo tempo. Ambas estão disponíveis com o mesmo nome, dependendo de onde você as usa no código.

source: Some functions have no return value, and return the 'unit type', `()`. The compiler will infer this if the `-> ()` return type is omitted.
es: Algunas funciones no devuelven ningún valor, devuelven el "tipo unitario", `()`. El compilador deducirá esto si se omite el tipo de retorno `-> ()`.
ja: 戻り値がなく、'unit type'、`()` を返す関数もあります。`-> ()` の戻り値の型が省略されている場合、コンパイラはこれを推測します。
ko: 반환값이 없는 함수의 경우, 유닛 타입 `()`을 반환합니다. `-> ()`가 생략된 경우 컴파일러는 이를 추론합니다.
pt_br: Algumas funções não têm valor de retorno e retornam o 'tipo unitário', `()`. O compilador irá inferir isso se o tipo de retorno `-> ()` for omitido.

source: The [Collatz Sequence](https://en.wikipedia.org/wiki/Collatz_conjecture) is defined as follows, for an arbitrary n
ja: [コラッツ数列](https://en.wikipedia.org/wiki/Collatz_conjecture) は、ゼロより大きい任意の n
pt_br: A [Sequência de Collatz](https://en.wikipedia.org/wiki/Collatz_conjecture) é definida da seguinte forma, para um n arbitrário

source: greater than zero:
ja: に対して、次のように定義されます。
pt_br: maior que zero:

source: If _n
ja: _n
pt_br: Se _n

source: _ is 1, then the sequence terminates at _n
ja: _ が 1 の場合、数列は _n
pt_br: _ é 1, então a sequência termina em _n

source: _ is even, then _n
ja: _ が偶数の場合、_n
pt_br: _ é par, então _n

source: _ is odd, then _n
ja: _ が奇数の場合、_n
pt_br: _ é ímpar, então _n

source: For example, beginning with _n
ja: たとえば、_n
pt_br: Por exemplo, começando com _n

source: 3 is odd, so _n
ja: 3 は奇数なので、_n
pt_br: 3 é ímpar, então _n

source: 10 is even, so _n
ja: 10 は偶数なので、_n
pt_br: 10 é par, então _n

source: 5 is odd, so _n
ja: 5 は奇数なので、_n
pt_br: 5 é ímpar, então _n

source: 16 is even, so _n
ja: 16 は偶数なので、_n
pt_br: 16 é par, então _n

source: 8 is even, so _n
ja: 8 は偶数なので、_n
pt_br: 8 é par, então _n

source: 4 is even, so _n
ja: 4 は偶数なので、_n
pt_br: 4 é par, então _n

source: 2 is even, so _n
ja: 2 は偶数なので、_n
pt_br: 2 é par, então _n

source: _ = 1; and
ja: _ = 1 になります。
pt_br: _ = 1; e

source: The `assert_ne!` macro is new here. There are also `assert_eq!` and `assert!` macros. These are always checked while, debug-only variants like `debug_assert!` compile to nothing in release builds.
ja: ここでは `assert_ne!` マクロが新たに加わっていますが、他にも `assert_eq! マクロと`assert!` マクロがあります。これらは常にチェックされますが、`debug_assert!` などのデバッグ専用の派生ツールは、リリースビルドでは何もコンパイルされません。
pt_br: A macro `assert_ne!` é nova aqui. Existem também macros `assert_eq!` e `assert!`. Estes são sempre verificados enquanto as variantes apenas para debug como `debug_assert!` não compilam nada em compilações de release.

source: A reference provides a way to access another value without taking responsibility for the value, and is also called "borrowing". Shared references are read-only, and the referenced data cannot change.
ja: 参照を使用すると、値について責任を負うことなく別の値にアクセスできます。参照は「借用」とも呼ばれます。共有参照は読み取り専用であり、参照先のデータは変更できません。
pt_br: Uma referência fornece uma maneira de acessar outro valor sem assumir a responsabilidade pelo valor, e também é chamada de "empréstimo". Referências compartilhadas são somente leitura e os dados referenciados não podem ser alterados.

source: Question: What happens if you modify `a[3]` right before printing `s`?
es: Pregunta: ¿Qué ocurre si se modifica `a[3]` justo antes de imprimir `s`?
fa: پرسش: اگر <span dir=ltr>`a[3]`</span> را درست قبل از چاپ <span dir=ltr>`s`</span> تغییر دهید چه اتفاقی می‌افتد؟
ja: 質問: `s` を出力する直前に `a[3]` を変更するとどうなるでしょうか？
ko: 질문: `s`를 출력하기 전에 `a[3]`을 수정하면 무슨 일이 있어날까요?
pt_br: Pergunta: O que acontece se você modificar `a[3]` imediatamente antes de imprimir `s`?

source: The question about modifying `a[3]` can spark an interesting discussion, but the answer is that for memory safety reasons you cannot do it through `a` at this point in the execution, but you can read the data from both `a` and `s` safely. It works before you created the slice, and again after the `println`, when the slice is no longer used.
fa: پرسش در مورد تغییر <span dir=ltr>`a[3]`</span> می تواند یک بحث جالب را شروع کند، اما پاسخ‌اش این است که به دلایل ایمنی حافظه، نمی‌توانید این کار را از طریق <span dir=ltr>`a`</span> در این مرحله از اجرا انجام دهید، اما می‌توانید داده‌ها را از هر دو <span dir=ltr>`a`</span> و <span dir=ltr>`s`</span> به طور ایمن بخوانید. این کار قبل از ایجاد برش و دوباره بعد از <span dir=ltr>`println!`</span> کار میکند، زمانی که برش دیگر استفاده نمی شود. جزئیات بیشتری در بخش بررسی‌کننده‌قرض (the borrow checker) توضیح خواهیم داد.
ja: `a[3]` の変更に関する質問は興味深い議論のきっかけになるかもしれませんが、メモリ安全性上の理由から、この時点では `a` を使用して変更することはできない、という回答になります。ただし、`a` と `s` の両方のデータを安全に読み取ることはできます。これは、スライスを作成する前と、`println` の後でスライスが使用されなくなったあとであれば、変更することが出来ます。
pt_br: A questão sobre a modificação de `a[3]` pode gerar uma discussão interessante, mas a resposta é que por motivos de segurança de memória você não pode fazer isso por meio de `a` neste ponto durante a execução. Porém você pode ler os dados de `a` e `s` com segurança. Isto funciona antes da criação do _slice_, e novamente depois de `println`, quando o _slice_ não é mais necessário.

source: [Welcome](./welcome-day-2.md) (3 minutes)
ja: [ようこそ](./welcome-day-2.md)（3 分）
pt_br: [Bem-vindos](./welcome-day-2.md) (3 minutos)

source: [Pattern Matching](./pattern-matching.md) (1 hour)
pt_br: [Correspondência de Padrões](./pattern-matching.md) (1 hora)

source: [Methods and Traits](./methods-and-traits.md) (50 minutes)
pt_br: [Métodos e Traits](./methods-and-traits.md) (50 minutos)

source: Including 10 minute breaks, this session should take about 2 hours and 10 minutes
pt_br: Incluindo pausas de 10 minutos, esta sessão deve levar cerca de 2 horas e 10 minutos

source: [Matching Values](./pattern-matching/match.md) (10 minutes)
pt_br: [Correspondência de Valores](./pattern-matching/match.md) (10 minutos)

source: [Destructuring Structs](./pattern-matching/destructuring-structs.md) (4 minutes)
pt_br: [Desestruturação de Structs](./pattern-matching/destructuring-structs.md) (4 minutos)

source: [Destructuring Enums](./pattern-matching/destructuring-enums.md) (4 minutes)
pt_br: [Desestruturação de Enums](./pattern-matching/destructuring-enums.md) (4 minutos)

source: [Let Control Flow](./pattern-matching/let-control-flow.md) (10 minutes)
ja: [let による制御フロー](./pattern-matching/let-control-flow.md)（10 分）
pt_br: [Fluxo de Controle com `let`](./pattern-matching/let-control-flow.md) (10 minutos)

source: [Exercise: Expression Evaluation](./pattern-matching/exercise.md) (30 minutes)
ja: [演習: 式の評価](./pattern-matching/exercise.md)（30 分）
pt_br: [Exercício: Avaliação de Expressão](./pattern-matching/exercise.md) (30 minutos)

source: This segment should take about 1 hour
ja: このセグメントの所要時間は約 1 時間です
pt_br: Este segmento deve levar cerca de 1 hora
