Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Note that `IntoIter` and `Item` are linked: the iterator must have the same `Item` type, which means that it returns `Option<Item>`
es: Ten en cuenta que `IntoIter` y `Item` están vinculados: el iterador debe tener el mismo tipo de `Item`, lo que significa que devuelve `Option<Item>`.
fa: توجه داشته باشید که `IntoIter` و`Item` به هم link شده‌اند: تکرار‌کننده (iterator) باید همان `Item` type را داشته باشد، به این معنی که `Option<Item>` را برمی‌گرداند.
ja: `IntoIter`と`Item`は関連があり、イテレータは`Item`と同じ型を持つ必要があります。すなわち、`Option<Item>`を返します。
ko: `IntoIter`에는 `Item`이 연결되어 있음을 주목하세요. `IntoIter` 반복자는 `Item` 타입의 데이터를 가리켜야 합니다. 즉, 반복자는 `Option<Item>`을 리턴합니다
pt_br: Observe que `IntoIter` e `Item` estão vinculados: o iterador deve ter o mesmo tipo `Item`, o que significa que ele retorna `Option<Item>`
uk: Зауважте, що `IntoIter` і `Item` пов’язані: ітератор повинен мати той самий тип `Item`, що означає, що він повертає `Option<Item>`

source: The example iterates over all combinations of x and y coordinates.
fa: مثال روی تمام ترکیبات مختصات x و y تکرار می‌شود.
ja: この例は、x 座標と y 座標のすべての組み合わせを反復処理しています。
pt_br: O exemplo itera sobre todas as combinações de coordenadas x e y.
uk: У прикладі перебираються всі комбінації координат x та y.

source: Try iterating over the grid twice in `main`. Why does this fail? Note that `IntoIterator::into_iter` takes ownership of `self`.
fa: سعی کنید دو بار روی شبکه در `main` تکرار کنید. چرا این گزینه شکست می‌خورد؟ توجه داشته باشید که `IntoIterator::into_iter` مالکیت `self` را می‌گیرد.
ja: `main` でグリッドを 2 回反復処理してみましょう。これはなぜ失敗するのでしょうか。`IntoIterator::into_iter` は `self` の所有権を取得することに着目してください。
pt_br: Tente iterar sobre o _grid_ duas vezes em `main`. Por que isso falha? Observe que `IntoIterator::into_iter` assume a propriedade de `self`.
uk: Спробуйте виконати ітерацію над сіткою двічі в `main`. Чому це не спрацьовує? Зверніть увагу, що `IntoIterator::into_iter` отримує право власності на `self`.

source: Fix this issue by implementing `IntoIterator` for `&Grid` and storing a reference to the `Grid` in `GridIter`.
fa: این مشکل را با اجرای `IntoIterator` برای `&Grid` و ذخیره یک reference به این `Grid` در `GridIter` برطرف کنید.
ja: この問題を修正するには、`&Grid` に `IntoIterator` を実装し、`Grid` への参照を `GridIter` に保存します。
pt_br: Corrija este problema implementando `IntoIterator` para `&Grid` e armazenando uma referência ao `Grid` em `GridIter`.
uk: Виправте цю проблему, реалізувавши `IntoIterator` для `&Grid` і зберігаючи посилання на `Grid` у `GridIter`.

source: The same problem can occur for standard library types: `for e in some_vector` will take ownership of `some_vector` and iterate over owned elements from that vector. Use `for e in &some_vector` instead, to iterate over references to elements of `some_vector`.
fa: همین مشکل می‌تواند برای انواع کتابخانه استاندارد رخ دهد: `برای e در some_vector` مالکیت `some_vector` را در اختیار می‌گیرد و روی عناصر متعلق به آن بردار تکرار می‌شود. به جای آن از `e در &some_vector` برای تکرار بر روی ارجاعات به عناصر `some_vector` استفاده کنید.
ja: 標準ライブラリ型でも同じ問題が発生する可能性があります。`for e in some_vector` は、`some_vector` の所有権を取得し、そのベクターの所有要素を反復処理します。`some_vector` の要素への参照を反復処理するには、代わりに `for e in &some_vector` を使用します。
pt_br: O mesmo problema pode ocorrer para tipos da biblioteca padrão: `for e in some_vector` assumirá a propriedade de `some_vector` e iterará sobre elementos _owned_ desse vetor. Use `for e in &some_vector` em vez disso, para iterar sobre referências aos elementos de `some_vector`.
uk: Така сама проблема може виникнути для стандартних бібліотечних типів: `for e in some_vector` отримає право власності на `some_vector` і буде перебирати елементи з цього вектора, які йому належать. Натомість використовуйте `for e in &some_vector` для перебору посилань на елементи `some_vector`.

source: [`FromIterator`](https://doc.rust-lang.org/std/iter/trait.FromIterator.html) lets you build a collection from an [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html).
es: [`FromIterator`](https://doc.rust-lang.org/std/iter/trait.FromIterator.html) permite construir una colección a partir de un [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html).
fa: گزینه [`FromIterator`](https://doc.rust-lang.org/std/iter/trait.FromIterator.html) به شما امکان می دهد از یک [`Iterator`](https://doc.rust-lang .org/std/iter/trait.Iterator.html) یک مجموعه یا collection بسازید.
ja: [`FromIterator`](https://doc.rust-lang.org/std/iter/trait.FromIterator.html) を使用すると、[`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html) からコレクションを作成できます。
ko: 어떤 컬렉션이 [`FromIterator`](https://doc.rust-lang.org/std/iter/trait.FromIterator.html)를 구현하고 있다면 [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html)로부터 그 컬렉션을 만들 수 있습니다.
pt_br: [`FromIterator`](https://doc.rust-lang.org/std/iter/trait.FromIterator.html) permite que você construa uma coleção a partir de um [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html).
uk: [`FromIterator`](https://doc.rust-lang.org/std/iter/trait.FromIterator.html) дозволяє створювати колекцію з [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html).

source: `Iterator` implements
fa: پیاده‌سازی `Iterator`
ja: `Iterator` の実装
pt_br: `Iterator` implementa
uk: `Iterator` реалізує

source: There are two ways to specify `B` for this method:
fa: دو راه برای تعیین`B` برای این روش وجود دارد:
ja: このメソッドで `B` を指定するには、次の 2 つの方法があります。
pt_br: Existem duas maneiras de especificar `B` para este método:
uk: Існує два способи вказати `B` для цього методу:

source: With the "turbofish": `some_iterator.collect::<COLLECTION_TYPE>()`, as shown. The `_` shorthand used here lets Rust infer the type of the `Vec` elements.
fa: با کمک "turbofish": `some_iterator.collect::<COLLECTION_TYPE>()`، همانطور که نشان داده شده است و به طور خلاصه `_` استفاده شده در اینجا به Rust امکان می‌دهد نوع عناصر "Vec" را استنتاج کند.
ja: 「turbofish」を使用する場合: 例えば、上記における、`some_iterator.collect::<COLLECTION_TYPE>()`。ここで使用されている_ はRustに`Vecの`要素の方を推測させるためのものです。
pt_br: Com o "turbofish": `some_iterator.collect::<COLLECTION_TYPE>()`, como mostrado. O _shorthand_ `_` usado aqui permite que o Rust infira o tipo dos elementos do `Vec`.
uk: З " turbofish": `some_iterator.collect::<COLLECTION_TYPE>()`, як показано. Скорочення `_`, використане тут, дозволяє Rust визначити тип елементів `Vec`.

source: With type inference: `let prime_squares: Vec<_> = some_iterator.collect()`. Rewrite the example to use this form.
fa: با نوع inference: `let prime_squares: Vec<_> = some_iterator.collect()`. این مثال را برای استفاده از این فرم بازنویسی کنید.
ja: 型推論を使用する場合: `let prime_squares: Vec<_> = some_iterator.collect()`。この形式を使用するように例を書き換えてください。
pt_br: Com inferência de tipo: `let prime_squares: Vec<_> = some_iterator.collect()`. Reescreva o exemplo para usar esta forma.
uk: З виведенням типу: `let prime_squares: Vec<_> = some_iterator.collect()`. Перепишіть приклад так, щоб він мав такий вигляд.

source: There are basic implementations of `FromIterator` for `Vec`, `HashMap`, etc. There are also more specialized implementations which let you do cool things like convert an `Iterator<Item = Result<V, E>>` into a `Result<Vec<V>, E>`.
fa: پیاده‌سازی‌های اولیه `FromIterator` برای`Vec`, `HashMap` و غیره وجود دارد. همچنین پیاده‌سازی‌های تخصصی‌تری وجود دارد که به شما امکان می‌دهد کارهای جالبی مانند تبدیل `Iterator<Item = Result<V, E>>` به یک `Result<Vec<V>, E>` انجام دهید.
ja: `Vec` や `HashMap` などに `FromIterator` の基本的な実装が用意されています。また、`Iterator<Item = Result<V, E>>` を `Result<Vec<V>, E>` に変換できるものなど、より特化した実装もあります。
pt_br: Há implementações básicas de `FromIterator` para `Vec`, `HashMap`, etc. Também existem implementações mais especializadas que permitem fazer coisas legais, como converter um `Iterator<Item = Result<V, E>>` em um `Result<Vec<V>, E>`.
uk: Існують базові реалізації `FromIterator` для `Vec`, `HashMap` тощо. Існують також більш спеціалізовані реалізації, які дозволяють робити цікаві речі, наприклад, перетворювати `Iterator<Item = Result<V, E>>` у `Result<Vec<V>, E>`.

source: In this exercise, you will need to find and use some of the provided methods in the [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html) trait to implement a complex calculation.
fa: در این تمرین، باید برخی از روش های ارائه شده در [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html) را برای پیاده‌سازی یک ویژگی پیدا کنید و از آنها برای محاسبه پیچیده استفاده کنید.
ja: この演習では、複雑な計算を実装するために[`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html) トレイトで提供されているメソッドをいくつかを探して使用する必要があります。
pt_br: Neste exercício, você precisará encontrar e usar alguns dos métodos fornecidos no _trait_ [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html) para implementar um cálculo complexo.
uk: У цій вправі вам потрібно буде знайти і використати деякі з методів, наданих у трейті [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html), для реалізації складних обчислень.

source: Copy the following code to <https://play.rust-lang.org/> and make the tests pass. Use an iterator expression and `collect` the result to construct the return value.
fa: کد زیر را در<https://play.rust-lang.org/> کپی کنید و تست ها را قبول کنید. از یک عبارت تکرارکننده (iterator) استفاده کنید و نتیجه را جمع‌آوری (`collect`) کنید تا مقدار بازگشتی را بسازید.
ja: 次のコードを <https://play.rust-lang.org/> にコピーし、テストが通るようにしてください。イテレータ式を使用し、その結果を`collect`することで戻り値を生成します。
pt_br: Copie o seguinte código para <https://play.rust-lang.org/> e faça os testes passarem. Use uma expressão de iterador e `collect` o resultado para construir o valor de retorno.
uk: Скопіюйте наступний код до <https://play.rust-lang.org/> і запустіть тести. Для побудови значення, що повертається, використовуйте вираз ітератору та `collect` результат.

source: /// Calculate the differences between elements of `values` offset by `offset`, /// wrapping around from the end of `values` to the beginning. /// /// Element `n` of the result is `values[(n+offset)%len] - values[n]`.
ja: /// `values`において、`offset`だけ離れた要素間の差を計算します。 /// なお、`values`の末尾要素の次は先頭へ戻ることとします。 /// /// 結果の要素 `n` は `values[(n+offset)%len] - values[n]` です。
pt_br: /// Calcule as diferenças entre os elementos de `values` deslocados por `offset`, /// voltando ao início de `values` no final. /// /// O elemento `n` do resultado é `values[(n+offset)%len] - values[n]`.
uk: /// Обчислює різницю між елементами `values`, зміщеними на `offset`, /// обгортаючи навколо від кінця `values` до початку. /// /// Елемент `n` результату має вигляд `values[(n+offset)%len] - values[n]`.

source: We have seen how `impl` blocks let us namespace functions to a type.
es: Hemos visto cómo los bloques `impl` nos permiten asignar espacios de nombres de funciones a un tipo.
fa: دیده‌ایم که چگونه بلوک‌های `impl` به ما اجازه می‌دهند تا namespace functions را به یک type تبدیل کنیم.
ja: `impl` ブロックで関数を型の名前空間に所属させる方法はすでに見てきました。
ko: `impl`블록은 해당 타입의 함수들에 대한 네임스페이스를 제공합니다.
pt_br: Vimos como os blocos `impl` nos permitem usar _namespaces_ (espaços de nomes) de funções para um tipo.
uk: Ми бачили, як блоки `impl` дозволяють нам співвідносити функції з типом.

source: Similarly, `mod` lets us namespace types and functions:
es: Del mismo modo, `mod` nos permite asignar espacios de nombres a funciones y tipos:
fa: به طور مشابه، `mod` به ما اجازه می‌دهد تا توابع و namespace type به این صورت داشته باشیم:
ja: 同様に、`mod` を使用して型と関数の名前空間を指定できます。
ko: 마찬가지로, `mod`는 타입과 함수들에 대해 네임스페이스를 제공합니다:
pt_br: Da mesma forma, `mod` nos permite usar _namespaces_ de tipos e funções:
uk: Аналогічно, `mod` надає нам можливості співвідносити типи та функції:

source: "In the foo module"
fa: "در ماژول foo"
pt_br: "No módulo foo"
uk: "У модулі foo"

source: "In the bar module"
fa: "در ماژول نواری"
pt_br: "No módulo bar"
uk: "У модулі bar"

source: Packages provide functionality and include a `Cargo.toml` file that describes how to build a bundle of 1+ crates.
es: Los paquetes ofrecen funciones e incluyen un archivo `Cargo.toml` que describe cómo compilar un paquete de más de un crate.
fa: بسته‌ها یا Packageهای عملکردی را ارائه می‌کنند و شامل یک فایل`Cargo.toml` می‌شوند که نحوه ساخت بسته‌ای از crateهای 1+ را شرح می‌دهد.
ja: パッケージ(package)は機能を提供するものであり、一つ以上のクレートをビルドする方法を記述した`Cargo.toml` ファイルを含むものです。
ko: 패키지는 기능을 제공하며 하나의 대표 `Cargo.toml` 파일을 포함합니다. 패키지를 구성하는 크레이트들을 빌드하는 방법이 이 파일에 기술됩니다.
pt_br: Pacotes (_packages_) fornecem funcionalidades e incluem um arquivo `Cargo.toml` que descreve como gerar um pacote com um ou mais _crates_.
uk: Пакети забезпечують функціональність і включають файл `Cargo.toml`, який описує, як створити пакет із 1+ крейтів.

source: Crates are a tree of modules, where a binary crate creates an executable and a library crate compiles to a library.
es: Los crates son un árbol de módulos, donde un crate binario crea un ejecutable y un crate de biblioteca compila una biblioteca.
fa: در واقع Crateها درختی از ماژول‌ها هستند که در آن یک crate باینری یک فایل اجرایی ایجاد می‌کند و یک crate کتابخانه در یک کتابخانه کامپایل می‌شود.
ja: バイナリクレートの場合は実行可能ファイルを生成し、ライブラリクレートの場合はライブラリを生成します。
ko: 크레이트는 모듈의 트리입니다. 바이너리 크레이트는 실행파일로 빌드되고, 라이브러리 크레이트는 라이브러리로 빌드됩니다.
pt_br: _Crates_ são arvores de módulos, onde um _crate_ binário cria um executável e um _crate_ de biblioteca é compilado em uma biblioteca.
uk: Крейти — це дерево модулів, у якому бінарний крейт створює виконуваний файл, а бібліотечний крейт компілюється в бібліотеку.

source: Modules define organization, scope, and are the focus of this section.
es: Los módulos definen la organización y el ámbito, y son el centro de esta sección.
fa: ماژول‌های organization، scope، و تمرکز این بخش را تعریف می‌کنند.
ja: モジュールによって構成とスコープが定義されます。このセクションではモジュールに焦点を当てます。
ko: 모듈은 코드를 조직화하고 스코프를 정의하는 단위입니다.
pt_br: Módulos definem organização, escopo e são o foco desta seção.
uk: Модулі визначають організацію, обсяг і є темою цього розділу.

source: Omitting the module content will tell Rust to look for it in another file:
es: Omitir el contenido del módulo hará que Rust lo busque en otro archivo:
fa: حذف محتوای ماژول به Rust می‌گوید که آن را در فایل دیگری جستجو کند:
ja: モジュールの定義内容を省略すると、Rust はそれを別のファイルで探します。
ko: 모듈의 내용을 기술하지 않으면, 러스트는 다른 파일에서 그 내용을 읽습니다:
pt_br: Omitir o conteúdo do módulo dirá ao Rust para procurá-lo em outro arquivo:
uk: Пропущення вмісту модуля призведе до того, що Rust шукатиме його в іншому файлі:

source: This tells rust that the `garden` module content is found at `src/garden.rs`. Similarly, a `garden::vegetables` module can be found at `src/garden/vegetables.rs`.
es: Esto indica que el contenido del módulo `garden` se encuentra en `src/garden.rs`. Del mismo modo, el módulo `garden::vegetables` se encuentra en `src/garden/vegetables.rs`.
fa: این به rust می‌گوید که محتوای ماژول `garden` در`src/garden.rs`یافت می‌شود. به طور مشابه، ماژول `garden::vegetables` را می‌توان در `src/garden/vegetables.rs` یافت.
ja: これにより、`garden` モジュールの定義内容が `src/garden.rs` にあることを Rust に伝えます。同様に、`garden::vegetables` モジュールは `src/garden/vegetables.rs` にあります。
ko: 위 코드는 러스트로 하여금 `garden`모듈의 내용을 `src/garden.rs`에서 찾도록 합니다. 비슷하게, `garden::vegetables` 모듈은 `src/garden/vegetables.rs`에서 찾습니다.
pt_br: Isto diz ao Rust que o conteúdo do módulo `garden` é encontrado em `src/garden.rs`. Da mesma forma, um módulo `garden::vegetables` pode ser encontrado em `src/garden/vegetables.rs`.
uk: Це повідомляє Rust, що вміст модуля `garden` знаходиться в `src/garden.rs`. Так само модуль `garden::vegetables` можна знайти на `src/garden/vegetables.rs`.

source: The `crate` root is in:
es: La raíz de `crate` está en:
fa: ریشه`crate` در:
ja: `crate` ルートは以下の場所にあります。
ko: `crate(크레이트)`의 루트는 아래 경로 입니다:
pt_br: A raiz do `crate` está em:
uk: Корінь `crate` знаходиться в:

source: `src/lib.rs` (for a library crate)
es: `src/lib.rs` (para un crate de biblioteca)
ja: `src/lib.rs`（ライブラリ クレートの場合）
ko: `src/lib.rs` (라이브러리 크레이트)
pt_br: `src/lib.rs` (para um _crate_ de biblioteca)
uk: `src/lib.rs` (для крейта бібліотеки)

source: `src/main.rs` (for a binary crate)
es: `src/main.rs` (para un crate binario)
ja: `src/main.rs`（バイナリ クレートの場合）
ko: `src/main.rs` (바이너리 크레이트)
pt_br: `src/main.rs` (para um _crate_ binário)
uk: `src/main.rs` (для крейта виконуваного файлу)

source: Modules defined in files can be documented, too, using "inner doc comments". These document the item that contains them -- in this case, a module.
es: Los módulos definidos en archivos también se pueden documentar mediante "comentarios internos del documento". En ellos se indica el elemento que los contiene, en este caso, un módulo.
fa: ماژول‌های تعریف‌شده در فایل‌ها را نیز می‌توان با استفاده از «کامنت‌های مستند داخلی» مستند کرد. اینها موردی را که حاوی آنها است - در این مورد، یک ماژول مستند می‌کنند.
ja: ファイルで定義されたモジュールに対して、「内部ドキュメント用コメント」を使用して説明を加えることもできます。これらのコメントは、それが含まれるアイテム（この場合はモジュール）に対する説明になります。
ko: 모듈도 "내부 문서 주석"을 사용하여 문서화할 수 있습니다. 이러한 모듈은 모듈이 포함된 항목(이 경우에는 모듈)을 문서화합니다.
pt_br: Módulos definidos em arquivos também podem ser documentados usando "comentários internos de documento" (_inner doc comments_). Estes documentam o item que os contém - neste caso, um módulo.
uk: Модулі, визначені у файлах, також можна документувати за допомогою "внутрішніх коментарів документа". Вони документують елемент, який їх містить – у цьому випадку це модуль.

source: //! This module implements the garden, including a highly performant germination //! implementation.
ja: //! このモジュールは畑を実装します（パフォーマンスの高い発芽の //! 実装を含む）。
pt_br: //! Este módulo implementa o jardim (_garden_), incluindo uma implementação de germinação //! de alto desempenho.
uk: //! Цей модуль реалізує сад, включаючи високоефективну реалізацію //! пророщування.

source: // Re-export types from this module.
ja: // このモジュールから型を再エクスポートします。
pt_br: // Re-exporta tipos deste módulo.
uk: // Ре-експорт типів з цього модуля.

source: /// Sow the given seed packets.
ja: /// 指定された種をまきます。
pt_br: /// Semeia os pacotes de semente fornecidos.
uk: /// Посіяти задані пакети насіння.

source: /// Harvest the produce in the garden that is ready.
ja: /// 十分に実っている畑で作物を収穫します。
pt_br: /// Colhe os vegetais no jardim que está pronto.
uk: /// Збір врожаю в саду, який вже готовий.

source: Before Rust 2018, modules needed to be located at `module/mod.rs` instead of `module.rs`, and this is still a working alternative for editions after 2018.
es: Antes de Rust 2018, los módulos debían ubicarse en `module/mod.rs` en lugar de en `module.rs`. Esta alternativa sigue existiendo en las ediciones posteriores a 2018.
fa: قبل از Rust 2018، ماژول‌ها باید به جای `module.rs` در `module/mod.rs` قرار می‌گرفتند و این هنوز یک جایگزین کارآمد برای نسخه‌های بعد از 2018 است.
ja: Rust 2018 より前では、モジュールを `module.rs` ではなく `module/mod.rs` に配置する必要がありました。これは 2018 以降のエディションでも依然としてサポートされています。
ko: `module/mod.rs`를 `module.rs`로 바꾼다 하더라도 Rust 2018에서는 하위 모듈을 사용할 수 있습니다.
pt_br: Antes do Rust 2018, os módulos precisavam estar localizados em `module/mod.rs` ao invés de `module.rs`, e esta ainda é uma alternativa funcional para edições posteriores a 2018.
uk: До Rust 2018 модулі мали розташовуватися в `module/mod.rs` замість `module.rs`, і це все ще робоча альтернатива для випусків після 2018 року.

source: The main reason to introduce `filename.rs` as alternative to `filename/mod.rs` was because many files named `mod.rs` can be hard to distinguish in IDEs.
es: El principal motivo de introducir `filename.rs` en lugar de `filename/mod.rs` se debe a que si muchos archivos llamados `mod.rs` puede ser difícil distinguirlos en IDEs.
fa: دلیل اصلی معرفی `filename.rs` به‌عنوان جایگزین `filename/mod.rs` این بود که تشخیص بسیاری از فایل‌ها با نام `mod.rs` در IDE‌ها دشوار است.
ja: `filename/mod.rs` の代わりに `filename.rs` が導入された主な理由は、`mod.rs` という名前のファイルが多くあると、それらをIDEで区別するのが難しい場合があるからです。
ko: `filename.rs`를 `filename/mod.rs`대신 사용할 수 있도록 하는 주된 이유는, `mod.rs`라는 이름을 가진 파일이 많을 경우 IDE에서 이들을 서로 구별하는게 힘들기 때문입니다.
pt_br: A principal razão para introduzir `nome_de_arquivo.rs` como alternativa a `nome_de_arquivo/mod.rs` foi porque muitos arquivos denominados `mod.rs` podem ser difíceis de distinguir em IDEs.
uk: Основною причиною введення `filename.rs` як альтернативи `filename/mod.rs` було те, що багато файлів з назвами `mod.rs` важко розрізнити в IDE.

source: Deeper nesting can use folders, even if the main module is a file:
es: Un anidamiento más profundo puede usar carpetas, incluso si el módulo principal es un archivo:
fa: لانه‌گزینی(nesting) عمیق‌تر می‌تواند از folderها استفاده کند، حتی اگر ماژول اصلی یک فایل باشد:
ja: より深いネストでは、メイン モジュールがファイルであっても、フォルダを使用できます。
ko: 폴더를 이용해서 더 깊은 계층 구조를 구현할 수 있습니다. 심지어는 메인 모듈이 파일이더라도요:
pt_br: O aninhamento mais profundo pode usar pastas, mesmo que o módulo principal seja um arquivo:
uk: Більш глибоке вкладення може використовувати папки, навіть якщо основним модулем є файл:

source: The place rust will look for modules can be changed with a compiler directive:
es: El lugar donde Rust buscará los módulos se puede cambiar con una directiva del compilador:
fa: مکانی که rust به دنبال ماژول‌ها می‌گردد را می‌توان با دستور کامپایلر تغییر داد:
ja: Rust がモジュールを検索する場所は、コンパイラ ディレクティブで変更できます。
ko: 러스트가 어디서 모듈들을 찾을지는 컴파일러 디렉티브로 변경 가능합니다:
pt_br: O local no qual o Rust irá procurar por módulos pode ser alterado por meio de uma diretiva de compilador:
uk: Місце, де Rust шукатиме модулі, можна змінити за допомогою директиви компілятора:

source: This is useful, for example, if you would like to place tests for a module in a file named `some_module_test.rs`, similar to the convention in Go.
es: Esto resulta útil, por ejemplo, si deseas colocar pruebas de un módulo en un archivo denominado `some_module_test.rs`, similar a la convención en Go.
fa: برای مثال، اگر می‌خواهید تست‌هایی را برای یک ماژول در فایلی به نام `some_module_test.rs` قرار دهید، مفید است، شبیه به قرارداد (convention) در Go.
ja: これは、たとえば Go でよく行われているように、`some_module_test.rs` という名前のファイルにモジュールのテストを配置する場合に便利です。
ko: 이는 Go언어 에서처럼 어떤 모듈의 테스트를 `some_module_test.rs` 같은 파일에 두고 싶은 경우에 유용합니다.
pt_br: Isto é útil, por exemplo, se você quiser colocar testes para um módulo em um arquivo chamado `algum_modulo_teste.rs`, semelhante à convenção em Go.
uk: Це корисно, наприклад, якщо ви хочете розмістити тести для модуля у файлі з іменем `some_module_test.rs`, подібно до конвенції у Go.

source: Modules are a privacy boundary:
es: Los módulos marcan el límite de la privacidad:
fa: ماژول‌ها یک مرز حریم خصوصی هستند:
ja: モジュールはプライバシーの境界です。
ko: 모듈의 타입이나 함수는 기본적으로 바깥에 노출되지 않습니다:
pt_br: Módulos são limitadores de privacidade:
uk: Модулі є межею конфіденційності:

source: Module items are private by default (hides implementation details).
es: Los elementos del módulo son privados de forma predeterminada (se ocultan los detalles de implementación).
fa: گزینه‌های ماژول به طور پیش‌فرض private هستند (جزئیات پیاده سازی را پنهان می‌کند).
ja: モジュール アイテムはデフォルトでプライベートです（実装の詳細は表示されません）。
ko: 따라서 모듈의 세부 구현 내용이 감춰집니다.
pt_br: Itens do módulo são privados por padrão (ocultam detalhes de implementação).
uk: Елементи модуля є приватними за замовчуванням (приховує деталі реалізації).

source: Parent and sibling items are always visible.
es: Los elementos superiores y los del mismo nivel siempre están visibles.
fa: کزینه‌های sibling و sibling همیشه قابل مشاهده است.
ja: 親アイテムと兄弟アイテムは常に見えます。
ko: 부모와 이웃 항목은 언제나 접근 가능합니다.
pt_br: Itens paternos e fraternos são sempre visíveis.
uk: Батьківські та споріднені елементи завжди видно.
