Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Let's design a simple logging utility, using a trait `Logger` with a `log` method. Code which might log its progress can then take an `&impl Logger`. In testing, this might put messages in the test logfile, while in a production build it would send messages to a log server.
fa: بیایید یک ابزار لاگ‌ ساده طراحی کنیم که از یک trait به نام `Logger` با متد `log` استفاده کند. کدی که ممکن است پیشرفت خود را لاگ کند می‌تواند یک `impl Logger&` دریافت کند. در زمان تست، این ممکن است پیام‌ها را در فایل‌ لاگ تست قرار دهد، در حالی که در نسخه تولید، پیام‌ها به یک سرور لاگ ارسال می‌شود.
ja: トレイト `Logger` と `log` メソッドを使用して、シンプルなロギングユーティリティを設計してみましょう。進行状況をログに記録するコードは、その後に `&impl Logger` を受け取ることができます。この場合、テストではテストログファイルにメッセージが書き込まれますが、本番環境ビルドではログサーバーにメッセージが送信されます。
pt_br: Vamos projetar um utilitário de registro (_log_) simples, usando um _trait_ `Logger` com um método `log`. O código que pode registrar seu progresso pode então receber um `&impl Logger`. Nos testes, isso pode colocar mensagens no arquivo de log de teste, enquanto em uma compilação de produção, ele enviaria mensagens para um servidor de log.
uk: Давайте розробимо просту утиліту для ведення логів, використовуючи трейт `Logger` з методом `log`. Код, який може реєструвати свій прогрес, може отримати `&impl Logger`. Під час тестування це може призвести до запису повідомлень до тестового лог-файлу, тоді як у виробничій збірці повідомлення надсилатимуться до сервера логів.

source: However, the `StderrLogger` given below logs all messages, regardless of verbosity. Your task is to write a `VerbosityFilter` type that will ignore messages above a maximum verbosity.
fa: با این حال، `StderrLogger` که در زیر داده شده است، تمامی پیام‌ها را بدون توجه به سطح جزئیات لاگ می‌کند. وظیفه شما این است که نوع `VerbosityFilter` را بنویسید که پیام‌هایی با سطح جزئیات بالاتر از حداکثر سطح تعیین‌شده را نادیده بگیرد.
ja: ただし、以下の `StderrLogger` は、詳細度(verbosity)に関係なく、すべてのメッセージをログに記録します。ここでのタスクは、最大の詳細度を超えるメッセージを無視する `VerbosityFilter` 型を作成することです。
pt_br: No entanto, o `StderrLogger` fornecido abaixo registra todas as mensagens, independentemente da verbosidade. Sua tarefa é escrever um tipo `VerbosityFilter` que ignorará mensagens acima de uma verbosidade máxima.
uk: Однак, наведений нижче `StderrLogger` реєструє всі повідомлення, незалежно від їхньої докладності. Ваше завдання - написати тип `VerbosityFilter`, який ігноруватиме повідомлення з максимальною докладностю.

source: This is a common pattern: a struct wrapping a trait implementation and implementing that same trait, adding behavior in the process. What other kinds of wrappers might be useful in a logging utility?
fa: این الگو الگوی رایجی است: یک ساختارکه یک پیاده‌سازی trait را در بر می‌گیرد و همان trait را پیاده‌سازی می‌کند و در این فرآیند به آن رفتار اضافی می‌دهد. چه نوع‌های دیگری از پوشش‌دهنده‌ها ممکن است در یک ابزار لاگ مفید باشند؟
ja: これは一般的なパターンです。つまり、トレイト実装をラップして同じトレイトを実装し、その過程で挙動を追加していく構造体です。ロギングユーティリティでは他にどのような種類のラッパーが役立つでしょうか。
pt_br: Este é um padrão comum: uma _struct_ que envolve uma implementação de _trait_ e implementa esse mesmo _trait_, adicionando comportamento no processo. Que outros tipos de _wrappers_ podem ser úteis em um utilitário de registro?
uk: Це поширений патерн: структура, що обгортає реалізацію трейту і реалізує той самий трейт, додаючи поведінку в процесі. Які ще типи обгорток можуть бути корисними у утиліті для ведення логів?

source: /// Log a message at the given verbosity level.
ja: /// 指定された詳細度レベルでメッセージをログに記録します。
pt_br: /// Registra uma mensagem no nível de verbosidade fornecido.
uk: /// Запишіть повідомлення із заданим рівнем докладності.

source: // TODO: Define and implement `VerbosityFilter`.
ja: // TODO: `VerbosityFilter` を定義して実装します。
pt_br: // TODO: Definir e implementar `VerbosityFilter`.
uk: // TODO: Визначте та реалізуйте `VerbosityFilter`.

source: /// Only log messages up to the given verbosity level.
ja: /// 指定された詳細度レベルまでのメッセージのみをログに記録。
pt_br: /// Registra apenas mensagens até o nível de verbosidade fornecido.
uk: /// Записуйте повідомлення лише до заданого рівня докладності.

source: Rust supports generics, which lets you abstract algorithms or data structures (such as sorting or a binary tree) over the types used or stored.
fa: Rust از generics پشتیبانی می‌کند که به شما امکان می‌دهد الگوریتم‌ها یا ساختارهای داده (مانند مرتب‌سازی یا درخت دودویی) را بر روی تایپ‌های استفاده‌شده یا ذخیره‌شده تخصیص دهید.
pt_br: Rust suporta genéricos, o que permite abstrair algoritmos ou estruturas de dados (como ordenação ou uma árvore binária) sobre os tipos usados ou armazenados.
uk: Rust підтримує узагальнені типи, що дозволяє абстрагувати алгоритми або структури даних (наприклад, сортування або бінарне дерево) від типів, що використовуються або зберігаються.

source: /// Pick `even` or `odd` depending on the value of `n`.
ja: /// `n` の値に応じて `even` または `odd` を選択します。
pt_br: /// Escolhe `even` ou `odd` dependendo do valor de `n`.
uk: /// Виберіть `even` або `odd` в залежності від значення `n`.

source: "picked a number: {:?}"
fa: "شماره ای را انتخاب کرد: {:?}"
pt_br: "escolheu um número: {:?}"
uk: "вибраний номер: {:?}"

source: "picked a string: {:?}"
uk: "вибрав рядок: {:?}"

source: "dog"
fa: "سگ"
pt_br: "cachorro"
uk: "собака"

source: "cat"
fa: "گربه"
pt_br: "gato"
uk: "кіт"

source: Rust infers a type for T based on the types of the arguments and return value.
fa: Rust تایپ T را بر اساس تایپ آرگومان‌ها و مقدار بازگشتی استنباط می‌کند.
ja: Rust は引数と戻り値の型に基づいて T の型を推測します。
pt_br: Rust infere um tipo para T com base nos tipos dos argumentos e valor de retorno.
uk: Rust визначає тип для T на основі типів аргументів та значення, що повертається.

source: In this example we only use the primitive types `i32` and `&str` for `T`, but we can use any type here, including user-defined types:
uk: У цьому прикладі ми використовуємо лише примітивні типи `i32` та `&str` для `T`, але ми можемо використовувати будь-який тип, включаючи типи, визначені користувачем:

source: This is similar to C++ templates, but Rust partially compiles the generic function immediately, so that function must be valid for all types matching the constraints. For example, try modifying `pick` to return `even + odd` if `n == 0`. Even if only the `pick` instantiation with integers is used, Rust still considers it invalid. C++ would let you do this.
fa: این شبیه به الگوهای در ++C است، اما Rust تابع generic را بلافاصله به صورت جزئی کامپایل می‌کند، بنابراین آن تابع باید برای تمام تایپ‌هایی که با محدودیت‌ها مطابقت دارند معتبر باشد. به عنوان مثال، سعی کنید تابع `pick` را طوری تغییر دهید که اگر `n == 0` باشد، مقدار `even + odd` را برگرداند. حتی اگر فقط نمونه‌سازی تابع `pick` با اعداد صحیح استفاده شود، Rust همچنان آن را نامعتبر در نظر می‌گیرد. اما ++C اجازه این کار را به شما می‌دهد.
ja: これは C++ テンプレートに似ていますが、Rust はジェネリック関数を部分的にすぐにコンパイルするため、その関数は制約に一致するすべての型に対して有効である必要があります。たとえば、`n == 0` の場合は `even + odd` を返すように `pick` を変更してみてください。整数を使用した `pick` インスタンス化のみが使用されている場合でも、Rust はそれを無効とみなします。C++ ではこれを行うことができます。
pt_br: Isto é semelhante aos _templates_ C++, mas Rust compila parcialmente a função genérica imediatamente, de modo que a função deve ser válida para todos os tipos que correspondem às restrições. Por exemplo, tente modificar `pick` para retornar `even + odd` se `n == 0`. Mesmo que apenas a instância `pick` com inteiros seja usada, Rust ainda a considera inválida. C++ permitiria que você fizesse isso.
uk: Це схоже на шаблони C++, але Rust частково компілює узагальнену функцію одразу, тому ця функція має бути валідною для всіх типів, що відповідають обмеженням. Наприклад, спробуйте модифікувати `pick` так, щоб вона повертала `even + odd`, якщо `n == 0`. Навіть якщо використовується лише екземпляр `pick` з цілими числами, Rust все одно вважатиме його невірним. C++ дозволить вам зробити це.

source: Generic code is turned into non-generic code based on the call sites. This is a zero-cost abstraction: you get exactly the same result as if you had hand-coded the data structures without the abstraction.
fa: کد generic بر اساس محل‌های فراخوانی به کد non-generic تبدیل می‌شود. این یک انتزاع بدون هزینه است: شما دقیقاً همان نتیجه‌ای را دریافت می‌کنید که گویی ساختارهای داده را بدون انتزاع به صورت دستی کدنویسی کرده‌اید.
pt_br: O código genérico é transformado em código não genérico com base nos locais de chamada. Esta é uma abstração sem custo: você obtém exatamente o mesmo resultado como se tivesse codificado as estruturas de dados sem a abstração.
uk: Узагальнений код перетворюється на не-узагальнений на основі сайтів виклику. Це абстракція з нульовою вартістю: ви отримуєте точно такий же результат, як якщо б ви написали структури даних власноруч без абстракції.

source: You can use generics to abstract over the concrete field type:
es: Puedes usar genéricos para abstraer el tipo de campo concreto:
fa: می‌توانید از generic‌ ها برای انتزاع نوع فیلد مشخص استفاده کنید:
ja: ジェネリクスを使って、具体的なフィールドの型を抽象化することができます：
ko: 제네릭을 사용하여 필드의 타입을 추상화 할 수 있습니다:
pt_br: Você pode usar genéricos para abstrair o tipo concreto do campo:
uk: Ви можете використовувати узагальнення для абстрагування від конкретного типу поля:

source: "{integer:?} and {float:?}"
fa: "{integer:?} و {float:?}"
pt_br: "{integer:?} e {float:?}"
uk: "{integer:?} та {float:?}"

source: "coords: {:?}"
uk: "координати: {:?}"

source: _Q:_ Why `T` is specified twice in `impl<T> Point<T> {}`? Isn't that redundant?
es: _P:_ ¿Por qué `T` se especifica dos veces en `impl<T> Point<T> {}`? ¿No es redundante?
fa: _سوال:_ چرا `T` در عبارت `{}<impl<T> Point<T` دوبار مشخص شده است؟ آیا این تکراری نیست؟
ja: _Q:_ なぜ`T`は２回も `impl<T> Point<T> {}` において指定されたのでしょうか？冗長ではありませんか？
ko: _질문:_ `impl<T> Point<T> {}`에서 `T`가 왜 두 번 사용됩니까?
pt_br: _Pergunta:_ Por que `T` é especificado duas vezes em `impl<T> Point<T> {}`? Isso não é redundante?
uk: _З:_ Чому `T` вказаний двічі в `impl<T> Point<T> {}`? Хіба це не зайве?

source: This is because it is a generic implementation section for generic type. They are independently generic.
es: Esto se debe a que es una sección de implementación genérica para un tipo genérico. Son genéricos de forma independiente.
fa: این به این دلیل است که این یک بخش پیاده‌سازی generic برای تایپ generic است. آن‌ها به‌طور مستقل generic هستند.
ja: なぜなら、これはジェネリクスに対してのジェネリックな実装の箇所だからです。それらは独立してジェネリックです。
ko: 제네릭 타입에 대한 제네릭 구현 이기 때문입니다. 이 두 제네릭은 서로 독립적입니다.
pt_br: Isso ocorre porque é uma seção de implementação genérica para tipo genérico. Eles são genéricos de forma independente.
uk: Це пояснюється тим, що це частина узагальненої реалізації для узагальненого типу. Вони є узагальненими незалежно один від одного..

source: It means these methods are defined for any `T`.
es: Significa que estos métodos están definidos para cualquier `T`.
fa: این به این معناست که این متدها برای هر نوع `T` تعریف شده‌اند.
ja: つまり、そのようなメソッドは任意の`T`に対して定義されるということです。
ko: 이는 임의의 모든 `T`에 대해서 이 메소드들이 정의된다는 것을 의미합니다.
pt_br: Significa que esses métodos são definidos para qualquer `T`.
uk: Це означає, що ці методи визначені для будь-якого `T`.

source: It is possible to write `impl Point<u32> { .. }`.
fa: این امکان وجود دارد که `{ .. }<impl Point<u32` را بنویسید.
pt_br: É possível escrever `impl Point<u32> { .. }`.
uk: Можна написати `impl Point<u32> { .. }`.

source: `Point` is still generic and you can use `Point<f64>`, but methods in this block will only be available for `Point<u32>`.
es: `Point` sigue siendo genérico y puedes usar `Point<f64>`, pero los métodos de este bloque solo estarán disponibles para `Point<u32>`.
fa: `Point` هنوز هم generic است و می‌توانید از `<Point<f64` استفاده کنید، اما متدهای موجود در این بلوک تنها برای `<Point<u32` در دسترس خواهند بود.
ja: `Point`はそれでもなおジェネリックであり、 `Point<f64>`を使うことができます。しかし、このブロックでのメソッドは`Point<u32>`に対してのみ利用可能となります。
ko: `Point`는 여전히 제네릭이며 `Point<f64>`를 사용할 수도 있지만 이 블록의 메서드는 `Point<u32>`만 쓸 수 있습니다.
pt_br: `Point` ainda é genérico e você pode usar `Point<f64>`, mas os métodos neste bloco só estarão disponíveis para `Point<u32>`.
uk: `Point` все ще є узагальненим типом, і ви можете використовувати `Point<f64>`, але методи в цьому блоці будуть доступні лише для `Point<u32>`.

source: Try declaring a new variable `let p = Point { x: 5, y: 10.0 };`. Update the code to allow points that have elements of different types, by using two type variables, e.g., `T` and `U`.
fa: سعی کنید یک متغیر جدید با `let p = Point { x: 5, y: 10.0 };` بسازید. کد را به‌روزرسانی کنید تا نقاطی که دارای عناصر با تایپ‌های مختلف هستند را مجاز کند، با استفاده از دو تایپ متغیر، مانند `T` و `U`.
ja: 新しい変数 `let p = Point { x: 5, y: 10.0 };` を宣言してみてください。2 つの変数（`T` と `U` など）を使用して、異なる型の要素を持つポイントを許可するようにコードを更新します。
pt_br: Tente declarar uma nova variável `let p = Point { x: 5, y: 10.0 };`. Atualize o código para permitir pontos que tenham elementos de tipos diferentes, usando duas variáveis de tipo, por exemplo, `T` e `U`.
uk: Спробуйте оголосити нову змінну `let p = Point { x: 5, y: 10.0 };`. Оновіть код, щоб дозволити створювати точки, які мають елементи різних типів, використовуючи дві змінні типу, наприклад, `T` і `U`.

source: Minutes: 5
uk: Хвилин: 5

source: Traits can also be generic, just like types and functions. A trait's parameters get concrete types when it is used.
fa: Traits نیز می‌توانند generic باشند، درست مانند تایپ و توابع. پارامترهای یک trait زمانی که استفاده می‌شود، تایپ‌های مشخصی پیدا می‌کنند.
pt_br: _Traits_ também podem ser genéricos, assim como tipos e funções. Os parâmetros de um _trait_ recebem tipos concretos quando ele é usado.
uk: Трейти також можуть бути загальними, так само як типи та функції. Параметри трейту отримують конкретні типи під час його використання.

source: "Converted from integer: {from}"
fa: "تبدیل شده از integer: {from}"
pt_br: "Convertido de inteiro: {from}"
uk: "Перетворено з цілого числа: {from}"

source: "Converted from bool: {from}"
fa: "تبدیل‌شده از bool: {from}"
pt_br: "Convertido de booleano: {from}"
uk: "Перетворено з булевого значення: {from}"

source: The `From` trait will be covered later in the course, but its [definition in the `std` docs](https://doc.rust-lang.org/std/convert/trait.From.html) is simple.
fa: `From` trait در ادامه دوره پوشش داده خواهد شد، اما [تعریف آن در مستندات `std`](https://doc.rust-lang.org/std/convert/trait.From.html) ساده است.
pt_br: O _trait_ `From` será abordado mais tarde no curso, mas sua [definição na documentação `std`](https://doc.rust-lang.org/std/convert/trait.From.html) é simples.
uk: Трейт `From` буде розглянутий пізніше у курсі, але її [визначення у документації `std`](https://doc.rust-lang.org/std/convert/trait.From.html) є простим.

source: Implementations of the trait do not need to cover all possible type parameters. Here, `Foo::from("hello")` would not compile because there is no `From<&str>` implementation for `Foo`.
fa: پیاده‌سازی‌های trait نیازی به پوشش تمام پارامترهای تایپ ممکن ندارند. در اینجا، `Foo::from("hello")` کامپایل نخواهد شد زیرا پیاده‌سازی `<From<&str` برای `Foo` وجود ندارد.
pt_br: As implementações do _trait_ não precisam cobrir todos os possíveis parâmetros de tipo. Aqui, `Foo::from("hello")` não seria compilado porque não há implementação `From<&str>` para `Foo`.
uk: Реалізації трейту не обов'язково повинні охоплювати всі можливі параметри типів. У цьому випадку `Foo::from("hello")` не буде скомпільовано, оскільки для `Foo` не існує реалізації `From<&str>`.

source: Generic traits take types as "input", while associated types are a kind of "output" type. A trait can have multiple implementations for different input types.
fa: traitهای Generic تایپ‌ها را به‌عنوان "ورودی" می‌پذیرند، در حالی که تایپ مرتبط تایپ از "خروجی" هستند. یک trait می‌تواند پیاده‌سازی‌های مختلفی برای تایپ‌های ورودی متفاوت داشته باشد.
pt_br: Os _traits_ genéricos recebem tipos como "entrada", enquanto os tipos associados são uma espécie de tipo de "saída". Um _trait_ pode ter várias implementações para diferentes tipos de entrada.
uk: Узагальнені трейти приймають типи як "вхідні", тоді як асоціативні типи є своєрідним "вихідним" типом. Трейт може мати декілька реалізацій для різних вхідних типів.

source: In fact, Rust requires that at most one implementation of a trait match for any type T. Unlike some other languages, Rust has no heuristic for choosing the "most specific" match. There is work on adding this support, called [specialization](https://rust-lang.github.io/rfcs/1210-impl-specialization.html).
fa: در واقع، Rust نیاز دارد که حداکثر یک پیاده‌سازی از یک trait برای هر تایپ `T` تطابق داشته باشد. بر خلاف برخی زبان‌های دیگر، Rust هیچ قاعده‌ای برای انتخاب "مشخص‌ترین" تطابق را ندارد. در حال حاضر، کارهایی برای اضافه کردن این پشتیبانی وجود دارد که به آن [ویژه‌سازی](https://rust-lang.github.io/rfcs/1210-impl-specialization.html) می‌گویند.
pt_br: Na verdade, o Rust exige que no máximo uma implementação de um _trait_ corresponda a qualquer tipo T. Ao contrário de algumas outras linguagens, o Rust não tem uma heurística para escolher a correspondência "mais específica". Há trabalho em adicionar esse suporte, chamado [especialização](https://rust-lang.github.io/rfcs/1210-impl-specialization.html).
uk: Ведеться робота над додаванням цієї підтримки, яка називається [спеціалізація](https://rust-lang.github.io/rfcs/1210-impl-specialization.html).

source: When working with generics, you often want to require the types to implement some trait, so that you can call this trait's methods.
es: Cuando se trabaja con genéricos, a menudo se prefiere que los tipos implementen algún trait, de forma que se pueda llamar a los métodos de este trait.
fa: هنگام کار با generic‌ها، معمولاً می‌خواهید نیاز داشته باشید که تایپ، trait ترید خاص را پیاده‌سازی کنند، تا بتوانید متدهای آن trait را فراخوانی کنید.
ja: ジェネリクスを用いるとき、あるトレイトのメソッドを呼び出せるように、型がそのトレイトを実装していることを要求したいことがよくあります。（脚注：本教材では"Trait bounds"を「トレイト制約」と翻訳しましたが、Rustの日本語翻訳コミュニティでは「トレイト境界」と呼ぶ流派もあり、どちらの翻訳を採用するかについては[議論がなされています](https://github.com/rust-lang-ja/book-ja/issues/172)。）
ko: 제네릭을 이용하다 보면 타입이 어떤 트레잇을 구현하고 있어야 하는 경우가 있습니다. 그래야 그 트레잇의 메서드를 호출할 수 있기 때문입니다.
pt_br: Ao trabalhar com genéricos, muitas vezes você exigir que os tipos implementem algum `trait` para poder utilizar os métodos do `trait`.
uk: При роботі з узагальненнями ви часто потребуєте, щоб типи реалізовували деякий трейт, щоб ви могли викликати методи цього трейту.

source: You can do this with `T: Trait`:
uk: Ви можете зробити це за допомогою `T: Trait`:

source: Try making a `NonClonable` and passing it to `duplicate`.
fa: سعی کنید یک `NonClonable` بسازید و آن را به `duplicate` پاس دهید.
ja: `NonClonable` を作成して`duplicate` に渡してみてください。
pt_br: Tente criar um `NonClonable` e passá-lo para `duplicate`.
uk: Спробуйте зробити `NonClonable` і передати його в `duplicate`.

source: When multiple traits are necessary, use `+` to join them.
fa: زمانی که چندین ترید لازم است، از `+` برای ترکیب آن‌ها استفاده کنید.
ja: 複数のトレイトが必要な場合は、`+` を使って結合します。
pt_br: Quando vários _traits_ são necessários, use `+` para uni-los.
uk: Якщо потрібно вказати декілька трейтів, використовуйте `+`, щоб об'єднати їх.

source: Show a `where` clause, students will encounter it when reading code.
es: Muestra una cláusula `where` para que los alumnos la encuentren al leer el código.
fa: یک عبارت `where` را نشان دهید، زیرا دانش‌آموزان هنگام خواندن کد با آن مواجه خواهند شد.
ja: `where` 節の使い方を示しましょう。受講生はコードを読んでいるときに、この`where`節に遭遇します。
ko: `where` 문법을 사용할 수도 있습니다. 수강생들도 코드를 읽다가 그 문법을 마주할 수 있습니다.
pt_br: Mostre uma cláusula `where`, estudantes irão encontrá-la quando lerem código.
uk: Покажіть вираз `where`, студенти зустрінуться з ним під час читання коду.

source: It declutters the function signature if you have many parameters.
es: Despeja la firma de la función si tienes muchos parámetros.
fa: اگر تعداد پارامترها زیاد باشد، استفاده از عبارت `where` باعث می‌شود که امضای تابع مرتب‌تر و خواناتر باشد.
ja: たくさんのパラメタがある場合に、`where`節は関数のシグネチャを整理整頓してくれます。
ko: 이를 이용하면 타입 파라메터가 많은 경우 함수 시그니처를 간결하게 정리하는 데 도움이 됩니다.
pt_br: Organiza a assinatura da função se você tiver muitos parâmetros.
uk: Це розчищає сигнатуру функції, якщо у вас багато параметрів.

source: It has additional features making it more powerful.
es: Tiene funciones adicionales para que sea más potente.
fa: این ویژگی‌های اضافی دارد که آن را قدرتمندتر می‌کند.
ja: `where`節には更に強力な機能があります。
ko: 좀 더 강력한 추가 기능도 제공합니다.
pt_br: Possui recursos adicionais tornando-o mais poderoso.
uk: Він має додаткові функції, що робить його більш потужним.

source: If someone asks, the extra feature is that the type on the left of ":" can be arbitrary, like `Option<T>`.
es: Si alguien pregunta, la función adicional es que el tipo que está a la izquierda de ":" puede ser arbitrario, como `Option<T>`.
fa: اگر کسی بپرسد، ویژگی اضافی این است که تایپ در سمت چپ `:` می‌تواند دلخواه باشد، مانند `<Option<T`.
ja: 誰かに聞かれた場合で良いですが、その機能というのは、":" の左側には `Option<T>` のように任意の型を表現できるというものです。
ko: `:` 왼쪽에 임의의 타입(예를 들어 `Option<T>`)을 사용할 수 있습니다.
pt_br: Se alguém perguntar, o recurso extra é que o tipo à esquerda de ":" pode ser arbitrário, como `Option<T>`.
uk: Якщо хтось запитає, додаткова можливість полягає в тому, що тип ліворуч від ":" може бути довільним, наприклад `Option<T>`.

source: Note that Rust does not (yet) support specialization. For example, given the original `duplicate`, it is invalid to add a specialized `duplicate(a: u32)`.
fa: توجه داشته باشید که Rust (هنوز) پشتیبانی از ویژه‌سازی را ندارد. به عنوان مثال، با توجه به `duplicate` اصلی، اضافه کردن یک پیاده‌سازی ویژه‌شده مانند `duplicate(a: u32)` نامعتبر است.
ja: なお、Rust はまだ特化(specialization)をサポートしていません。たとえば、元の `duplicate` がある場合は、特化された `duplicate(a: u32)` を追加することはできません。
pt_br: Observe que o Rust ainda não suporta especialização. Por exemplo, dada a função `duplicate` original, é inválido adicionar uma especialização `duplicate(a: u32)`.
uk: Зауважте, що Rust (поки що) не підтримує спеціалізацію. Наприклад, за наявності оригінального `duplicate` додавання спеціалізованого `duplicate(a: u32)` є некоректним.

source: Similar to trait bounds, an `impl Trait` syntax can be used in function arguments and return values:
es: De forma similar a los límites de _traits_, se puede usar la sintaxis `impl Trait` en argumentos de funciones y valores devueltos:
fa: مشابه با محدودیت‌های trait، می‌توان از `impl Trait` syntax در آرگومان‌های تابع و مقادیر بازگشتی استفاده کرد:
ja: トレイト境界と似たように、構文 `impl Trait`は関数の引数と返り値においてのみ利用可能です：
ko: 트레잇 바운드와 유사하게 `impl Trait` 문법은 함수의 인자와 반환값에도 적용 가능합니다:
pt_br: Semelhante aos limites de _trait_, a sintaxe do _trait_ `impl` pode ser usada em argumentos de funções e em valores de retorno:
uk: Подібно до меж трейтів, синтаксис `impl Trait` можна використовувати в аргументах функції та значеннях, що повертаються:

source: // Syntactic sugar for: // fn add_42_millions<T: Into<i32>>(x: T) -> i32 {
ja: // 以下の糖衣構文: // fn add_42_millions<T: Into<i32>>(x: T) -> i32 {
pt_br: // Código simplificado para: // fn add_42_millions<T: Into<i32>>(x: T) -> i32 {
uk: // Синтаксичний цукор для: // fn add_42_millions<T: Into<i32>>(x: T) -> i32 {

source: `impl Trait` allows you to work with types which you cannot name. The meaning of `impl Trait` is a bit different in the different positions.
fa: `impl Trait` به شما اجازه می‌دهد با تایپ‌هایی کار کنید که نمی‌توانید نام ببرید. معنی `impl Trait` در موقعیت‌های مختلف کمی متفاوت است.
pt_br: O `impl Trait` permite que você trabalhe com tipos que você não pode nomear. O significado de `impl Trait` é um pouco diferente nas diferentes posições.
uk: `impl Trait` дозволяє працювати з типами, які ви не можете назвати. Значення `impl Trait` дещо відрізняється у різних позиціях.
