Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: "username or error: {username:?}"
fa: "نام‌کاربری یا خطا: {username:?}"
pt_br: "username ou erro: {username:?}"
uk: "ім'я користувача або помилка: {username:?}"

source: Simplify the `read_username` function to use `?`.
fa: تابع `read_username` را برای استفاده از `?` ساده کنید.
ja: ? を使用して `read_username` 関数を簡素化します。
pt_br: Simplifique a função `read_username` para usar `?`.
uk: Спростіть функцію `read_username` до використання `?`.

source: The `username` variable can be either `Ok(string)` or `Err(error)`.
es: La variable `username` puede ser `Ok(string)` o `Err(error)`.
fa: متغیر`username` می تواند `Ok(string)` یا `Err(error)` باشد.
ja: `username` 変数は、`Ok(string)` または `Err(error)` のいずれかになります。
ko: `username` 변수는 `Ok(string)`이거나 `Err(error)`일 수 있습니다.
pt_br: A variável `username` pode ser `Ok(string)` ou `Err(error)`.
uk: Змінна `username` може мати значення `Ok(string)` або `Err(error)`.

source: Use the `fs::write` call to test out the different scenarios: no file, empty file, file with username.
es: Utiliza la llamada a `fs::write` para probar las distintas situaciones: sin archivo, archivo vacío o archivo con nombre de usuario.
fa: از فراخوانی `fs::write` برای آزمایش سناریوهای مختلف استفاده کنید: بدون فایل، فایل خالی، فایل با نام کاربری.
ja: `fs::write` 呼び出しを使用して、さまざまなシナリオ（ファイルがない、空のファイル、ユーザー名のあるファイルなど）をテストします。
ko: `fs::write` 메서드를 사용하여 파일이 없거나, 비었거나, 중복되는 경우 등을 테스트해 봅니다.
pt_br: Use a chamada `fs::write` para testar os diferentes cenários: nenhum arquivo, arquivo vazio e arquivo com nome de usuário.
uk: Використовуйте виклик `fs::write`, щоб перевірити різні сценарії: відсутність файлу, порожній файл, файл з іменем користувача.

source: Note that `main` can return a `Result<(), E>` as long as it implements `std::process::Termination`. In practice, this means that `E` implements `Debug`. The executable will print the `Err` variant and return a nonzero exit status on error.
fa: توجه داشته باشید که `main` تا زمانی که `std::process::Termination` را پیاده‌سازی کند، می‌تواند `نتیجه<(), E>` را برگرداند. در عمل، این بدان معنی است که `E` پیاده‌سازی `Debug` را انجام‌می‌دهد. فایل اجرایی، نوع `Err` را چاپ می‌کند و در صورت خطا، وضعیت خروج غیر صفر (nonzero) را برمی‌گرداند.
uk: Зверніть увагу, що `main` може повертати `Result<(), E>`, якщо вона реалізує `std::process:Termination`. На практиці це означає, що `E` реалізує `Debug`. Виконуваний файл виведе варіант `Err` і поверне ненульовий статус виходу у разі помилки.

source: The effective expansion of `?` is a little more complicated than previously indicated:
es: La expansión efectiva de `?` es un poco más complicada de lo que se ha indicado anteriormente:
fa: گسترش مؤثر `?` کمی پیچیده‌تر از آنچه قبلاً ذکر شد است:
ja: `?` を実際に展開すると、前述のコードよりも少し複雑なコードになります。
ko: 실제로 `?`가 적용되는 과정은 아까 설명한 것 보다 좀 더 복잡합니다:
pt_br: A expansão efetiva do operador `?` é um pouco mais complicada do que indicado anteriormente:
uk: Ефективне розширення `?` є трохи складнішим, ніж було зазначено раніше:

source: works the same as
es: funciona igual que
fa: به طو مشابه کار می‌کند
ja: 上のコードは、以下と同じように動作します。
ko: 위 표현은 아래와 같습니다
pt_br: funciona da mesma forma que
uk: працює так само, як

source: The `From::from` call here means we attempt to convert the error type to the type returned by the function. This makes it easy to encapsulate errors into higher-level errors.
fa: فراخوانی `From::from` در اینجا به این معنی است که ما سعی می کنیم نوع خطا را به نوع بازگشتی توسط تابع تبدیل کنیم. این باعث می‌شود که خطاها به خطاهای سطح بالاتر کپسوله شوند.
ja: ここでの `From::from` 呼び出しは、エラー型を関数が返す型に変換しようとしていることを意味します。これにより、エラーを上位レベルのエラーに簡単にカプセル化できます。
pt_br: A chamada `From::from` aqui significa que tentamos converter o tipo de erro para o tipo retornado pela função. Isso torna fácil encapsular erros em erros de nível superior.
uk: Виклик `From::from` тут означає, що ми намагаємося перетворити тип помилки на тип, який повертає функція. Це дозволяє легко інкапсулювати помилки у помилки вищого рівня.

source: "I/O error: {e}"
uk: "I/O помилка: {e}"

source: "Found no username in {path}"
fa: "در این {path} نام کاربری یافت نشد"
pt_br: "Nome de usuário não encontrado em {path}"
uk: "Не знайдено імені користувача в {path}"

source: The `?` operator must return a value compatible with the return type of the function. For `Result`, it means that the error types have to be compatible. A function that returns `Result<T, ErrorOuter>` can only use `?` on a value of type `Result<U, ErrorInner>` if `ErrorOuter` and `ErrorInner` are the same type or if `ErrorOuter` implements `From<ErrorInner>`.
fa: عملگر `?` باید مقداری سازگار با نوع بازگشتی تابع برگرداند. برای `Result`، به این معنی است که انواع خطا باید سازگار باشند. تابعی که`Result<T, ErrorOuter>` را برمی‌گرداند، تنها می‌تواند از `?` در مقداری از تایپ‌های `Result<U, ErrorInner>` استفاده کند اگر `ErrorOuter` و `ErrorInner` یک نوع باشند یا اگر `ErrorOuter` از<ErrorInner>` را پیاده‌سازی کند.
ja: `?` 演算子は、関数の戻り値の型と互換性のある値を返す必要があります。つまり、`Result` の場合、エラー型に互換性がなければなりません。`Result<T, ErrorOuter>` を返す関数は、`ErrorOuter` と `ErrorInner` が同じ型であるか、`ErrorOuter` が `From<ErrorInner>` を実装している場合にのみ、型 `Result<U, ErrorInner>` の値に `?` を使用できます。
pt_br: O operador `?` deve retornar um valor compatível com o tipo de retorno da função. Para `Result`, isso significa que os tipos de erro devem ser compatíveis. Uma função que retorna `Result<T, ErrorOuter>` só pode usar `?` em um valor do tipo `Result<U, ErrorInner>` se `ErrorOuter` e `ErrorInner` forem do mesmo tipo ou se `ErrorOuter` implementar `From<ErrorInner>`.
uk: Оператор `?` повинен повертати значення, сумісне з типом повернення функції. Для `Result` це означає, що типи помилок мають бути сумісними. Функція, яка повертає `Result<T, ErrorOuter>`, може використовувати `?` на значенні типу `Result<U, ErrorInner>` тільки якщо `ErrorOuter` і `ErrorInner` мають однаковий тип або якщо `ErrorOuter` реалізує `From<ErrorInner>`.

source: A common alternative to a `From` implementation is `Result::map_err`, especially when the conversion only happens in one place.
fa: یک جایگزین رایج برای پیاده سازی `From`جهت `Result::map_err` است، به خصوص زمانی که تبدیل‌ها فقط در یک مکان انجام می‌شود.
ja: 特に変換が 1 か所でのみ発生する場合は、`From` を実装する代わりに Result::map_err を使用するのが一般的です。
pt_br: Uma alternativa comum a uma implementação `From` é `Result::map_err`, especialmente quando a conversão ocorre apenas em um local.
uk: Поширеною альтернативою реалізації `From` є `Result::map_err`, особливо коли перетворення відбувається лише в одному місці.

source: There is no compatibility requirement for `Option`. A function returning `Option<T>` can use the `?` operator on `Option<U>` for arbitrary `T` and `U` types.
fa: هیچ الزامی برای سازگاری `Option` وجود ندارد. تابعی که `Option<T>` را برمی گرداند می تواند از عملگر `?` در `Option<U>` برای انواع دلخواه `T` و `U` استفاده کند.
ja: `Option`には互換性の要件はありません。`Option<T>`を返す関数は、任意のT型とU型に対して、?演算子をOption<T>に適用できます。
pt_br: Não há requisito de compatibilidade para `Option`. Uma função que retorna `Option<T>` pode usar o operador `?` em `Option<U>` para tipos `T` e `U` arbitrários.
uk: Для `Option` немає вимог щодо сумісності. Функція, що повертає `Option<T>`, може використовувати оператор `?` на `Option<U>` для довільних типів `T` та `U`.

source: A function that returns `Result` cannot use `?` on `Option` and vice versa. However, `Option::ok_or` converts `Option` to `Result` whereas `Result::ok` turns `Result` into `Option`.
fa: یک تابعی که `Result` را برمی‌گرداند دیگر نمی‌تواند از `?` در `Option` استفاده کند و بالعکس. با این‌حال، `Option::ok_or` یک `Option` را به `Result` تبدیل می‌کند در حالی که `Result::ok` «نتیجه» را به `Option` تبدیل می‌کند.
ja: `Result` を返す関数では `Option` に `?` を使用できません。その逆も同様です。ただし、`Option::ok_or` は `Option` を `Result` に変換でき、`Result::ok` は `Result` を `Option` に変換できます。
pt_br: Uma função que retorna `Result` não pode usar `?` em `Option` e vice-versa. No entanto, `Option::ok_or` converte `Option` em `Result`, enquanto `Result::ok` transforma `Result` em `Option`.
uk: Функція, яка повертає `Result`, не може використовувати `?` в `Option` і навпаки. Однак, `Option::ok_or` перетворює `Option` в `Result`, тоді як `Result::ok` перетворює `Result` в `Option`.

source: Dynamic Error Types
es: Tipos de Errores Dinámicos
fa: انواع خطاهای Dynamic
ja: 動的なエラー型
ko: 동적인 에러 타입
pt_br: Tipos de Erros Dinâmicos
uk: Динамічні типи помилок

source: Sometimes we want to allow any type of error to be returned without writing our own enum covering all the different possibilities. The `std::error::Error` trait makes it easy to create a trait object that can contain any error.
fa: گاهی اوقات می‌خواهیم اجازه دهیم هر نوع خطای بدون نوشتن enum خودمان که تمام احتمالات مختلف را پوشش می‌دهد، برگردانده شود. ویژگی `std::error::Error` ایجاد یک object مشخ استه که می‌تواند حاوی هر خطایی باشد را آسان می‌کند.
ja: さまざまな可能性をカバーする独自の列挙型を記述することなく、あらゆる種類のエラーを返せるようにしたい場合があります。`std::error::Error` トレイトを使用すると、あらゆるエラーを含めることができるトレイト オブジェクトを簡単に作成できます。
pt_br: Às vezes, queremos permitir que qualquer tipo de erro seja retornado sem escrever nosso próprio enum cobrindo todas as possibilidades diferentes. O _trait_ `std::error::Error` torna fácil criar um objeto _trait_ que pode conter qualquer erro.
uk: Іноді ми хочемо дозволити повертати будь-який тип помилки без написання власного переліку, що охоплює всі різні можливості. Трейт `std::error::Error` дозволяє легко створити об'єкт трейту, який може містити будь-яку помилку.

source: "Count: {count}"
fa: "تعداد: {count}"
pt_br: "Contagem: {count}"
uk: "Підрахунок: {count}"

source: "Error: {err}"
pt_br: "Erro: {err}"
uk: "Помилка: {err}"

source: The `read_count` function can return `std::io::Error` (from file operations) or `std::num::ParseIntError` (from `String::parse`).
fa: تابع `read_count`می‌تواند `std::io::Error` (از عملیات فایل) یا `std::num::ParseIntError` (از `String::parse`) را برگرداند.
ja: `read_count` 関数は、`std::io::Error`（ファイル オペレーションから）または `std::num::ParseIntError`（`String::parse` から）を返すことができます。
pt_br: A função `read_count` pode retornar `std::io::Error` (de operações de arquivo) ou `std::num::ParseIntError` (de `String::parse`).
uk: Функція `read_count` може повернути `std::io::Error` (з файлових операцій) або `std::num::ParseIntError` (з `String::parse`).

source: Boxing errors saves on code, but gives up the ability to cleanly handle different error cases differently in the program. As such it's generally not a good idea to use `Box<dyn Error>` in the public API of a library, but it can be a good option in a program where you just want to display the error message somewhere.
fa: خطاهای Boxing باعث صرفه‌جویی در کد می شود، اما توانایی رسیدگی به موارد خطای مختلف را به طور متفاوت در برنامه از بین می‌برد. به این ترتیب استفاده از `Box<dyn Error>` در public API یک کتابخانه ایده خوبی نیست، اما می‌تواند گزینه خوبی در برنامه‌ای باشد که فقط می‌خواهید پیام خطا را در جایی نمایش دهید.
ja: エラーをボックス化することでコードを節約できますが、プログラムで異なるエラーケースを異なる方法で適切に処理する機能が失われます。そのため、ライブラリの公開 API で `Box<dyn Error>` を使用することは通常おすすめしませんが、エラー メッセージをどこかに表示したいだけのプログラムでは適切な選択肢となりえます。
pt_br: Encaixotar (_boxing_) erros economiza código, mas sacrifica a capacidade de lidar elegantemente com diferentes casos de erro de forma individualizada no programa. Como tal, geralmente não é uma boa ideia usar `Box<dyn Error>` na API pública de uma biblioteca, mas pode ser uma boa opção em um programa onde você só quer exibir a mensagem de erro em algum lugar.
uk: Пакування помилок економить код, але позбавляє можливості чисто обробляти різні випадки помилок по-різному у програмі. Загалом, це не дуже гарна ідея використовувати `Box<dyn Error>` у публічному API бібліотеки, але це може бути гарним варіантом у програмі, де ви просто хочете десь вивести повідомлення про помилку.

source: Make sure to implement the `std::error::Error` trait when defining a custom error type so it can be boxed.
uk: Переконайтеся, що ви використовуєте трейт`std::error::Error` під час визначення користувацького типу помилки, щоб її можна було упакувати.

source: The [`thiserror`](https://docs.rs/thiserror/) crate provides macros to help avoid boilerplate when defining error types. It provides derive macros that assist in implementing `From<T>`, `Display`, and the `Error` trait.
uk: Крейт [`thiserror`](https://docs.rs/thiserror/) містить макроси, які допомагають уникнути повторювань при визначенні типів помилок. Він містить похідні макроси, які допомагають реалізувати `From<T>`, `Display` та трейт`Error`.

source: "I/O error: {0}"
uk: "I/O помилка: {e}"

source: "Found no username in {0}"
fa: "هیچ نام‌کاربری در {0} یافت نشد"
pt_br: "Nome de usuário não encontrado em {0}"
uk: "Не знайдено імені користувача в {0}"

source: "Username: {username}"
fa: "نام‌کاربری: {username}"
pt_br: "Nome do usuário: {username}"
uk: "Ім'я користувача: {username}"

source: "Error: {err:?}"
pt_br: "Erro: {err:?}"
uk: "Помилка: {err:?}"

source: The `Error` derive macro is provided by `thiserror`, and has lots of useful attributes to help define error types in a compact way.
fa: ماکرو استخراج `Error` توسط `thiserror` ارائه می‌شود و دارای ویژگی‌های مفید زیادی برای کمک به تعریف انواع خطا به روشی فشرده است.
ja: `Error` 導出マクロは `thiserror` によって提供されます。このマクロには、エラー型を簡潔に定義するのに役立つ属性が数多く用意されています。
pt_br: A macro `Error` é fornecida por `thiserror` e possui vários atributos úteis para ajudar a definir tipos de erro de forma compacta.
uk: Похідний макрос `Error` надається `thiserror` і має багато корисних атрибутів для компактного визначення типів помилок.

source: The message from `#[error]` is used to derive the `Display` trait.
fa: پیام `#[error]` برای استخراج ویژگی `Display` استفاده می‌شود.
ja: `#[error]` からのメッセージは、`Display` トレイトを導出するために使用されます。
pt_br: A mensagem de `#[error]` é usada para derivar o _trait_ `Display`.
uk: Повідомлення з `#[error]` використовується для отримання трейту `Display`.

source: Note that the (`thiserror::`)`Error` derive macro, while it has the effect of implementing the (`std::error::`)`Error` trait, is not the same this; traits and macros do not share a namespace.
uk: Зауважте, що похідний макрос (`thiserror::`)`Error`, хоча і має ефект реалізації трейту (`std::error::`)`Error`, не є тим самим; трейти та макроси не мають спільного простору імен.

source: The [`anyhow`](https://docs.rs/anyhow/) crate provides a rich error type with support for carrying additional contextual information, which can be used to provide a semantic trace of what the program was doing leading up to the error.
uk: Крейт [`anyhow`](https://docs.rs/anyhow/) надає багатий тип помилок з підтримкою передачі додаткової контекстної інформації, яка може бути використана для семантичного відстеження дій програми, що призвели до виникнення помилки.

source: This can be combined with the convenience macros from `thiserror` to avoid writing out trait impls explicitly for custom error types.
uk: Це можна поєднати зі зручними макросами з `thiserror`, щоб уникнути написання реалізацій трейтів явно для користувацьких типів помилок.

source: "Failed to open {path}"
fa: "{path} باز نشد"
pt_br: "Falha ao abrir {path}"
uk: "Не вдалося відкрити {path}"

source: "Failed to read"
fa: "شکست در خواندن"
pt_br: "Falha ao ler"
uk: "Не вдалося прочитати"

source: `anyhow::Error` is essentially a wrapper around `Box<dyn Error>`. As such it's again generally not a good choice for the public API of a library, but is widely used in applications.
es: `anyhow::Error` es básicamente un envoltorio alrededor de `Box<dyn Error>`. Como tal, no suele ser una buena elección para la API pública de una biblioteca, pero se usa con frecuencia en aplicaciones.
fa: `anyhow::Error` اساساً پوششی (wrapper) در اطراف`Box<dyn Error>` است. به این ترتیب معمولاً انتخاب خوبی برای API عمومی یک کتابخانه نیست، اما به طور گسترده در برنامه‌های مختلف استفاده می‌شود.
ja: `anyhow::Error` は基本的に `Box<dyn Error>` のラッパーとなっています。そのため、ライブラリの公開 API としては一般的には適していませんが、アプリでは広く使用されています。
ko: `anyhow::Error`는 `Box<dyn Error>`의 래퍼 타입이라 할 수 있습니다. 따라서 라이브러리의 공개 API로서 사용하기에 부적합하다고 할 수 있지만 많은 애플리케이션에 널리 사용되고 있습니다.
pt_br: `anyhow::Error` é essencialmente um wrapper em torno de `Box<dyn Error>`. Como tal, geralmente não é uma boa escolha para a API pública de uma biblioteca, mas é amplamente utilizado em aplicações.
uk: `anyhow::Error` по суті є обгорткою навколо `Box<dyn Error>`. Таким чином, це знову ж таки, як правило, не є хорошим вибором для загальнодоступного API бібліотеки, але широко використовується в програмах.

source: `anyhow::Result<V>` is a type alias for `Result<V, anyhow::Error>`.
es: `anyhow::Result<V>` es un alias de tipo para `Result<V, anyhow::Error>`.
fa: `anyhow::Result<V>`یک type مستعار برای است`Result<V, anyhow::Error>`.
ja: `anyhow::Result<V>` は `Result<V, anyhow::Error>` の型エイリアスです。
ko: `anyhow::Result<V>`는 `Result<V, anyhow::Error>`의 타입 앨리어스(alias)입니다.
pt_br: `anyhow::Result<V>` é um _alias_ de tipo para `Result<V, anyhow::Error>`.
uk: `anyhow::Result<V>` — це псевдонім типу для `Result<V, anyhow::Error>`.

source: Functionality provided by `anyhow::Error` may be familiar to Go developers, as it provides similar behavior to the Go `error` type and `Result<T, anyhow::Error>` is much like a Go `(T, error)` (with the convention that only one element of the pair is meaningful).
uk: Функціональність, яку надає `anyhow::Error`, може бути знайома розробникам Go, оскільки вона забезпечує поведінку, подібну до типу Go `error`, а `Result<T, anyhow::Error>` дуже схожа на Go `(T, error)` (з умовою, що тільки один елемент пари є значущим).

source: `anyhow::Context` is a trait implemented for the standard `Result` and `Option` types. `use anyhow::Context` is necessary to enable `.context()` and `.with_context()` on those types.
fa: `anyhow::Context` یک ویژگی است که برای typeهای استاندارد `Result` و `Option` پیاده‌سازی شده است. `use anyhow::Context` برای فعال کردن `.context()` و `.with_context()` در آن typeها ضروری است.
ja: `anyhow::Context` は、標準の `Result` 型と `Option` 型に実装されたトレイトです。これらの型で `.context()` と `.with_context()` を有効にするには、`use anyhow::Context` が必要です。
pt_br: `anyhow::Context` é um _trait_ implementado para os tipos padrão `Result` e `Option`. `use anyhow::Context` é necessário para habilitar `.context()` e `.with_context()` nesses tipos.
uk: `anyhow::Context` - це трейт, реалізований для стандартних типів `Result` та `Option`. Використання `anyhow::Context` необхідне для того, щоб дозволити використання `.context()` та `.with_context()` для цих типів.

source: `anyhow::Error` has support for downcasting, much like `std::any::Any`; the specific error type stored inside can be extracted for examination if desired with [`Error::downcast`](https://docs.rs/anyhow/latest/anyhow/struct.Error.html#method.downcast).
uk: `anyhow::Error` має підтримку даункастингу, подібно до `std::any::Any`; конкретний тип помилки, що зберігається всередині, може бути витягнутий для вивчення за допомогою [`Error::downcast`](https://docs.rs/anyhow/latest/anyhow/struct.Error.html#method.downcast).

source: Exercise: Rewriting with Result
fa: تمرین: بازنویسی با نتیجه
ja: 演習: Result を使用した書き換え
pt_br: Exercício: Reescrevendo com Result
uk: Вправа: Переписування з Result

source: The following implements a very simple parser for an expression language. However, it handles errors by panicking. Rewrite it to instead use idiomatic error handling and propagate errors to a return from `main`. Feel free to use `thiserror` and `anyhow`.
fa: در زیر یک تجزیه‌کننده بسیار ساده برای یک زبان عبارت پیاده‌سازی می‌کند. با این حال، با panic خطاها را کنترل می‌کند. آن را بازنویسی کنید تا به جای آن از مدیریت خطای اصطلاحی استفاده کنید و خطاها را به بازگشت از `main` منتشر کنید. با خیال راحت از `thiserror` و `anyhow` استفاده کنید.
ja: ここでは、式を表す言語の非常にシンプルなパーサーを実装します。ただし、エラーに対してはパニックしています。代わりに慣用的なエラー処理を使用し、`main` からの戻り値にエラーを伝播するように書き換えてください。`thiserror` と `anyhow`を自由に使用してかまいません。
pt_br: O seguinte implementa um analisador muito simples para uma linguagem de expressão. No entanto, ele lida com erros disparando um pânico. Reescreva-o para usar o tratamento de erros idiomático e propagar erros para um retorno de `main`. Sinta-se à vontade para usar `thiserror` e `anyhow`.
uk: Нижче реалізовано дуже простий синтаксичний аналізатор для мови виразів. Однак, він обробляє помилки панічно. Перепишіть його так, щоб він використовував ідіоматичну обробку помилок і поширював помилки на повернення з `main`. Сміливо використовуйте `thiserror` і `anyhow`.

source: HINT: start by fixing error handling in the `parse` function. Once that is working correctly, update `Tokenizer` to implement `Iterator<Item=Result<Token, TokenizerError>>` and handle that in the parser.
fa: نکته: با رفع خطا در عملکرد `parse` شروع کنید. هنگامی که به درستی کار کرد، `Tokenizer` را برای پیاده‌سازی `Iterator<Item=Result<Token, TokenizerError>>` به‌روزرسانی کنید و آن را در parser کنترل کنید.
ja: ヒント: まず、`parse` 関数のエラー処理を修正します。それができたら`Iterator<Item=Result<Token, TokenizerError>>` を実装するように`Tokenizer` を更新し、その結果をパーサーで処理するようにしてください。
pt_br: DICA: comece corrigindo o tratamento de erros na função `parse`. Depois que isso estiver funcionando corretamente, atualize `Tokenizer` para implementar `Iterator<Item=Result<Token, TokenizerError>>` e trate isso no analisador (_parser_).
uk: Підказка: почніть з виправлення обробки помилок у функції `parse`. Після того, як вона буде працювати коректно, оновіть `Tokenizer` для реалізації `Iterator<Item=Result<Token, TokenizerError>>` і обробіть це у парсері.

source: /// An arithmetic operator.
ja: /// 算術演算子。
pt_br: /// Um operador aritmético.
uk: /// Арифметичний оператор.

source: /// A token in the expression language.
ja: /// 式言語のトークン
pt_br: /// Um token na linguagem de expressão.
uk: /// Токен у мові виразів.

source: /// An expression in the expression language.
ja: /// 式言語の式
pt_br: /// Uma expressão na linguagem de expressão.
uk: /// Вираз у мові виразів.

source: /// A reference to a variable.
ja: /// 変数への参照。
pt_br: /// Uma referência a uma variável.
uk: /// Посилання на змінну.

source: /// A literal number.
ja: /// リテラル数値。
pt_br: /// Um número literal.
uk: /// Буквальне число.

source: /// A binary operation.
ja: /// バイナリ演算。
pt_br: /// Uma operação binária.
uk: /// Бінарна операція.

source: "Unexpected character {c}"
fa: "کاراکتر غیرمنتظره {c}"
pt_br: "Caractere inesperado {c}"
uk: "Неочікуваний символ {c}"

source: "Unexpected end of input"
fa: "پایان غیرمنتظره در ورودی"
pt_br: "Fim de entrada inesperado"
uk: "Неочікуваний кінець вводу"

source: "Invalid 32-bit integer'"
fa: "عدد صحیح 32-bit نامعتبر"
pt_br: "Inteiro de 32 bits inválido'"
uk: "Неправильне 32-бітне ціле число'"

source: "Unexpected token {tok:?}"
fa: "توکن غیرمنتظره {tok:?}"
pt_br: "Token inesperado {tok:?}"
uk: "Неочікуваний токен {tok:?}"

source: // Look ahead to parse a binary operation if present.
ja: // バイナリ演算が存在する場合はパースします。
pt_br: // Olhe adiante para analisar uma operação binária, se presente.
uk: // Заглянути наперед, щоб розібрати бінарну операцію, якщо вона присутня.

source: "Unexpected character '{0}' in input"
fa: "کاراکتر غیرمنتظره "{0}" در ورودی"
pt_br: "Caractere '{0}' inesperado na entrada"
uk: "Неочікуваний символ '{0}' у вхідних даних"

source: "Tokenizer error: {0}"
fa: "خطای توکن‌سازی: {0}"
pt_br: "Erro de tokenizador: {0}"
uk: "Помилка токенізатора: {0}"

source: "Unexpected token {0:?}"
fa: "توکن (token) غیرمنتظره {0:?}"
pt_br: "Token inesperado {0:?}"
uk: "Неочікуваний токен {0:?}"

source: "Invalid number"
fa: "شماره نامعتبر"
pt_br: "Número inválido"
uk: "Неправильне число"

source: The Rust language has two parts:
es: El lenguaje Rust tiene dos partes:
fa: زبان Rust دو بخش دارد:
ja: Rust 言語は 2 つの部分で構成されています。
ko: 러스트로 작성된 프로그램은 크게 두 부분으로 나뉩니다:
pt_br: A linguagem Rust tem duas partes:
uk: Мова Rust складається з двох частин:
