Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: By wrapping a pointer in an object, you can free memory when the object is destroyed. The compiler guarantees that this happens, even if an exception is raised.
es: Al envolver un puntero en un objeto, puedes liberar memoria cuando el objeto se destruya. El compilador asegura que esto ocurra, aunque se genere una excepción.
ko: 포인터를 객체로 감싸도록 하면, 그 객체가 소멸될 때 그 포인터가 가리키는 메모리가 해제되도록 할 수 있습니다. 컴파일러는 객체가 소멸될 때 반드시 소멸자가 호출되는 것을 보장합니다. 심지어는 예외(exception)가 발생(_역주_: 함수의 리턴이나 스코프의 종료 뿐만이 아니라) 하더라도요.

source: This is often called _resource acquisition is initialization_ (RAII) and gives you smart pointers.
es: A menudo, significa que la _adquisición de recursos es la inicialización_ (RAII) y te proporciona punteros inteligentes.
ko: 이를 종종 RAII (Resource Acquisition Is Initialization)라고 하며, 이런 객체는 일종의 스마트 포인터 역할을 합니다.

source: C++ Example
es: Ejemplo en C++
ko: C++ 예제

source: ```c++ void say_hello(std::unique_ptr<Person> person) { std::cout << "Hello " << person->name << std::endl; } ```
es: ```c++ void say_hello(std::unique_ptr<Person> person) { std::cout << "Hola " << person->name << std::endl; } ```

source: The `std::unique_ptr` object is allocated on the stack, and points to memory allocated on the heap.
es: El objeto `std::unique_ptr` se reserva en el _stack_ y apunta a la memoria asignada en el _heap_.
ko: `std::unique_ptr`객체는 스택에 할당되며, 힙에 할당된 메모리를 가리킵니다.

source: At the end of `say_hello`, the `std::unique_ptr` destructor will run.
es: Al final de `say_hello`, se ejecuta el destructor `std::unique_ptr`.
ko: `say_hello`함수가 끝나면 `std::unique_ptr`의 소멸자가 실행됩니다.

source: The destructor frees the `Person` object it points to.
es: El destructor libera el objeto `Person` al que apunta.
ko: 소멸자는 `Person` 객체가 가리키는 메모리를 해제합니다.

source: Special move constructors are used when passing ownership to a function:
es: Los constructores de movimiento especiales se utilizan cuando se pasa el _ownership_ a una función:
ko: 이동 생성자는 함수 호출 시 소유권을 전달할때 사용됩니다:

source: Automatic Memory Management
es: Gestión Automática de la Memoria
ko: 자동 메모리 관리

source: An alternative to manual and scope-based memory management is automatic memory management:
es: Una alternativa a la gestión manual de la memoria basada en el ámbito es la gestión automática de la memoria:
ko: 수동, 스코프기반 메모리 관리의 대안으로 자동 메모리 관리 방식이 있습니다:

source: The programmer never allocates or deallocates memory explicitly.
es: El programador nunca asigna ni desasigna la memoria de forma explícita.
ko: 개발자는 메모리를 명시적으로 할당/해제 하지 않습니다.

source: A garbage collector finds unused memory and deallocates it for the programmer.
es: Un _garbage collector_ (recolector de memoria residual) encuentra la que no se utiliza y la desasigna para el programador.
ko: 가비지 컬렉터(GC)는 사용되지 않는 메모리를 찾아 해제합니다.

source: Java Example
es: Ejemplo en Java
ko: Java 예제

source: The `person` object is not deallocated after `sayHello` returns:
es: El objeto `person` no se libera después de que `sayHello` devuelva el siguiente resultado:
ko: `person`객체는 `sayHello`함수 반환 후에도 해제되지 않습니다. (_역주_: GC가 나중에 알아서 해제합니다.)

source: ```java void sayHello(Person person) { System.out.println("Hello " + person.getName()); } ```
es: ```java void sayHello(Person person) { System.out.println("Hola " + person.getName()); } ```

source: Memory Management in Rust
es: Gestión de la Memoria en Rust
ko: 러스트에서의 메모리 관리

source: Memory management in Rust is a mix:
es: La gestión de la memoria en Rust es una mezcla:
ko: 러스트의 메모리 관리는 지금까지 설명한 방식들을 혼합해서 사용합니다:

source: Safe and correct like Java, but without a garbage collector.
es: Segura y correcta como Java, pero sin _garbage collector_.
ko: 자바처럼 안전하고 정확합니다. 하지만 GC는 없습니다.

source: Scope-based like C++, but the compiler enforces full adherence.
es: Está basada en el ámbito, como C++, pero el compilador cumple con todas las normas.
ko: C++ 처럼 범위(스코프) 기반입니다. 하지만 컴파일러가 훨씬 더 엄격합니다.

source: A Rust user can choose the right abstraction for the situation, some even have no cost at runtime like C.
es: Un usuario de Rust puede elegir la abstracción adecuada para cada situación, algunas ni siquiera tienen coste en _runtime_, como C.
ko: 사용자는 상황에 따라 적합한 추상화를 선택할 수 있습니다. 그 중에는 C 언어 처럼 런타임 오버헤드가 없는 것도 있습니다.

source: Rust achieves this by modeling _ownership_ explicitly.
es: Rust lo consigue modelando explícitamente el _ownership_.
ko: 러스트는 \_소유권_을 언어 차원에서 명시적으로 모델링 함으로써 이를 이룹니다.

source: If asked how at this point, you can mention that in Rust this is usually handled by RAII wrapper types such as [Box](https://doc.rust-lang.org/std/boxed/struct.Box.html), [Vec](https://doc.rust-lang.org/std/vec/struct.Vec.html), [Rc](https://doc.rust-lang.org/std/rc/struct.Rc.html), or [Arc](https://doc.rust-lang.org/std/sync/struct.Arc.html). These encapsulate ownership and memory allocation via various means, and prevent the potential errors in C.
es: Si en este momento te preguntan cómo, puedes mencionar que en Rust se suele gestionar con tipos de envoltorios RAII, como [Box](https://doc.rust-lang.org/std/boxed/struct.Box.html), [Vec]https://doc.rust-lang.org/std/vec/struct.Vec.html), [Rc](https://doc.rust-lang.org/std/rc/struct.Rc.html) o [Arc](https://doc.rust-lang.org/std/sync/struct.Arc.html). Estos encapsulan el _ownership_ y la asignación de memoria a través de diversos medios, evitando así los posibles errores en C.
ko: 이 시점에서 그게 어떻게 가능하냐는 질문이 있으면, 러스트에서 이 작업은 일반적으로 [Box](https://doc.rust-lang.org/std/boxed/struct.Box.html), [Vec](https://doc.rust-lang.org/std/vec/struct.Vec.html), [Rc](https://doc.rust-lang.org/std/rc/struct.Rc.html) 또는 [Arc](https://doc.rust-lang.org/std/sync/struct.Arc.html)와 같은 RAII 타입에 의해 처리된다고 답변할 수 있습니다. 이들은 다양한 방법을 통해 소유권과 메모리 할당에 대한 구체적인 내용을을 캡슐화하여, C 언어였다면 발생할 수 있었을 다양한 에러를 막습니다.

source: You may be asked about destructors here, the [Drop](https://doc.rust-lang.org/std/ops/trait.Drop.html) trait is the Rust equivalent.
es: Puede que aquí te pregunten por los destructores, así que debes saber que el trait [Drop](https://doc.rust-lang.org/std/ops/trait.Drop.html) es el equivalente en Rust.
ko: 소멸자에 대한 질문도 있을 수 있습니다. [Drop](https://doc.rust-lang.org/std/ops/trait.Drop.html) 트레잇이 답입니다.

source: At the end of the scope, the variable is _dropped_ and the data is freed.
es: Al final del ámbito, la variable _se elimina_ y los datos se liberan.
ko: 스코프가 종료되면 변수는 "삭제(drop)"되었다고 하며 그 변수의 데이터는 메모리에서 해제됩니다.

source: A destructor can run here to free up resources.
es: Se puede ejecutar un destructor para liberar recursos.
ko: 스코프가 종료될 때 다른 리소스를 해제하기 위해 소멸자가 호출되도록 할 수 있습니다.

source: We say that the variable _owns_ the value.
es: Decimos que el valor _pertenece_ a la variable.
ko: 이것을 두고 변수가 값을 "소유"한다고 표현합니다.

source: ```rust,editable fn main() { let s1: String = String::from("Hello!"); let s2: String = s1; println!("s2: {s2}"); // println!("s1: {s1}"); } ```
es: ```rust,editable fn main() { let s1: String = String::from("Hola!"); let s2: String = s1; println!("s2: {s2}"); // println!("s1: {s1}"); } ```

source: There is always _exactly_ one variable binding which owns a value.
es: Siempre hay _exactamente_ un enlace a variable que posee un valor.
ko: 값(데이터)의 소유권을 갖는 변수는 항상 _단_ 하나 입니다.

source: The heap data from `s1` is reused for `s2`.
es: Los datos del _heap_ de `s1` se reutilizan en `s2`.
ko: `s1`의 힙 데이터는 `s2`에서 재사용 됩니다.

source: When `s1` goes out of scope, nothing happens (it has been moved from).
es: Cuando `s1` sale del ámbito, no ocurre nada (ha sido movida).
ko: `s1`의 스코프가 종료되면 아무일도 일어나지 않습니다.(이미 이동되었습니다.)

source: ```c++ std::string s1 = "Cpp"; std::string s2 = s1; // Duplicate the data in s1. ```
es: ```c++ std::string s1 = "Cpp"; std::string s2 = s1; // Duplicar datos en s1. ```
ko: ```c++ std::string s1 = "Cpp"; std::string s2 = s1; // s1의 데이터를 복제합니다. ```

source: Remove `Copy` from the `derive` attribute. The compiler error is now in the `println!` for `p1`.
es: Elimina `Copy` del atributo `derive`. El error del compilador se encuentra ahora en `println!` para `p1`.
ko: `derive` 속성에서 `Copy`를 제거해 보세요. `p1`을 `println!` 할 때 컴파일 에러가 발생할 것입니다.

source: If students ask about `derive`, it is sufficient to say that this is a way to generate code in Rust at compile time. In this case the default implementations of `Copy` and `Clone` traits are generated.
es: Si los alumnos preguntan por `derive`, basta con decir que se trata de una forma de generar código en Rust durante el tiempo de compilación. En este caso, se generan las implementaciones predeterminadas de los traits `Copy` y `Clone`.
ko: 만약 학생들이 `derive`에 대해 묻는다면, 컴파일 시 러스트에서 코드를 생성하는방법이라고 말하는 것으로 충분합니다. 위 경우 `Copy`와 `Clone` 트레잇에 대한 기본 구현이 생성됩니다.

source: Instead of transferring ownership when calling a function, you can let a function _borrow_ the value:
es: En lugar de transferir el _ownership_ al llamar a una función, puedes permitir que una función _tome prestado_ el valor:
ko: 함수 호출시 값의 소유권을 이동하는 대신의 함수가 값을 _빌려올 수_ 있습니다:

source: Demonstrate that the return from `add` is cheap because the compiler can eliminate the copy operation. Change the above code to print stack addresses and run it on the [Playground](https://play.rust-lang.org/) or look at the assembly in [Godbolt](https://rust.godbolt.org/). In the "DEBUG" optimization level, the addresses should change, while they stay the same when changing to the "RELEASE" setting:
es: Demuestra que la instrucción de retorno de `add` es fácil porque el compilador puede eliminar la operación de copia. Cambia el código anterior para imprimir las direcciones de la _stack_ y ejecutarlas en el [Playground](https://play.rust-lang.org/) o consulta el ensamblador en [Godbolt](https://rust.godbolt.org/). En el nivel de optimización "DEBUG", las direcciones deberían cambiar. Sin embargo, deberían mantenerse igual modificar la configuración "RELEASE":
ko: `add`에서 값을 반환하는 것은 매우 값이 싸다는 것을 설명하세요. 왜냐하면, 컴파일러가 복사 과정을 생략할 수 있기 때문입니다. 위 코드를 스택 주소를 출력하도록 수정하고 [Playground](https://play.rust-lang.org/)에서 수행해 보세요. 또는 [Godbolt](https://rust.godbolt.org/)에서 어셈블리를 확인해 보세요. 최적화 레벨이 "DEBUG" 일 때에는 주소가 바뀌지만, "RELEASE" 레벨에서는 바뀌지 않습니다:

source: Rust puts constraints on the ways you can borrow values:
es: Rust limita las formas en que se pueden tomar prestados valores:
ko: 러스트에서는 값을 빌릴 때 다음과 같은 제약조건이 있습니다:

source: You can have one or more `&T` values at any given time, _or_
es: Puedes tener uno o varios valores `&T` en un momento dado, _o_
ko: 한번에 하나 이상의 `&T` 값을 가지거나, _또는_

source: You can have exactly one `&mut T` value.
es: puedes tener exactamente un valor `&mut T`.
ko: 정확히 하나의 `&mut T` 값만을 가질 수 있습니다.

source: A borrowed value has a _lifetime_:
es: Un valor que se toma prestado tiene un _tiempo de vida_:
ko: 빌려온 값은 _수명_을 갖습니다:

source: The lifetime can be implicit: `add(p1: &Point, p2: &Point) -> Point`.
es: El tiempo de vida puede ser implícito: `add(p1: &Point, p2: &Point) -> Point`.
ko: 수명은 생략할 수 있습니다: `add(p1: &Point, p2: &Point) -> Point`.

source: Lifetimes can also be explicit: `&'a Point`, `&'document str`.
es: Tiempo de vida también puede ser explícito: `&'a Point`, `&'document str`.
ko: 물론 명시할 수도 있습니다: `&'a Point`, `&'document str`.

source: Read `&'a Point` as "a borrowed `Point` which is valid for at least the lifetime `a`".
es: Lee `&'a Point` como "un `Point` prestado que es válido al menos durante el tiempo de vida de `a`".
ko: `&'a Point` 는 `Point`의 수명이 최소한 `'a`라는 수명보다는 같거나 더 길다는 것을 의미합니다.

source: Lifetimes are always inferred by the compiler: you cannot assign a lifetime yourself.
es: El compilador siempre infiere el tiempo de vida: no puedes asignarlos tú.
ko: 수명은 항상 컴파일러가 자동으로 추론합니다. 직접 수명을 지정할 수는 없습니다.

source: Lifetime annotations create constraints; the compiler verifies that there is a valid solution.
es: Las anotaciones durante el tiempo de vida crean restricciones. El compilador verifica que hay una solución válida.
ko: 수명 표기(`'`)은 수명 추론시 제약조건이 됩니다. 컴파일러는 이 제약조건을 만족시키는 유요한 수명을 추론할 수 있는지 검사를 합니다.

source: Lifetimes for function arguments and return values must be fully specified, but Rust allows lifetimes to be elided in most cases with [a few simple rules](https://doc.rust-lang.org/nomicon/lifetime-elision.html).
es: El tiempo de vida de los argumentos de las funciones y los valores devueltos deben especificarse por completo, pero Rust permite que se puedan eludir en la mayoría de los casos con [unas sencillas reglas](https://doc.rust-lang.org/nomicon/lifetime-elision.html).
ko: 원래, 함수의 인자와 리턴값에는 수명을 설정해야 합니다. 그러나 [몇 가지 조건](https://doc.rust-lang.org/nomicon/lifetime-elision.html)을 만족하는 대부분의 경우에는 생략할 수 있습니다.

source: In addition to borrowing its arguments, a function can return a borrowed value:
es: Además de tomar prestados sus argumentos, una función puede devolver un valor que se ha tomado prestado:
ko: 함수는 인수를 빌리는 것 외에도 빌린 값을 반환할 수 있습니다:

source: `'a` is a generic parameter, it is inferred by the compiler.
es: `'a` es un parámetro genérico que infiere el compilador.
ko: `'a`는 제네릭 매개변수로 컴파일러로에 의해 추론됩니다.

source: Lifetimes start with `'` and `'a` is a typical default name.
es: Los tiempos de vida comienzan por `'` y `'a` suele ser un nombre predeterminado habitual.
ko: 수명의 이름은 `'` 로 시작하며 보통 `'a`를 많이 씁니다.

source: The _at least_ part is important when parameters are in different scopes.
es: La parte _al menos_ es importante cuando los parámetros están en ámbitos distintos.
ko: 매개변수들이 서로 다른 스코프에 있을 경우 "최소한"이라는 조건이 중요합니다.

source: Move the declaration of `p2` and `p3` into a new scope (`{ ... }`), resulting in the following code:
es: Mueve la declaración de `p2` y `p3` a un nuevo ámbito (`{ ... }`), lo que dará como resultado el siguiente código:
ko: `p2`와 `p3`를 새로운 범위(`{...}`)로 아래 코드와 같이 이동해 봅니다:

source: Note how this does not compile since `p3` outlives `p2`.
es: Ten en cuenta que no se puede compilar, ya que `p3` dura más tiempo que `p2`.
ko: `p3`의 수명이 `p2` 보다 길기 때문에 이 예제는 컴파일되지 않음을 확인하시기 바랍니다.

source: Reset the workspace and change the function signature to `fn left_most<'a, 'b>(p1: &'a Point, p2: &'a Point) -> &'b Point`. This will not compile because the relationship between the lifetimes `'a` and `'b` is unclear.
es: Restablece el espacio de trabajo y cambia la firma de la función a `fn left_most<'a, 'b>(p1: &'a Point, p2: &'a Point) -> &'b Point`. No se compilará porque la relación entre los tiempos de vida de `'a` y `'b` no está clara.
ko: 작업공간을 초기화 한 후 함수 시그니처를 `fn left_most<'a, 'b>(p1: &'a Point, p2: &'a Point) -> &'b Point`로 변경해 봅니다. 이 경우 `'a`와 `'b`사이의 관계가 불분명하기 때문에 컴파일 되지 않습니다.

source: Another way to explain it:
es: Otra forma de explicarlo:
ko: 이 에러를 설명하는 또 다른 방법은 다음과 같습니다:

source: Two references to two values are borrowed by a function and the function returns another reference.
es: Una función toma prestadas dos referencias a dos valores y devuelve otra referencia.
ko: 이 함수는 두 값을 빌려서, 새로운 참조를 반환합니다.

source: It must have come from one of those two inputs (or from a global variable).
es: Esta debe proceder de una de esas dos entradas (o de una variable global).
ko: 이 반환된 참조는 두 입력 중 하나로 부터 와야 합니다. (아니면 전역 변수로 부터)

source: Which one is it? The compiler needs to know, so at the call site the returned reference is not used for longer than a variable from where the reference came from.
es: ¿Cuál de ellas es? El compilador debe saberlo para que, en el sitio de la llamada, la referencia devuelta no se use durante más tiempo que una variable de la que procede la referencia.
ko: 두 입력 중 어떤 것일까요? 컴파일러는 이를 알아야 합니다. 그래야만 함수 호출부에서 봤을 때, 반환된 참조의 수명이 원래 값을 수명보다 길지 않음을 확인할 수 있기 때문입니다.

source: Methods are defined in an `impl` block, which we will see in following slides.
es: Los métodos están definidos en un bloque `impl` que veremos en las siguientes diapositivas.
ko: 메서드는 `impl`블록에 정의 합니다. 다음 슬라이드에서 확인 할 수 있습니다.

source: This may be a good time to let people know there are different types of structs.
es: Puede que sea un buen momento para indicar a los alumnos que existen diferentes tipos de estructuras.
ko: 사람들에게 다른 종류의 구조체가 있음을 알게 하기에 좋은 시간일 것입니다.

source: Zero-sized structs `e.g., struct Foo;` might be used when implementing a trait on some type but don’t have any data that you want to store in the value itself.
es: Las estructuras de tamaño cero, como `struct Foo;`, se pueden utilizar al implementar un trait en algún tipo, pero no tienen ningún dato que te interese almacenar en el propio valor.
ko: 0 크기 구조체(예: `struct Foo;`)는 데이터를 가지고 있지 않지만 특정 타입의 트레잇을 구현할 때 유용합니다.

source: The syntax `..peter` allows us to copy the majority of the fields from the old struct without having to explicitly type it all out. It must always be the last element.
es: La sintaxis `..peter` nos permite copiar la mayoría de los campos de la estructura anterior sin tener que escribirlos explícitamente. Siempre debe ser el último elemento.
ko: `..peter` 문법은 한 구조체에서 다른 구조체로 대부분의 값을 복사하려고 하는 경우에 하나하나 타이핑하는 수고를 덜어줍니다. 반드시 맨 마지막에 와야 합니다.

source: The value passed some validation when it was created, so you no longer have to validate it again at every use: 'PhoneNumber(String)`or`OddNumber(u32)\`.
es: El valor ha pasado alguna validación cuando se ha creado, por lo que ya no tendrás que volver a validarlo cada vez que lo uses: `PhoneNumber(String)` u `OddNumber(u32)`.
ko: 값이 생성될 때 이미 유효성 검사를 통과 했으므로 추가적인 검사가 필요없습니다: `PhoneNumber(String)`또는 `OddNumber(u32)`.

source: If you already have variables with the right names, then you can create the struct using a shorthand:
es: Si ya dispones de variables con los nombres adecuados, puedes crear la estructura con un método abreviado:
ko: 구조체 필드와 동일한 이름의 변수가 있다면 아래와 같이 "짧은 문법"으로 구조체를 생성할 수 있습니다:

source: The `new` function could be written using `Self` as a type, as it is interchangeable with the struct type name
es: La función `new` se podría escribir utilizando `Self` como tipo, ya que es intercambiable con el nombre de tipo de estructura.
ko: `new`함수를 다음처럼 구조체 이름 대신 `Self`를 사용하여 작성해도 됩니다

source: Implement the `Default` trait for the struct. Define some fields and use the default values for the other fields.
es: Implementa el trait `Default` en la estructura. Define algunos campos y usa los valores predeterminados para el resto de los campos.
ko: `Default` 트레잇을 구현해보세요. 필드 몇개는 초기화하고 나머지 필드는 디폴트 값을 사용할 수 있습니다.

source: Methods are defined in the `impl` block.
es: Los métodos se definen en el bloque `impl`.
ko: 메서드는 `impl` 블록에 정의됩니다.

source: Use struct update syntax to define a new structure using `peter`. Note that the variable `peter` will no longer be accessible afterwards.
es: Utiliza la sintaxis de actualización de estructuras para definir una estructura nueva con `peter`. Ten en cuenta que, después, ya no podrás acceder a la variable `peter`.
ko: `peter`와 구조체 업데이트 문법을 사용하여 새로운 구조체 인스턴스를 만들어보세요. 이때, `peter`는 더이상 사용할 수 없게 됩니다.

source: Use `{:#?}` when printing structs to request the `Debug` representation.
es: Utiliza `{:#?}` al imprimir estructuras para solicitar la representación de `Debug`.
ko: 구조체를 `Debug` 형태로 출력하려면 `{:#?}`를 사용하세요.

source: This might be a good time to demonstrate how the `&self` differs from `self` by modifying the code and trying to run say_hello twice.
es: Puede ser un buen momento para mostrar la diferencia entre `&self` y `self` modificando el código e intentando ejecutar say_hello dos veces.
ko: `say_hello` 함수가 두 번 호출되도록 코드를 수정하여 `&self`와 `self`가 어떻게 다른지 보여주는 것도 좋습니다.

source: We describe the distinction between method receivers next.
es: A continuación, se describe la diferencia entre receptores de métodos.
ko: 다음 슬라이드에서 receiver의 구분을 설명합니다.

source: The `&self` above indicates that the method borrows the object immutably. There are other possible receivers for a method:
es: `&self` indica que el método toma prestado el objeto de forma inmutable. Hay otros posibles receptores para un método:
ko: `&self`는 메서드가 객체를 불변하게 빌려옴을 나타냅니다. 메서드의 리시버는 다음의 형태들이 가능합니다:

source: `mut self`: same as above, but the method can mutate the object.
es: `mut self`: igual que lo anterior, pero el método puede mutar el objeto.
ko: `mut self`: 위와 동일하지만 메서드가 객체의 소유권을 가지면서 동시에 객체를 수정할 수도 있습니다. 소유권을 가지는 것이 수정할 수 있음을 의미하는 것은 아닙니다.

source: Consider emphasizing "shared and immutable" and "unique and mutable". These constraints always come together in Rust due to borrow checker rules, and `self` is no exception. It isn't possible to reference a struct from multiple locations and call a mutating (`&mut self`) method on it.
es: Considera recalcar los conceptos "compartido e inmutable" y "único y mutable". Estas restricciones siempre vienen juntas en Rust debido a las reglas del _borrow checker_, y `self` no es una excepción. No es posible referenciar una estructura desde varias ubicaciones y llamar a un método mutable (`&mut self`) en ella.
ko: "공유가능한 불변"과 "유일한 가변" 부분은 강조할 만합니다. 이러한 제약은 러스트의 빌림 검사기(borrow checker) 규칙으로 늘 붙어다닙니다. `self`도 예외는 아닙니다. 여러 위치에서 구조체를 참조하면서 객체를 수정하는(`&mut self`를 리시버로 하는) 메서드를 호출하는 것은 불가능합니다.

source: All four methods here use a different method receiver.
es: Cada uno de estos cuatro métodos utilizan un receptor de método distinto.
ko: 이 네 개의 메서드는 서로 다른 유형의 리시버를 사용합니다.

source: You can point out how that changes what the function can do with the variable values and if/how it can be used again in `main`.
es: Puedes indicar cómo eso cambia lo que la función puede hacer con los valores de las variables y si se puede utilizar de nuevo en `main` y, en caso afirmativo, cómo.
ko: 리시버의 유형에 따라 함수가 할 수 있는 일이 달라지고, 또 메소드를 호출한 뒤 `main`에서 해당 객체를 사용할 수 있는지 여부도 달라진다는 점을 강조하세요.

source: You can showcase the error that appears when trying to call `finish` twice.
es: Puedes mostrar el error que aparece al intentar llamar a `finish` dos veces.
ko: `finish`를 두번 호출하여 오류가 발생하는 것을 보일 수 있습니다.

source: Note that although the method receivers are different, the non-static functions are called the same way in the main body. Rust enables automatic referencing and dereferencing when calling methods. Rust automatically adds in the `&`, `*`, `muts` so that that object matches the method signature.
es: Ten en cuenta que, aunque los receptores de los métodos sean diferentes, las funciones no estáticas se llaman del mismo modo en el cuerpo principal. Rust habilita la referenciación y desreferenciación automáticas al llamar a los métodos. Además, añade automáticamente los caracteres `&`, `*` y `muts` para que el objeto coincida con la firma del método.
ko: 비록 메서드 receiver는 다르지만 main 함수에서 비 정적 함수를 부르는 방법은 같습니다. 러스트는 메서드를 호출할 때 자동으로 참조/역참조(따라가기)를 수행합니다. 러스트는 객체와 매서드 시그니처가 서로 매치되도록 객체에 `&`, `*`, `muts`를 자동으로 붙여줍니다.

source: You might point out that `print_laps` is using a vector that is iterated over. We describe vectors in more detail in the afternoon.
es: Podrías mencionar que `print_laps` está usando un vector sobre el que se itera. Describiremos los vectores con más detalle por la tarde.
ko: `print_laps`함수에서 벡터를 어떤 식으로 사용하고 있는지 언급하는 것도 좋습니다. 벡터는 오후 강의에서 더 자세히 설명할 것입니다.

source: Day 2: Morning Exercises
es: Día 2: Ejercicios de la Mañana
ko: 2일차 오전 연습문제

source: We will look at implementing methods in two contexts:
es: Veremos la implementación de métodos en dos contextos:
ko: 이번 연습문제들은 두가지 맥락에서 메서드 구현방법을 다룹니다:

source: Storing books and querying the collection
es: Almacenar libros y consultar la colección

source: Keeping track of health statistics for patients
es: Hacer seguimiento de las estadísticas de salud de pacientes

source: We will learn much more about structs and the `Vec<T>` type tomorrow. For now, you just need to know part of its API:
es: Mañana conoceremos mucho mejor _structs_ y el tipo `Vec<T>`. Por ahora, solo debes conocer parte de su API:
ko: 우리는 내일 구조체와 `Vec<T>`에 대해 더 많은 것을 배울 것입니다. 일단 오늘은 API의 일부만 알면 됩니다:
