Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Welcome to Comprehensive Rust 🦀
ar: مرحبًا بكم في Comprehensive Rust 🦀
es: Te damos la bienvenida a Comprehensive Rust 🦀
fa: به Comprehensive Rust خوش آمدید 🦀
ja: Comprehensive Rust 🦀 へようこそ
ko: Comprehensive Rust에 오신 것을 환영합니다 🦀
pt_br: Bem-vindo ao Comprehensive Rust 🦀
uk: Ласкаво просимо в Comprehensive Rust 🦀

source: Running the Course
ar: تشغيل الدورة
es: Desarrollo del curso
fa: اجرای دوره
ja: 講座の運営について
ko: 강의 진행
pt_br: Conduzindo o Curso
uk: Проведення курсу

source: Course Structure
ar: هيكل الدورة
es: Estructura del curso
fa: مباحث دوره
ja: 講座の構成
ko: 강의 구성
pt_br: Estrutura do Curso
uk: Структура курсу

source: Keyboard Shortcuts
ar: (keyboard shortcuts) اختصارات لوحة المفاتيح
es: Combinaciones de teclas
fa: میان‌برهای صفحه کلید
ja: キーボード ショートカット
ko: 단축키
pt_br: Atalhos de Teclado
uk: Гарячі клавіші

source: Translations
ar: الترجمات
es: Traducciones
fa: ترجمه
ja: 翻訳
ko: 다른 언어들
pt_br: Traduções
uk: Переклади

source: Using Cargo
ar: استخدام Cargo
es: Usando Cargo
fa: استفاده از cargo
ja: Cargoの使用
ko: 카고 사용하기
pt_br: Usando o Cargo
uk: Використання Cargo

source: Rust Ecosystem
ar: النظام البيئي ل Rust
es: Ecosistema Rust
fa: اکوسیستم Rust
ja: Rust エコシステム
ko: 러스트 생태계
pt_br: O Ecossistema do Rust
uk: Екосистема Rust

source: Code Samples
ar: (Code Samples) عينات الكود
es: Ejemplos de Código
fa: نمونه کد
ja: コードサンプル
ko: 코드 샘플
pt_br: Exemplos de Código
uk: Приклади коду

source: Running Cargo Locally
ar: تشغيل Cargo محليًا
es: Ejecutar Cargo a nivel local
fa: اجرای کد به صورت لوکال با cargo
ja: ローカル環境での実行
ko: 카고(Cargo) 수행하기
pt_br: Executando o Cargo Localmente
uk: Локальний запуск Cargo

source: Day 1: Morning
ar: اليوم الأول: صباحا
es: Día 1: mañana
fa: روز ۱: صبح
ja: Day 1： AM
ko: 1일차 오전
pt_br: Dia 1: Manhã
uk: День 1: Ранок

source: Welcome
ar: مرحبًا
es: Te damos la bienvenida
fa: خوش آمدید
ja: ようこそ
ko: 개요
pt_br: Bem-vindo
uk: Ласкаво просимо

source: What is Rust?
ar: ما هي Rust؟
es: ¿Qué es Rust?
fa: زبان Rust چیست؟
ja: Rustとは？
ko: 러스트란?
pt_br: O que é Rust?
uk: Що таке Rust?

source: Benefits of Rust
ar: فوائد Rust
fa: مزیت‌های زبان Rust
ja: Rustのメリット
pt_br: Benefícios do Rust
uk: Переваги Rust

source: Playground
ar: مكان لتجربة اللغة (playground)
ja: プレイグラウンド
uk: Ігровий майданчик

source: Types and Values
ar: الأنواع والقيم
fa: تایپ‌ها و مقادیر
ja: 型と値
pt_br: Tipos e Valores
uk: Типи та значення

source: Variables
ar: المتغيرات
fa: متغیرها
ja: 変数
ko: 변수
pt_br: Variáveis
uk: Змінні

source: Values
ar: القيم
fa: مقادیر
ja: 値
pt_br: Valores
uk: Значення

source: Arithmetic
ar: الحساب
fa: عملگرهای ریاضی
ja: 算術
pt_br: Aritimética
uk: Арифметика

source: Type Inference
ar: استنباط النوع
es: Inferencia de tipos
fa: تعیین تایپ ضمنی
ja: 型推論
ko: 타입 추론
pt_br: Inferência de Tipo
uk: Виведення типів

source: Exercise: Fibonacci
ar: تمرين: فيبوناتشي
fa: تمرین: دنباله فیبوناچی
ja: 演習: フィボナッチ
pt_br: Exercício: Fibonacci
uk: Вправа: Фібоначчі

source: Solution
fa: راه‌حل
ja: 解答
pt_br: Solução
uk: Рішення

source: Control Flow Basics
fa: مبانی پایه کنترل جریان
ja: 制御フローの基本
pt_br: Fundamentos de Controle de Fluxo
uk: Основи потоку керування

source: `if` Expressions
fa: عبارات `if`
uk: Вирази `if`

source: Loops
fa: حلقه‌ها
ja: ループ
uk: Цикли

source: `break` and `continue`
es: `break` y `continue`
fa: `break` و `continue`
ja: `break` と `continue`
ko: `break`와 `continue`
pt_br: `break` e `continue`
uk: `break` та `continue`

source: Labels
fa: برچسب‌ها
uk: Мітки

source: Blocks and Scopes
fa: بلوک‌ها و محدوده‌ها
ja: ブロックとスコープ
pt_br: Blocos e Escopos
uk: Блоки та області застосування

source: Scopes and Shadowing
es: Ámbitos y _Shadowing_
fa: محدوده‌ها و سایه‌گذاری
ja: スコープとシャドーイング
ko: 범위(Scopes)와 쉐도잉(Shadowing)
pt_br: Escopos e _Shadowing_ (Sobreposição)
uk: Області видимості та затінення

source: Functions
es: Funciones
fa: توابع
ja: 関数
ko: 함수
pt_br: Funções
uk: Функції

source: Macros
fa: ماکروها
ja: マクロ
uk: Макроси

source: Exercise: Collatz Sequence
fa: تمرین: دنباله Collatz
ja: 演習: コラッツ数列
pt_br: Exercício: Sequência de Collatz
uk: Вправа: Послідовність Коллатца

source: Day 1: Afternoon
es: Día 1: Tarde
fa: روز ۱: بعد از ظهر
ja: Day 1： PM
ko: 1일차 오후
pt_br: Dia 1: Tarde
uk: День 1: Полудень

source: Tuples and Arrays
fa: تاپل ها و آرایه ها
ja: タプルと配列
pt_br: Tuplas e Matrizes
uk: Кортежі та масиви

source: Arrays
fa: آرایه‌ها
ja: 配列
ko: 배열
pt_br: Matrizes
uk: Масиви

source: Tuples
es: Tuplas
fa: تاپل‌ها
ja: タプル
ko: 튜플
pt_br: Tuplas
uk: Кортежі

source: Array Iteration
fa: تکرار ارایه
ja: 配列のイテレート
pt_br: Iterator de Matrizes
uk: Ітерація масиву

source: Patterns and Destructuring
fa: الگو‌ها و ضدِ ساختارها
uk: Патерни та деструктуризація

source: Exercise: Nested Arrays
fa: تمرین: آرایه‌های تو در تو
ja: 演習: ネストされた配列
pt_br: Exercício: Matrizes Aninhadas
uk: Вправа: Вкладені масиви

source: References
es: Referencias
fa: مراجع
ja: 参照
ko: 참조
pt_br: Referências
uk: Посилання

source: Shared References
fa: مراجع اشتراکی
ja: 共有参照
pt_br: Referências Compartilhadas
uk: Спільні посилання

source: Exclusive References
fa: مراجع انحصاری
ja: 排他参照
pt_br: Referências Exclusivas
uk: Ексклюзивні посилання

source: Slices
fa: برش‌ها
ko: 슬라이스
pt_br: Slices (Fatias)
uk: Зрізи

source: Strings
ar: السلاسل النص او الكتابة (Strings)
es: Cadenas de texto (_Strings_)
fa: رشته‌ها
ja: 文字列
ko: 문자열
uk: Рядки

source: Exercise: Geometry
fa: تمرین: هندسه
ja: 演習: ジオメトリ
pt_br: Exercício: Geometria
uk: Вправа: Геометрія

source: User-Defined Types
fa: تایپ‌های تعریف شده توسط کاربر
ja: ユーザー定義型
pt_br: Tipos Definidos pelo Usuário
uk: Типи, які визначаються користувачем

source: Named Structs
fa: ساختارهای نام‌دار
pt_br: _Structs_ (Estruturas) Nomeadas
uk: Іменовані структури

source: Tuple Structs
es: Estructuras de tuplas
fa: ساختار‌ تاپل‌ها
ja: タプル構造体
ko: 튜플
pt_br: _Structs_ de Tuplas
uk: Кортежні структури

source: Enums
ja: 列挙型（enums）
ko: 열거형
pt_br: _Enums_ (Enumerações)
uk: Перелічувані типи

source: Const
uk: Константи

source: Static
es: Estático
ja: 静的
ko: 정적(static) 변수
uk: Статика

source: Type Aliases
fa: نام‌های مستعار تایپ
ja: 型エイリアス
pt_br: _Aliases_ (Apelidos) de Tipo
uk: Псевдоніми типу

source: Exercise: Elevator Events
fa: تمرین: رویدادهای آسانسور
ja: 演習: エレベーターでのイベント
pt_br: Exercício: Eventos de Elevador
uk: Вправа: події в ліфті

source: Day 2: Morning
es: Día 2: Mañana
fa: روز ۲: صبح
ja: Day 2： AM
ko: 2일차 오전
pt_br: Dia 2: Manhã
uk: День 2: Ранок

source: Pattern Matching
es: Correspondencia de Patrones
fa: تطبیق
ja: パターンマッチング
ko: 패턴 매칭
pt_br: Correspondência de Padrões
uk: Зіставлення зразків

source: Matching Values
fa: تطابق مقادیر
uk: Співставлення значень

source: Destructuring Structs
es: Desestructurando Structs
fa: تخریب ساختارها
ko: 구조체 분해(역구조화)
pt_br: Desestruturando Structs
uk: Деструктурування структур

source: Destructuring Enums
es: Desestructurando Enums
fa: تخریب ساختار Enums
ko: 열거형 분해(역구조화)
uk: Деструктурування переліків

source: Let Control Flow
fa: کنترل جریان Let
pt_br: Controle de Fluxo _Let_
uk: Потік контролю Let

source: Exercise: Expression Evaluation
fa: تمرین: ارزیابی عبارت
ja: 演習: 式の評価
pt_br: Exercício: Avaliação de Expressões
uk: Вправа: обчислення виразу

source: Methods and Traits
fa: متدها و تریت‌ها
pt_br: Métodos e _Traits_
uk: Методи та Трейти

source: Methods
es: Métodos
fa: متدها
ja: メソッド
ko: 메서드
pt_br: Métodos
uk: Методи

source: Traits
ja: トレイト（trait）
ko: 트레잇(Trait)
uk: Трейти

source: Implementing Traits
fa: پیاده سازی Traits
uk: Реалізація трейтів

source: Supertraits
uk: Супертрейти

source: Associated Types
fa: تایپ‌های وابسته
uk: Асоційовані типи

source: Deriving
pt_br: Derivando
uk: Виведення

source: Exercise: Generic Logger
fa: تمرین: توابع Generic
ja: 演習: ジェネリックなロガー
uk: Вправа: Загальний логгер

source: Day 2: Afternoon
es: Día 2: tarde
fa: روز دوم: عصر
ja: Day 2： PM
ko: 2일차 오후
pt_br: Dia 2: Tarde
uk: День 2: Полудень

source: Generics
es: Genéricos
ja: ジェネリクス（generics）
ko: 제네릭
pt_br: Genéricos (_Generics_)
uk: Узагальнені типи

source: Generic Functions
fa: توابع Generic
pt_br: Funções Genéricas
uk: Узагальнені функції

source: Generic Data Types
es: Tipos de Datos Genéricos
fa: دیتا تایپ‌های Generic
ja: ジェネリックデータ型
ko: 제네릭 데이터 타입
pt_br: Tipos de Dados Genéricos
uk: Узагальнені типи даних

source: Generic Traits
uk: Узагальнені трейти

source: Trait Bounds
es: Límites Trait (Bounds)
ja: トレイト制約
ko: 제네릭 타입 제한(트레잇 경계)
pt_br: _Trait Bounds_ (Limites de Trait)
uk: Обмеження трейту

source: Exercise: Generic `min`
fa: تمرین: Generic `min`
ja: 演習: ジェネリックな `min`
pt_br: Exercício: `min` Genérico
uk: Вправа: узагальнена `min`

source: Standard Library Types
fa: کتابخانه‌ استاندارد تایپ‌ها
pt_br: Tipos da Biblioteca Padrão
uk: Типи стандартної бібліотеки

source: Standard Library
es: Biblioteca estándar
fa: کتابخانه‌ استاندارد
ja: 標準ライブラリ
ko: 표준 라이브러리
pt_br: Biblioteca Padrão
uk: Стандартна бібліотека

source: Documentation
fa: مستندات
ja: ドキュメント
pt_br: Documentação
uk: Документація

source: Exercise: Counter
fa: تمرین: شمارنده
ja: 演習: カウンター
pt_br: Exercício: Contador
uk: Вправа: Лічильник

source: Standard Library Traits
fa: کتابخانه استاندارد Traits
pt_br: _Traits_ da Biblioteca Padrão
uk: Трейти стандартної бібліотеки

source: Comparisons
es: Comparaciones
fa: مقایسه
ja: 他の言語との比較
pt_br: Comparações
uk: Порівняння

source: Operators
fa: اپراتورها
pt_br: Operadores
uk: Оператори

source: `From` and `Into`
es: `From` e `Into`
ja: `From` と `Into`
ko: `From`과 `Into`
pt_br: `From` e `Into`
uk: `From` та `Into`

source: Casting
pt_br: Conversões
uk: Приведення

source: `Read` and `Write`
es: `Read` y `Write`
ja: `Read` と `Write`
ko: `Read`와 `Write`
pt_br: `Read` e `Write`
uk: `Read` та `Write`

source: `Default`, struct update syntax
ja: `Default`、構造体更新記法
pt_br: `Default`, sintaxe de atualização de _struct_
uk: `Default`, синтаксис оновлення структури

source: Closures
es: Cierres
ja: クロージャ
ko: 클로저(Closure)
uk: Закриття

source: Exercise: ROT13
fa: تمرین: ROT13
ja: 演習: ROT13暗号
pt_br: Exercício: ROT13
uk: Вправа: ROT13

source: Day 3: Morning
es: Día 3: Mañana
fa: روز ۳: صبح
ja: Day 3： AM
ko: 3일차 오전
pt_br: Dia 3: Manhã
uk: День 3: Ранок

source: Memory Management
es: Manejo de Memoria
fa: مدیریت حافظه
ja: メモリ管理
ko: 메모리 관리
pt_br: Gerenciamento de Memória
uk: Управління пам'яттю

source: Review of Program Memory
fa: بررسی حافظه برنامه
ja: プログラム メモリの見直し
pt_br: Revisão da Memória de Programa
uk: Огляд пам'яті програми

source: Approaches to Memory Management
fa: رویکردهای مدیریت حافظه
pt_br: Abordagens para Gerenciamento de Memória
uk: Підходи до управління пам'яттю

source: Ownership
es: Propiedad (_Ownership_)
fa: مالکیت
ja: 所有権
ko: 소유권
uk: Володіння

source: Move Semantics
es: Semántica de movimiento
fa: مفاهیم جابه‌جایی
ja: ムーブセマンティクス
ko: Move 문법
pt_br: Semântica de Movimento
uk: Семантика переміщення

source: Copy Types
fa: کپی کردن تایپ‌ها
ja: Copy 型
pt_br: Tipos Copiáveis
uk: Типи які копіюються

source: Exercise: Builder Type
fa: تمرین: تایپ‌های سازنده
ja: 演習: ビルダー型
pt_br: Exercício: Tipo Builder
uk: Вправа: Тип будівельника

source: Smart Pointers
fa: اشاره‌گرهای هوشمند
ja: スマートポインタ
pt_br: Ponteiros Inteligentes (_Smart Pointers_)
uk: Розумні вказівники

source: Owned Trait Objects
uk: Принадлежні об'єкти трейтів

source: Exercise: Binary Tree
fa: تمرین: درخت باینری
ja: 演習: バイナリツリー
pt_br: Exercício: Árvore Binária
uk: Вправа: Бінарне дерево

source: Day 3: Afternoon
es: Día 3: Tarde
fa: روز ۳: بعد از ظهر
ja: Day 3： PM
ko: 3일차 오후
pt_br: Dia 3: Tarde
uk: День 3: Полудень

source: Borrowing
es: Préstamos (_Borrowing_)
fa: قرض‌گیری (Borrowing)
ja: 借用
ko: 빌림
pt_br: Empréstimo (_Borrowing_)
uk: Запозичення

source: Borrowing a Value
fa: قرض‌گیری یک مقدار
pt_br: Emprestando um Valor
uk: Запозичення значення

source: Borrow Checking
fa: چک کردن قرض
pt_br: Verificação de Empréstimo
uk: Перевірка запозичення

source: Borrow Errors
fa: خطاهای قرض‌گیری
uk: Помилки запозичення

source: Interior Mutability
fa: تغییرپذیری داخلی
ja: 内部可変性
pt_br: Mutabilidade Interior
uk: Внутрішня мутабельність

source: Exercise: Health Statistics
fa: تمرین: آمار سلامتی
ja: 演習: 健康に関する統計
pt_br: Exercício: Estatísticas de Saúde
uk: Вправа: Статистика здоров’я

source: Lifetimes
es: Tiempos de vida
fa: طول‌عمر
ko: 수명
uk: Тривалість життя

source: Lifetime Annotations
fa: تفسیر‌های طول عمر
ja: 関数とライフタイム
pt_br: Anotações de Tempo de Vida
uk: Анотації тривалісті життя

source: Lifetime Elision
fa: حذف طول عمر
pt_br: Elisão de Tempo de Vida
uk: Упущення тривалісті життя

source: Struct Lifetimes
fa: طول عمر ساختارها
pt_br: Tempos de Vida de _Structs_
uk: Тривалість життя структур

source: Exercise: Protobuf Parsing
fa: تمرین: تجزیه Protobuf
ja: 演習: Protobufの解析
pt_br: Exercício: Análise de Protobuf
uk: Вправа: Розбір Protobuf

source: Day 4: Morning
fa: روز چهارم: صبح
ja: Day 4： AM
pt_br: Dia 4: Manhã
uk: День 4: Ранок

source: Iterators
es: Iteradores
ja: イテレータ
pt_br: Iteradores
uk: Ітератори

source: `Iterator`
uk: `Ітератор`

source: Exercise: Iterator Method Chaining
fa: تمرین: روش Iterator Chaining
ja: 演習: イテレータのメソッドチェーン
pt_br: Exercício: Encadeamento de Métodos de Iterador
uk: Вправа: ланцюжок методів ітератора

source: Modules
es: Módulos
fa: ماژول‌ها
ko: 모듈
pt_br: Módulos
uk: Модулі

source: Filesystem Hierarchy
es: Jerarquía del sistema de archivos
fa: سلسله‌ مراتب فایل‌سیستم
ja: ファイルシステム階層
ko: 파일시스템 계층
pt_br: Hierarquia do Sistema de Arquivos
uk: Ієрархія файлової системи

source: Visibility
es: Visibilidad
fa: قابلیت دید
ja: 可視性
ko: 가시성
pt_br: Visibilidade
uk: Видимість

source: Exercise: Modules for a GUI Library
fa: تمرین: ماژولهایی برای کتابخانه رابط کاربری گرافیکی
uk: Вправа: Модулі для бібліотеки графічного інтерфейсу користувача

source: Testing
es: Probando
fa: تست‌کردن
ja: テスト
ko: 테스트
pt_br: Testando
uk: Тестування

source: Test Modules
es: Módulos de Pruebas
fa: تست‌ ماژول‌ها
ja: テストモジュール
ko: 테스트 모듈
pt_br: Módulos de Teste
uk: Тестові модулі

source: Other Types of Tests
fa: انواع دیگر تست‌ها
pt_br: Outros Tipos de Testes
uk: Інші типи тестів

source: Compiler Lints and Clippy
fa: کامپایلر Lints و Clippy
ja: コンパイラの Lints と Clippy
pt_br: _Lints_ do Compilador e Clippy
uk: Лінти компілятора та Clippy

source: Exercise: Luhn Algorithm
fa: تمرین: الگوریتم Luhn
pt_br: Exercício: Algoritmo de Luhn
uk: Вправа: Алгоритм Луна

source: Day 4: Afternoon
fa: روز چهارم: بعد از ظهر
ja: Day 4： PM
pt_br: Dia 4: Tarde
uk: День 4: Полудень

source: Error Handling
es: Manejo de Errores
fa: مدیریت خطا
ja: エラー処理
ko: 오류처리
pt_br: Tratamento de Erros
uk: Обробка помилок

source: Panics
fa: در مورد Panicها
ja: パニック（panic）
ko: 패닉
pt_br: Pânicos (_Panics_)
uk: Паніки

source: Try Operator
fa: عملگرد Try
pt_br: Operador _Try_
uk: Оператор спроб

source: Try Conversions
fa: این تبدیل‌ها (Conversions) را امتحان کنید
pt_br: Conversões _Try_
uk: Перетворення спроб

source: `Error` Trait
ja: `Error`トレイト
pt_br: Trait `Error`
uk: `Error` трейт

source: Exercise: Rewriting with `Result`
fa: تمرین: بازنویسی با `Result`
ja: 演習: `Result` を使用した書き換え
pt_br: Exercício: Reescrevendo com `Result`
uk: Вправа: Переписування с `Result`

source: Unsafe Rust
fa: Rust ناایمن
ko: 안전하지 않은 러스트
pt_br: Rust Inseguro (_Unsafe_)
uk: Небезпечний Rust

source: Dereferencing Raw Pointers
es: Dereferenciación de Punteros Sin Formato
fa: عدم ارجاع به اشاره‌گرهای خام
ja: 生ポインタの参照外し
ko: 원시 포인터 역참조(따라가기)
pt_br: Desreferenciando Ponteiros Brutos
uk: Розіменування "сирих" вказівників

source: Mutable Static Variables
es: Variables Estáticas Mutables
fa: متغیرهای ثابت قابل تغییر
ja: 可変なstatic変数
ko: 정적 가변 변수
pt_br: Variáveis Estáticas Mutáveis
uk: Несталі статичні змінні

source: Unions
es: Uniones
fa: نوع داده چندگانه
ja: 共用体
pt_br: Uniões
uk: Об'єднання

source: Unsafe Functions
fa: توابع ناامن
ja: Unsafe関数の呼び出し
pt_br: Funções Inseguras
uk: Небезпечні функції

source: Unsafe Traits
fa: صفات (Traits) ناامن
ja: Unsafeなトレイトの実装
pt_br: Traits Inseguros
uk: Небезпечні трейти

source: Exercise: FFI Wrapper
fa: تمرین: FFI Wrapper
ja: 演習: FFIラッパー
pt_br: Exercício: _Wrapper_ FFI
uk: Вправа: обгортка FFI

source: Setup
es: Configurar
fa: تنظیم
ja: セットアップ
ko: 설치
pt_br: Configuração
uk: Установка

source: Build Rules
es: Reglas de Compilación (Build)
fa: قوانین ساخت
ja: ビルドのルール
ko: 빌드 규칙
pt_br: Regras de Compilação (_Build Rules_)
uk: Правила побудови

source: Binary
es: Binarios
fa: باینری
ja: バイナリ
ko: 바이너리
pt_br: Binários
uk: Бінарний файл

source: Library
es: Biblioteca
fa: کتابخانه
ja: ライブラリ
ko: 라이브러리
pt_br: Bibliotecas
uk: Бібліотека

source: Birthday Service Tutorial
fa: آموزش سرویس Birthday
uk: Посібник із сервісу Birthday

source: Interface
es: Interfaz
fa: رابط (Interface)
ja: インターフェイス
ko: AIDL 인터페이스
uk: Інтерфейс

source: Service API
uk: API сервісу

source: Service
fa: سرویس
uk: Сервіс

source: Server
es: Servidor
fa: سرور
ja: サーバ
ko: AIDL 서버
pt_br: Servidor
uk: Сервер

source: Deploy
es: Despliegue
fa: استقرار
ja: デプロイ
ko: 배포
pt_br: Implantar
uk: Розгортка

source: Client
es: Cliente
fa: کاربر
ja: クライアント
ko: 클라이언트
pt_br: Cliente
uk: Кліент

source: Changing API
es: Cambio de API
fa: تغییر دادن API
ja: APIの変更
ko: API 수정
pt_br: Alterando API
uk: Зміна API

source: Updating Implementations
uk: Оновлення реалізацій

source: AIDL Types
uk: AIDL типи

source: Primitive Types
fa: انواع اولیه
uk: Примітивні типи

source: Array Types
fa: تایپ‌های اٰرایه‌ای
uk: Типи Масивів

source: Sending Objects
uk: Надсилання об'єктів

source: Parcelables
fa: بسته‌بندی‌ها
uk: Посилкові данні

source: Sending Files
fa: ارسال فایل‌ها
uk: Надсилання файлів

source: Logging
es: Almacenamiento de registros
fa: لاگ
ja: ログ出力
ko: 로깅
pt_br: Gerando Registros (Log)
uk: Журналювання

source: Interoperability
es: Interoperabilidad
fa: قابلیت همکاری
ja: 相互運用性
ko: 상호운용성
pt_br: Interoperabilidade
uk: Інтероперабельність

source: With C
es: Con C
fa: با C
ja: C
ko: C와의 상호운용성
pt_br: Com C
uk: З С

source: Calling C with Bindgen
es: Llamar a C con Bindgen
fa: فراخوانی C با Bindgen
ja: BindgenによるCの呼び出し
ko: Bindgen을 사용한 C호출
pt_br: Chamando C com Bindgen
uk: Виклик С за допомогою Bindgen

source: Calling Rust from C
es: Llamar a Rust desde C
fa: فراخوانی Rust از C
ja: CからRust呼び出し
ko: C에서 러스트 호출
pt_br: Chamando Rust do C
uk: Виклик Rust з C

source: With C++
es: Con C++
fa: با <span dir=ltr>C++</span>
ja: C++
ko: C++와의 상호운용성
pt_br: Com C++
uk: З С++

source: The Bridge Module
fa: ماژول پل
pt_br: O Módulo _Bridge_
uk: Модуль Bridge

source: Generated C++
ja: 生成された C++
pt_br: C++ Gerado
uk: Згенерований C++

source: Shared Types
fa: انواع مشترک
ja: 共有の型
pt_br: Tipos Compartilhados
uk: Спільні типи

source: Shared Enums
ja: 共有の列挙型
pt_br: _Enums_ Compartilhados
uk: Спільні переліки

source: Rust Error Handling
fa: مدیریت خطا Rust
pt_br: Tratamento de Erros do Rust
uk: Обробка помилок в Rust

source: C++ Error Handling
fa: مدیریت خطا ++C
uk: Обробка помилок в C++

source: Additional Types
fa: تایپ‌های اضافی
ja: その他の型
pt_br: Tipos Adicionais
uk: Додаткові типи

source: Building for Android: C++
fa: روش Build برای اندروید: ++C
ja: Android 向けのビルド: C++
pt_br: Compilando para Android: C++
uk: Збірка для Android: C++

source: Building for Android: Genrules
fa: روش Build برای اندروید: ژانرها
ja: Android 向けのビルド: Genrules
pt_br: Compilando para Android: Genrules
uk: Збірка для Android: Genrules

source: Building for Android: Rust
fa: روش Build برای اندروید: Rust
ja: Android 向けのビルド: Rust
pt_br: Compilando para Android: Rust
uk: Збірка для Android: Rust

source: With Java
es: Con Java
fa: با جاوا
ja: Java
ko: Java와의 상호운용성
pt_br: Com Java
uk: З Java

source: Exercises
es: Ejercicios
fa: تمرین‌ها
ja: 練習問題
ko: 연습문제
pt_br: Exercícios
uk: Вправи

source: Comparing Chromium and Cargo Ecosystems
fa: مقایسه Chromium و اکوسیستم Cargo
ja: Chromium と Cargo のエコシステムの比較
pt_br: Comparando os Ecossistemas do Chromium e do Cargo
uk: Порівняння екосистем Chromium і Cargo

source: Policy
fa: قواعد
ja: ポリシー
pt_br: Política
uk: Політика

source: Unsafe Code
pt_br: Código Inseguro (_Unsafe_)
uk: Небезпечний код

source: Depending on Rust Code from Chromium C++
fa: بسته به Rust Code از ++Chromium C
ja: Chromium C++からRustのコードに依存させる
pt_br: Dependendo de Código Rust do C++ do Chromium
uk: Залежнісь Chromium C++ від коду Rust

source: Exercise
fa: تمرین‌ها
ja: 演習
pt_br: Exercício
uk: Вправа

source: `rust_gtest_interop` Library
ja: `rust_gtest_interop` ライブラリ
pt_br: Biblioteca `rust_gtest_interop`
uk: Бібліотека `rust_gtest_interop`

source: GN Rules for Rust Tests
fa: قواعد GN برای تست‌های Rust
ja: Rust テスト用の GN ルール
pt_br: Regras GN para Testes em Rust
uk: Правила GN для тестів Rust

source: `chromium::import!` Macro
ja: `chromium::import!` マクロ
pt_br: Macro `chromium::import!`
uk: Макрос `chromium::import!`

source: Interoperability with C++
fa: قابلیت همکاری با ++C
pt_br: Interoperabilidade com C++
uk: Взаємодія з C++

source: Example Bindings
fa: نمونه اتصال‌ها (Bindingها)
pt_br: Exemplo de _Bindings_
uk: Приклади прив'язок

source: Limitations of CXX
fa: محدودیت‌های CXX
ja: CXXの限界
pt_br: Limitações do CXX
uk: Обмеження CXX

source: CXX Error Handling
fa: مدیریت خطا CXX
pt_br: Tratamento de Erros do CXX
uk: Обробка помилок в CXX

source: Error Handling: QR Example
fa: مدیریت خطا: مثال QR
pt_br: Tratamento de Erros: Exemplo de QR
uk: Обробка помилок: приклад QR

source: Error Handling: PNG Example
fa: مدیریت خطا: مثال PNG
pt_br: Tratamento de Erros: Exemplo de PNG
uk: Обробка помилок: приклад PNG

source: Using CXX in Chromium
fa: استفاده از CXX در Chromium
ja: Chromium で CXX を使用する
pt_br: Usando CXX no Chromium
uk: Використання CXX у Chromium

source: Adding Third Party Crates
fa: اضافه‌کردن Crateهای شخص ثالث
ja: サードパーティのクレートを追加する
pt_br: Adicionando _Crates_ de Terceiros
uk: Додавання крейтів третіх сторін

source: Configuring Cargo.toml
fa: پیکربندی Cargo.toml
ja: Cargo.toml を構成する
pt_br: Configurando Cargo.toml
uk: Налаштування Cargo.toml

source: Configuring `gnrt_config.toml`
fa: تنظیمات `gnrt_config.toml`
ja: `gnrt_config.toml` を構成する
pt_br: Configurando `gnrt_config.toml`
uk: Налаштування `gnrt_config.toml`

source: Downloading Crates
fa: دانلود کردن Crateها
ja: クレートをダウンロードする
pt_br: Baixando _Crates_
uk: Завантаження крейтів

source: Generating `gn` Build Rules
fa: ایجاد قواعد `gn` Build
ja: `gn` ビルドルールを生成する
pt_br: Gerando Regras de Compilação `gn`
uk: Створення правил побудови `gn`

source: Resolving Problems
fa: حل مشکلات
ja: 問題を解決する
pt_br: Resolvendo Problemas
uk: Вирішення проблем

source: Build Scripts Which Generate Code
fa: ساخت اسکریپت‌هایی که کد را تولید می‌کنند
ja: コードを生成するビルドスクリプト
pt_br: Scripts de Compilação que Geram Código
uk: Скрипти збірки, які генерують код

source: Build Scripts Which Build C++ or Take Arbitrary Actions
fa: ساخت اسکریپت‌هایی که ++C را Build می‌کند یا اقدامات دلخواه انجام می‌دهند
ja: C++をビルドする、もしくは、任意のアクションを実行するビルドスクリプト
pt_br: Scripts de Compilação que Compilam C++ ou Tomam Ações Arbitrárias
uk: Скрипти збірки, які будують C++ або виконують довільні дії

source: Depending on a Crate
fa: وابسته به یک Crate
ja: クレートへの依存を設定する
pt_br: Dependendo de um _Crate_
uk: Залежнісь від крейта

source: Reviews and Audits
fa: بررسی‌ها و ممیزی‌ها
ja: 審査と監査
pt_br: Revisões e Auditorias
uk: Перевірки та аудити

source: Checking into Chromium Source Code
fa: کد‌های Chromium را بررسی کنید
ja: Chromium ソースコードにチェックインする
pt_br: Submetendo ao Código Fonte do Chromium
uk: Реєстрація в Chromium Source Code

source: Keeping Crates Up to Date
fa: به روز نگه داشتن Crateها
ja: クレートを最新の状態に保つ
pt_br: Mantendo _Crates_ Atualizados
uk: Підтримання крейтів в актуальному стані

source: Bringing It Together - Exercise
fa: دور همی تمرین کنید
ja: まとめ - 演習
pt_br: Juntando Tudo - Exercício
uk: Зібрання усього разом - вправа

source: Exercise Solutions
fa: راه‌حل‌های تمرین
pt_br: Soluções dos Exercícios
uk: Рішення вправ

source: Bare Metal: Morning
es: Bare Metal: mañana
fa: با Bare Metal: صبح
ko: Bare Metal 오전
pt_br: Bare Metal: Manhã
uk: Залізо: Ранок

source: A Minimal Example
es: Un Pequeño Ejemplo
fa: یک مثال ساده
ja: 例
ko: 작은 예제
pt_br: Um Pequeno Exemplo
uk: Мінімальний приклад
