Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: The next slide will introduce Tuple structs, used when the field names are not important.
es: La siguiente diapositiva presentará las estructuras de tuplas, que se utilizan cuando los nombres de los campos no son importantes.
fa: اسلاید بعدی ساختارهای تاپل (Tuple structs) را معرفی خواهد کرد، که زمانی استفاده می‌شوند که نام فیلدها مهم نیستند.
ja: 次のスライドでは、フィールド名が重要でない場合に使用されるタプル構造体を紹介します。
ko: 다음 슬라이드에서는 필드 이름이 덜 중요할 때 사용할 수 있는 튜플 구조체를 소개합니다.
pt_br: O próximo slide apresentará as _structs_ de tuplas usadas quando o nome dos campos não são importantes.
uk: На наступному слайді буде представлено структури кортежу, які використовуються, коли імена полів не важливі.

source: If you already have variables with the right names, then you can create the struct using a shorthand.
fa: اگر از قبل متغیرهایی با نام‌های مناسب دارید، می‌توانید ساختار را با استفاده از یک روش میانبر ایجاد کنید.
ja: 適切な名前の変数がすでにある場合は、省略形を使用して構造体を作成できます。
pt_br: Se você já tiver variáveis com os nomes corretos, poderá criar a _struct_ usando uma abreviação.
uk: Якщо у вас уже є змінні з правильними іменами, ви можете створити структуру за допомогою скорочення:

source: The syntax `..avery` allows us to copy the majority of the fields from the old struct without having to explicitly type it all out. It must always be the last element.
fa: سینتکس `..avery` به ما اجازه می‌دهد که اکثر فیلدها را از ساختار قدیمی کپی کنیم بدون اینکه همه آن‌ها را صریحاً تایپ کنیم. این باید همیشه آخرین عنصر باشد.
ja: 構文 `..avery` を使用すると、明示的にすべてのフィールドを入力しなくても、古い構造体のフィールドの大部分をコピーできます。この構文は、常に最後の要素にする必要があります。
uk: Синтаксис `..avery` дозволяє нам скопіювати більшість полів зі старої структури без необхідності явного введення всіх полів. Це завжди має бути останнім елементом.

source: If the field names are unimportant, you can use a tuple struct:
es: Si los nombres de los campos no son importantes, puedes utilizar una estructura de tuplas:
fa: اگر نام فیلدها بی‌اهمیت هستند، می‌توانید از ساختار tuple استفاده کنید:
ja: フィールド名が重要でない場合は、タプル構造体を使用できます。
ko: 각 필드 이름이 중요하지 않다면 튜플 구조체를 사용할 수 있습니다:
pt_br: Se os nomes dos campos não forem importantes, você pode usar uma _struct_ de tupla:
uk: Якщо імена полів неважливі, ви можете використати структуру кортежу:

source: This is often used for single-field wrappers (called newtypes):
es: Esto se suele utilizar para envoltorios de campo único (denominados newtypes):
fa: این اغلب برایsingle-field wrapper (که newtypes نامیده می‌شوند) استفاده می‌شود:
ja: これは多くの場合、単一フィールド ラッパー（ニュータイプと呼ばれます）に使用されます。
ko: 튜플 구조체는 종종 단일 필드의 래퍼(wrapper, 러스트에서 뉴타입(newtype)이라고 부름)로 사용됩니다:
pt_br: Isso é comumente utilizado para _wrappers_ (invólucros) com campo único (chamados _newtypes_):
uk: Це часто використовується для обгорток з одним полем (так званих newtypes):

source: "Ask a rocket scientist at NASA"
fa: "از یک دانشمند حوزه موشک در ناسا بپرس"
pt_br: "Pergunte para um cientista de foguetes da NASA"
uk: "Запитайте вченого-ракетника з NASA"

source: Newtypes are a great way to encode additional information about the value in a primitive type, for example:
es: Los newtypes son una buena forma de codificar información adicional sobre el valor de un tipo primitivo, por ejemplo:
fa: Newtypes یک راه مناسب برای رمزگذاری اطلاعات اضافی در مورد مقدار در یک نوع اولیه (primitive type) است، به عنوان مثال:
ja: ニュータイプは、プリミティブ型の値に関する追加情報をエンコードする優れた方法です。次に例を示します。
ko: 뉴타입은 기본 타입에 부가적인 의미를 더하는 좋은 방법입니다. 예를 들어:
pt_br: _Newtypes_ são uma ótima maneira de codificar informações adicionais sobre o valor em um tipo primitivo, por exemplo:
uk: Newtypes — чудовий спосіб закодувати додаткову інформацію про значення в примітивному типі, наприклад:

source: The number is measured in some units: `Newtons` in the example above.
es: El número se mide en algunas unidades: `Newtons` en el ejemplo anterior.
fa: این عدد در برخی واحدها اندازه گیری می‌شود: `Newtons` در مثال بالا.
ja: 数値はいくつかの単位で測定されます（上記の例では `Newtons`）。
ko: 숫자값에 단위를 표시할 수 있음: 위에서 `Newtons`이 그 예입니다.
pt_br: O número é medido em algumas unidades: `Newtons` no exemplo acima.
uk: Число вимірюється в деяких одиницях: у наведеному вище прикладі `Newtons`.

source: The value passed some validation when it was created, so you no longer have to validate it again at every use: `PhoneNumber(String)` or `OddNumber(u32)`.
fa: مقدار زمانی که ایجاد شد مقداری اعتبارسنجی را دریافت کرد، بنابراین دیگر لازم نیست در هر بار استفاده دوباره آن را تأیید کنید: `PhoneNumber(String)` یا `OddNumber(u32)`.
ja: この値は作成時に検証に合格したため、`PhoneNumber(String)` または `OddNumber(u32)` を使用するたびに再検証する必要はありません。
pt_br: O valor passou por alguma validação quando foi criado, então não é preciso validá-lo novamente a cada uso: `PhoneNumber(String)` ou `OddNumber(u32)`.
uk: Значення пройшло певну перевірку під час створення, тому вам більше не потрібно перевіряти його знову при кожному використанні: `PhoneNumber(String)` або `OddNumber(u32)`.

source: Demonstrate how to add a `f64` value to a `Newtons` type by accessing the single field in the newtype.
es: Demuestra cómo se añade un valor `f64` a un tipo `Newtons` accediendo al campo único del newtype.
fa: نحوه افزودن مقدار `f64` به نوع `Newtons` را با دسترسی به single field در نوع جدید نشان دهید.
ja: ニュータイプの 1 つのフィールドにアクセスして、`Newtons` 型に `f64` の値を追加する方法を示します。
ko: `Newtons` 타입의 값에 `f64` 값을 더하는 방법을 보여주세요.
pt_br: Demonstre como somar um valor `f64` em um valor do tipo `Newtons` acessando o campo único no _newtype_.
uk: Продемонструйте, як додати значення `f64` до типу `Newtons`, отримавши доступ до єдиного поля в newtype.

source: Rust generally doesn’t like inexplicit things, like automatic unwrapping or for instance using booleans as integers.
es: Por lo general, a Rust no le gustan los elementos no explícitos, como el desenvolvimiento automático o, por ejemplo, el uso de booleanos como enteros.
fa: Rust معمولاً چیزهای غیر واضح را دوست ندارد، مانند automatic unwrapping یا به‌عنوان‌مثال استفاده از booleanها به عنوان اعداد صحیح.
ja: Rust では通常、不明瞭なこと（自動ラップ解除や、整数としてのブール値の使用など）は好まれません。
ko: 러스트는 분명하지 않은 것을 싫어합니다. 예를 들면 자동으로 unwrap하거나 불리언 값을 정수 값으로 사용하는 것들이 그렇습니다.
pt_br: Geralmente, Rust não gosta de coisas implícitas, como _unwrapping_ automático ou, por exemplo, usar booleanos como inteiros.
uk: Rust зазвичай не любить неявних речей, таких як автоматичне розгортання або, наприклад, використання логічних значень як цілих чисел.

source: Operator overloading is discussed on Day 3 (generics).
es: El día 3 (genéricos), se explicará la sobrecarga del operador.
fa: مبحث Operator overloading در روز سوم مورد بحث قرار می گیرد (generics).
ja: 演算子のオーバーロードについては、3 日目（ジェネリクス）で説明します。
ko: 연산자 재정의는 3일차 제네릭 부분에서 다룹니다.
pt_br: Sobrecarga de operadores é discutido no Dia 3 (genéricos).
uk: Перевантаження операторів обговорюється в день 3 (дженерики).

source: The example is a subtle reference to the [Mars Climate Orbiter](https://en.wikipedia.org/wiki/Mars_Climate_Orbiter) failure.
es: El ejemplo es una sutil referencia al fracaso de la sonda [Mars Climate Orbiter](https://es.wikipedia.org/wiki/Mars_Climate_Orbiter).
fa: این مثال، اشاره ظریفی به شکست [مدارگَرد آب‌و‌هوای مریخ](https://en.wikipedia.org/wiki/Mars_Climate_Orbiter) است.
ja: この例は、[マーズ クライメイト オービター](https://en.wikipedia.org/wiki/Mars_Climate_Orbiter)の失敗を参考にしています。
ko: 이는 [화성 기후 궤도선 (Mars Climate Orbiter)](https://en.wikipedia.org/wiki/Mars_Climate_Orbiter)의 실패 원인으로 지목된 도량형 입력 오류를 보여줍니다.
pt_br: O examplo é uma referência sutil a falha do [Orbitador Climático de Marte](https://pt.wikipedia.org/wiki/Mars_Climate_Orbiter).
uk: Цей приклад є тонким посиланням на невдачу [Mars Climate Orbiter](https://en.wikipedia.org/wiki/Mars_Climate_Orbiter).

source: The `enum` keyword allows the creation of a type which has a few different variants:
es: La palabra clave `enum` permite crear un tipo que tiene diferentes variantes:
fa: کلمه کلیدی `enum` اجازه ایجاد نوع داده‌ای را می دهد که دارای چندین گونه مختلف است:
ja: `enum` キーワードを使用すると、いくつかの異なるバリアントを持つ型を作成できます。
ko: `enum` 키워드는 몇가지 유형(variant)으로 표현되는 타입을 생성합니다:
pt_br: A palavra-chave `enum` permite a criação de um tipo que possui algumas variantes diferentes:
uk: Ключове слово `enum` дозволяє створити тип, який має кілька різних варіантів:

source: // Simple variant
ja: // 単純なバリアント
pt_br: // Variante simples
uk: // Простий варіант

source: // Tuple variant
uk: // Варіант кортежу

source: // Struct variant
ja: // 構造体バリアント
uk: // Варіант структури

source: "On this turn: {:?}"
fa: "در این پیچ: {:?}"
uk: "На цьому повороті: {:?}"

source: Enumerations allow you to collect a set of values under one type.
fa: `Enum`ها به شما امکان می دهند مجموعه‌ای از مقادیر مختلف با نوع‌های مختلف را تحت یک نوع جمع آوری کنید.
ja: 列挙型を使用すると、1 つの型で一連の値を収集できます。
pt_br: Enumerações permitem coletar um conjunto de valores em um tipo
uk: Переліки дозволяють збирати набір значень під одним типом.

source: `Direction` is a type with variants. There are two values of `Direction`: `Direction::Left` and `Direction::Right`.
fa: `Direction` یک type با گونه‌های مختلف است. دو مقدار `Direction` وجود دارد: `Direction::Left` و `Direction::Right`.
ja: `Direction` はバリアントを持つ型です。`Direction`には、`Direction::Left` と `Direction::Right` の 2 つの値があります。
pt_br: `Direction` é um tipo com variantes. Existem dois valores de `Direction`: `Direction::Left` e `Direction::Right`.
uk: Напрямок - це тип з варіантами. Існує два значення `Direction`: `Direction::Left` та `Direction::Right`.

source: `PlayerMove` is a type with three variants. In addition to the payloads, Rust will store a discriminant so that it knows at runtime which variant is in a `PlayerMove` value.
ja: `PlayerMove` は、3 つのバリアントを持つ型です。Rust はペイロードに加えて判別式を格納することで、実行時にどのバリアントが `PlayerMove` 値に含まれているかを把握できるようにします。
pt_br: `PlayerMove` é um tipo com três variantes. Além dos _payloads_, o Rust armazenará um discriminante para que ele saiba em tempo de execução qual variante está em um valor `PlayerMove`.
uk: `PlayerMove` - це тип з трьома варіантами. На додаток до корисного навантаження, Rust зберігатиме дискримінант, щоб під час виконання знати, який варіант є у значенні `PlayerMove`.

source: This might be a good time to compare structs and enums:
fa: الان زمان خوبی برای مقایسه ساختارها و `Enum`هاست:
ja: ここで構造体と列挙型を比較することをおすすめします。
pt_br: Este pode ser um bom momento para comparar structs e enums:
uk: Це може бути гарний час для порівняння структури та переліки:

source: In both, you can have a simple version without fields (unit struct) or one with different types of fields (variant payloads).
fa: در هر دو، می توانید یک نسخه ساده بدون فیلد (unit struct) یا یکی با انواع مختلف فیلد (variant payloads) داشته باشید.
ja: どちらでも、フィールドのないシンプルなバージョン（単位構造体）か、さまざまなフィールドがあるバージョン（バリアント ペイロード）を使用できます。
pt_br: Em ambos, você pode ter uma versão simples sem campos (_unit struct_, ou estrutura unitária) ou uma com diferentes tipos de campo (_variant payloads_ ou _cargas de variante_).
uk: В обох ви можете мати просту версію без полів (структура одиниць) або з різними типами полів (різні варіанти корисного навантаження).

source: You could even implement the different variants of an enum with separate structs but then they wouldn’t be the same type as they would if they were all defined in an enum.
fa: شما حتی می توانید انواع مختلف یک `Enum` را با ساختارهای جداگانه پیاده سازی کنید، اما در آن صورت آنها از همان نوعی که در ابتدا تعریف کردید یعنی `Enum` نخواهند بود.
ja: 個別の構造体を使用して、列挙型のさまざまなバリアントを実装することもできますが、その場合、それらがすべて列挙型で定義されている場合と同じ型にはなりません。
pt_br: Você pode até mesmo implementar as diferentes variantes de uma _enum_ com _structs_ separadas, mas elas não seriam do mesmo tipo, como seriam se todas fossem definidas em uma _enum_.
uk: Ви навіть можете реалізувати різні варіанти переліку окремими структурами, але тоді вони не будуть одного типу, як якщо б всі вони були визначені в переліку.

source: Rust uses minimal space to store the discriminant.
fa: Rust از حداقل فضا برای ذخیره‌سازی متمایز‌کننده (discriminant) استفاده می‌کند.
ja: Rust は判別式を保存するために最小限のスペースを使用します。
pt_br: O Rust usa espaço mínimo para armazenar o discriminante.
uk: Rust використовує мінімальний обсяг пам'яті для зберігання дискримінанта.

source: If necessary, it stores an integer of the smallest required size
fa: در صورت لزوم، یک عدد صحیح با کوچکترین اندازه مورد نیاز را ذخیره می‌کند
ja: 必要に応じて、必要最小限のサイズの整数を格納します。
pt_br: Se necessário, armazena um inteiro do menor tamanho necessário
uk: Якщо потрібно, він зберігає ціле число найменшого необхідного розміру

source: If the allowed variant values do not cover all bit patterns, it will use invalid bit patterns to encode the discriminant (the "niche optimization"). For example, `Option<&u8>` stores either a pointer to an integer or `NULL` for the `None` variant.
fa: اگر مقادیر متغیر مجاز همه الگوهای bit را پوشش ندهند، از الگوهای bit نامعتبر برای رمزگذاری متمایز کننده (یک "niche optimization") استفاده می‌کند. برای مثال، `Option<&u8>` یک اشاره‌گر به یک عدد صحیح یا `NULL` را برای نوع `None` ذخیره می‌کند.
ja: 許可されたバリアント値がすべてのビットパターンをカバーしていない場合、無効なビットパターンを使用して判別式をエンコードします（「ニッチの最適化」）。たとえば、`Option<&u8>` には `None` バリアントに対する整数へのポインタまたは `NULL` が格納されます。
uk: Якщо допустимі значення варіантів не покривають усіх бітових шаблонів, для кодування дискримінанта буде використано неприпустимі бітові шаблони ("нішева оптимізація"). Наприклад, `Option<&u8>` зберігає або вказівник на ціле число, або `NULL` для варіанта `None`.

source: You can control the discriminant if needed (e.g., for compatibility with C):
es: Puedes controlar el discriminante si es necesario (por ejemplo, para asegurar la compatibilidad con C):
fa: شما می توانید در صورت نیاز (به عنوان مثال، برای سازگاری با C) discriminant را کنترل کنید:
ja: 必要に応じて（たとえば C との互換性を確保するために）判別式を制御できます。
ko: C와의 연동을 위해 식별자 값을 직접 지정할 수도 있습니다:
pt_br: É possível controlar o discriminante se necessário (p.ex., para compatibilidade com C):
uk: За потреби можна керувати дискримінантом (наприклад, для сумісності з C):

source: Without `repr`, the discriminant type takes 2 bytes, because 10001 fits 2 bytes.
es: Sin `repr`, el tipo discriminante ocupa 2 bytes, debido a que 10001 se cabe en 2 bytes.
fa: بدون `repr`، نوع discriminant دو بایت حافظه اشغال میکند، زیرا 10001 در 2 بایت جا می‌شود.
ja: `repr` がない場合、10001 は 2 バイトに収まるため、判別式の型には 2 バイトが使用されます。
ko: `repr` 속성이 없다면 10001이 2 바이트로 표현가능하기 때문에 식별자의 타입 크기는 2 바이트가 됩니다.
pt_br: Sem `repr`, o tipo do discriminante usa 2 bytes, porque 10001 cabe em 2 bytes.
uk: Без `repr` тип дискримінанта займає 2 байти, оскільки 10001 вміщує 2 байти.

source: More to Explore
fa: برای کاوش بیشتر
ja: その他
pt_br: Mais para Explorar
uk: Більше інформації для вивчення

source: Rust has several optimizations it can employ to make enums take up less space.
fa: زبان Rust دارای چندین بهینه‌سازی دارد که می‌تواند برای کاهش فضای اشغال شده توسط`Enum`ها استفاده کند.
ja: Rust には、列挙型が占めるスペースを少なくするために使用できる最適化がいくつかあります。
pt_br: O Rust tem várias otimizações que pode empregar para fazer com que as enums ocupem menos espaço.
uk: Rust має декілька оптимізацій, які можна застосувати, щоб зменшити розмір переліків.

source: Null pointer optimization: For [some types](https://doc.rust-lang.org/std/option/#representation), Rust guarantees that `size_of::<T>()` equals `size_of::<Option<T>>()`.
es: Optimización de puntero nulo: para [algunos tipos](https://doc.rust-lang.org/std/option/#representation), Rust asegura que `size_of::<T>()` es igual a `size_of::<Option<T> >()`.
fa: بهینه‌سازی اشاره‌گر `NULL`: برای برخی از انواع، Rust تضمین می‌کند که <span dir=ltr>`size_of::<T>()`</span> برابر با <span dir=ltr>`size_of::<Option<T>>()`</span> است.
ja: null ポインタの最適化: [一部の型](https://doc.rust-lang.org/std/option/#representation)で、Rust は `size_of::<T>()` が `size_of::<Option<T>>()` と等しいことを保証します。
ko: 널포인터 최적화: [어떤 타입들](https://doc.rust-lang.org/std/option/#representation)에 대해서 러스트는 `size_of::<T>()`가 `size_of::<Option<T>>()`와 같은 것을 보장합니다.
pt_br: Otimização de ponteiro nulo: para [alguns tipos](https://doc.rust-lang.org/std/option/#representation), o Rust garante que `size_of::<T>()` é igual a `size_of::<Option<T>>()`.
uk: Оптимізація нульового вказівника: для [деяких типів](https://doc.rust-lang.org/std/option/#representation) Rust гарантує, що `size_of::<T>()` дорівнює `size_of::<Option <T>>()`.

source: Example code if you want to show how the bitwise representation _may_ look like in practice. It's important to note that the compiler provides no guarantees regarding this representation, therefore this is totally unsafe.
es: Fragmento de código de ejemplo si quieres mostrar cómo puede ser la representación bit a bit en la práctica. Es importante tener en cuenta que el compilador no ofrece garantías con respecto a esta representación, por lo tanto es totalmente inseguro.
fa: کد نمونه, اگر می‌خواهید نشان دهید که نمایش بیت به بیت در عمل چگونه ممکن است به نظر برسد. مهم است توجه داشته باشید که کامپایلر هیچ تضمینی در مورد این نمایش نمی‌دهد، بنابراین این کاملاً ناایمن است.
ja: 以下のサンプルコードは、ビット単位の表現が実際にどのようになるかを示しています。コンパイラはこの表現に関して保証しないので、これはまったく安全ではないことに注意してください。
ko: 실제로 널포인터 최적화가 적용된 것을 확인하고 싶다면 아래의 예제코드를 사용하세요. 주의할 점은, 여기에서 보여주는 비트 패턴이 컴파일러가 보장해 주는 것은 아니라는 점입니다. 여기에 의존하는 것은 완전히 unsafe합니다.
pt_br: Código de exemplo caso queira mostrar como a representação em bits _pode_ ser na prática. É importante apontar que o compilador não oferece nenhuma garantia a respeito dessa representação, portanto isso é completamente inseguro.
uk: Приклад коду, якщо ви хочете показати, як _може_ виглядати побітове представлення на практиці. Важливо зазначити, що компілятор не надає жодних гарантій щодо цього представлення, тому це абсолютно небезпечно.

source: Constants are evaluated at compile time and their values are inlined wherever they are used:
uk: Константи обчислюються під час компіляції, а їхні значення вставляються всюди, де вони використовуються:

source: According to the [Rust RFC Book](https://rust-lang.github.io/rfcs/0246-const-vs-static.html) these are inlined upon use.
fa: طبق [کتاب Rust RFC](https://rust-lang.github.io/rfcs/0246-const-vs-static.html)، این موارد هنگام استفاده درج می شوند.
ja: [Rust RFC Book](https://rust-lang.github.io/rfcs/0246-const-vs-static.html) によると、定数変数は使用時にインライン化されます。
ko: [Rust RFC Book](https://rust-lang.github.io/rfcs/0246-const-vs-static.html)에 따르면 상수는, 그 상수가 사용되는 곳에 인라인 됩니다.
pt_br: De acordo com o [Rust RFC Book](https://rust-lang.github.io/rfcs/0246-const-vs-static.html), eles são expandidos no próprio local (_inline_) quando utilizados.
uk: Відповідно до [Книги Rust RFC](https://rust-lang.github.io/rfcs/0246-const-vs-static.html) вони підставляються під час використання.

source: Only functions marked `const` can be called at compile time to generate `const` values. `const` functions can however be called at runtime.
es: Sólo se pueden llamar a las funciones marcadas como `const` en tiempo de compilación para generar valores `const`. Sin embargo, las funciones `const` se pueden llamar en _runtime_.
fa: فقط توابعی که با `const` علامت گذاری شده اند می توانند در زمان کامپایل برای تولید مقادیر `const` فراخوانی شوند. با این حال، توابع `const` را می توان در زمان اجرا فراخوانی کرد (بر خلاف تعریف متغییری ثابت)
ja: コンパイル時に `const` 値を生成するために呼び出せるのは、`const` とマークされた関数のみです。ただし、`const` 関数は実行時に呼び出すことができます。
ko: `const` 값을 생성할 때에는 `const`로 마킹된 함수만이 호출 가능하며, 이 함수들은 컴파일 시에 호출이 됩니다. 물론 `const`함수들을 런타임에 호출하는 것도 가능합니다.
pt_br: Somente funções marcadas como `const` podem ser chamadas em tempo de compilação para gerar valores `const`. As funções `const` podem, entretanto, ser chamadas em tempo de execução.
uk: Лише функції з позначкою `const` можна викликати під час компіляції для створення значень `const`. Однак функції `const` можна викликати під час виконання.

source: Mention that `const` behaves semantically similar to C++'s `constexpr`
fa: به این نکته اشاره کنید که `const` شبیه `constexpr` در <span dir=ltr>`C++`</span> عمل می‌کند.
uk: Зауважте, що `const` поводиться семантично подібно до `constexpr` C++.

source: It isn't super common that one would need a runtime evaluated constant, but it is helpful and safer than using a static.
es: No es muy habitual que se necesite una constante evaluada en _runtime_, pero es útil y más seguro que usar una estática.
fa: با اینکه خیلی رایج نیست که اگر کسی به یک یک مقدار ثابت که در زمان اجرا ارزیابی می‌شود از `const` استفاده کند اما مفید تر و ایمن تر از استفاده `static`ها هستند.
ja: 実行時に評価される定数が必要になることはあまりありませんが、静的変数を使用するよりも便利で安全です。
ko: 프로그램 수행시 그 값이 정해지는 상수가 필요한 경우는 드뭅니다. 그러나 그렇다고 해도, 정적 변수를 사용하는 것 보다는 더 유용하고 안전합니다.
pt_br: Não é muito comum que alguém precise de uma constante avaliada em tempo de execução, mas é útil e mais seguro do que usar uma variável estática.
uk: Не так часто виникає потреба у константі, що обчислюється під час виконання, але це корисно та безпечніше, ніж використовувати static.

source: Static variables will live during the whole execution of the program, and therefore will not move:
es: Las variables estáticas vivirán durante toda la ejecución del programa y, por lo tanto, no se moverán:
fa: متغیرهای ایستا در طول عمر کل اجرای برنامه خواهند ماند و بنابراین منتقل نمی‌شوند:
ja: 静的変数はプログラムの実行全体を通じて存続するため、移動しません。
ko: 정적 변수는 프로그램이 수행되는 동안 유지가 됩니다. 그러므로 다른 변수로 이동(move)되지 않습니다:
pt_br: Variáveis estáticas permanecerão válidas durante toda a execução do programa e, portanto, não serão movidas:
uk: Статичні змінні будуть жити протягом усього часу виконання програми, тому не будуть переміщатися:

source: "Welcome to RustOS 3.14"
fa: "به RustOS 3.14 خوش آمدید"
pt_br: "Bem-vindo ao RustOS 3.14"
uk: "Ласкаво просимо до RustOS 3.14"

source: As noted in the [Rust RFC Book](https://rust-lang.github.io/rfcs/0246-const-vs-static.html), these are not inlined upon use and have an actual associated memory location. This is useful for unsafe and embedded code, and the variable lives through the entirety of the program execution. When a globally-scoped value does not have a reason to need object identity, `const` is generally preferred.
ja: [Rust RFC Book](https://rust-lang.github.io/rfcs/0246-const-vs-static.html) で説明されているように、静的変数は使用時にインライン化されず、実際の関連するメモリ位置に存在します。これは安全でないコードや埋め込みコードに有用であり、変数はプログラムの実行全体を通じて存続します。グローバル スコープの値にオブジェクト ID が必要ない場合は、一般的に `const` が使用されます。
pt_br: Conforme observado no [Rust RFC Book](https://rust-lang.github.io/rfcs/0246-const-vs-static.html), eles não são expandidos no local (_inlined_) quando utilizados e possuem um local de memória real associado. Isso é útil para código inseguro (_unsafe_) e embarcado, e a variável é válida durante toda a execução do programa. Quando um valor de escopo global não tem uma razão para precisar de identidade de objeto, geralmente `const` é preferido.
uk: Як зазначено в [Книзі Rust RFC](https://rust-lang.github.io/rfcs/0246-const-vs-static.html), вони не підставляються під час використання та мають реальну асоційовану ділянку пам'яті. Це корисно для небезпечного та вбудованого коду, і змінна живе протягом усього виконання програми. Якщо значення глобальної області видимості не потребує ідентичності об’єкта, перевага надається `const`.

source: `static` is similar to mutable global variables in C++.
uk: `static` схожий на мутабельні глобальні змінні в C++.
