Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: borrow: See [Borrowing](borrowing/shared.md).
fa: borrow: ‏ [Borrowing](borrowing/shared.md) را ببینید.
uk: позичати: Дивіться [Запозичення](borrowing/shared.md).

source: borrow checker: The part of the Rust compiler which checks that all borrows are valid.
fa: borrow checker: بخشی از کامپایلر Rust که بررسی می‌کند که همه قرض‌ها (borrows) معتبر هستند.
ja: 借用チェッカー（borrow checker）: Rust コンパイラの一部。すべての借用が有効かどうかをチェックします。
pt_br: verificador de empréstimo: A parte do compilador Rust que verifica se todos os empréstimos são válidos.
uk: перевірка запозичень: Частина компілятора Rust, яка перевіряє допустимість усіх запозичень.

source: brace: `{` and `}`. Also called _curly brace_, they delimit _blocks_.
ja: 中かっこ（brace）: `{` and `}`。ブロックを区切ります。
pt_br: chaves: `{` e `}`. Elas delimitam _blocos_.
uk: дужка: `{` та `}`. Також називаються _фігурними дужками_, вони розмежовують _блоки_.

source: build: The process of converting source code into executable code or a usable program.
fa: build: فرآیند تبدیل کد منبع به کد اجرایی یا یک برنامه قابل استفاده می‌باشد.
ja: ビルド（build）: ソースコードを実行可能なコードまたは使用可能なプログラムに変換するプロセス。
pt_br: compilar: O processo de converter o código-fonte em código executável ou um programa usável.
uk: збірка: Процес перетворення вихідного коду у виконуваний код або придатну для використання програму.

source: call: To invoke or execute a function or method.
fa: call: برای فراخوانی یا اجرای یک تابع یا متد، کاربرد دارد.
ja: 呼び出し（call）: 関数またはメソッドを呼び出します。
pt_br: chamada: Para invocar ou executar uma função ou método.
uk: виклик: Виклик або виконання функції або методу.

source: channel: Used to safely pass messages [between threads](concurrency/channels.md).
fa: channel: ‏ برای ارسال ایمن پیام‌ها [بین threadها]‌(concurrency/channels.md) استفاده می‌شود.
ja: チャンネル（channel）: [スレッド間](concurrency/channels.md) でメッセージを安全に渡すために使用されます。
pt_br: canal: Usado para passar mensagens com segurança [entre _threads_](concurrency/channels.md).
uk: канал: Використовується для безпечної передачі повідомлень [між потоками](concurrency/channels.md).

source: Comprehensive Rust 🦀: The courses here are jointly called Comprehensive Rust 🦀.
fa: Comprehensive Rust 🦀: دوره‌های اینجا Comprehensive Rust 🦀 نامیده می‌شوند.
ja: Comprehensive Rust 🦀: このコースは、まとめて Comprehensive Rust 🦀 と呼びます。
pt_br: Comprehensive Rust 🦀: Os cursos aqui são chamados conjuntamente de Comprehensive Rust 🦀.
uk: Comprehensive Rust 🦀: Ці курси мають спільну назву Comprehensive Rust 🦀.

source: concurrency: The execution of multiple tasks or processes at the same time.
fa: concurrency: اجرای چندین task یا process به طور همزمان.
ja: 同時実行（concurrency）: 複数のタスクまたはプロセスを同時に実行することを指します。
pt_br: concorrência: A execução de várias tarefas ou processos ao mesmo tempo.
uk: одночасність виконання: Виконання декількох завдань або процесів одночасно.

source: Concurrency in Rust: See [Concurrency in Rust](concurrency/welcome.md).
fa: Concurrency در Rust ‏[Concurrency in Rust](concurrency/welcome.md) را ببینید.
uk: Одночасність виконання у Rust: Дивіться [Одночасність виконання у Rust](concurrency/welcome.md).

source: constant: A value that does not change during the execution of a program.
fa: constant: مقداری که در طول اجرای برنامه تغییر نمی‌کند.
ja: 定数（constant）: プログラムの実行中に変更されない値。
pt_br: constante: Um valor que não muda durante a execução de um programa.
uk: константа: Значення, яке не змінюється під час виконання програми.

source: control flow: The order in which the individual statements or instructions are executed in a program.
fa: control flow: ترتیبی که دستورات یا عملگرها در یک برنامه اجرا می‌شوند.
ja: 制御フロー（control flow）: 個々のステートメントまたは命令がプログラム内で実行される順序。
pt_br: fluxo de controle: A ordem na qual as instruções individuais são executadas em um programa.
uk: потік керування: Порядок, у якому виконуються окремі оператори або інструкції у програмі.

source: crash: An unexpected and unhandled failure or termination of a program.
fa: crash: یک شکست (failure) یا خاتمه غیرمنتظره و کنترل نشده یک برنامه است.
ja: クラッシュ（crash）: 予期しない制御不能なエラーまたは終了。
pt_br: falha (_crash_): Uma falha ou término inesperado e não tratado de um programa.
uk: крах: Неочікуваний і некерований збій або завершення роботи програми.

source: enumeration: A data type that holds one of several named constants, possibly with an associated tuple or struct.
fa: enumeration: یک نوع داده که یکی از چندین ثابت نامگذاری شده را، احتمالاً با یک تاپل یا ساختار مرتبط، نگه می‌دارد.
ja: 列挙型（enumeration）: 複数の名前付き定数のうちの 1 つを保持するデータ型。関連するタプルまたは構造体を伴う場合があります。
uk: перелік: Тип даних, який містить одну з декількох іменованих констант, можливо, з асоційованим кортежем або структурою.

source: error: An unexpected condition or result that deviates from the expected behavior.
fa: error: شرایط یا نتیجه غیرمنتظره‌ای که از رفتار مورد انتظار خارج می‌شود.
ja: エラー（error）: 想定された動作から逸脱した、予期しない条件または結果。
pt_br: erro: Uma condição ou resultado inesperado que desvia do comportamento esperado.
uk: помилка: Неочікувана умова або результат, що відхиляється від очікуваної поведінки.

source: error handling: The process of managing and responding to errors that occur during program execution.
fa: error handling: فرآیند مدیریت و پاسخگویی به خطاهایی که در حین اجرای برنامه رخ می‌دهد.
ja: エラー処理（error handling）: プログラムの実行中に発生するエラーを管理し、それに対応するプロセス。
pt_br: tratamento de erro: O processo de gerenciar e responder a erros que ocorrem durante a execução do programa.
uk: обробка помилок: Процес управління та реагування на помилки, що виникають під час виконання програми.

source: exercise: A task or problem designed to practice and test programming skills.
fa: exercise: مشکل یا task که برای تمرین و آزمایش مهارت‌های برنامه‌نویسی طراحی شده است.
ja: 演習（exercise:）: プログラミング スキルの向上とテストを目的としたタスクまたは問題。
pt_br: exercício: Uma tarefa ou problema projetado para praticar e testar habilidades de programação.
uk: вправа: Завдання або проблема, призначена для практики та перевірки навичок програмування.

source: function: A reusable block of code that performs a specific task.
fa: function: یک بلوک کد قابل استفاده مجدد که وظیفه خاصی را انجام می‌دهد.
ja: 関数（function）: 特定のタスクを実行する再利用可能なコードブロック。
pt_br: função: Um bloco de código reutilizável que executa uma tarefa específica.
uk: функція: Багаторазово використовуваний блок коду, який виконує певне завдання.

source: garbage collector: A mechanism that automatically frees up memory occupied by objects that are no longer in use.
fa: garbage collector: مکانیزمی که به طور خودکار حافظه اشغال شده توسط اشیایی که دیگر استفاده نمی‌شوند را آزاد می‌کند.
ja: ガベージ コレクタ（garbage collector）: 使用されなくなったオブジェクトが占有していたメモリを自動的に解放するメカニズム。
pt_br: coletor de lixo: Um mecanismo que libera automaticamente a memória ocupada por objetos que não estão mais em uso.
uk: збирач сміття: Механізм, який автоматично звільняє пам'ять, зайняту об'єктами, які більше не використовуються.

source: generics: A feature that allows writing code with placeholders for types, enabling code reuse with different data types.
fa: generics: قابلیتی که امکان نوشتن کد با متغیرهایی برای انواع را فراهم می‌کند و امکان استفاده مجدد از کد با انواع داده‌های مختلف را فراهم می‌کند.
ja: ジェネリクス（generics）: 型のプレースホルダを使用してコードを記述し、さまざまなデータ型でコードを再利用できるようにする機能。
pt_br: genéricos: Um recurso que permite escrever código com espaços reservados para tipos, possibilitando a reutilização de código com diferentes tipos de dados.
uk: узагальнення: Це можливість написання коду із заповнювачами для типів, що дозволяє повторно використовувати код з різними типами даних.

source: immutable: Unable to be changed after creation.
fa: immutable: پس از ایجاد، دیگر قابل تغییر نیست.
ja: 不変（immutable）: 作成後に変更できないこと。
pt_br: imutável: Incapaz de ser alterado após a criação.
uk: незмінний: Неможливо змінити після створення.

source: integration test: A type of test that verifies the interactions between different parts or components of a system.
fa: integration test: نوعی تست که تعامل بین بخش‌ها یا اجزای مختلف یک سیستم را تأیید می‌کند.
ja: 統合テスト（integration test）: システムのさまざまな部分やコンポーネント間の相互作用を検証するテストの一種。
pt_br: teste de integração: Um tipo de teste que verifica as interações entre diferentes partes ou componentes de um sistema.
uk: інтеграційний тест: Тип тесту, який перевіряє взаємодію між різними частинами або компонентами системи.

source: keyword: A reserved word in a programming language that has a specific meaning and cannot be used as an identifier.
fa: keyword: یک کلمه رزرو شده در یک زبان برنامه‌نویسی که معنای خاصی دارد و نمی‌توان از آن به عنوان شناسه یا سایر نامگذاری‌ها استفاده کرد.
ja: キーワード（keyword）: 特定の意味を持ち、識別子として使用できない、プログラミング言語の予約語。
pt_br: palavra-chave: Uma palavra reservada em uma linguagem de programação que tem um significado específico e não pode ser usada como um identificador.
uk: ключове слово: Зарезервоване слово в мові програмування, яке має певне значення і не може використовуватися як ідентифікатор.

source: library: A collection of precompiled routines or code that can be used by programs.
fa: library: مجموعه‌ای از routine‌ها یا کدهای از پیش کامپایل شده که می تواند توسط برنامه‌ها استفاده شود.
ja: ライブラリ（library）: プログラムで使用できるプリコンパイル済みのルーチンまたはコードのコレクション。
pt_br: biblioteca: Uma coleção de rotinas ou código pré-compilado que pode ser usado por programas.
uk: бібліотека: Колекція попередньо скомпільованих процедур або коду, які можуть бути використані програмами.

source: macro: Rust macros can be recognized by a `!` in the name. Macros are used when normal functions are not enough. A typical example is `format!`, which takes a variable number of arguments, which isn't supported by Rust functions.
fa: macro: ماکروهای Rust را می‌توان با یک `!` در نام آن تشخیص داد. ماکروها زمانی استفاده می‌شوند که توابع عادی کافی نباشد. یک مثال معمولی `format!` است که تعداد متغیری از آرگومان‌ها را می‌گیرد که توسط توابع Rust پشتیبانی نمی‌شوند.
ja: マクロ（macro）: Rust マクロは名前に `!` を含めることで認識できます。マクロは、通常の関数では不十分な場合に使用されます。典型的な例が `format!` です。これは可変長引数を取りますが、Rust 関数ではサポートされていません。
pt_br: macro: Macros Rust podem ser reconhecidas por um `!` no nome. Macros são usadas quando funções normais não são suficientes. Um exemplo típico é `format!`, que aceita um número variável de argumentos, o que não é suportado por funções Rust.
uk: макрос: Макроси використовуються, коли звичайних функцій недостатньо. Типовим прикладом є `format!`, який приймає змінну кількість аргументів, що не підтримується функціями Rust.

source: `main` function: Rust programs start executing with the `main` function.
fa: `main` function: برنامه‌های Rust با تابع `main` شروع به اجرا می‌کنند.
ja: `main` 関数（`main` function）: Rust プログラムの実行は `main` 関数で開始されます。
pt_br: função `main`: Programas Rust começam a executar a partir da função `main`.
uk: `main` функція: Rust-програми починають виконуватися з функції `main`.

source: match: A control flow construct in Rust that allows for pattern matching on the value of an expression.
fa: match: یک ساختار جریان کنترلی در Rust که امکان تطبیق الگو بر روی مقدار یک عبارت را فراهم می‌کند.
ja: 一致（match）: 式の値に対するパターン マッチングを可能にする、Rust の制御フロー構造。
pt_br: correspondência: Uma construção de fluxo de controle em Rust que permite a correspondência de padrões no valor de uma expressão.
uk: match: Конструкція потоку керування у Rust, яка дозволяє виконувати шаблонний пошук за значенням виразу.

source: memory leak: A situation where a program fails to release memory that is no longer needed, leading to a gradual increase in memory usage.
fa: memory leak: وضعیتی که در آن برنامه نمی‌تواند حافظه‌ای را که دیگر مورد نیاز نیست آزاد کند و منجر به افزایش تدریجی استفاده از حافظه می‌شود.
ja: メモリリーク（memory leak）: プログラムで不要になったメモリの解放に失敗し、メモリ使用量が徐々に増加する状況。
pt_br: vazamento de memória: Uma situação em que um programa falha em liberar memória que não é mais necessária, levando a um aumento gradual no uso de memória.
uk: витік пам'яті: Ситуація, коли програма не звільнює пам'ять, яка більше не потрібна, що призводить до поступового збільшення використання пам'яті.

source: method: A function associated with an object or a type in Rust.
fa: method: یک تابع مرتبط با یک object یا یک type در Rust.
ja: メソッド（method）: Rust のオブジェクトまたは型に関連付けられた関数。
pt_br: método: Uma função associada a um objeto ou a um tipo em Rust.
uk: метод: Функція, пов'язана з об'єктом або типом у Rust.

source: module: A namespace that contains definitions, such as functions, types, or traits, to organize code in Rust.
fa: module: فضای نامی که شامل تعاریفی مانند توابع، انواع یا صفات برای سازماندهی کد در Rust است.
ja: モジュール（module）: 関数、型、トレイトなどの定義を含む名前空間。Rust でコードを整理するために使用されます。
pt_br: módulo: Um espaço de nomes que contém definições, como funções, tipos ou _traits_, para organizar o código em Rust.
uk: модуль: Простір імен, який містить визначення, такі як функції, типи або трейти, для організації коду в Rust.

source: move: The transfer of ownership of a value from one variable to another in Rust.
fa: move: انتقال مالکیت (ownership) یک مقدار از یک متغیر به متغیر دیگر در Rust.
ja: 移動（move）: Rust である変数から別の変数に値の所有権を移動すること。
pt_br: mover: A transferência de propriedade de um valor de uma variável para outra em Rust.
uk: move: Передача права власності на значення від однієї змінної до іншої у Rust.

source: mutable: A property in Rust that allows variables to be modified after they have been declared.
fa: mutable: یک ویژگی در Rust که به متغیرها اجازه می‌دهد پس از اعلان، اصلاح شوند.
ja: 可変（mutable）: 宣言後の変数の変更を可能にする Rust のプロパティ。
pt_br: mutável: Uma propriedade em Rust que permite que variáveis sejam modificadas depois de terem sido declaradas.
uk: мутабельний: Це властивість у Rust, яка дозволяє змінювати змінні після того, як їх було оголошено.

source: ownership: The concept in Rust that defines which part of the code is responsible for managing the memory associated with a value.
fa: ownership: مفهومی در Rust که مشخص می‌کند کدام قسمت از کد مسئول مدیریت حافظه مرتبط با یک مقدار است.
ja: 所有権（ownership）: 値に関連付けられたメモリの管理をコードのどの部分が担うかを定義する Rust の概念。
pt_br: propriedade (_ownership_): O conceito em Rust que define qual parte do código é responsável por gerenciar a memória associada a um valor.
uk: володіння: Концепція в Rust, яка визначає, яка частина коду відповідає за управління пам'яттю, пов'язаною зі значенням.

source: panic: An unrecoverable error condition in Rust that results in the termination of the program.
fa: panic: یک وضعیت خطای غیرقابل جبران در Rust که منجر به خاتمه برنامه می‌شود.
ja: パニック（panic）: プログラムの終了を引き起こす、Rust の回復不能なエラー状態。
pt_br: pânico: Uma condição de erro irreversível em Rust que resulta no término do programa.
uk: паніка: Невиправна помилка у Rust, яка призводить до завершення роботи програми.

source: parameter: A value that is passed into a function or method when it is called.
fa: parameter: مقداری که هنگام فراخوانی به یک تابع یا متد ارسال می‌شود.
ja: パラメータ（parameter）: 関数またはメソッドが呼び出されたときに渡される値。
pt_br: parâmetro: Um valor que é passado para uma função ou método quando é chamado.
uk: параметр: Значення, яке передається у функцію або метод при її виклику.

source: pattern: A combination of values, literals, or structures that can be matched against an expression in Rust.
fa: pattern: ترکیبی از مقادیر، عبارت‌ها یا ساختارهایی که می‌توانند با یک عبارت در Rust مطابقت داده شوند.
ja: パターン（pattern）: Rust の式と照合できる値、リテラル、構造体の組み合わせ。
pt_br: padrão: Uma combinação de valores, literais ou estruturas que podem ser correspondidos a uma expressão em Rust.
uk: шаблон: Комбінація значень, літералів або структур, які можна зіставити з виразом у Rust.

source: payload: The data or information carried by a message, event, or data structure.
fa: payload: داده یا اطلاعاتی که توسط یک پیام، رویداد یا ساختار داده حمل می‌شود.
ja: ペイロード（payload）: メッセージ、イベント、またはデータ構造体で保持されるデータまたは情報。
pt_br: carga (_payload_): Os dados ou informações transportados por uma mensagem, evento ou estrutura de dados.
uk: корисне навантаження: Дані або інформація, яку несе повідомлення, подія або структура даних.

source: program: A set of instructions that a computer can execute to perform a specific task or solve a particular problem.
fa: program: مجموعه‌ای از دستورالعمل‌هایی که یک کامپیوتر می‌تواند برای انجام یک کار خاص یا حل یک مشکل خاصی اجرا کند.
ja: プログラム（program）: 特定のタスクを実行したり、特定の問題を解決したりするためにコンピュータが実行できる一連の命令。
pt_br: programa: Um conjunto de instruções que um computador pode executar para realizar uma tarefa específica ou resolver um problema particular.
uk: програма: Набір інструкцій, які комп'ютер може виконати, щоб виконати певне завдання або вирішити певну проблему.

source: programming language: A formal system used to communicate instructions to a computer, such as Rust.
fa: مجموعه‌ای از دستورالعمل‌هایی که یک کامپیوتر می‌تواند برای انجام یک کار خاص یا حل یک مشکل خاص اجرا کند.
ja: プログラミング言語（programming language）: コンピュータに命令を伝えるために使用される正式なシステム（Rust など）。
pt_br: linguagem de programação: Um sistema formal usado para comunicar instruções a um computador, como Rust.
uk: мова програмування: Формальна система, що використовується для передачі інструкцій комп'ютеру, наприклад, Rust.

source: receiver: The first parameter in a Rust method that represents the instance on which the method is called.
fa: receiver: اولین پارامتر در متد Rust که نمونه‌ای را نشان می‌دهد که متد در آن فراخوانی می‌شود.
ja: レシーバ（receiver）: メソッドが呼び出されたインスタンスを表す Rust メソッドの最初のパラメータ。
pt_br: receptor: O primeiro parâmetro em um método Rust que representa a instância na qual o método é chamado.
uk: приймач: Перший параметр у методі Rust, який представляє екземпляр, на якому викликається метод.

source: reference counting: A memory management technique in which the number of references to an object is tracked, and the object is deallocated when the count reaches zero.
fa: reference counting: یک تکنیک مدیریت حافظه که در آن تعداد ارجاعات به یک object ردیابی می‌شود و زمانی که شمارش به صفر می‌رسد، object تخصیص داده می‌شود.
ja: 参照カウント（reference counting）: オブジェクトへの参照の数をトラッキングし、カウントがゼロになるとオブジェクトの割り当てを解除するメモリ管理技術。
pt_br: contagem de referências: Uma técnica de gerenciamento de memória na qual o número de referências a um objeto é rastreado, e o objeto é desalocado quando a contagem atinge zero.
uk: підрахунок посилань: Метод керування пам'яттю, в якому відстежується кількість посилань на об'єкт, і об'єкт звільняється, коли цей показник досягає нуля.

source: return: A keyword in Rust used to indicate the value to be returned from a function.
fa: return: یک کلمه کلیدی در Rust برای نشان دادن مقداری که باید از یک تابع برگردانده شود استفاده می‌شود.
ja: 戻り値（return）: 関数から返される値を示すために使用される Rust のキーワード。
pt_br: _return_: Uma palavra-chave em Rust usada para indicar o valor a ser retornado de uma função.
uk: return: Ключове слово у Rust, яке використовується для позначення значення, що повертається з функції.

source: Rust: A systems programming language that focuses on safety, performance, and concurrency.
fa: Rust: یک زبان برنامه‌نویسی سیستمی که بر safety، کارایی و concurrency تمرکز دارد.
ja: Rust: 安全性、パフォーマンス、同時実行に重点を置いたシステム プログラミング言語。
pt_br: Rust: Uma linguagem de programação de sistemas que se concentra em segurança, desempenho e concorrência.
uk: Rust: Мова системного програмування, яка фокусується на безпеці, продуктивності та одночасності виконання.

source: Rust Fundamentals: Days 1 to 4 of this course.
fa: Rust Fundamentals: روزهای ۱ تا ۴ این دوره.
uk: Основи Rust: Дні з 1 по 4 цього курсу.

source: Rust in Android: See [Rust in Android](android.md).
fa: Rust در Android: این [Rust in Android](android.md) را ببینید.
ja: Android での Rust（Rust in Android）: [Android での Rust](android.md) をご覧ください。
pt_br: Rust no Android: Veja [Rust no Android](android.md).
uk: Rust в Android: Дивіться [Rust в Android](android.md).

source: Rust in Chromium: See [Rust in Chromium](chromium.md).
fa: ‏ Rust در Chromium: ‏ [Rust in Chromium](chromium.md) را ببینید.
ja: Chromium での Rust（Rust in Chromium）: [Chromium での Rust](chromium.md) をご覧ください。
pt_br: Rust no Chromium: Veja [Rust no Chromium](chromium.md).
uk: Rust в Chromium: Дивіться [Rust в Chromium](chromium.md).

source: safe: Refers to code that adheres to Rust's ownership and borrowing rules, preventing memory-related errors.
fa: safe: به کدی اشاره دارد که به قوانین مالکیت (ownership) در زبان Rust و قرض‌گرفتن (borrowing) پایبند است و از خطاهای مربوط به حافظه جلوگیری می‌کند.
ja: 安全（safe）: Rust の所有権と借用に関するルールに従って、メモリ関連のエラーを防止するコードを指します。
pt_br: seguro (_safe_): Refere-se a código que adere às regras de propriedade e empréstimo de Rust, prevenindo erros relacionados à memória.
uk: безпечний: Відноситься до коду, який дотримується правил власності та запозичень Rust, запобігаючи помилкам, пов'язаним з пам'яттю.

source: scope: The region of a program where a variable is valid and can be used.
fa: scope: منطقه‌ای از یک برنامه که در آن یک متغیر معتبر است و می‌توان از آن استفاده کرد.
ja: スコープ（scope）: 変数が有効かつ使用可能なプログラムの領域。
pt_br: escopo: A região de um programa onde uma variável é válida e pode ser usada.
uk: область видимості: Область програми, де змінна є дійсною і може бути використана.

source: standard library: A collection of modules providing essential functionality in Rust.
fa: standard library: مجموعه‌ای از ماژول‌ها که عملکردهای ضروری را در Rust ارائه می‌دهند.
ja: 標準ライブラリ（standard library）: Rust の必須機能を提供するモジュールのコレクション。
pt_br: biblioteca padrão: Uma coleção de módulos que fornecem funcionalidades essenciais em Rust.
uk: стандартна бібліотека: Колекція модулів, що забезпечують необхідну функціональність у Rust.

source: static: A keyword in Rust used to define static variables or items with a `'static` lifetime.
fa: static: یک کلمه کلیدی در Rust برای تعریف متغیرهای ثابت یا موارد با طول عمر `'static` استفاده می‌شود.
ja: 静的（static）: 静的な変数や `'static` ライフタイムを持つアイテムを定義するために使用される Rust のキーワード。
pt_br: static: Uma palavra-chave em Rust usada para definir variáveis estáticas ou itens com um tempo de vida `'static`.
uk: static: Ключове слово у Rust, що використовується для визначення статичних змінних або елементів зі `'static` часом життя.

source: string: A data type storing textual data. See [Strings](references/strings.html) for more.
fa: string: نوع داده‌ای که داده‌های متنی را ذخیره می‌کند. برای اطلاعات بیشتر به [Strings](references/strings.html) مراجعه کنید.
uk: string: Тип даних, що зберігає текстові дані. Дивіться [Strings](references/strings.html) для отримання додаткової інформації.

source: struct: A composite data type in Rust that groups together variables of different types under a single name.
fa: struct: یک نوع داده ترکیبی در Rust که متغیرهای انواع مختلف را تحت یک نام واحد جمع می‌کند.
ja: 構造体（struct）: 異なる型の変数を 1 つの名前でグループ化する Rust の複合データ型。
pt_br: estrutura (_struct_): Um tipo de dado composto em Rust que agrupa variáveis de diferentes tipos sob um único nome.
uk: struct: Комбінований тип даних у Rust, який об'єднує змінні різних типів під одним іменем.

source: test: A Rust module containing functions that test the correctness of other functions.
fa: test: یک ماژول Rust حاوی توابعی که صحت عملکردهای دیگر را آزمایش می‌کند.
ja: テスト（test）: 他の関数の正しさをテストする関数を含む Rust モジュール。
pt_br: _test_: Um módulo Rust contendo funções que testam a correção de outras funções.
uk: test: Модуль Rust, що містить функції, які перевіряють коректність інших функцій.

source: thread: A separate sequence of execution in a program, allowing concurrent execution.
fa: thread: دنباله‌ای جداگانه از اجرا در یک برنامه که امکان اجرای همزمان را فراهم می‌کند.
ja: スレッド（thread）: 同時実行を可能にする、プログラム内の独立した実行シーケンス。
pt_br: _thread_: Uma sequência de execução separada em um programa, permitindo execução concorrente.
uk: потік: Окрема послідовність виконання в програмі, що дозволяє одночасне виконання.
