Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Note that unsafe code is allowed within an unsafe function without an `unsafe` block. We can prohibit this with `#[deny(unsafe_op_in_unsafe_fn)]`. Try adding it and see what happens.
es: Ten en cuenta que el código inseguro se admite en una función insegura sin un bloque `unsafe`. Podemos prohibirlo con `#[deny(unsafe_op_in_unsafe_fn)]`. Prueba a añadirlo para ver qué ocurre.
ko: 안전하지 않은(unsafe) 코드가 안전하지 않은(unsafe) 함수의 내부에서 호출될 경우에는 `unsafe`블록을 지정하지 않아도 됩니다. `unsafe`블록을 항상 지정하도록 하고 싶다면 `#[deny(unsafe_op_in_unsafe_fn)]`를 이용하세요. 이 어트리뷰트를 추가해 보고 어떤 일이 일어나는지 확인해 보세요.

source: Calling External Code
es: Llamar a código externo
ko: 외부 코드 호출

source: Functions from other languages might violate the guarantees of Rust. Calling them is thus unsafe:
es: Es posible que las funciones de otros lenguajes infrinjan las garantías de Rust. Por lo tanto, no es seguro llamarlas:
ko: 다른 언어의 함수는 러스트의 보증을 위반할 수 있습니다. 따라서 이를 호출하는 것은 안전하지 않습니다:

source: This is usually only a problem for extern functions which do things with pointers which might violate Rust's memory model, but in general any C function might have undefined behaviour under any arbitrary circumstances.
es: Esto solo suele suponer un problema para las funciones externas que hacen cosas con punteros que pueden infringir el modelo de memoria de Rust pero, en general, cualquier función C puede tener un comportamiento indefinido bajo cualquier circunstancia arbitraria.
ko: 이게 문제가 되는 경우는 대부분 외부 함수가 러스트의 메모리 모델을 위반하고 있을 경우입니다. 그러나 어떤 C함수라도 어떤 임의의 상황에서는 정의되지 않은 동작을 할 수 있기 때문에, 엄밀히 말해서는 모든 외부 함수에 대해서 문제입니다.

source: Day 3: Afternoon Exercises
es: Día 3: ejercicios de la tarde
ko: 3일차 오후 연습문제

source: Let us build a safe wrapper for reading directory content!
es: Vamos a crear un envoltorio seguro para leer el contenido del directorio.
ko: 디렉터리의 내용을 읽는 안전한 래퍼 코드를 작성해 봅시다!

source: For this exercise, we suggest using a local dev environment instead of the Playground. This will allow you to run your binary on your own machine.
es: Para este ejercicio, recomendamos utilizar un entorno de desarrollo local, en lugar del playground. De este modo, podrás ejecutar tu binario en tu propia máquina.
ko: 이번 연습에서는, 플레이그라운드 대신 로컬 개발 환경을 사용해서, 여러분의 컴퓨터에서 바이너리를 직접 수행해 보세요.

source: To get started, follow the [running locally](../../cargo/running-locally.md) instructions.
es: Para empezar, sigue las instrucciones para [ejecutar a nivel local](../../cargo/running-locally.md).
ko: 시작하기 위해, [로컬 환경에서 수행하기](../../cargo/running-locally.md)를 따르세요.

source: After looking at the exercise, you can look at the [solution](solutions-afternoon.md) provided.
es: Después de realizar el ejercicio, puedes consultar la [solución](solutions-afternoon.md) proporcionada.
ko: 연습문제를 살펴 본 후, 제공된 [해답](solutions-afternoon.md)을 살펴볼 수 있습니다.

source: Rust has great support for calling functions through a _foreign function interface_ (FFI). We will use this to build a safe wrapper for the `libc` functions you would use from C to read the filenames of a directory.
es: Rust ofrece una gran asisencia para llamar a funciones a través de una _interfaz de función externa_ (FFI). Usaremos esto para crear un envoltorio seguro para las funciones `libc` que usarías desde C para leer los nombres de archivo de un directorio.
ko: 러스트는 \_외부 기능 호출(FFI)\_을 지원합니다. 우리는 이를 이용하여 디렉터리에서 파일 이름을 읽어오는 `libc` 함수에 대한 안전한 래퍼를 만들 것입니다.

source: `&CStr` to `&[u8]`: a slice of bytes is the universal interface for "some unknow data",
es: De `&CStr` a `&[u8]`: un slice de bytes es la interfaz universal para "algunos datos desconocidos".
ko: `&CStr`에서 `&[u8]`로의 변환: 바이트 슬라이스는 "알수없는 데이터"에 대한 일반적인 인터페이스입니다,

source: Rust is supported for native platform development on Android. This means that you can write new operating system services in Rust, as well as extending existing services.
es: Rust es compatible con el desarrollo de plataformas nativas en Android. Esto significa que puedes escribir nuevos servicios del sistema operativo en Rust, así como ampliar los que ya existen.
ko: 러스트는 안드로이드 네이티브 플랫폼 개발을 지원합니다. 기존의 OS 서비스를 확장하거나, 새로운 서비스를 만드는데 러스트를 쓸 수 있습니다.

source: We will be using an Android Virtual Device to test our code. Make sure you have access to one or create a new one with:
es: Utilizaremos un dispositivo Android virtual para probar el código. Asegúrate de que tienes acceso a uno o créalo con:
ko: 안드로이드 가상 디바이스(Android Virtual Device)를 사용하여 여러분의 코드를 수행할 겁니다. 새로운 가상 디바이스를 생성하려면 아래의 명령어를 사용하세요:

source: ```rust,ignore //! Rust demo. use greetings::greeting; use textwrap::fill; /// Prints a greeting to standard output. fn main() { println!("{}", fill(&greeting("Bob"), 24)); } ```
es: ```rust,ignore //! Rust demo. use greetings::greeting; use textwrap::fill; /// Imprime un saludo en una salida estándar. fn main() { println!("{}", fill(&greeting("Bob"), 24)); } ```
ko: ```rust,ignore //! Rust 데모입니다. use greetings::greeting; use textwrap::fill; /// 인사말을 표준 출력으로 인쇄합니다. fn main() { println!("{}", fill(&greeting("Bob"), 24)); } ```

source: ```rust,ignore //! Greeting library. /// Greet `name`. pub fn greeting(name: &str) -> String { format!("Hello {name}, it is very nice to meet you!") } ```
es: ```rust,ignore //! Greeting library. /// Saludar a `name`. pub fn greeting(name: &str) -> String { format!("Hello {name}, it is very nice to meet you!") } ```
ko: ```rust,ignore //! 인사말 라이브러리입니다. /// `이름`에게 인사합니다. pub fn greeting(name: &str) -> String { format!("Hello {name}, it is very nice to meet you!") } ```

source: See the [CXX tutorial](https://cxx.rs/tutorial.html) for an full example of using this.
es: Consulta el [tutorial de CXX](https://cxx.rs/tutorial.html) para ver un ejemplo completo de su uso.
ko: 사용하는 방법에 대해서는[CXX 튜토리얼](https://cxx.rs/tutorial.html) 를 참조합니다.

source: At this point, the instructor should switch to the [CXX tutorial](https://cxx.rs/tutorial.html).
es: En este punto, el instructor debería cambiar al [tutorial de CXX](https://cxx.rs/tutorial.html).

source: Walk the students through the tutorial step by step.
es: Guía a los estudiantes a través del tutorial paso a paso.

source: Highlight how CXX presents a clean interface without unsafe code in _both languages_.
es: Destaca cómo CXX presenta una interfaz limpia sin código inseguro en _ambos lenguajes_.

source: Show the correspondence between [Rust and C++ types](https://cxx.rs/bindings.html):
es: Muestra la correspondencia entre [los tipos de Rust y C++](https://cxx.rs/bindings.html):

source: Explain how a Rust `String` cannot map to a C++ `std::string` (the latter does not uphold the UTF-8 invariant). Show that despite being different types, `rust::String` in C++ can be easily constructed from a C++ `std::string`, making it very ergonomic to use.
es: Explica que una `String` de Rust no puede asignarse a una `std::string` de C++ (esta última no mantiene la invariante UTF-8). Muestra que, a pesar de ser tipos diferentes, `rust::String` en C++ se puede construir fácilmente a partir de una `std::string` de C++, lo que la hace muy ergonómica de usar.

source: Explain that a Rust function returning `Result<T, E>` becomes a function which throws a `E` exception in C++ (and vice versa).
es: Explica que una función de Rust que devuelve `Result<T, E>` se convierte en una función que lanza una excepción `E` en C++ (y viceversa).

source: Finally, we can call this function from Java:
es: Por último, podemos llamar a esta función desde Java:
ko: 자바에서 이 함수를 호출 할 수 있습니다:

source: ```rust,editable,compile_fail #![no_main] #![no_std] extern crate alloc; extern crate panic_halt as _; use alloc::string::ToString; use alloc::vec::Vec; use buddy_system_allocator::LockedHeap; #[global_allocator] static HEAP_ALLOCATOR: LockedHeap<32> = LockedHeap::<32>::new(); static mut HEAP: [u8; 65536] = [0; 65536]; pub fn entry() { // Safe because `HEAP` is only used here and `entry` is only called once. unsafe { // Give the allocator some memory to allocate. HEAP_ALLOCATOR .lock() .init(HEAP.as_mut_ptr() as usize, HEAP.len()); } // Now we can do things that require heap allocation. let mut v = Vec::new(); v.push("A string".to_string()); } ```
es: ```rust,editable,compile_fail #![no_main] #![no_std] extern crate alloc; extern crate panic_halt as _; use alloc::string::ToString; use alloc::vec::Vec; use buddy_system_allocator::LockedHeap; #[global_allocator] static HEAP_ALLOCATOR: LockedHeap<32> = LockedHeap::<32>::new(); static mut HEAP: [u8; 65536] = [0; 65536]; pub fn entry() { // Safe because `HEAP` is only used here and `entry` is only called once. unsafe { // Give the allocator some memory to allocate. HEAP_ALLOCATOR .lock() .init(HEAP.as_mut_ptr() as usize, HEAP.len()); } // Ahora podemos hacer cosas que requieran asignación de _heap_. let mut v = Vec::new(); v.push("A string".to_string()); } ```
ko: ```rust,editable,compile_fail #![no_main] #![no_std] extern crate alloc; extern crate panic_halt as _; use alloc::string::ToString; use alloc::vec::Vec; use buddy_system_allocator::LockedHeap; #[global_allocator] static HEAP_ALLOCATOR: LockedHeap<32> = LockedHeap::<32>::new(); static mut HEAP: [u8; 65536] = [0; 65536]; pub fn entry() { // Safe because `HEAP` is only used here and `entry` is only called once. unsafe { // Give the allocator some memory to allocate. HEAP_ALLOCATOR .lock() .init(HEAP.as_mut_ptr() as usize, HEAP.len()); } // 이제 힙 할당이 필요한 작업을 실행할 수 있습니다. let mut v = Vec::new(); v.push("A string".to_string()); } ```

source: Timers
es: Temporizadores
ko: 타이머

source: and JTAG via CMSIS-DAP, ST-Link and J-Link probes
es: y JTAG a través de comprobaciones CMSIS-DAP, ST-Link y J-Link
ko: 및 JTAG(CMSIS-DAP, ST-Link, J-Link 프로브를 통함)

source: GDB stub and Microsoft
es: GDB stub y el servidor
ko: GDB 스텁 및 Microsoft

source: server
es: de Microsoft
ko: 서버

source: `cargo-embed` is a cargo subcommand to build and flash binaries, log
es: `cargo-embed` es un subcomando de Cargo para compilar e instalar binarios, registrar salidas
ko: `cargo-embed`는 cargo의 서브 커맨트로써, 바이너리를 빌드하고 플래시하며,

source: RTT
es: TTR

source: output and connect GDB. It's configured by an `Embed.toml` file in your project directory.
es: y conectar GDB. Se configura mediante un archivo `Embed.toml` en el directorio del proyecto.
ko: 출력을 기록하고, GDB를 연결해 줍니다. 이 명령어의 세부 동작은 프로젝트 디렉터리의 `Embed.toml` 파일을 통해 설정합니다.

source: `Cargo.toml` (you shouldn't need to change this):
es: `Cargo.toml` (no debería ser necesario cambiarlo):

source: `Embed.toml` (you shouldn't need to change this):
es: `Embed.toml` (no debería ser necesario cambiarlo):

source: `.cargo/config.toml` (you shouldn't need to change this):
es: `.cargo/config.toml` (no debería ser necesario cambiarlo):

source: Sometimes we need to use assembly to do things that aren't possible with Rust code. For example, to make an
es: A veces necesitamos usar el ensamblador para hacer cosas que no son posibles con código Rust. Por ejemplo, hacer un
ko: 가끔 Rust 코드로는 구현이 불가능한 작업들이 있으며, 이 경우 어셈블리를 사용해야 합니다. 예를 들어 펌웨어를 향해서 시스템 전원을 끄라고

source: to tell the firmware to power off the system:
es: para decirle al firmware que apague el sistema:
ko: 를 호출하는 방법은 다음과 같습니다.

source: `spin` also has a ticket lock mutex implementation; equivalents of `RwLock`, `Barrier` and `Once` from `std::sync`; and `Lazy` for lazy initialisation.
es: `spin` también cuenta con una implementación de exclusión mutua de bloqueo de tickets; equivalentes de `RwLock`, `Barrier` y `Once` de `std::sync`, y `Lazy` para inicialización perezosa
ko: `spin`에는 티켓 잠금 뮤텍스 구현도 있습니다. `std::sync`의 `RwLock`, `Barrier`, `Once` 에 해당하는 것들이 제공되며, 지연된 초기화를 위한 `Lazy`에 해당하는 것도 제공됩니다.

source: `src/exceptions.rs` (you should only need to change this for the 3rd part of the exercise):
es: `src/exceptions.rs` (solo se debería cambiar esto en la tercera parte del ejercicio):

source: `src/logger.rs` (you shouldn't need to change this):
es: `src/logger.rs` (no debería ser necesario cambiarlo):

source: `src/pl011.rs` (you shouldn't need to change this):
es: `src/pl011.rs` (no debería ser necesario cambiarlo):

source: `build.rs` (you shouldn't need to change this):
es: `build.rs` (no debería ser necesario cambiarlo):

source: `entry.S` (you shouldn't need to change this):
es: `entry.S` (no debería ser necesario cambiarlo):

source: `exceptions.S` (you shouldn't need to change this):
es: `exceptions.S` (no debería ser necesario cambiarlo):

source: `idmap.S` (you shouldn't need to change this):
es: `idmap.S` (no debería ser necesario cambiarlo):

source: `image.ld` (you shouldn't need to change this):
es: `image.ld` (no debería ser necesario cambiarlo):

source: `Makefile` (you shouldn't need to change this):
es: `Makefile` (no debería ser necesario cambiarlo):

source: Notice that the thread is stopped before it reaches 10 — the main thread is not waiting.
es: Observa que el hilo se detiene antes de llegar a 10; el hilo principal no está esperando.
ko: 메인 스레드가 자식 스레드를 기다리지 않기 때문에 자식 스레드의 for문은 10까지 가지 않습니다.

source: How does Rust know to forbid shared access across thread? The answer is in two traits:
es: ¿Cómo sabe Rust que debe prohibir el acceso compartido entre hilos? La respuesta está en dos traits:
ko: 러스트는 어떻게 해서 스레드 간에 특정 데이터 타입이 공유될 수 있거나, 안된다는 것을 알까요? 정답은 다음 두 트레잇에 있습니다:

source: `MutexGuard<T>`: Uses OS level primitives which must be deallocated on the thread which created them.
es: `MutexGuard<T>`: utiliza primitivos de nivel SO que se deben desasignar en el hilo que los creó.
ko: `MutexGuard<T>`: 내부적으로, 운영체제가 제공하는 primitive를 사용하는데, 이 primitive는 생성된 스레드에서 해제가 이루어져야 합니다. (_역주_: 그래서 다른 스레드로 옮길 수 없습니다.)

source: [`Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html) ensures mutual exclusion _and_ allows mutable access to `T` behind a read-only interface:
es: [`Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html) asegura la exclusión mutua _y_ permite un acceso mutable a `T` a través de una interfaz de solo lectura:
ko: [`Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html)를 이용하면 불변 참조를 통해서도 `T`의 값을 수정할 수가 있으며, _이에 더해서_ 한 번에 한 스레드만 `T`의 값을 접근(읽거나 쓰거나)함을 보장해 줍니다:

source: `Mutex` in Rust looks like a collection with just one element - the protected data.
es: `Mutex` en Rust parece una colección con un solo elemento: los datos protegidos.

source: A read-write lock counterpart - `RwLock`.
es: Un equivalente de bloqueo de lectura y escritura: `RwLock`.

source: Why does `lock()` return a `Result`?
es: ¿Por qué `lock()` devuelve un `Result`?

source: The "async" keyword is syntactic sugar. The compiler replaces the return type with a future.
es: La palabra clave "async" es azúcar sintáctico. El compilador sustituye el tipo de resultado devuelto por un futuro.
ko: "async" 키워드는 문법 설탕(syntactic sugar)입니다. 컴파일러가 리턴 타입을 future로 바꿉니다.

source: You need an executor to run async code. `block_on` blocks the current thread until the provided future has run to completion.
es: Se necesita un ejecutor para ejecutar el código asíncrono. `block_on` bloquea el hilo hasta que se complete el futuro proporcionado.
ko: 비동기 코드를 실행하려면 실행자(executor)가 필요합니다. `block_on` 실행자는 제공된 future가 완료될 때까지 현재 스레드를 블록합니다.

source: `.await` can only be used inside an `async` function (or block; these are introduced later).
es: `.await` solo se puede usar dentro de una función `async` (o bloqueo; estos se verán más tarde).
ko: `.await`는 `async` 함수(또는 나중에 소개될 `async` 블록) 안에서만 사용할 수 있습니다.

source: Tokio provides:
es: Tokio ofrece lo siguiente:
ko: Tokio는 다음을 제공합니다.

source: This is the first time we've seen an `async` block. This is similar to a closure, but does not take any arguments. Its return value is a Future, similar to an `async fn`.
es: Esta es la primera vez que vemos un bloque `async`. Es similar a un cierre, pero no acepta argumentos. Su valor devuelto es un futuro, similar a `async fn`.
ko: `async` 블록을 처음 보게 되었습니다. 이것은 클로저와 비슷하지만 인자를 받지 않습니다. 리턴 타입은 `async fn`과 비슷한 Future입니다.

source: The risk of `join` is that one of the futures may never resolve, this would cause your program to stall.
es: El riesgo que supone 'join' es que puede que uno de los futuros no se resuelva nunca, causando que el programa se bloquee.
ko: 'join'의 위험성은 futures들 중 하나가 영영 끝나지 않을 수도 있다는 것입니다. 그러면 프로그램이 더이상 진행을 못하고 멈춰있을(stall) 수 있습니다.

source: Similar to a match statement, the body of `select!` has a number of arms, each of the form `pattern = future => statement`. When the `future` is ready, the `statement` is executed with the variables in `pattern` bound to the `future`'s result.
es: Al igual que en el caso de una instrucción _match_, el cuerpo de `select!` tiene una serie de brazos, cada uno de los cuales tiene la forma `pattern = future => statement`. Cuando `future` está listo, la instrucción se ejecuta con las variables de `pattern` vinculadas al resultado de `future`.
ko: `select!` 안에는, `match`문과 비슷하게, `pattern = future => statement` 형태의 브랜치(arm) 들이 있습니다. 어떤 'future'가 진행 가능 상태가 되면 '그 `future`의 결과값이 `pattern`으로 바인딩 되며, 그 상태에서 \`statement'가 수행됩니다.

source: When you await a future, all local variables (that would ordinarily be stored on a stack frame) are instead stored in the Future for the current async block. If your future has pointers to data on the stack, those pointers might get invalidated. This is unsafe.
es: Cuando esperas un futuro, todas las variables locales (que normalmente se almacenarían en un marco de pila) se almacenan en el futuro del bloque asíncrono. Si tu futuro tiene punteros en datos de la pila, podrían invalidarse. Es una acción insegura.
ko: Future에 대해 `await`를 호출하여 그 future가 준비되기를 기다릴 때, 모든 로컬 변수(일반적으로 스택 프레임에 저장됨)는 그 future객체 안에 저장됩니다. 만약 그 future에 스택에 있는 어떤 데이터로의 포인터가 있으면 이러한 포인터는 올바르지 않을 수 있습니다. 안전하지 않습니다.

source: Therefore, you must guarantee that the addresses your future points to don't change. That is why we need to `pin` futures. Using the same future repeatedly in a `select!` often leads to issues with pinned values.
es: Por lo tanto, debes asegurarte de que las direcciones a las que apunta el futuro no cambien. Por ese motivo debemos fijar (`pin`) los futuros. Si se usa el mismo futuro varias veces en un `select!`, se suelen producir problemas en los valores fijados.
ko: 따라서 future가 가리키는 주소가 변경되지 않도록 해야 합니다. 이것이 future를 `pin`(고정)해야 하는 이유입니다. `select!`에서 동일한 future를 반복적으로 사용하면 고정 값 문제가 발생하는 경우가 많습니다.

source: Dining Philosophers - Async
es: La Cena de Filósofos - Async

source: Can you make your implementation single-threaded?
es: ¿Puedes conseguir que tu implementación tenga un solo hilo?

source: [SinkExt::send()](https://docs.rs/futures-util/0.3.28/futures_util/sink/trait.SinkExt.html#method.send) implemented by `WebsocketStream`: for asynchronously sending messages on a Websocket Stream.
es: [SinkExt::send()](https://docs.rs/futures-util/0.3.28/futures_util/sink/trait.SinkExt.html#method.send) implementado por `WebsocketStream`: permite enviar mensajes de forma asíncrona a través de un flujo WebSocket.

source: Normally in a Cargo project, you can have only one binary, and one `src/main.rs` file. In this project, we need two binaries. One for the client, and one for the server. You could potentially make them two separate Cargo projects, but we are going to put them in a single Cargo project with two binaries. For this to work, the client and the server code should go under `src/bin` (see the [documentation](https://doc.rust-lang.org/cargo/reference/cargo-targets.html#binaries)).
es: Normalmente, en un proyecto de Cargo, solo puedes tener un archivo binario y un archivo `src/main.rs`. En este proyecto, se necesitan dos binarios, uno para el cliente y otro para el servidor. Puedes convertirlos en dos proyectos de Cargo independientes, pero los incluiremos en un solo proyecto de Cargo con dos binarios. Para que funcione, el código del cliente y del servidor deben aparecer en `src/bin` (consulta la [documentación](https://doc.rust-lang.org/cargo/reference/cargo-targets.html#binaries)).

source: Copy the following server and client code into `src/bin/server.rs` and `src/bin/client.rs`, respectively. Your task is to complete these files as described below.
es: Copia el fragmento de código del servidor y del cliente que aparecen más abajo en `src/bin/server.rs` y `src/bin/client.rs`, respectivamente. Tu tarea es completar estos archivos como se describe a continuación.

source: You will find solutions to the exercises on the following pages.
es: En las páginas siguientes encontrarás las soluciones a los ejercicios.
ko: 연습문제의 해답은 다음 페이지에서 확인할 수 있습니다.

source: Feel free to ask questions about the solutions [on GitHub](https://github.com/google/comprehensive-rust/discussions). Let us know if you have a different or better solution than what is presented here.
es: No dudes en hacer preguntas sobre las soluciones [en GitHub](https://github.com/google/comprehensive-rust/discussions). Ponte en contacto con nosotros si tienes una solución distinta o mejor de la que se presenta aquí.
ko: [깃허브](https://github.com/google/comprehensive-rust/discussions)에서 이에 대해 자유롭게 질문하시고 더 나은 솔루션이 있다면 알려주시기 바랍니다.

source: **Note:** Please ignore the `// ANCHOR: label` and `// ANCHOR_END: label` comments you see in the solutions. They are there to make it possible to re-use parts of the solutions as the exercises.
es: **Nota:** Ignora los comentarios `// ANCHOR: label` y `// ANCHOR_END: label` que aparecen en las soluciones. Están ahí para que sea posible reutilizar algunas partes de las soluciones de los ejercicios.
ko: **참고:** `// ANCHOR: label`과 `// ANCHOR_END: label` 주석은 문제를 구성하기 위한 메타 주석으로 무시하시면 됩니다.

source: Day 1 Morning Exercises
es: Día 1: Ejercicios de la Mañana
ko: 1일차 오전 연습문제

source: ([back to exercise](for-loops.md))
es: ([Volver al ejercicio](for-loops.md))

source: Bonus question
es: Pregunta extra
ko: 보너스 문제

source: It requires more advanced concepts. It might seem that we could use a slice-of-slices (`&[&[i32]]`) as the input type to transpose and thus make our function handle any size of matrix. However, this quickly breaks down: the return type cannot be `&[&[i32]]` since it needs to own the data you return.
es: Requiere conceptos más avanzados. Es posible que parezca que se puede utilizar un slice de slices (`&[&[i32]]`) como tipo de entrada para hacer una trasposición y así lograr que nuestra función controle cualquier tamaño de matriz. Sin embargo, esto se viene abajo rápidamente: el tipo de resultado devuelto no puede ser `&[&[i32]]`, ya que necesita ser el propietario de los datos que devuelve.
ko: 사실 이 문제는 고급 개념이 필요합니다. 슬라이스의 슬라이스(slice-of-slices, `&[&[i32]]`)를 입력 타입으로 사용하면 모든 크기의 행렬을 처리할 수 있을것 같습니다. 하지만 실제로 해보면 금방 안된다는 걸 알 수 있습니다. 반환값을 소유해야 하기때문에 `&[&[i32]]` 반환 타입으로 사용할 수 없습니다.

source: You can attempt to use something like `Vec<Vec<i32>>`, but this doesn't work out-of-the-box either: it's hard to convert from `Vec<Vec<i32>>` to `&[&[i32]]` so now you cannot easily use `pretty_print` either.
es: Puedes probar a utilizar algo como `Vec<Vec<i32>>`, pero esto tampoco funciona desde el principio: es difícil cambiar de `Vec<Vec<i32>>` a `&[&[i32]]`, por lo que tampoco puedes usar `pretty_print` de forma sencilla.
ko: `Vec<Vec<i32>>`와 같은 타입을 사용하려고 시도할 수도 있지만 역시 쉽게 되진 않습니다. `Vec<Vec<i32>>` 타입을 `&[&[i32]]`로 변환하는 것이 어렵기 때문에 `pretty_print`을 사용하는데 어려움이 있습니다.

source: Once we get to traits and generics, we'll be able to use the [`std::convert::AsRef`](https://doc.rust-lang.org/std/convert/trait.AsRef.html) trait to abstract over anything that can be referenced as a slice.
es: Una vez que veamos los traits y los genéricos, podremos usar el trait [`std::convert::AsRef`](https://doc.rust-lang.org/std/convert/trait.AsRef.html) para abstraer cualquier elemento que se pueda referenciar, como un slice.
ko: 트레잇나 제네릭을 다루고 나면 [`std::convert::AsRef`](https://doc.rust-lang.org/std/convert/trait.AsRef.html) 트레잇을 사용하여 슬라이스처럼 사용될 수 있는 타입을 추상화할 수 있습니다.
