Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: This compiles, but once the timeout expires it is `Poll::Ready` on every iteration (a fused future would help with this). Update to reset `timeout_fut` every time it expires:
fa: این مورد کامپایل می‌شود، اما پس از انقضای timeout و در هر تکرار برابر با `Poll::Ready` است (future ترکیبی به این مسئله کمک می‌کند). به‌روزرسانی برای بازنشانی `timeout_fut` هر بار که منقضی می‌شود:
uk: Це компілюється, але після закінчення часу очікування на кожній ітерації відображається `Poll::Ready` (злитий ф'ючерс міг би допомогти в цьому). Оновіть, щоб скидати `timeout_fut` кожного разу, коли він спливає:

source: Box allocates on the heap. In some cases, `std::pin::pin!` (only recently stabilized, with older code often using `tokio::pin!`) is also an option, but that is difficult to use for a future that is reassigned.
es: Box se asigna en el montículo. En algunos casos, `std::pin::pin!` (solo si se ha estabilizado recientemente, con código antiguo que suele utilizar `tokio::pin!`) también es una opción, pero difícil de utilizar en un futuro que se reasigna.
ja: Box でヒープに割り当てます。場合によっては `std::pin::pin!`（最近安定化されたばかりで、古いコードでは多くの場合に `tokio::pin!` を使用します）も使用できますが、再割り当てされる Future に使用することは困難です。
ko: Box는 힙에 할당합니다. 경우에 따라 `std::pin::pin!`(최근에야 안정화되었으며 이전 코드는 `tokio::pin!`을 사용하는 경우가 많음)도 사용할 수 있지만 이는 재할당된 future에 사용하기가 어렵습니다.
pt_br: O _Box_ aloca na pilha. Em alguns casos, `std::pin::pin!` (apenas recentemente estabilizado, com código mais antigo frequentemente usando `tokio::pin!`) também é uma opção, mas é difícil de usar para uma _future_ que é reatribuída.
uk: Box виділяє у купі. У деяких випадках, `std::pin::pin!` (лише нещодавно стабілізовано, у старому коді часто використовується `tokio::pin!`) також є варіантом, але його важко використовувати для фьючерсів, які перепризначено.

source: Another alternative is to not use `pin` at all but spawn another task that will send to a `oneshot` channel every 100ms.
es: Otra alternativa es no utilizar `pin`, sino generar otra tarea que se enviará a un canal de `oneshot` cada 100 ms.
fa: جایگزین دیگر این است که به هیچ وجه از `pin` استفاده نکنید، بلکه task دیگری ایجاد کنید که هر 100 میلی‌ثانیه به یک کانال `oneshot` ارسال می‌شود.
ja: 別の方法としては、`pin` をまったく使用せずに、100 ミリ秒ごとに `oneshot` チャネルに送信する別のタスクを生成するという方法もあります。
ko: 또 다른 방법은 `pin`을 아예 사용하지 않고 100ms마다 `oneshot` 채널에 전송할 다른 작업을 생성하는 것입니다.
pt_br: Outra alternativa é não usar `pin` de forma alguma, mas iniciar outra tarefa que enviará para um canal `oneshot` a cada 100ms.
uk: Інша альтернатива — взагалі не використовувати `pin`, а створювати інше завдання, яке буде надсилати на канал `oneshot` кожні 100 мс.

source: Data that contains pointers to itself is called self-referential. Normally, the Rust borrow checker would prevent self-referential data from being moved, as the references cannot outlive the data they point to. However, the code transformation for async blocks and functions is not verified by the borrow checker.
fa: داده‌هایی که حاوی اشاره‌گرهایی به خود هستند، خود ارجاعی ( self-referential) نامیده می شوند. به طور معمول، Rust borrow checker از جابجایی داده‌های خودارجاعی جلوگیری می‌کند، زیرا منابع نمی‌توانند بیشتر از داده‌هایی که به آنها اشاره می‌کنند زنده بمانند. با‌این‌حال، تبدیل کد برای بلوک‌ها و توابع async توسط borrow checker تأیید نمی‌شود.
ja: それ自体へのポインタを含むデータは、自己参照と呼ばれます。通常、Rust 借用チェッカーは、参照が参照先のデータより長く存続できないため、自己参照データの移動を防ぎます。ただし、非同期ブロックと関数のコード変換は、借用チェッカーによって検証されません。
uk: Дані, які містять вказівники на себе, називаються самопосилальними. Зазвичай, перевірка запозичень у Rust запобігає переміщенню самопосилань, оскільки посилання не можуть пережити дані, на які вони вказують. Однак, перетворення коду для асинхронних блоків і функцій не перевіряється перевіркою запозичень.

source: `Pin` is a wrapper around a reference. An object cannot be moved from its place using a pinned pointer. However, it can still be moved through an unpinned pointer.
fa: ‏ `Pin` یک wrapper در اطراف یک reference است. یک object را نمی‌توان با استفاده از یک pointer پین شده از جای خود حرکت داد. با این حال، هنوز هم می‌توان آن را از طریق یک pointer بدون پین جابجا کرد.
ja: `Pin` は参照のラッパーです。固定されたポインタを使用して、オブジェクトをその場所から移動することはできません。ただし、固定されていないポインタを介して移動することは可能です。
uk: `Pin` - це обгортка навколо вказівника. Об'єкт не можна перемістити з його місця за допомогою закріпленого вказівника. Однак, його можна переміщати за допомогою незакріпленого вказівника.

source: The `poll` method of the `Future` trait uses `Pin<&mut Self>` instead of `&mut Self` to refer to the instance. That's why it can only be called on a pinned pointer.
fa: متد `poll` از ویژگی `Future` از `Pin<&mut Self>` به جای `&mut Self` برای اشاره به نمونه (instance) استفاده می‌‌کند. به همین دلیل است که فقط می‌توان آن را روی یک اشاره‌‌گر پین شده فراخوانی کرد.
ja: `Future` トレイトの `poll` メソッドは、`&mut Self` ではなく `Pin<&mut Self>` を使用してインスタンスを参照します。固定されたポインタでのみ呼び出すことができるのはこのためです。
uk: Метод `poll` трейту `Future` використовує `Pin<&mut Self>` замість `&mut Self` для посилання на екземпляр. Тому його можна викликати лише на закріпленому покажчику.

source: Async methods in traits are were stabilized only recently, in the 1.75 release. This required support for using return-position `impl Trait` (RPIT) in traits, as the desugaring for `async fn` includes `-> impl Future<Output = ...>`.
fa: متدهای Async در traitها اخیراً در انتشار 1.75 تثبیت شده‌اند. این نیاز به پشتیبانی برای استفاده از موقعیت بازگشتی `impl Trait` (RPIT) در traitها را داشت، زیرا شیرین‌زدایی (desugaring) برای `async fn` شامل `-> impl Future<Output = ...>` است.
uk: Асинхронні методи у трейтах було стабілізовано нещодавно, у випуску 1.75. Це вимагало підтримки використання `impl Trait` з позицією повернення (RPIT) у трейтах, оскільки десигнування для `async fn` включає `-> impl Future<Output = ...>`.

source: However, even with the native support today there are some pitfalls around `async fn` and RPIT in traits:
fa: با این‌حال، حتی با پشتیبانی native امروز، برخی از مشکلات در مورد `async fn` و RPIT در ویژگی‌ها وجود دارد:
uk: Однак, навіть з нативною підтримкою сьогодні існують деякі підводні камені навколо `async fn` та RPIT у трейтах:

source: Return-position impl Trait captures all in-scope lifetimes (so some patterns of borrowing cannot be expressed)
fa: ‏Return-position impl Trait تمام طول عمرهای درون محدوده را ثبت می کند (بنابراین برخی از الگوهای قرض کردن (borrowing) نمی توانند بیان شوند)
uk: Позиція повернення impl Trait фіксує всі терміни життя в межах області застосування (тому деякі моделі запозичення не можуть бути виражені)

source: Traits whose methods use return-position `impl trait` or `async` are not `dyn` compatible.
fa: ویژگی‌هایی که متد‌های آن‌ها از موقعیت بازگشتی `impl trait` یا `async` استفاده می‌کنند با `dyn` سازگار نیستند.
uk: Трейти, методи яких використовують позицію повернення `impl trait` або `async`, не сумісні з `dyn`.

source: If we do need `dyn` support, the crate [async_trait](https://docs.rs/async-trait/latest/async_trait/) provides a workaround through a macro, with some caveats:
uk: Якщо нам потрібна підтримка `dyn`, то крейт [async_trait](https://docs.rs/async-trait/latest/async_trait/) надає обхідний шлях за допомогою макросу, з деякими застереженнями:

source: "running all sleepers.."
pt_br: "executando todos os dormentes.."
uk: "запуск всіх сплячих.."

source: "slept for {}ms"
pt_br: "dormiu por {}ms"
uk: "проспав {}мс"

source: `async_trait` is easy to use, but note that it's using heap allocations to achieve this. This heap allocation has performance overhead.
es: `async_trait` es fácil de usar, pero ten en cuenta que utiliza asignaciones de montículos para conseguirlo. Esta asignación de montículo tiene una sobrecarga de rendimiento.
fa: استفاده از `async_trait` آسان است، اما توجه داشته باشید که برای رسیدن به این هدف از heap allocationها استفاده می‌کند. این heap allocation دارای سربار عملکرد است.
ja: `async_trait` は簡単に使用できますが、ヒープ割り当てを使用してこれを実現しています。このヒープ割り当てには、パフォーマンス オーバーヘッドが伴います。
ko: `async_trait`은 사용하기 쉽지만 이를 위해 힙에 메모리를 할당한다는 점에 유의하세요. 이 힙 할당에는 성능 오버헤드가 있습니다.
pt_br: `async_trait` é fácil de usar, mas observe que ele está usando alocações de pilha para alcançar isso. Essa alocação de pilha impacta o desempenho.
uk: `async_trait` простий у використанні, але зауважте, що для цього він використовує виділення в купі. Цей розподіл купи має накладні витрати на продуктивність.

source: The challenges in language support for `async trait` are deep Rust and probably not worth describing in-depth. Niko Matsakis did a good job of explaining them in [this post](https://smallcultfollowing.com/babysteps/blog/2019/10/26/async-fn-in-traits-are-hard/) if you are interested in digging deeper.
es: Los problemas de compatibilidad del lenguaje con `async trait` son muy complejos y no vale la pena describirlos en profundidad. Niko Matsakis lo explica muy bien en [esta publicación](https://smallcultfollowing.com/babysteps/blog/2019/10/26/async-fn-in-traits-are-hard/), por si te interesa investigar más a fondo.
fa: چالش‌های پشتیبانی برای `async trait` در زبان Rust بسیار عمیق هستند و احتمالاً ارزش توصیف عمیق در اینجا را ندارند. Niko Matsakis در [این پست](https://smallcultfollowing.com/babysteps/blog/2019/10/26/async-fn-in-traits-are-hard/) آنها را به خوبی توضیح داده است. به خصوص اگر شما به این موضوع علاقه‌مند هستید.
ja: `async trait` の言語サポートにおける課題は、Rust の中でも難解な部類に入るため、ここでは詳しく説明する必要はないでしょう。Niko Matsakis が [こちらの投稿](https://smallcultfollowing.com/babysteps/blog/2019/10/26/async-fn-in-traits-are-hard/) で詳しく説明していますので、深く掘り下げたい方はご覧ください。
ko: `async trait` 를 언어 차원에서 지원하는 것과 관련된 문제는 매우 전문적인 토픽이며 따라서 이 강의에서 다룰 내용은 아닙니다. [이 게시물](https://smallcultfollowing.com/babysteps/blog/2019/10/26/async-fn-in-traits-are-hard/)에 이에 관한 니코 마사키스의 좋은 설명이 있으므로 관심이 있다면 참고하세요.
pt_br: Os desafios no suporte da linguagem para `async trait` são profundos em Rust e provavelmente não valem a pena descrever em detalhes. Niko Matsakis fez um bom trabalho ao explicá-los [neste post](https://smallcultfollowing.com/babysteps/blog/2019/10/26/async-fn-in-traits-are-hard/) se você estiver interessado em aprofundar.
uk: Проблеми з мовною підтримкою для `async trait` глибокі в Rust і, мабуть, не варті детального опису. Ніко Мацакіс добре пояснив їх у [цій публікації](https://smallcultfollowing.com/babysteps/blog/2019/10/26/async-fn-in-traits-are-hard/), якщо вам цікаво копати глибше.

source: Try creating a new sleeper struct that will sleep for a random amount of time and adding it to the Vec.
es: Prueba a crear una estructura que entre en suspensión durante un periodo aleatorio y añádela a Vec.
fa: سعی کنید یک sleep خواب جدید ایجاد کنید که برای مدت زمان تصادفی می‌خوابد و آن را به Vec اضافه کنید.
ja: ランダムな時間スリープする新しいスリーパー構造体を作成し、Vec に追加してみましょう。
ko: 임의의 시간 동안 sleep 하는 새로운 sleeper 구조체를 만들어 Vec에 추가해 보세요.
pt_br: Tente criar uma nova estrutura _sleeper_ que dormirá por uma quantidade aleatória de tempo e adicioná-la ao _Vec_.
uk: Спробуйте створити нову сплячу структуру, яка буде спати протягом випадкового періоду часу, і додайте її до Vec.

source: Dropping a future implies it can never be polled again. This is called _cancellation_ and it can occur at any `await` point. Care is needed to ensure the system works correctly even when futures are cancelled. For example, it shouldn't deadlock or lose data.
es: Si eliminas un futuro, no se podrá volver a sondear. Este fenómeno se denomina _cancelación_ y puede producirse en cualquier momento de `await`. Hay que tener cuidado para asegurar que el sistema funcione correctamente, incluso cuando se cancelen los futuros. Por ejemplo, no debería sufrir interbloqueos o perder datos.
fa: کنار گذاشتن future به این معنی است که دیگر هرگز نمی‌توان آن را poll کرد. به این حالت _cancellation_ می‌گویند و می‌تواند در هر نقطه `await` رخ دهد. برای اطمینان از عملکرد صحیح سیستم حتی در صورت لغو futureها، دقت مناسب لازم است. به‌عنوان ‌مثال، نباید داده‌ها را از دست بدهد یا به بن‌بست (deadlock) برسد.
ja: Future をドロップすると、その Future を再度ポーリングすることはできません。これはキャンセルと呼ばれ、どの `await` ポイントでも発生する可能性があります。そのため、Future がキャンセルされた場合でも、システムが正常に動作するようにしておく必要があります。たとえば、デッドロックやデータの消失があってはなりません。
pt_br: Descartar uma _future_ implica que ela nunca pode ser consultada novamente. Isso é chamado de _cancelamento_ e pode ocorrer em qualquer ponto de `await`. Cuidado é necessário para garantir que o sistema funcione corretamente mesmo quando as _futures_ são canceladas. Por exemplo, não deve travar ou perder dados.
uk: Видалення ф'ючерсу означає, що він більше ніколи не може бути опитаний. Це називається _скасуванням_, і воно може відбутися в будь-який `await` момент. Потрібно бути обережним, щоб система працювала правильно, навіть якщо ф'ючерс скасовано. Наприклад, вона не повинна зайти в глухий кут або втратити дані.

source: "not UTF-8"
pt_br: "não UTF-8"
uk: "не UTF-8"

source: "hi\nthere\n"
uk: "всім\привіт\n"

source: "tick!"
uk: "тік!"

source: The compiler doesn't help with cancellation-safety. You need to read API documentation and consider what state your `async fn` holds.
es: El compilador no ayuda con la seguridad de la cancelación. Debes leer la documentación de la API y tener en cuenta el estado de tu `async fn`.
fa: کامپایلر در مورد cancellation-safety کمکی نمی‌کند. باید مستندات API را بخوانید و در نظر بگیرید که `async fn` شما چه وضعیتی دارد.
ja: コンパイラではキャンセル安全性を確保できません。API ドキュメントを読み、`async fn` が保持する状態を考慮する必要があります。
pt_br: O compilador não ajuda com a segurança do cancelamento. Você precisa ler a documentação da API e considerar qual estado sua `async fn` mantém.
uk: Компілятор не допомагає з безпекою скасування. Вам потрібно прочитати документацію до API і звернути увагу на те, який стан містить ваша `async fn`.

source: Unlike `panic` and `?`, cancellation is part of normal control flow (vs error-handling).
es: A diferencia de `panic` y `?`, la cancelación forma parte del flujo de control normal (en contraposición a la gestión de errores).
fa: برخلاف `panic` و `?`، لغو یا cancellation بخشی از جریان کنترل عادی (و رسیدگی به خطا) است.
ja: `panic` や `?`とは異なり、キャンセルは（エラー処理ではなく）通常の制御フローの一部です。
pt_br: Diferentemente de `panic` e `?`, o cancelamento faz parte do fluxo de controle normal (vs tratamento de erros).
uk: На відміну від `panic` і `?`, скасування є частиною звичайного потоку керування (на відміну від обробки помилок).

source: The example loses parts of the string.
es: En el ejemplo se pierden partes de la cadena.
fa: اسن مثال بخش‌هایی از string را از دست می‌دهد.
ja: この例では、文字列の一部が失われています。
pt_br: O exemplo perde partes da _string_.
uk: Приклад втрачає частини рядка.

source: Whenever the `tick()` branch finishes first, `next()` and its `buf` are dropped.
es: Cuando la rama `tick()` termina primero, se eliminan `next()` y su `buf`.
fa: هر زمان که شاخه `tick()` اول تمام شود، `next()` و `buf` آن حذف می شوند.
ja: `tick()` 分岐が先に終了するたびに、`next()` とその `buf` がドロップされます。
pt_br: Sempre que o ramo `tick()` termina primeiro, `next()` e seu `buf` são descartados.
uk: Щоразу, коли гілка `tick()` завершується першою, `next()` і його `buf` відкидаються.

source: `LinesReader` can be made cancellation-safe by making `buf` part of the struct:
es: `LinesReader` se puede configurar para que no se cancele marcando `buf` como parte del _struct_:
fa: ‏`LinesReader` را می‌توان با تبدیل `buf` به بخشی از ساختار، ایمن کرد:
ja: `buf` を構造体の一部にすることで、`LinesReader` にキャンセル安全性を持たせることができます。
pt_br: `LinesReader` pode ser tornado seguro para cancelamento tornando `buf` parte da estrutura:
uk: `LinesReader` можна зробити безпечним для скасування, зробивши `buf` частиною структури:

source: // prefix buf and bytes with self.
ja: // buf と bytes の先頭に self を付加します。
pt_br: // prefixe buf e bytes com self.
uk: // префікс buf та байти з self.

source: [`Interval::tick`](https://docs.rs/tokio/latest/tokio/time/struct.Interval.html#method.tick) is cancellation-safe because it keeps track of whether a tick has been 'delivered'.
es: [`Interval::tick`](https://docs.rs/tokio/latest/tokio/time/struct.Interval.html#method.tick) es a prueba de cancelaciones, ya que registra si una marca se ha 'entregado'.
fa: ‏ ['Interval::tick'](https://docs.rs/tokio/latest/tokio/time/struct.Interval.html#method.tick) برای cancellation-safe است زیرا ردیابی می‌کند که آیا یک tick تحویل داده شده است.
ja: [`Interval::tick`](https://docs.rs/tokio/latest/tokio/time/struct.Interval.html#method.tick) は、ティックが「配信済み」かどうかを追跡しているため、安全にキャンセルできます。
pt_br: [`Interval::tick`](https://docs.rs/tokio/latest/tokio/time/struct.Interval.html#method.tick) é seguro para cancelamento porque mantém o controle de se um _tick_ foi 'entregue'.
uk: [`Interval::tick`](https://docs.rs/tokio/latest/tokio/time/struct.Interval.html#method.tick) є безпечним для скасування, оскільки він відстежує, чи був тік 'доставлений'.

source: [`AsyncReadExt::read`](https://docs.rs/tokio/latest/tokio/io/trait.AsyncReadExt.html#method.read) is cancellation-safe because it either returns or doesn't read data.
es: [`AsyncReadExt::read`](https://docs.rs/tokio/latest/tokio/io/trait.AsyncReadExt.html#method.read) es a prueba de cancelaciones porque o devuelve los datos o no los lee.
fa: ‏ [`AsyncReadExt::read`](https://docs.rs/tokio/latest/tokio/io/trait.AsyncReadExt.html#method.read) برای cancellation-safe است زیرا داده‌ها را برمی‌گرداند یا نمی‌خواند.
ja: [`AsyncReadExt::read`](https://docs.rs/tokio/latest/tokio/io/trait.AsyncReadExt.html#method.read) は、データを返すか、データを読み取らないかのいずれかであるため、安全にキャンセルできます。
pt_br: [`AsyncReadExt::read`](https://docs.rs/tokio/latest/tokio/io/trait.AsyncReadExt.html#method.read) é seguro para cancelamento porque ou retorna ou não lê dados.
uk: [`AsyncReadExt::read`](https://docs.rs/tokio/latest/tokio/io/trait.AsyncReadExt.html#method.read) є безпечним для скасування, оскільки він повертає або не читає дані.

source: [`AsyncBufReadExt::read_line`](https://docs.rs/tokio/latest/tokio/io/trait.AsyncBufReadExt.html#method.read_line) is similar to the example and _isn't_ cancellation-safe. See its documentation for details and alternatives.
es: [`AsyncBufReadExt::read_line`](https://docs.rs/tokio/latest/tokio/io/trait.AsyncBufReadExt.html#method.read_line) es similar al ejemplo y _no está_ configurado a prueba de cancelaciones. Consulta su documentación para obtener información detallada y alternativas.
fa: ‏ [`AsyncBufReadExt::read_line`](https://docs.rs/tokio/latest/tokio/io/trait.AsyncBufReadExt.html#method.read_line) مشابه مثال است و شبیه cancellation-safe نیست. برای جزئیات و موارد جایگزین به مستندات آن مراجعه کنید.
ja: [`AsyncBufReadExt::read_line`](https://docs.rs/tokio/latest/tokio/io/trait.AsyncBufReadExt.html#method.read_line) はこの例と類似しており、安全にキャンセルできません。詳細と代替方法については、ドキュメントをご覧ください。
pt_br: [`AsyncBufReadExt::read_line`](https://docs.rs/tokio/latest/tokio/io/trait.AsyncBufReadExt.html#method.read_line) é semelhante ao exemplo e _não_ é seguro para cancelamento. Consulte sua documentação para detalhes e alternativas.
uk: [`AsyncBufReadExt::read_line`](https://docs.rs/tokio/latest/tokio/io/trait.AsyncBufReadExt.html#method.read_line) схожий на приклад і _не є_ безпечним для скасування. Подробиці та альтернативи дивится у його документації.

source: Dining Philosophers --- Async
pt_br: Jantar dos Filósofos --- Async
uk: Вечеря філософів --- Async

source: See [dining philosophers](../sync-exercises/dining-philosophers.md) for a description of the problem.
fa: برای توضیح مشکل به [dining philosophers](../sync-exercises/dining-philosophers.md) مراجعه کنید.
uk: Перегляньте [вечерю філософів](../sync-exercises/dining-philosophers.md) для опису проблеми.

source: As before, you will need a local [Cargo installation](../../cargo/running-locally.md) for this exercise. Copy the code below to a file called `src/main.rs`, fill out the blanks, and test that `cargo run` does not deadlock:
es: Como antes, necesitarás una [instalación local de Cargo](../../cargo/running-locally.md) para realizar el ejercicio. Copia el fragmento de código que aparece más abajo en un archivo denominado `src/main.rs`, rellena los espacios en blanco y comprueba que `cargo run` no presenta interbloqueos:
fa: مانند قبل، برای این تمرین به Cargo installation](../../cargo/running-locally.md) نیاز دارید. کد زیر را در فایلی به نام `src/main.rs` کپی کنید، جاهای خالی را پر کنید و تست کنید که `cargo run` به بن بست (`src/main.rs`) نمی‌خورد:
ja: 前と同様に、この演習でもローカルの [Cargo インストール](../../cargo/running-locally.md) が必要です。以下のコードを `src/main.rs` というファイルにコピーし、空欄を埋めて、`cargo run` がデッドロックしないことを確認します。
pt_br: Como antes, você precisará de uma [instalação local do Cargo](../../cargo/running-locally.md) para este exercício. Copie o código abaixo para um arquivo chamado `src/main.rs`, preencha os espaços em branco e teste se `cargo run` não trava:
uk: Як і раніше, для виконання цієї вправи вам знадобиться локальний [встановленний Cargo](../../cargo/running-locally.md). Скопіюйте наведений нижче код у файл під назвою `src/main.rs`, заповніть порожні поля та перевірте, чи `cargo run` не блокує:

source: // Keep trying until we have both forks
uk: // Продовжуємо пробувати, поки не знайдемо обидві виделки

source: // Make them think and eat
ja: // 哲学者が思索と食事を行うようにする
pt_br: // Faça-os pensar e comer
uk: // Змусимо їх думати і їсти

source: Since this time you are using Async Rust, you'll need a `tokio` dependency. You can use the following `Cargo.toml`:
es: Dado que esta vez usas async, necesitarás una dependencia `tokio`. Puedes usar el siguiente `Cargo.toml`:
fa: از آنجایی که این بار از Async Rust استفاده می‌کنید، به وابستگی `tokio` نیاز دارید. می‌توانید از `Cargo.toml` زیر استفاده کنید:
ja: 今回は非同期 Rust を使用するため、`tokio` 依存関係が必要になります。次の `Cargo.toml` を使用できます。
pt_br: Como desta vez você está usando Rust Async, você precisará de uma dependência `tokio`. Você pode usar o seguinte `Cargo.toml`:
uk: Оскільки цього разу ви використовуєте Async Rust, вам знадобиться залежність `tokio`. Ви можете використовувати наступний `Cargo.toml`:

source: Also note that this time you have to use the `Mutex` and the `mpsc` module from the `tokio` crate.
es: Además, ten en cuenta que esta vez tienes que utilizar `Mutex` y el módulo `mpsc` del crate `tokio`.
fa: همچنین توجه داشته باشید که این بار باید از ماژول `Mutex` و `mpsc` از `tokio` crate استفاده کنید.
ja: また、今度は `tokio` クレートの `Mutex` モジュールと `mpsc` モジュールを使用する必要があることにも注意してください。
pt_br: Também observe que desta vez você tem que usar o módulo `Mutex` e o módulo `mpsc` do _crate_ `tokio`.
uk: Також зауважте, що цього разу вам доведеться використовувати `Mutex` і модуль `mpsc` з крейту `tokio`.

source: Can you make your implementation single-threaded?
fa: آیا می‌توانید پیاده‌سازی خود را تک thread ای کنید؟
ja: 実装をシングルスレッドにできますか？
pt_br: Você pode fazer sua implementação single-threaded?
uk: Чи можете ви зробити вашу реалізацію однопотоковою?
