Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: We refer in `main` to a function written below. Neither forward declarations nor headers are necessary.
es: En `main` hacemos referencia a una función escrita más abajo. No se necesitan declaraciones de redirección ni encabezados.
ko: `main` 함수에서 그 다음에 오는 함수들을 사용할 수 있습니다. 미리 선언하기(forward declaration)나 헤더 같은건 필요 없습니다.

source: The last expression in a function body (or any block) becomes the return value. Simply omit the `;` at the end of the expression.
es: La última expresión del cuerpo de una función (o de cualquier bloque) se convierte en el valor devuelto. Basta con omitir el carácter `;` al final de la expresión.
ko: 함수 본문의 마지막 표현식은 반환 값이 됩니다. 간단히, 식 끝에 있는 `;`를 생략하면 됩니다.

source: The range expression in the `for` loop in `print_fizzbuzz_to()` contains `=n`, which causes it to include the upper bound.
es: La expresión de intervalo del bucle `for` en `print_fizzbuzz_to()` contiene `=n`, lo que hace que incluya el límite superior.
ko: `fizzbuzz_to()`함수 내 `for` 반목문의 범위 표현식 중 `=n`은 n까지 포함한다는 의미입니다.

source: All language items in Rust can be documented using special `///` syntax.
es: Todos los elementos del lenguaje de Rust se pueden documentar con la sintaxis especial `///`.
ko: Rust의 아이템(item)은 `///` 문법을 사용하여 문서화할 수 있습니다.

source: Show students the generated docs for the `rand` crate at [`docs.rs/rand`](https://docs.rs/rand).
es: Muestra a los alumnos los documentos generados para el crate `rand` en [`docs.rs/rand`](https://docs.rs/rand).
ko: [`docs.rs/rand`](https://docs.rs/rand)에서 `rand` 크레이트용으로 생성된 문서를 보여줍니다.

source: This course does not include rustdoc on slides, just to save space, but in real code they should be present.
es: Este curso no incluye diapositivas sobre rustdoc para ahorrar espacio, pero deben aparecer en el código real.
ko: 이 슬라이드의 예제 코드는 문서화 주석이 생략되어 있지만, 실제 코드라면 문서화 주석을 반드시 써야 합니다.

source: Inner doc comments are discussed later (in the page on modules) and need not be addressed here.
es: Los comentarios internos de los documentos se tratarán más adelante (en la página de módulos), no es necesario tratarlos aquí.
ko: 문서 내부 주석 모듈 페이지 뒷부분에서 다루며 여기서 다루지 않아도 됩니다.

source: Rustdoc comments can contain code snippets that we can run and test using `cargo test`. We will discuss these tests in the [Testing section](../testing/doc-tests.html).
es: Los comentarios de rustdoc pueden contener fragmentos de código que podemos ejecutar y probar utilizando `cargo test`. Hablaremos de esto en la [sección de pruebas](../testing/doc-tests.html).
ko: 문서화 주석은 코드를 포함할 수도 있으며, 이 코드는 `cargo test`를 통해 테스트로 동작할 수도 있습니다. [테스트](../testing/doc-tests.html)에서 더 자세히 다루겠습니다.

source: Methods are functions associated with a type. The `self` argument of a method is an instance of the type it is associated with:
es: Los métodos son funciones asociadas a un tipo. El argumento `self` de un método es una instancia del tipo al que está asociada:
ko: 메서드는 특정 타입과 연결된 함수입니다. 메서드의 `self` 인자가 그 메서드가 연결된 인스턴스의 타입입니다:

source: We will look much more at methods in today's exercise and in tomorrow's class.
es: Abordaremos en mayor profundidad los métodos en el ejercicio de hoy y en la clase de mañana.
ko: 오늘과 내일 강의에서 더 많은 메서드 사용법을 다룰 것입니다.

source: Add a static method called `Rectangle::new` and call this from `main`:
es: Añade un método estático denominado `Rectangle::new` y llámalo desde `main`:
ko: `Rectangle::new` 생성자를 추가하고 이를 `main`에서 호출합니다:

source: While _technically_, Rust does not have custom constructors, static methods are commonly used to initialize structs (but don't have to). The actual constructor, `Rectangle { width, height }`, could be called directly. See the [Rustnomicon](https://doc.rust-lang.org/nomicon/constructors.html).
es: Aunque _técnicamente_ Rust no tiene constructores personalizados, los métodos estáticos se utilizan habitualmente para inicializar estructuras, pero no es obligatorio. El constructor real, `Rectangle { width, height }`, podría llamarse directamente. Consulta el [Rustnomicon](https://doc.rust-lang.org/nomicon/constructors.html).
ko: \_기술적_으로 이야기 하자면, 러스트는 커스텀 생성자를 지원하지 않습니다. 정적 메소드를 사용하는 것이 구조체를 초기화 하는 일반적인 방법입니다 (물론 이것이 강제되지는 않습니다). 진짜 생성자인 `Rectangle { width, height }`를 직접 호출할 수도 있습니다. 자세한 내용은 [Rustnomicon](https://doc.rust-lang.org/nomicon/constructors.html)을 참조하세요.

source: Add a `Rectangle::square(width: u32)` constructor to illustrate that such static methods can take arbitrary parameters.
es: Añade un constructor `Rectangle::square(width: u32)` para mostrar que esos métodos estáticos puede utilizar parámetros arbitrarios.
ko: `Rectangle::square(width: u32)` 생성자를 추가하여 생성자가 임의의 매개변수를 사용할 수 있음을 보입시다.

source: Function Overloading
es: Sobrecarga de funciones
ko: (함수) 오버로딩

source: Overloading is not supported:
es: No se admite la sobrecarga:
ko: 오버로딩은 지원되지 않습니다:

source: Each function has a single implementation:
es: Cada función tiene una única implementación:
ko: 개별함수는 단일 구현만 갖습니다:

source: Always takes a fixed number of parameters.
es: Siempre se utiliza un número fijo de parámetros.
ko: 항상 고정된 수의 파라매터만 갖습니다.

source: Always takes a single set of parameter types.
es: Siempre se utiliza un único conjunto de tipos de parámetros.
ko: 파라매터들의 타입은 항상 고정되어 있습니다.

source: Default values are not supported:
es: No se admiten valores predeterminados:
ko: 파라매터의 기본 값은 지원되지 않습니다:

source: All call sites have the same number of arguments.
es: Todos los sitios de llamada tienen el mismo número de argumentos.
ko: 모든 호출부에서는 동일한 수의 인자를 설정해야합니다.

source: Macros are sometimes used as an alternative.
es: A veces, se utilizan macros como alternativa.
ko: 이런 사항들이 제약이 될 경우, 대안으로 매크로를 사용하기도 합니다.

source: However, function parameters can be generic:
es: Sin embargo, los parámetros de función pueden ser genéricos:
ko: 하지만, 함수의 매개변수는 제네릭을 적용할 수 있습니다:

source: When using generics, the standard library's `Into<T>` can provide a kind of limited polymorphism on argument types. We will see more details in a later section.
es: Cuando se utilizan genéricos, el `Into<T>` de la biblioteca estándar puede proporcionar una especie de polimorfismo limitado en los tipos de argumentos. Veremos más información al respecto en una sección posterior.
ko: 제네릭을 사용할 때 표준 라이브러리의 `Into<T>`은 타입에 대한 다형성을 제공할 수 있습니다. 나중에 자세히 설명하겠습니다.

source: Day 1: Morning Exercises
es: Día 1: ejercicios de la mañana
ko: 1일차 오전 연습문제

source: In these exercises, we will explore two parts of Rust:
es: En estos ejercicios, estudiaremos dos partes de Rust:
ko: 이번 연습문제는 러스트의 두 부분을 알아볼 것입니다:

source: Implicit conversions between types.
es: Conversiones implícitas entre tipos.
ko: 타입의 묵시적 변환.

source: Arrays and `for` loops.
es: Arrays y bucles `for`.
ko: 배열과 `for` 반복문.

source: A few things to consider while solving the exercises:
es: Ten en cuenta lo siguiente a la hora de resolver los ejercicios:
ko: 연습문제를 해결하는데 고려해야 할 사항들:

source: Use a local Rust installation, if possible. This way you can get auto-completion in your editor. See the page about [Using Cargo](../../cargo.md) for details on installing Rust.
es: Si es posible, utiliza una instalación local de Rust. De esta forma, podrás autocompletar datos en tu editor. Consulta la página sobre \[cómo usar Cargo\] para obtener más información sobre cómo instalar Rust.
ko: 가능하다면 러스트가 설치된 로컬 환경에서 진행하세요. 그러는 편이 텍스트 에디터의 자동완성 기능의 도움을 받을 수 있어서 좋습니다. [카고 사용하기](../../cargo.md) 을 참조하시기 바랍니다.

source: Alternatively, use the Rust Playground.
es: También puedes usar el playground de Rust.
ko: 혹은 러스트 플레이그라운드를 이용할 수 있습니다.

source: The code snippets are not editable on purpose: the inline code snippets lose their state if you navigate away from the page.
es: Los fragmentos de código no son editables a propósito: los que están insertados pierden su estado si se sale de la página.
ko: 페이지 밖으로 이동할 경우 작성한 내용이 소실되기 때문에 제공되는 코드 스니펫은 의도적으로 편집할 수 없습니다.

source: Rust will not automatically apply _implicit conversions_ between types ([unlike C++](https://en.cppreference.com/w/cpp/language/implicit_conversion)). You can see this in a program like this:
es: Rust no aplicará automáticamente _conversiones implícitas_ entre tipos ([a diferencia de C++](https://en.cppreference.com/w/cpp/language/implicit_conversion)). Puedes ver un ejemplo de esto en el siguiente programa:
ko: 러스트는 [C++ 와 다르게](https://en.cppreference.com/w/cpp/language/implicit_conversion) 타입 간 _묵시적 변환_을 자동으로 적용하지 않습니다. 아래 예시를 확인해 보세요:

source: The Rust integer types all implement the [`From<T>`](https://doc.rust-lang.org/std/convert/trait.From.html) and [`Into<T>`](https://doc.rust-lang.org/std/convert/trait.Into.html) traits to let us convert between them. The `From<T>` trait has a single `from()` method and similarly, the `Into<T>` trait has a single `into()` method. Implementing these traits is how a type expresses that it can be converted into another type.
es: Todos los tipos de enteros de Rust implementan los traits [`From<T>`](https://doc.rust-lang.org/std/convert/trait.From.html) y [`Into<T>`](https://doc.rust-lang.org/std/convert/trait.Into.html) para permitirnos realizar conversiones entre ellos. El trait `From<T>` tiene un único método `from()` y, del mismo modo, el trait `Into<T>` tiene un único método `into()`. Un tipo expresa que se puede convertir en otro tipo implementando estos traits.
ko: 러스트의 정수형 타입은 모두 [`From<T>`](https://doc.rust-lang.org/std/convert/trait.From.html) 와 [`Into<T>`](https://doc.rust-lang.org/std/convert/trait.Into.html) 트레잇을 구현하고 있으며, 이를 통해 타입 변환이 이루어 집니다. `From<T>` 트레잇은 `from()` 메서드를 가지고 있고, `Into<T>`트레잇은 `into()` 메서드를 가지고 있습니다. 러스트에서는 `From`과 `Into` 트레잇을 구현함으로써, 타입 간 변환이 가능하다는 것을 표현합니다.

source: The standard library has an implementation of `From<i8> for i16`, which means that we can convert a variable `x` of type `i8` to an `i16` by calling `i16::from(x)`. Or, simpler, with `x.into()`, because `From<i8> for i16` implementation automatically create an implementation of `Into<i16> for i8`.
es: La biblioteca estándar implementa `From<i8> for i16`, lo que significa que podemos convertir una variable `x` del tipo `i8` a `i16` llamando a `i16::from(x)`. O, más sencillo, con `x.into()`, ya que la implementación de `From<i8> for i16` crea automáticamente una implementación de `Into<i16> for i8`.
ko: 표준 라이브러리에는 `From<i8> for i16`가 구현되어 있는데 이것은 `i8` 타입의 변수 `x`를 `i16::from(x)`를 호출하여 `i16`타입으로 변환할 수 있다는 의미입니다. 혹은 더 간단하게 `x.into()`를 사용할 수도 있습니다. 이것이 가능한 이유는 `From<i8> for i16` 구현을 가지고 있으면 `Into<i16> for i8` 구현이 자동으로 생성되기 때문입니다.

source: The same applies for your own `From` implementations for your own types, so it is sufficient to only implement `From` to get a respective `Into` implementation automatically.
es: Lo mismo se aplica a tus implementaciones `From` para tus propios tipos, por lo que basta con implementar `From` para obtener la respectiva implementación `Into` de forma automática.
ko: 이는 사용자 정의 타입에도 동일하게 적용되는 규칙입니다. 따라서 `From`만을 구현해도 `Into`까지 자동으로 구현이 됩니다.

source: Execute the above program and look at the compiler error.
es: Ejecuta el programa anterior y observa el error del compilador.
ko: 위 예제코드를 실행하고 어떤 컴파일 에러가 발생하는지 확인해 보세요.

source: Update the code above to use `into()` to do the conversion.
es: Actualiza el código anterior para usar `into()` y realizar la conversión.
ko: `into()`를 사용하여 코드를 수정하세요.

source: Change the types of `x` and `y` to other things (such as `f32`, `bool`, `i128`) to see which types you can convert to which other types. Try converting small types to big types and the other way around. Check the [standard library documentation](https://doc.rust-lang.org/std/convert/trait.From.html) to see if `From<T>` is implemented for the pairs you check.
es: Cambia los tipos de `x` e `y` a otros elementos (por ejemplo, `f32`, `bool`, `i128`) para ver qué tipos puedes convertir. Prueba a convertir tipos pequeños en tipos grandes y viceversa. Consulta la [documentación de la biblioteca estándar](https://doc.rust-lang.org/std/convert/trait.From.html) para comprobar si se ha implementado `From<T>` en los pares que elijas.
ko: `x`와 `y`를 `f32`이나 `bool`, `i128` 등으로 바꿔서 해당 타입들로 변환이 되는지 확인해보세요. 작은 사이즈 타입에서 큰 사이즈로 변경해보시고 그 반대로도 해보세요. [표준 라이브러리 문서](https://doc.rust-lang.org/std/convert/trait.From.html)에서 시도해 본 케이스가 구현되어 있는지 확인해 보세요.

source: Arrays and `for` Loops
es: Arrays y bucles`for`
ko: 배열과 `for`반복문

source: We saw that an array can be declared like this:
es: Hemos visto que un array se puede declarar de la siguiente manera:
ko: 배열을 아래와 같이 선언 할 수 있음을 배웠습니다:

source: You can print such an array by asking for its debug representation with `{:?}`:
es: Puedes imprimir dicho array solicitando su representación de depuración con `{:?}`:
ko: 배열을 출력하려면 `{:?}`를 씁니다:

source: Rust lets you iterate over things like arrays and ranges using the `for` keyword:
es: Rust te permite iterar sobre elementos como arrays e intervalos usando la palabra clave `for`:
ko: 러스트에서는 `for` 키워드를 사용해 배열이나 범위를 반복할 수 있습니다:

source: Use the above to write a function `pretty_print` which pretty-print a matrix and a function `transpose` which will transpose a matrix (turn rows into columns):
es: Usa el método anterior para escribir una función `pretty_print` que sirva para dar formato al texto de la matriz y una función `transpose` que transponga una matriz (convertir filas en columnas):
ko: 위 코드를 이용해서, 행렬을 예쁘게 출력하는 `pretty_print`함수와, 행렬을 전치(행과 열을 서로 바꾸는)시키는 `transpose`함수를 작성해 보시기 바랍니다:

source: Bonus Question
es: Pregunta Extra
ko: 보너스 문제

source: Could you use `&[i32]` slices instead of hard-coded 3 × 3 matrices for your argument and return types? Something like `&[&[i32]]` for a two-dimensional slice-of-slices. Why or why not?
es: ¿Se podrían usar slices `&[i32]` en lugar de matrices de 3 × 3 predefinidas en el código para tus argumentos y tipos de resultados devueltos? Por ejemplo, \``&\[&\[i32\]\]\` para un slice de slices de dos dimensiones. ¿Por qué? ¿Por qué no?
ko: `&[i32]`슬라이스를 잘 이용하면 행렬 크기를 3 x 3으로 하드코딩 하지 않을 수 있을까요? 예컨데 `&[&[i32]]`는 2차원 슬라이스의 슬라이스 입니다. 가능하다면/하지 않다면 왜 그런가요?

source: See the [`ndarray` crate](https://docs.rs/ndarray/) for a production quality implementation.
es: Consulta el [crate `ndarray`](https://docs.rs/ndarray/) para obtener una implementación con calidad de producción.
ko: 상용 품질의 구현에 대해서는 [`ndarray` 크레이트](https://docs.rs/ndarray/)를 참조하시기 바랍니다.

source: The solution and the answer to the bonus section are available in the [Solution](solutions-morning.md#arrays-and-for-loops) section.
es: La solución y la respuesta a la pregunta extra están disponibles en la sección [soluciones](solutions-morning.md#arrays-and-for-loops).
ko: 보너스 문제에 대한 답변 역시 [해답](solutions-morning.md#arrays-and-for-loops)에서 확인할 수 있습니다.

source: The use of the reference `&array` within `for n in &array` is a subtle preview of issues of ownership that will come later in the afternoon.
es: El uso de la referencia `&array` dentro de `for n in &array` es una vista previa sutil de los problemas de propiedad que se tratarán más tarde por la tarde.

source: Without the `&`...
es: Sin el `&`...

source: The loop would have been one that consumes the array. This is a change [introduced in the 2021 Edition](https://doc.rust-lang.org/edition-guide/rust-2021/IntoIterator-for-arrays.html).
es: El bucle habría sido uno que consume el array. Este es un cambio [introducido en la edición de 2021](https://doc.rust-lang.org/edition-guide/rust-2021/IntoIterator-for-arrays.html).

source: An implicit array copy would have occurred. Since `i32` is a copy type, then `[i32; 3]` is also a copy type.
es: Se habría producido una copia implícita del array. Dado que `i32` es un tipo de copia, `[i32; 3]` también es un tipo de copia.

source: As we have seen, `if` is an expression in Rust. It is used to conditionally evaluate one of two blocks, but the blocks can have a value which then becomes the value of the `if` expression. Other control flow expressions work similarly in Rust.
es: Como hemos visto, `if` es una expresión de Rust. Se utiliza para realizar una evaluación condicional de uno de los dos bloques, aunque estos pueden tener un valor que acaba convirtiéndose en el valor de la expresión `if`. Otras expresiones del flujo de control funcionan de forma similar en Rust.
ko: 앞에서 살펴본 바와 같이 러스트에서 `if`는 표현식입니다. 조건에 따라 두 블록 중 하나를 평가하며, 그 결과값이 `if` 표현식의 값이 됩니다. 다른 흐름제어 표현식도 유사하게 작동합니다.

source: A block in Rust contains a sequence of expressions. Each block has a value and a type, which are those of the last expression of the block:
es: En Rust, un bloque contiene una secuencia de expresiones. Cada bloque tiene un tipo y un valor, que son los de la última expresión del bloque:
ko: 러스트에서 블록은 값과 타입을 갖습니다. 블록의 마지막 표현식이 블록의 값이 됩니다:

source: The same rule is used for functions: the value of the function body is the return value:
es: Se utiliza la misma regla para las funciones: el valor del cuerpo de la función es el valor devuelto:
ko: 함수에도 동일한 규칙이 적용됩니다. 함수 바디를 이루는 블록의 값이 반환값이 됩니다:

source: The point of this slide is to show that blocks have a type and value in Rust.
es: El objetivo de esta diapositiva es mostrar que los bloques tienen un tipo y un valor en Rust.
ko: 러스트에서는 블록이 타입과 값을 가진다는 점이 이 슬라이드의 핵심입니다.

source: Because `if` is an expression and must have a particular type, both of its branch blocks must have the same type. Consider showing what happens if you add `;` after `x / 2` in the second example.
es: Dado que `if` es una expresión y debe tener un tipo concreto, ambos bloques de ramas deben tener el mismo tipo. En el segundo ejemplo, puedes mostrar lo que sucede al añadir `;` después de `x / 2`.
ko: `if`는 표현식이고 타입을 가져야 하므로 분기 블록은 모두 같은 타입을 가져야 합니다. 두번째 예시의 `x / 2` 뒤에 `;`를 추가하여 어떻게 되는지 확인해 보시기 바랍니다.

source: The [`for` loop](https://doc.rust-lang.org/std/keyword.for.html) is closely related to the [`while let` loop](while-let-expressions.md). It will automatically call `into_iter()` on the expression and then iterate over it:
es: El [bucle `for`][`for` loop](https://doc.rust-lang.org/std/keyword.for.html) está estrechamente relacionado con el [bucle `while let`](while-let-expressions.md). Llamará automáticamente a `into_iter()` en la expresión y después iterará sobre ella:
ko: `for` 반복문은 `while let` 반복문과 매우 유사합니다. `for` 반복문은 자동으로 `into_iter()`를 호출한 다음 이를 반복합니다:

source: You can use `break` and `continue` here as usual.
es: Aquí puedes usar `break` y `continue` como de costumbre.
ko: 다른 언어와 마찬가지로 `break` 와 `continue`를 사용할 수 있습니다.

source: Index iteration is not a special syntax in Rust for just that case.
es: La iteración de índices no es una sintaxis especial en Rust para ese caso.
ko: 러스트는 인덱스 기반의 반복을 위한 별도의 문법을 사용하지 않습니다.

source: `(0..10)` is a range that implements an `Iterator` trait.
es: `(0..10)` es un rango que implementa un `Iterator` trait.
ko: `(0..10)`은 `Iterator` 트레잇을 구현하는 범위(range) 값입니다.

source: `step_by` is a method that returns another `Iterator` that skips every other element.
es: `step_by` es un método que devuelve otro `Iterator` que salta cada otro elemento.
ko: `step_by`는 반복자의 요소들을 건너뛰는 또다른 `Iterator`를 반환하는 메서드입니다.

source: Modify the elements in the vector and explain the compiler errors. Change vector `v` to be mutable and the for loop to `for x in v.iter_mut()`.
es: Modifica los elementos del vector y explica los errores del compilador. Cambia el vector `v` para que sea mutable y el bucle `for x in v.iter_mut()`.
ko: 벡터 요소들을 수정하려고 하면 나오는 컴파일러 에러를 같이 살펴보세요. `v` 벡터를 가변 변수로 변경하고 루프는 `for x in v.iter_mut()`로 수정하세요.

source: `while` loops
es: Bucles `while`
ko: `while` 반복문

source: The [`while` keyword](https://doc.rust-lang.org/reference/expressions/loop-expr.html#predicate-loops) works very similar to other languages:
es: La [palabra clave `while`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#predicate-loops) es muy similar a otros lenguajes:
ko: [`while` 키워드](https://doc.rust-lang.org/reference/expressions/loop-expr.html#predicate-loops)는 다른 언어와 매우 비슷하게 작동합니다:

source: If you want to exit a loop early, use [`break`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#break-expressions),
es: Si quieres salir de un bucle antes, usa [`break`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#break-expressions).
ko: 루프를 조기에 종료하려면 [`break`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#break-expressions)를 사용합니다,

source: `loop` expressions
es: Expresiones `loop`
ko: `loop` 표현식

source: Finally, there is a [`loop` keyword](https://doc.rust-lang.org/reference/expressions/loop-expr.html#infinite-loops) which creates an endless loop.
es: Por último, la [palabra clave `loop`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#infinite-loops) crea un bucle infinito.
ko: 마지막으로, 무한 루프를 만드는 [`loop` 키워드](https://doc.rust-lang.org/reference/expressions/loop-expr.html#infinite-loops)가 있습니다.

source: Here you must either `break` or `return` to stop the loop:
es: Para detener el bucle, debes usar `break` o `return`:
ko: 따라서 반드시 `break` 또는 `return`을 사용해서 루프를 정지해야 합니다:

source: Break the `loop` with a value (e.g. `break 8`) and print it out.
es: Interrumpe `loop` con un valor (por ejemplo, `break 8`) e imprímelo.
ko: `loop`를 값(예: `break 8`)으로 나누고 출력합니다.

source: Rust provides type safety via static typing. Variable bindings are immutable by default:
es: Rust ofrece seguridad de tipos mediante tipado estático. De forma predeterminada, los enlaces a variables son inmutables:
ko: 러스트는 정적 타이핑을 통해 타입 안전성을 제공합니다. 변수는 기본적으로 불변(immutable)합니다:

source: Due to type inference the `i32` is optional. We will gradually show the types less and less as the course progresses.
es: Debido a la inferencia de tipos, `i32` es opcional. A medida que avance el curso, iremos mostrando cada vez menos los tipos.
ko: 타입 추론에 덕분에 `i32`는 생략 가능합니다. 강의가 진행될 수록 생략 가능한 부분은 점점 생략할 것입니다.

source: The following code tells the compiler to copy into a certain generic container without the code ever explicitly specifying the contained type, using `_` as a placeholder:
es: El siguiente fragmento de código le indica al compilador que copie en un determinado contenedor genérico sin que el código especifique explícitamente el tipo contenido utilizando `_` como marcador de posición:
ko: 아래 코드는, 제네릭 컨테이너를 쓸 때 컨테이터 안에 포함된 데이터의 타입을 명시적으로 쓰지 않고 `_`로 대체하여도 된다는 것을 보여줍니다:

source: [`collect`](https://doc.rust-lang.org/stable/std/iter/trait.Iterator.html#method.collect) relies on [`FromIterator`](https://doc.rust-lang.org/std/iter/trait.FromIterator.html), which [`HashSet`](https://doc.rust-lang.org/std/collections/struct.HashSet.html#impl-FromIterator%3CT%3E-for-HashSet%3CT,+S%3E) implements.
es: [`collect`](https://doc.rust-lang.org/stable/std/iter/trait.Iterator.html#method.collect) se basa en [`FromIterator`](https://doc.rust-lang.org/std/iter/trait.FromIterator.html), que implementa [`HashSet`](https://doc.rust-lang.org/std/collections/struct.HashSet.html#impl-FromIterator%3CT%3E-for-HashSet%3CT,+S%3E).
ko: [`collect`](https://doc.rust-lang.org/stable/std/iter/trait.Iterator.html#method.collect)는 [`HashSet`](https://doc.rust-lang.org/std/collections/struct.HashSet.html#impl-FromIterator%3CT%3E-for-HashSet%3CT,+S%3E)을 구현한 [`FromIterator`](https://doc.rust-lang.org/std/iter/trait.FromIterator.html)에 의존합니다.

source: Static and Constant Variables
es: Variables Estáticas y Constantes
ko: 정적변수(static)과 상수(const)

source: Static and constant variables are two different ways to create globally-scoped values that cannot be moved or reallocated during the execution of the program.
es: Las variables estáticas y constantes son dos formas diferentes de crear valores de ámbito global que no se pueden mover ni reasignar durante la ejecución del programa.
ko: 정적 변수와 상수는 전역 스코프에서 값을 생성하는 두 가지 방법입니다. 전역 스코프에 생성된 값은 프로그램 수행 도중에 다른 값으로 이동되지 않으며, 메모리 상에서 그 위치가 변하지 않습니다.
