Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: thread safety: The property of a program that ensures correct behavior in a multithreaded environment.
fa: thread safety: ویژگی برنامه‌ای که رفتار صحیح را در یک محیط multithread تضمین می‌کند.
ja: スレッドセーフ（thread safety）: マルチスレッド環境で正しい動作を保証するプログラムの特性。
pt_br: segurança de _thread_: A propriedade de um programa que garante comportamento correto em um ambiente multithread.
uk: безпека потоків: Властивість програми, яка забезпечує коректну поведінку в багатопотоковому середовищ.

source: trait: A collection of methods defined for an unknown type, providing a way to achieve polymorphism in Rust.
fa: trait: مجموعه‌ای از متدهای تعریف شده برای یک type ناشناخته، راهی برای دستیابی به polymorphism در Rust ارائه می‌دهد.
ja: トレイト（trait）: 未知の型に対して定義されたメソッドのコレクション。Rust でポリモーフィズムを実現する方法を提供します。
pt_br: trait: Uma coleção de métodos definidos para um tipo desconhecido, fornecendo uma maneira de alcançar polimorfismo em Rust.
uk: трейт: Набір методів, визначених для невідомого типу, що забезпечує можливість досягнення поліморфізму у Rust.

source: trait bound: An abstraction where you can require types to implement some traits of your interest.
ja: トレイト境界（trait bound）: 特定のトレイトを実装するために型を要求できる抽象化。
pt_br: restrição de _trait_: Uma abstração onde você pode exigir que os tipos implementem alguns _traits_ de seu interesse.
uk: обмеження трейту: Абстракція, в якій ви можете вимагати, щоб типи реалізовували певні трейти, які вас цікавлять.

source: tuple: A composite data type that contains variables of different types. Tuple fields have no names, and are accessed by their ordinal numbers.
fa: tuple: یک data type ترکیبی که شامل متغیرهایی از انواع مختلف است. فیلدهای Tuple بی‌نام هستند و با شماره ترتیبی آنها قابل دسترسی هستند.
ja: タプル（tuple）: さまざまな型の変数を含む複合データ型。タプル フィールドには名前がなく、序数でアクセスします。
uk: кортеж: Комбінований тип даних, який містить змінні різних типів. Поля кортежу не мають імен, доступ до них здійснюється за їхніми порядковими номерами.

source: type: A classification that specifies which operations can be performed on values of a particular kind in Rust.
fa: type: طبقه‌بندی که مشخص می‌کند کدام عملیات را می‌توان بر روی مقادیری از یک تایپ خاص در Rust انجام داد.
ja: 型（type）: Rust の特定の種類の値に対してどのオペレーションを実行できるかを指定する分類。
pt_br: tipo: Uma classificação que especifica quais operações podem ser realizadas em valores de um tipo particular em Rust.
uk: тип: Класифікація, яка визначає, які операції можна виконувати над значеннями певного типу в Rust.

source: type inference: The ability of the Rust compiler to deduce the type of a variable or expression.
fa: type inference: توانایی کامپایلر Rust برای شناسایی تایپ یک متغیر یا عبارت.
ja: 型推論（type inference）: 変数または式の型を推測する Rust コンパイラの機能。
pt_br: inferência de tipo: A capacidade do compilador Rust de deduzir o tipo de uma variável ou expressão.
uk: виведення типу: Здатність компілятора Rust виводити тип змінної або виразу.

source: undefined behavior: Actions or conditions in Rust that have no specified result, often leading to unpredictable program behavior.
fa: undefined behavior: اقدامات یا شرایطی در Rust که هیچ نتیجه مشخصی ندارند و اغلب منجر به رفتار غیرقابل پیش‌بینی برنامه می‌شوند.
ja: 未定義の動作（undefined behavior）: 結果が指定されていない Rust のアクションまたは条件。多くの場合、プログラムの予測不能な動作を引き起こします。
pt_br: comportamento indefinido: Ações ou condições em Rust que não têm um resultado especificado, frequentemente levando a comportamento imprevisível do programa.
uk: невизначена поведінка: Дії або умови в Rust, які не мають визначеного результату, що часто призводить до непередбачуваної поведінки програми.

source: union: A data type that can hold values of different types but only one at a time.
fa: union: یک data type که می‌تواند مقادیری از انواع مختلف را در خود نگه دارد، اما فقط یکی در یک زمان خاص.
ja: 共用体（union）: 異なる型の値を一度に 1 つだけ保持できるデータ型。
pt_br: união (_union_): Um tipo de dado que pode conter valores de diferentes tipos, mas apenas um de cada vez.
uk: об'єднання: Тип даних, який може містити значення різних типів, але лише по одному за раз.

source: unit test: Rust comes with built-in support for running small unit tests and larger integration tests. See [Unit Tests](testing/unit-tests.html).
fa: unit test: ‏ Rust با پشتیبانی داخلی برای اجرای unit testهای کوچک و integration testهای بزرگتر ارائه می‌شود. [Unit Tests](testing/unit-tests.html) را ببینید.
ja: 単体テスト（unit test）: Rust には、小規模な単体テストと大規模な統合テストを実行するための組み込みサポートが付属しています。[単体テスト](testing/unit-tests.html) をご覧ください。
pt_br: teste unitário: Rust vem com suporte embutido para executar pequenos testes unitários e testes de integração maiores. Veja [Testes Unitários](testing/unit-tests.html).
uk: модульній тест: Rust має вбудовану підтримку для запуску невеликих модульних тестів і великих інтеграційних тестів. Дивіться [Модульні тести](testing/unit-tests.html).

source: unit type: Type that holds no data, written as a tuple with no members.
fa: unit type: نوعی که هیچ داده‌ای را در خود نگه نمی‌دارد و به صورت tuple بدون هیچ عضوی نوشته شده است.
ja: ユニット型（unit type）: データを保持しない型。メンバーのないタプルとして記述されます。
uk: тип одиниці: Тип, що не містить даних, записаний як кортеж без членів.

source: unsafe: The subset of Rust which allows you to trigger _undefined behavior_. See [Unsafe Rust](unsafe-rust/unsafe.md).
fa: unsafe: زیرمجموعه (subset) در Rust که به شما امکان می‌دهد رفتار نامشخصی را فعال‌سازی کنید. [Unsafe Rust] (unsafe-rust/unsafe.md) را ببینید.
uk: unsafe: Підмножина Rust, яка дозволяє викликати _невизначену поведінку_. Дивіться [Небезпечний Rust](unsafe-rust/unsafe.md).

source: variable: A memory location storing data. Variables are valid in a _scope_.
fa: variable: یک مکان حافظه که داده‌ها را ذخیره می‌کند. متغیرها در یک _scope_ معتبر هستند.
ja: 変数（variable）: データを格納するメモリの場所。変数はスコープ内で有効です。
pt_br: variável: Uma localização de memória que armazena dados. Variáveis são válidas em um _escopo_.
uk: змінна: Ділянка пам'яті, в якій зберігаються дані. Змінні дійсні в межах _області видимості_.

source: Other Rust Resources
es: Otros recursos de Rust
fa: سایر منابع برای Rust
ja: Rust のその他のリソース
ko: 러스트 참고 자료
pt_br: Outros recursos de Rust
uk: Інші ресурси Rust

source: The Rust community has created a wealth of high-quality and free resources online.
es: La comunidad de Rust ha creado una gran cantidad de recursos online sin coste y de gran calidad.
fa: جامعه Rust منابع بسیار باکیفیت و رایگان را به صورت آنلاین ایجاد کرده است.
ja: Rust コミュニティは、高品質な無料のリソースをオンラインで多数提供しています。
ko: 러스트 커뮤니티는 온라인에서 고품질의 무료 소스를 만들었습니다.
pt_br: A comunidade Rust tem abundância de recursos gratuitos e de alta qualidade on-line.
uk: Спільнота Rust створила безліч високоякісних і безкоштовних ресурсів онлайн.

source: Official Documentation
es: Documentación oficial
fa: مستندات رسمی
ja: 正式なドキュメント
ko: 공식 문서들
pt_br: Documentação Oficial
uk: Офіційна документація

source: The Rust project hosts many resources. These cover Rust in general:
es: El proyecto Rust cuenta con muchos recursos. Estos tratan sobre Rust en general:
fa: پروژه Rust میزبان منابع بسیاری است. این‌ منابع، Rust را به طور کامل پوشش می‌دهند:
ja: Rust プロジェクトは多くのリソースをホストしており、これらは Rust 全般に対応しています。
ko: 러스트 프로젝트에는 참조할 만한 자료가 많습니다. 일반적인 내용을 다루는 몇가지 참고 문서들입니다:
pt_br: O projeto Rust hospeda muitos recursos. Estes cobrem Rust em geral:
uk: Проект Rust містить багато ресурсів. Вони охоплюють Rust загалом:

source: [The Rust Programming Language](https://doc.rust-lang.org/book/): the canonical free book about Rust. Covers the language in detail and includes a few projects for people to build.
es: [The Rust Programming Language](https://doc.rust-lang.org/book/): el libro canónico sobre Rust sin coste alguno. Trata el lenguaje de forma detallada e incluye algunos proyectos que los usuarios pueden compilar.
fa: ‏ [زبان برنامه نویسی Rust] (https://doc.rust-lang.org/book/): کتاب رایگان و معروف در مورد Rust که این زبان را با جزئیات دقیقی پوشش می‌دهد و شامل چند پروژه برای ساخت نرم‌افزار می‌شود.
ja: [The Rust Programming Language](https://doc.rust-lang.org/book/): Rust の標準的な書籍で、無料で利用できます。Rust について詳しく説明されているほか、ビルドできるプロジェクトがいくつか含まれています。
ko: [The Rust Programming Language](https://doc.rust-lang.org/book/): 러스트에 대한 무료 표준 서적입니다. 언어에 대한 자세한 설명과 사람들이 빌드 할수 있는 몇가지 프로젝트를 포함합니다.
pt_br: [A Linguagem de Programação Rust](https://doc.rust-lang.org/book/): o livro gratuito canônico sobre Rust. Abrange o idioma em detalhes e inclui alguns projetos para as pessoas construírem.
uk: [Мова програмування Rust](https://doc.rust-lang.org/book/): канонічна безкоштовна книга про Rust. Детально охоплює мову та містить кілька проектів для створення.

source: [Rust By Example](https://doc.rust-lang.org/rust-by-example/): covers the Rust syntax via a series of examples which showcase different constructs. Sometimes includes small exercises where you are asked to expand on the code in the examples.
es: [Rust by Example](https://doc.rust-lang.org/rust-by-example/): trata la sintaxis de Rust a través de una serie de ejemplos que muestran distintas construcciones. A veces incluye pequeños ejercicios en los que se te pide que amplíes el código de los ejemplos.
fa: ‏ [Rust By Example](https://doc.rust-lang.org/rust-by-example/): در مورد Rust syntax را به کمک یک سری از مثال‌ها پوشش می‌دهد که ساختارهای مختلف را به نمایش می‌گذارد. گاهی اوقات شامل تمرین‌های کوچکی می‌شود که از شما خواسته می‌شود کد را در مثال‌ها گسترش دهید.
ja: [Rust By Example](https://doc.rust-lang.org/rust-by-example/): さまざまな構造を示す一連のサンプルを使用して、Rust の構文を解説しています。小規模な演習がいくつか用意されており、そこでサンプルのコードを拡張するよう求められます。
ko: [Rust By Example](https://doc.rust-lang.org/rust-by-example/): 여러 예제를 통해 러스트의 문법을 보여주며 때때로 코드를 확장하는 약간의 연습문제들이 포함되어 있습니다.
pt_br: [Rust By Example](https://doc.rust-lang.org/rust-by-example/): abrange a sintaxe de Rust por meio de uma série de exemplos que mostram diferentes construções. As vezes inclui pequenos exercícios onde você é solicitado a expandir o código dos exemplos.
uk: [Rust за прикладом](https://doc.rust-lang.org/rust-by-example/): описує синтаксис Rust за допомогою серії прикладів, які демонструють різні конструкції. Іноді включає невеликі вправи, де вас просять розширити код у прикладах.

source: [Rust Standard Library](https://doc.rust-lang.org/std/): full documentation of the standard library for Rust.
es: \[La biblioteca estándar de Rust\][Rust Standard Library](https://doc.rust-lang.org/std/): documentación completa de la biblioteca estándar de Rust.
fa: ‏ [Rust Standard Library]‌(https://doc.rust-lang.org/std/): مستندات کامل کتابخانه استاندارد برای Rust می‌باشد.
ja: [Rust Standard Library](https://doc.rust-lang.org/std/): Rust の標準ライブラリの完全なドキュメントです。
ko: [Rust Standard Library](https://doc.rust-lang.org/std/): 러스트 표준 라이브러리 전체 문서입니다.
pt_br: [Rust Standard Library](https://doc.rust-lang.org/std/): documentação completa da biblioteca padrão para Rust.
uk: [Стандартна бібліотека Rust](https://doc.rust-lang.org/std/): повна документація стандартної бібліотеки для Rust.

source: [The Rust Reference](https://doc.rust-lang.org/reference/): an incomplete book which describes the Rust grammar and memory model.
es: [The Rust Reference](https://doc.rust-lang.org/reference/): un libro incompleto que describe la gramática y el modelo de memoria de Rust.
fa: ‏ [The Rust Reference](https://doc.rust-lang.org/reference/): کتاب ناقصی که گرامر و مدل حافظه Rust را توصیف می‌کند.
ja: [The Rust Reference](https://doc.rust-lang.org/reference/): Rust の文法とメモリモデルについて説明している未完成の書籍です。
ko: [The Rust Reference](https://doc.rust-lang.org/reference/): 메모리 모델링과 러스트 문법을 설명하는 문서입니다.(아직 불완전하다함)
pt_br: [The Rust Reference](https://doc.rust-lang.org/reference/): um livro incompleto que descreve a gramática Rust e o modelo de memória.
uk: [Довідник Rust](https://doc.rust-lang.org/reference/): неповна книга, яка описує граматику та модель пам’яті Rust.

source: More specialized guides hosted on the official Rust site:
es: Consulta guías más especializadas en el sitio oficial de Rust:
fa: راهنماهای تخصصی بیشتر میزبانی شده در سایت رسمی Rust:
ja: Rust の公式サイトでホストされている、より専門的なガイド:
ko: 좀 더 전문적인 공식 가이드입니다:
pt_br: Mais guias especializados hospedados no site oficial do Rust:
uk: Більш спеціалізовані посібники розміщені на офіційному сайті Rust:

source: [The Rustonomicon](https://doc.rust-lang.org/nomicon/): covers unsafe Rust, including working with raw pointers and interfacing with other languages (FFI).
es: [The Rustonomicon](https://doc.rust-lang.org/nomicon/): trata de Rust inseguro, incluido cómo trabajar con punteros sin formato e interactuar con otros lenguajes (FFI).
fa: ‏[Rustonomicon](https://doc.rust-lang.org/nomicon/): که unsafe Rust ناامن را پوشش می‌دهد، از جمله کار با pointerهای خام و interfaceهای با زبان های دیگر (FFI) را تشریح می‌کند.
ja: [The Rustonomicon](https://doc.rust-lang.org/nomicon/): 未加工のポインタの操作や、他の言語（FFI）とのやり取りなど、安全でない Rust について説明しています。
ko: [The Rustonomicon](https://doc.rust-lang.org/nomicon/): 안전하지 않은 러스트, FFI, raw포인터 작업을 다룹니다.
pt_br: [O Rustonomicon](https://doc.rust-lang.org/nomicon/): cobre Rust inseguro, incluindo trabalhar com ponteiros brutos e fazer interface com outras linguagens (FFI).
uk: [The Rustonomicon](https://doc.rust-lang.org/nomicon/): охоплює небезпечний Rust, зокрема роботу з необробленими покажчиками та взаємодію з іншими мовами (FFI).

source: [Asynchronous Programming in Rust](https://rust-lang.github.io/async-book/): covers the new asynchronous programming model which was introduced after the Rust Book was written.
es: [Asynchronous Programming in Rust](https://rust-lang.github.io/async-book/): incluye el nuevo modelo de programación asíncrona que se introdujo después de que se escribiera el libro de Rust.
fa: ‏ [برنامه نویسی ناهمزمان در Rust](https://rust-lang.github.io/async-book/): مدل برنامه‌نویسی ناهمزمان (asynchronous programming) جدیدی را پوشش می‌دهد که پس از نگارش کتاب Rust معرفی شده است.
ja: [Asynchronous Programming in Rust](https://rust-lang.github.io/async-book/): Rust Book の執筆後に導入された新しい非同期プログラミング モデルについて説明しています。
ko: [Asynchronous Programming in Rust](https://rust-lang.github.io/async-book/): 러스트 북이 작성 된 이후 도입된 새로운 비동기 프로그래밍 모델을 다룹니다.
pt_br: [Programação assíncrona em Rust](https://rust-lang.github.io/async-book/): abrange o novo modelo de programação assíncrona que foi introduzido após o Rust Book ser escrito.
uk: [Асинхронне програмування в Rust](https://rust-lang.github.io/async-book/): охоплює нову модель асинхронного програмування, яка була представлена ​​після написання книги Rust.

source: [The Embedded Rust Book](https://doc.rust-lang.org/stable/embedded-book/): an introduction to using Rust on embedded devices without an operating system.
es: [The Embedded Rust Book](https://doc.rust-lang.org/stable/embedded-book/): una introducción sobre el uso de Rust en dispositivos integrados sin sistema operativo.
fa: ‏ [The Embedded Rust Book](https://doc.rust-lang.org/stable/embedded-book/): مقدمه‌ای بر استفاده از Rust در embedded deviceها که بدون سیستم‌عامل هستند را شامل می‌شود.
ja: [The Embedded Rust Book](https://doc.rust-lang.org/stable/embedded-book/): オペレーティング システムのない組み込みデバイスで Rust を使用する方法を紹介しています。
ko: [The Embedded Rust Book](https://doc.rust-lang.org/stable/embedded-book/): 운영체제가 없는 임베디드 장치에서의 러스트 사용법을 소개합니다.
pt_br: [The Embedded Rust Book](https://doc.rust-lang.org/stable/embedded-book/): uma introdução ao uso do Rust em dispositivos embarcados sem um sistema operacional.
uk: [The Embedded Rust Book](https://doc.rust-lang.org/stable/embedded-book/): ознайомлення з використанням Rust на вбудованих пристроях без операційної системи.

source: Unofficial Learning Material
es: Material de formación no oficial
fa: مطالب آموزشی غیر‌رسمی
ja: 非公式の学習教材
ko: 비공식적 학습 자료
pt_br: Material de aprendizagem não oficial
uk: Неофіційний навчальний матеріал

source: A small selection of other guides and tutorial for Rust:
es: Una pequeña selección de otras guías y tutoriales sobre Rust:
fa: مجموعه کوچکی از راهنماها و آموزش‌های دیگر برای Rust:
ja: Rust に関するその他のガイドとチュートリアル:
ko: 러스트에 대한 기타 안내서와 튜토리얼의 일부입니다:
pt_br: Uma pequena seleção de outros guias e tutoriais para Rust:
uk: Невелика добірка інших посібників і підручників для Rust:

source: [Learn Rust the Dangerous Way](http://cliffle.com/p/dangerust/): covers Rust from the perspective of low-level C programmers.
es: [Learn Rust the Dangerous Way](http://cliffle.com/p/dangerust/): trata Rust desde la perspectiva de los programadores de C de bajo nivel.
fa: ‏ [Learn Rust the Dangerous Way](http://cliffle.com/p/dangerust/): درباره Rust را از دیدگاه برنامه‌نویسان سطح پایین C پوشش می‌دهد.
ja: [Learn Rust the Dangerous Way](http://cliffle.com/p/dangerust/): 高度な知識を持たない C プログラマーの視点で Rust を解説しています。
ko: [Learn Rust the Dangerous Way](http://cliffle.com/p/dangerust/): C언어 프로그래머 관점에서 러스트를 다룹니다.
pt_br: [ALearn Rust the Dangerous Way](http://cliffle.com/p/dangerust/): cobre Rust da perspectiva de programadores C de baixo nível.
uk: [Вивчіть Rust небезпечним способом](http://cliffle.com/p/dangerust/): розповідається про Rust з точки зору програмістів на C низького рівня.

source: [Rust for Embedded C Programmers](https://opentitan.org/book/doc/rust_for_c_devs.html): covers Rust from the perspective of developers who write firmware in C.
fa: ‏ [Rust for Embedded C Programmers](https://opentitan.org/book/doc/rust_for_c_devs.html): که Rust را از دیدگاه توسعه‌دهندگانی که سیستم‌عامل را به زبان C می‌نویسند پوشش می‌دهد.
uk: [Rust для Embedded C програмістів](https://opentitan.org/book/doc/rust_for_c_devs.html): розповідається про Rust з точки зору розробників, які пишуть вбудоване програмне забезпечення на C.

source: [Rust for professionals](https://overexact.com/rust-for-professionals/): covers the syntax of Rust using side-by-side comparisons with other languages such as C, C++, Java, JavaScript, and Python.
es: [Rust for professonals](https://overexact.com/rust-for-professionals/): trata la sintaxis de Rust comparándola con otros lenguajes, como C, C++, Java, JavaScript y Python.
fa: ‏ [Rust for Professionals](https://overexact.com/rust-for-professionals/): که syntax مورد استفاده Rust را به کمک مقایسه‌های جانبی با زبان‌های دیگر مانند C، C++، Java، JavaScript و Python پوشش می‌دهد.
ja: [Rust for professionals](https://overexact.com/rust-for-professionals/): 他の言語（C、C++、Java、JavaScript、Python など）と並べて比較しながら、Rust の構文について説明しています。
ko: [Rust for professionals](https://overexact.com/rust-for-professionals/): 다른 언어(C/C++, Java, Python, Javascript)와의 병렬비교를 사용하여 러스트 문법을 다룹니다.
pt_br: [Rust for professionals](https://overexact.com/rust-for-professionals/): cobre a sintaxe do Rust usando comparações lado a lado com outras linguagens como C, C++, Java, JavaScript e Python.
uk: [Rust для професіоналів](https://overexact.com/rust-for-professionals/): висвітлює синтаксис Rust, використовуючи порівняння з іншими мовами, такими як C, C++, Java, JavaScript та Python.

source: [Rust on Exercism](https://exercism.org/tracks/rust): 100+ exercises to help you learn Rust.
es: [Rust on Exercism](https://exercism.org/tracks/rust): más de 100 ejercicios para aprender Rust.
fa: ‏ [Rust on Exercism](https://exercism.org/tracks/rust): بیش از ۱۰۰ تمرین برای کمک به یادگیری Rust را شامل می‌شود.
ja: [Rust on Exercism](https://exercism.org/tracks/rust): Rust の学習に役立つ 100 以上の演習が用意されています。
ko: [Rust on Exercism](https://exercism.org/tracks/rust): 러스트를 배우는데 도움이 되는 100개 이상의 연습문제
pt_br: [Rust on Exercism](https://exercism.org/tracks/rust): mais de 100 exercícios para lhe ajudar a aprender Rust.
uk: [Rust on Exercism](https://exercism.org/tracks/rust): понад 100 вправ, які допоможуть вам вивчити Rust.

source: [Ferrous Teaching Material](https://ferrous-systems.github.io/teaching-material/index.html): a series of small presentations covering both basic and advanced part of the Rust language. Other topics such as WebAssembly, and async/await are also covered.
es: [Ferrous Teaching Material](https://ferrous-systems.github.io/teaching-material/index.html): una serie de pequeñas presentaciones que cubren tanto la parte básica como la parte más avanzada del lenguaje Rust. También se tratan otros temas como WebAssembly y async/await.
fa: ‏ [Ferrous Teaching Material](https://ferrous-systems.github.io/teaching-material/index.html): مجموعه‌ای از ارائه‌های کوچک که هم بخش پایه و هم پیشرفته زبان Rust را پوشش می‌دهد. موضوعات دیگری مانند WebAssembly و async/wait نیز پوشش داده شده است.
ja: [Ferrous Teaching Material](https://ferrous-systems.github.io/teaching-material/index.html): Rust 言語の基本的な部分と高度な部分の両方をカバーした、一連のコンパクトなプレゼンテーションです。WebAssembly、async / await などの他のトピックも扱っています。
ko: [Ferrous Teaching Material](https://ferrous-systems.github.io/teaching-material/index.html): 러스트 언어의 기본부터 고급을 전부 다루는 일련의 작은 프레젠테이션, 웹 어셈블리, async/await 같은 부분도 함께 다룹니다.
pt_br: [Ferrous Teaching Material](https://ferrous-systems.github.io/teaching-material/index.html): uma série de pequenas apresentações abrangendo tanto a parte básica quanto a avançada da Linguagem Rust. Outros tópicos como WebAssembly e async/await também são abordados.
uk: [Навчальний матеріал Ferrous](https://ferrous-systems.github.io/teaching-material/index.html): серія невеликих презентацій, що охоплюють базову та розширену частину мови Rust. Також розглядаються інші теми, такі як WebAssembly та async/await.

source: [Advanced testing for Rust applications](https://rust-exercises.com/advanced-testing/): a self-paced workshop that goes beyond Rust's built-in testing framework. It covers `googletest`, snapshot testing, mocking as well as how to write your own custom test harness.
uk: [Розширене тестування для прикладних програм Rust](https://rust-exercises.com/advanced-testing/): воркшоп для самостійної роботи, який виходить за рамки вбудованого тестового фреймворку Rust. Він охоплює `googletest`, тестування знімками, імітацію, а також те, як написати свій власний тестовий інструментарій.
