Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: For example, beginning with _n<sub>1</sub>_ = 3:
fa: به عنوان مثال، با شروع از _n<sub>i</sub>_ = ۳:
uk: Наприклад, починаючи з _n<sub>1</sub>_ = 3:

source: 3 is odd, so _n<sub>2</sub>_ = 3 * 3 + 1 = 10;
fa: ۳ فرد است، پس _n<sub>2</sub>_ = ۳ * ۳ + ۱ = 10;
uk: 3 є непарним, таким чином _n<sub>2</sub>_ = 3 * 3 + 1 = 10;

source: 10 is even, so _n<sub>3</sub>_ = 10 / 2 = 5;
fa: ۱۰ زوج است، پس _n<sub>3</sub>_ = ۱۰ / ۲ = ۵;
uk: 10 є парним, таким чином _n<sub>3</sub>_ = 10 / 2 = 5;

source: 5 is odd, so _n<sub>4</sub>_ = 3 * 5 + 1 = 16;
fa: ۵ فرد است، پس _n<sub>4</sub>_ = ۳ * ۵ + ۱ = 16;
uk: 5 є непарним, таким чином _n<sub>4</sub>_ = 3 * 5 + 1 = 16;

source: 16 is even, so _n<sub>5</sub>_ = 16 / 2 = 8;
fa: ۱۶ زوج است، پس _n<sub>5</sub>_ = ۱۶ / ۲ = 8;
uk: 16 є парним, таким чином _n<sub>5</sub>_ = 16 / 2 = 8;

source: 8 is even, so _n<sub>6</sub>_ = 8 / 2 = 4;
fa: ۸ زوج است، پس _n<sub>6</sub>_ = ۸ / ۲ = 4;
uk: 8 є парним, таким чином _n<sub>6</sub>_ = 8 / 2 = 4;

source: 4 is even, so _n<sub>7</sub>_ = 4 / 2 = 2;
fa: ۴ زوج است، پس _n<sub>7</sub>_ = ۴ / ۲ = ۲;
uk: 4 є парним, таким чином _n<sub>7</sub>_ = 4 / 2 = 2;

source: 2 is even, so _n<sub>8</sub>_ = 1; and
fa: ۲ زوج است، پس _n<sub>۸</sub>_ = ۱; و
uk: 2 є парним, таким чином _n<sub>8</sub>_ = 1; та

source: the sequence terminates.
fa: دنباله به پایان می‌رسد.
ja: 数列は終了します。
pt_br: a sequência termina.
uk: послідовність завершується.

source: Write a function to calculate the length of the collatz sequence for a given initial `n`.
fa: یک تابع بنویسید تا طول دنباله Collatz برای یک n اولیه داده شده را محاسبه کند.
ja: 任意の初期値 `n` に対するコラッツ数列の長さを計算する関数を作成します。
pt_br: Escreva uma função para calcular o comprimento da sequência de Collatz para um dado `n` inicial.
uk: Напишіть функцію, яка обчислює довжину коллатц-послідовності для заданого початкового `n`.

source: /// Determine the length of the collatz sequence beginning at `n`.
ja: /// `n` から始まるコラッツ数列の長さを決定。
pt_br: /// Determine o comprimento da sequência de Collatz começando em `n`.
uk: /// Визначте довжину послідовності колатів, яка починається з `n`.

source: "Length: {}"
pt_br: "Comprimento: {}"
uk: "Довжина: {}"

source: Welcome Back
fa: خوش آمد
ja: おかえり
pt_br: Bem-vindo de volta
uk: Ласкаво просимо назад

source: A value of the array type `[T; N]` holds `N` (a compile-time constant) elements of the same type `T`. Note that the length of the array is _part of its type_, which means that `[u8; 3]` and `[u8; 4]` are considered two different types. Slices, which have a size determined at runtime, are covered later.
fa: یک مقدار از نوع آرایه <span dir=ltr>`[T; N]`</span> دارای <span dir=ltr>`N`</span> (یک ثابت زمان کامپایل) عنصر از نوع یکسان <span dir=ltr>`T`</span> است. توجه داشته باشید که طول آرایه بخشی از نوع آن است، به این معنی که <span dir=ltr>`[u8; 3]`</span> و <span dir=ltr>`[u8; 4]`</span> دو نوع متفاوت در نظر گرفته می‌شوند.
ja: 配列型 `[T; N]`には、同じ型 `T` の `N`（コンパイル時定数）個の要素が保持されます。なお、配列の長さはその型の一部分です。つまり、`[u8; 3]` と `[u8; 4]` は 2 つの異なる型とみなされます。スライス（サイズが実行時に決定される）については後で説明します。
pt_br: O valor do tipo matriz `[T; N]` comporta `N` elementos (constante em tempo de compilação) do mesmo tipo `N`. Note que o tamanho de uma matriz é _parte do seu tipo_, o que significa que `[u8; 3]` e `[u8; 4]` são considerados dois tipos diferentes. _Slices_ (fatias), que têm um tamanho determinado em tempo de execução, são abordados mais tarde.
uk: Значення типу масиву `[T; N]` містить `N` (константа часу компіляції) елементів того самого типу `T`. Зверніть увагу, що довжина масиву є _частиною його типу_, що означає, що `[u8; 3]` і `[u8; 4]` вважаються двома різними типами. Зрізи, розмір яких визначається під час виконання, покриваються пізніше.

source: Try accessing an out-of-bounds array element. Array accesses are checked at runtime. Rust can usually optimize these checks away, and they can be avoided using unsafe Rust.
fa: سعی کنید به یک عنصر آرایه خارج از محدوده دسترسی داشته باشید. دسترسی های آرایه در زمان اجرا بررسی می شود. زنگ معمولاً می‌تواند این بررسی‌ها را از بین ببرد و با استفاده از Rust ناایمن از آنها جلوگیری کرد.
ja: 境界外の配列要素にアクセスしてみてください。配列アクセスは実行時にチェックされます。Rust では通常、これらのチェックを最適化により除去できます（Unsafe Rust を使用することで回避できます）。
pt_br: Tente acessar um elemento de matriz fora dos limites. Os acessos a matrizes são verificados em tempo de execução. Rust geralmente pode otimizar essas verificações e elas podem ser evitadas usando Rust inseguro.
uk: Спробуйте доступ до елементу масиву, що знаходиться за межами масиву. Доступ до масиву перевіряється під час виконання. Зазвичай Rust може оптимізувати ці перевірки, і їх можна уникнути, використовуючи небезпечний Rust.

source: We can use literals to assign values to arrays.
es: Podemos usar literales para asignar valores a arrays.
fa: ما می‌توانیم از مقادیر ثابت برای انتساب مقادیر به آرایه‌ها استفاده کنیم.
ja: リテラルを使用して配列に値を代入することができます。
ko: 리터럴을 사용하여 배열에 값을 할당할 수 있습니다.
pt_br: Nós podemos usar literais para atribuir valores para matrizes.
uk: Ми можемо використовувати літерали для присвоєння значень масивам.

source: The `println!` macro asks for the debug implementation with the `?` format parameter: `{}` gives the default output, `{:?}` gives the debug output. Types such as integers and strings implement the default output, but arrays only implement the debug output. This means that we must use debug output here.
fa: ماکرو <span dir=ltr>`println!`</span> با پارامتر فرمت <span dir=ltr>`?`</span> نیازمند پیاده سازی دیباگ است: <span dir=ltr>`{}`</span> خروجی پیش فرض را می‌دهد، <span dir=ltr>`{:?}`</span> خروجی دیباگ را می‌دهد. انواع‌ای مانند اعداد صحیح و رشته‌ها خروجی پیش فرض را پیاده سازی می‌کنند، اما آرایه‌ها فقط خروجی دیباگ را پیاده سازی می‌کنند. این بدان معناست که ما باید در اینجا از خروجی دیباگ استفاده کنیم.
ja: `println!` マクロは、`?` 形式のパラメータを使用してデバッグ実装を要求します。つまり、`{}` はデフォルトの出力を、`{:?}` はデバッグ出力を提供します。整数や文字列などの型はデフォルトの出力を実装しますが、配列はデバッグ出力のみを実装します。そのため、ここではデバッグ出力を使用する必要があります。
pt_br: A macro `println!` pede a implementação de depuração com o parâmetro de formato `?`: `{}` dá a saída padrão, `{:?}` dá a saída de depuração. Tipos como inteiros e strings implementam a saída padrão, mas matrizes implementam apenas a saída de depuração. Isso significa que devemos usar a saída de depuração aqui.
uk: Макрос `println!` запитує реалізацію налагодження за допомогою параметра формату `?`: `{}` - виведення за замовчуванням, `{:?}` - виведення налагодження. Такі типи, як цілі числа і рядки, реалізують виведення за замовчуванням, але масиви реалізують лише виведення для налагодження. Це означає, що тут ми повинні використовувати налагоджувальний вивід.

source: Adding `#`, eg `{a:#?}`, invokes a "pretty printing" format, which can be easier to read.
es: Si se añade `#`, por ejemplo `{a:#?}`, se da formato al texto para facilitar la lectura.
fa: اضافه کردن <span dir=ltr>`#`</span>، مانند <span dir=ltr>`{a:#?}`</span>، یک فرمت «چاپ زیبا» را فراخوانی می‌کند که می‌تواند خواندن آن را آسان تر کند.
ja: `#` を追加すると（例: `{a:#?}`）、読みやすい「プリティ プリント」形式が呼び出されます。
ko: `#`을 추가하면(`{a:#?}`) 좀 더 읽기 쉬운 "이쁜" 형태로 출력이 됩니다.
pt_br: Adicionando `#`, p.ex. `{a:#?}`, invoca um formato "_pretty printing_", que pode ser mais legível.
uk: Додавання `#`, наприклад `{a:#?}`, викликає формат "гарного друку", який може бути легшим для читання.

source: Like arrays, tuples have a fixed length.
es: Al igual que los arrays, las tuplas tienen una longitud fija.
fa: مانند آرایه‌ها، تاپل‌ها نیز دارای طول ثابت هستند.
ja: 配列と同様に、タプルの長さは固定されています。
ko: 배열과 마찬가지로 튜플은 고정 길이를 갖습니다.
pt_br: Assim como matrizes, tuplas têm tamanho fixo.
uk: Як і масиви, кортежі мають фіксовану довжину.

source: Tuples group together values of different types into a compound type.
es: Las tuplas agrupan valores de diferentes tipos en un tipo compuesto.
fa: تاپل‌ها مقادیر انواع مختلف را در یک نوع مرکب کنار هم قرار می‌دهند.
ja: タプルは、異なる型の値を複合型にグループ化します。
ko: 튜플은 서로 다른 타입의 값들을 하나의 복합 타입으로 묶습니다.
pt_br: Tuplas agrupam valores de diferentes tipos em um tipo composto.
uk: Кортежі групують значення різних типів у складений тип.

source: Fields of a tuple can be accessed by the period and the index of the value, e.g. `t.0`, `t.1`.
es: Se puede acceder a los campos de una tupla por el punto y el índice del valor, por ejemplo, `t.0`, `t.1`.
fa: می‌توان به فیلدهای یک تاپل با استفاده از نقطه و شماره اندیس مقدار، مانند <span dir=ltr>`t.0`</span>، <span dir=ltr>`t.1`</span> دسترسی پیدا کرد.
ja: タプルのフィールドには、ピリオドと値のインデックス（例: `t.0`、`t.1`）でアクセスできます。
ko: 튜플에 속한 값은 `t.0`, `t.1`과 같이 인덱스로 접근할 수 있습니다.
pt_br: Campos de uma tupla podem ser acessados com um ponto e o índice do valor, p.ex. `t.0`, `t.1`.
uk: Доступ до полів кортежу можна отримати після крапки з індексом значення, наприклад. `t.0`, `t.1`.

source: The empty tuple `()` is referred to as the "unit type" and signifies absence of a return value, akin to `void` in other languages.
fa: تاپل خالی `()` به عنوان `unit type` نامیده می‌شود و نشان‌دهنده عدم وجود مقدار بازگشتی است، مشابه `void` در زبان‌های دیگر.
uk: Порожній кортеж `()` називається " типом одиниці" і означає відсутність значення, що повертається, подібно до `void` в інших мовах.

source: The `for` statement supports iterating over arrays (but not tuples).
fa: عبارت `for` از تکرار روی آرایه ها (اما نه تاپل ها) پشتیبانی می کند.
ja: for ステートメントでは、配列の反復処理がサポートされています（タプルはサポートされていません）。
pt_br: O comando `for` suporta iteração sobre matrizes (mas não tuplas).
uk: Оператор `for` підтримує ітерацію над масивами (але не кортежами).

source: This functionality uses the `IntoIterator` trait, but we haven't covered that yet.
fa: این قابلیت از ویژگی `IntoIterator` استفاده می‌کند، اما ما هنوز به آن پرداخته‌ایم.
ja: この機能は `IntoIterator` トレイトを使用しますが、これはまだ説明していません。
pt_br: Esta funcionalidade usa o _trait_ `IntoIterator`, mas ainda não a abordamos.
uk: Ця функціональність використовує трейт `IntoIterator`, але ми ще не розглядали його.

source: The `assert_ne!` macro is new here. There are also `assert_eq!` and `assert!` macros. These are always checked, while debug-only variants like `debug_assert!` compile to nothing in release builds.
uk: Макрос `assert_ne!` тут новий. Існують також макроси `assert_eq!` та `assert!`. Вони завжди перевіряються, тоді як варіанти лише для налагодження, такі як `debug_assert!`, не компілюються у релізних збірках.

source: When working with tuples and other structured values it's common to want to extract the inner values into local variables. This can be done manually by directly accessing the inner values:
fa: هنگام کار با تاپل ها و سایر مقادیر ساختاریافته، معمول است که بخواهید مقادیر داخلی را در متغیرهای محلی استخراج کنید. این را می توان به صورت دستی با دسترسی مستقیم به مقادیر داخلی انجام داد:
uk: При роботі з кортежами та іншими структурованими значеннями часто виникає потреба витягти внутрішні значення у локальні змінні. Це можна зробити вручну шляхом прямого доступу до внутрішніх значень:

source: However, Rust also supports using pattern matching to destructure a larger value into its constituent parts:
fa: با این حال، Rust همچنین از استفاده از تطبیق الگو برای تخریب یک مقدار بزرگتر در بخش های تشکیل دهنده آن پشتیبانی می کند:
uk: Однак, Rust також підтримує використання зіставлення шаблонів для розбиття більшого значення на складові частини:

source: The patterns used here are "irrefutable", meaning that the compiler can statically verify that the value on the right of `=` has the same structure as the pattern.
fa: الگوهای استفاده شده در اینجا "irrefutable" هستند، به این معنی که کامپایلر می تواند به طور ایستا تأیید کند که مقدار سمت راست `=` ساختاری مشابه الگو دارد.
uk: Шаблони, що використовуються тут, є "неспростовними", тобто компілятор може статично перевірити, що значення праворуч від `=` має таку саму структуру, як і шаблон.

source: A variable name is an irrefutable pattern that always matches any value, hence why we can also use `let` to declare a single variable.
fa: نام متغیر یک الگوی انکارناپذیر است که همیشه با هر مقداری مطابقت دارد، از این رو می‌توانیم از «let» برای اعلام یک متغیر استفاده کنیم.
uk: Ім'я змінної - це неспростовний шаблон, який завжди відповідає будь-якому значенню, тому ми також можемо використовувати `let` для оголошення однієї змінної.

source: Rust also supports using patterns in conditionals, allowing for equality comparison and destructuring to happen at the same time. This form of pattern matching will be discussed in more detail later.
fa: Rust همچنین از استفاده از الگوها در شرطی‌ها پشتیبانی می‌کند و امکان مقایسه برابری و تخریب ساختار را در همان زمان فراهم می‌کند. این شکل از تطبیق الگو بعداً با جزئیات بیشتری مورد بحث قرار خواهد گرفت.
uk: Rust також підтримує використання шаблонів в умовних операторах, що дозволяє виконувати порівняння на рівність і деструкцію одночасно. Ця форма порівняння шаблонів буде розглянута більш детально пізніше.

source: Edit the examples above to show the compiler error when the pattern doesn't match the value being matched on.
fa: مثال‌های بالا را ویرایش کنید تا خطای کامپایلر در زمانی که الگو با مقدار مطابقت‌شده مطابقت ندارد نشان داده شود.
uk: Відредагуйте приклади вище, щоб показати помилку компілятора, коли шаблон не збігається зі значенням, що порівнюється.

source: Arrays can contain other arrays:
fa: آرایه ها می توانند آرایه های دیگری نیز داشته باشند:
ja: 配列には他の配列を含めることができます。
pt_br: Matrizes podem conter outras matrizes:
uk: Масиви можуть містити інші масиви:

source: What is the type of this variable?
fa: نوع این متغیر چیست؟
pt_br: Qual é o tipo desta variável?
uk: Який тип цієї змінної?

source: Use an array such as the above to write a function `transpose` which will transpose a matrix (turn rows into columns):
fa: از آرایه‌ای مشابه مثال بالا برای نوشتن تابع <span dir=ltr>`transpose`</span> استفاده کنید که یک ماتریس را جابجا می‌کند (ردیف‌ها را به ستون‌ها تبدیل می‌کند):
ja: 上記のような配列を使用して、行列を転置（行を列に変換）する `transpose` 関数を記述します。
pt_br: Use uma matriz como a acima para escrever uma função `transpose` que transporá uma matriz (transformar linhas em colunas):
uk: Використовуйте масив, подібний до наведеного вище, для написання функції `transpose`, яка транспонує матрицю (перетворює рядки у стовпці):

source: Copy the code below to <https://play.rust-lang.org/> and implement the function. This function only operates on 3x3 matrices.
fa: کد زیر را در <https://play.rust-lang.org/> کپی کرده و توابع را پیاده‌سازی کنید:
uk: Скопіюйте наведений нижче код на <https://play.rust-lang.org/> і реалізуйте функцію. Ця функція працює лише з матрицями 3x3.

source: // TODO: remove this when you're done with your implementation.
fa: // TODO: این را زمانی که پیاده‌سازی‌تان تمام شد حذف کنید.
ja: // TODO: 実装が完了したら、これを削除します。
pt_br: // TODO: remova isto quando você terminar sua implementação.
uk: // TODO: видаліть це, коли закінчите реалізацію.

source: // <-- the comment makes rustfmt add a newline
fa: ‏// <-- این کامنت باعث می‌شود rustfmt یک خط جدید اضافه کند.
ja: // <-- このコメントにより rustfmt で改行を追加
pt_br: // <-- o comentário faz com que o rustfmt adicione uma nova linha
uk: // <-- коментар змушує rustfmt додати новий рядок

source: "matrix: {:#?}"
pt_br: "matriz: {:#?}"
uk: "матриця: {:#?}"

source: "transposed: {:#?}"
fa: "جابجا شده است: {:#?}"
pt_br: "transposta: {:#?}"
uk: "транспонована: {:#?}"

source: A reference provides a way to access another value without taking ownership of the value, and is also called "borrowing". Shared references are read-only, and the referenced data cannot change.
uk: Посилання забезпечує доступ до іншого значення без отримання права власності на нього, і також називається "запозиченням". Спільні посилання доступні лише для читання, і дані, на які вони посилаються, не можуть бути змінені.

source: A shared reference to a type `T` has type `&T`. A reference value is made with the `&` operator. The `*` operator "dereferences" a reference, yielding its value.
fa: یک مرجع مشترک به یک نوع `T` دارای نوع `&T` است. یک مقدار مرجع با عملگر `&` ساخته می شود. عملگر `*` یک مرجع را "ارجاع مجدد" می کند و مقدار آن را به دست می دهد.
ja: 型 `T` への共有参照の型は `&T` です。参照値は `&` 演算子で作成されます。`*` 演算子は参照を「逆参照」し、その値を生成します。
pt_br: Uma referência compartilhada a um tipo `T` tem tipo `&T`. Um valor de referência é feito com o operador `&`. O operador `*` "desreferencia" uma referência, produzindo seu valor.
uk: Спільне посилання на тип `T` має тип `&T`. Значення посилання робиться за допомогою оператора `&`. Оператор `*` "розіменовує" посилання, повертаючи його значення.

source: Rust will statically forbid dangling references:
es: Rust prohibirá estáticamente las referencias colgantes:
fa: راست بطور استاتیک مراجع تعلیق شده (dangling) را ممنوع می‌کند:
ja: Rust はダングリング参照を静的に禁止します。
ko: 러스트는 허상(dangling) 참조를 컴파일러 단계에서 찾아내고 금지합니다:
pt_br: Rust estaticamente proibirá referências pendentes:
uk: Rust статично забороняє висячі посилання:

source: References can never be null in Rust, so null checking is not necessary.
uk: Посилання ніколи не можуть бути null у Rust, тому перевірка на null не є обов'язковою.

source: A reference is said to "borrow" the value it refers to, and this is a good model for students not familiar with pointers: code can use the reference to access the value, but is still "owned" by the original variable. The course will get into more detail on ownership in day 3.
fa: گفته می‌شود که یک مرجع مقداری را که به آن ارجاع می‌دهد "borrow" (قرض) می‌کند، و این مدل خوبی برای دانش‌آموزانی است که با اشاره‌گرها آشنا نیستند: کد می‌تواند از مرجع برای دسترسی به مقدار استفاده کند، اما همچنان متعلق به متغیر اصلی است. این دوره در روز 3 به جزئیات بیشتری در مورد مالکیت خواهد پرداخت.
ja: 参照とは、参照する値を「借用する」ことだと言われていますが、これはポインタに慣れていない受講者にとって理解しやすい説明です。コードでは参照を使用して値にアクセスできますが、その値は元の変数によって「所有」されたままとなります。所有については、コースの 3 日目で詳しく説明します。
pt_br: Uma referência é dita que "_borrow_" (empresta) o valor a que se refere, e este é um bom modelo para estudantes não familiarizados com ponteiros: o código pode usar a referência para acessar o valor, mas ainda é _"owned"_ (propriedade) da variável original. O curso entrará em mais detalhes sobre _ownership_ no dia 3.
uk: Кажуть, що посилання "позичає" значення, на яке воно посилається, і це гарна модель для слухачів, які не знайомі з вказівниками: код може використовувати посилання для доступу до значення, але все одно залишається "власністю" вихідної змінної. Більш детально про володіння буде розглянуто на третьому дні курсу.

source: References are implemented as pointers, and a key advantage is that they can be much smaller than the thing they point to. Students familiar with C or C++ will recognize references as pointers. Later parts of the course will cover how Rust prevents the memory-safety bugs that come from using raw pointers.
fa: مراجع به عنوان اشاره گر پیاده سازی می شوند و یک مزیت کلیدی این است که می توانند بسیار کوچکتر از چیزی باشند که به آن اشاره می کنند. دانش آموزانی که با C یا C++ آشنا هستند، مراجع را به عنوان اشاره گر تشخیص می دهند. بخش‌های بعدی دوره به این موضوع می‌پردازد که چگونه Rust از اشکالات ایمنی حافظه ناشی از استفاده از نشانگرهای خام جلوگیری می‌کند.
ja: 参照はポインタとして実装されます。主な利点は、参照先よりもはるかに小さくできることです。C または C++ に精通している受講者は、参照をポインタとして認識できます。このコースの後半で、未加工ポインタの使用によるメモリ安全性のバグを Rust で防止する方法について説明します。
pt_br: Referências são implementadas como ponteiros, e uma vantagem chave é que podem ser muito menores do que a coisa a que apontam. Os alunos familiarizados com C ou C++ reconhecerão referências como ponteiros. Partes posteriores do curso abordarão como o Rust impede os bugs de segurança de memória que vêm do uso de ponteiros brutos.
uk: Посилання реалізовано як вказівники, і ключовою перевагою є те, що вони можуть бути набагато меншими за об'єкт, на який вони вказують. Слухачі, знайомі з C або C++, розпізнають посилання як вказівники. У наступних частинах курсу буде розглянуто, як Rust запобігає помилкам, пов'язаним з безпекою пам'яті, які виникають при використанні сирих вказівників.

source: Rust does not automatically create references for you - the `&` is always required.
fa: Rust به طور خودکار برای شما مراجع ایجاد نمی کند - `&` همیشه مورد نیاز است.
ja: Rust は参照を自動的に作成しないため、常に `&` を付ける必要があります。
pt_br: O Rust não cria automaticamente referências para você - o `&` é sempre necessário.
uk: Rust не створює посилання автоматично - завжди потрібно використовувати `&`.

source: Rust will auto-dereference in some cases, in particular when invoking methods (try `r.is_ascii()`). There is no need for an `->` operator like in C++.
fa: راست در برخی موارد به‌طور خودکار از Dereference می‌کند، به‌ویژه هنگام فراخوانی متدها (<span dir=ltr>`ref_x.count_ones()`</span> را امتحان کنید).
uk: У деяких випадках Rust виконує автоматичне розіменування, зокрема під час виклику методів (спробуйте `r.is_ascii()`). Тут не потрібен оператор `->`, як у C++.

source: In this example, `r` is mutable so that it can be reassigned (`r = &b`). Note that this re-binds `r`, so that it refers to something else. This is different from C++, where assignment to a reference changes the referenced value.
fa: در این مثال، `r` قابل تغییر است تا بتوان آن را مجدداً اختصاص داد (`r = &b`). توجه داشته باشید که این `r` را دوباره متصل می کند، به طوری که به چیز دیگری اشاره می کند. این با C++ متفاوت است، جایی که انتساب به یک مرجع مقدار مرجع را تغییر می دهد.
ja: この例では、`r` は可変であるため、再代入が可能です（`r = &b`）。これにより `r` が再バインドされ、他の値を参照するようになります。これは、参照に代入すると参照先の値が変更される C++ とは異なります。
pt_br: Neste exemplo, `r` é mutável para que possa ser reatribuído (`r = &b`). Observe que isso re-associa `r`, de modo que se refere a outra coisa. Isso é diferente do C++, onde a atribuição a uma referência altera o valor referenciado.
uk: У цьому прикладі `r` є мутабельним, тому його можна перепризначити (`r = &b`). Зверніть увагу, що це повторно зв'язує `r`, так що він посилається на щось інше. Це відрізняється від C++, де присвоювання посилання змінює значення, на яке воно посилається.

source: A shared reference does not allow modifying the value it refers to, even if that value was mutable. Try `*r = 'X'`.
fa: یک مرجع مشترک اجازه تغییر مقداری را که به آن ارجاع می دهد را نمی دهد، حتی اگر آن مقدار قابل تغییر باشد. "*r = "X" را امتحان کنید.
ja: 共有参照では、値が可変であっても、参照先の値は変更できません。`*r = 'X'` と指定してみてください。
pt_br: Uma referência compartilhada não permite modificar o valor a que se refere, mesmo que esse valor seja mutável. Tente `*r = 'X'`.
uk: Спільне посилання не дозволяє змінювати значення, на яке воно посилається, навіть якщо це значення було змінним. Спробуйте `*r = 'X'`.

source: Rust is tracking the lifetimes of all references to ensure they live long enough. Dangling references cannot occur in safe Rust. `x_axis` would return a reference to `point`, but `point` will be deallocated when the function returns, so this will not compile.
fa: Rust طول عمر همه مراجع را ردیابی می کند تا اطمینان حاصل شود که آنها به اندازه کافی عمر می کنند. ارجاعات آویزان نمی توانند در Rust ایمن رخ دهند. `x_axis` یک ارجاع به `point` برمی‌گرداند، اما «نقطه» زمانی که تابع برمی‌گردد، تخصیص داده می‌شود، بنابراین کامپایل نمی‌شود.
ja: Rust は、すべての参照のライフタイムを追跡して、十分な存続期間を確保しています。安全な Rust では、ダングリング参照が発生することはありません。`x_axis` は `point` への参照を返しますが、関数が戻ると `point` の割り当てが解除されるため、コンパイルされません。
pt_br: O Rust está rastreando os tempos de vida de todas as referências para garantir que elas vivam tempo suficiente. Referências pendentes não podem ocorrer em Rust seguro. `x_axis` retornaria uma referência a `point`, mas `point` será desalocado quando a função retornar, então isso não será compilado.
uk: Rust відстежує час життя всіх посилань, щоб переконатися, що вони живуть достатньо довго. У безпечному Rust'і не може бути "висячих" посилань. Функція `x_axis` поверне посилання на `point`, але `point` буде звільнено, коли функція повернеться, тому це не буде скомпільовано.
