Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: [`Send`](https://doc.rust-lang.org/std/marker/trait.Send.html): a type `T` is `Send` if it is safe to move a `T` across a thread boundary.
es: [`Send`](https://doc.rust-lang.org/std/marker/trait.Send.html): un tipo `T` es `Send` si es seguro mover un `T` entre los límites de un hilo.
fa: ‏[`Send`](https://doc.rust-lang.org/std/marker/trait.Send.html): در صورتی که جابجایی `T` در امتداد thread boundary ایمن باشد، تایپ `T` از جنس `Send` است.
ja: [`Send`](https://doc.rust-lang.org/std/marker/trait.Send.html): スレッド境界をまたいでの型`T`のムーブが安全に行える場合、型`T`は`Send`である。
ko: [`Send`](https://doc.rust-lang.org/std/marker/trait.Send.html): `T`가 스레드 간 이동이 안전하다면, `T`의 타입은 `Send`입니다.
pt_br: [`Send`](https://doc.rust-lang.org/std/marker/trait.Send.html): um tipo `T` é `Send` se for seguro mover um `T` entre _threads_
uk: [`Send`](https://doc.rust-lang.org/std/marker/trait.Send.html): тип `T` є `Send`, якщо безпечно переміщувати `T` через межу потоку.

source: [`Sync`](https://doc.rust-lang.org/std/marker/trait.Sync.html): a type `T` is `Sync` if it is safe to move a `&T` across a thread boundary.
es: [`Sync`](https://doc.rust-lang.org/std/marker/trait.Sync.html): un tipo `T` es `Sync` si es seguro mover un `&T` entre los límites de un hilo.
fa: ‏[`Sync`](https://doc.rust-lang.org/std/marker/trait.Sync.html): در صورتی که جابجایی یک `&T` در سراسر یک thread boundary ایمن باشد، یک تایپ `T` از جنس `Sync` است.
ja: [`Sync`](https://doc.rust-lang.org/std/marker/trait.Sync.html): スレッド境界をまたいで`&T`のムーブが安全に行える場合、型`T`は`Sync`である。
ko: [`Sync`](https://doc.rust-lang.org/std/marker/trait.Sync.html): `&T`가 스레드 간 이동이 안전하다면, `&T`의 타입은 `Sync`입니다.
pt_br: [`Sync`](https://doc.rust-lang.org/std/marker/trait.Sync.html): um tipo `T` é `Sync` se for seguro mover um `&T` entre _threads_
uk: [`Sync`](https://doc.rust-lang.org/std/marker/trait.Sync.html): тип `T` є `Sync`, якщо безпечно переміщувати `&T` через межу потоку.

source: `Send` and `Sync` are [unsafe traits](../../unsafe-rust/unsafe-traits.md). The compiler will automatically derive them for your types as long as they only contain `Send` and `Sync` types. You can also implement them manually when you know it is valid.
fa: ‏`Send` و `Sync` [ویژگی‌های ناامن] هستند (../../unsafe-rust/unsafe-traits.md). کامپایلر به‌طور خودکار آنها را برای تایپ‌های شما مشتق می‌کند تا زمانی که فقط دارای انواع `Send` و `Sync` باشند. شما همچنین می توانید آنها را به صورت دستی پیاده سازی کنید به‌خصوص زمانی که می دانید مقدار آن معتبر است.
uk: `Send` та `Sync` є [небезпечними трейтами](../unsafe/unsafe-traits.md). Компілятор автоматично виведе їх для ваших типів, якщо вони містять лише типи `Send` і `Sync`. Ви також можете реалізувати їх вручну, якщо знаєте, що це допустимо.

source: One can think of these traits as markers that the type has certain thread-safety properties.
es: Se podría pensar en estos traits como marcadores que indican que el tipo tiene ciertas propiedades de seguridad en hilos.
fa: می‌توان این traitها را به عنوان نشانگرهایی در نظر گرفت که نوعی ویژگی thread-safety خاصی را دارد.
ja: これらのトレイトは、ある型が特定のスレッドセーフの特性を持っていることを示すマーカーと考えることもできます。
ko: `Sync`와 `Send`는 어떤 타입이 특정한 스레드-안전 속성을 가짐을 나타내는 마커로 생각할 수 있습니다.
pt_br: Pode-se pensar nesses _traits_ como marcadores de que o tipo possui certas propriedades de segurança de _threads_.
uk: Ці трейти можна розглядати як маркери того, що тип має певні властивості безпеки потоків.

source: They can be used in the generic constraints as normal traits.
es: Se pueden utilizar en las restricciones genéricas como traits normales.
fa: آنها را می‌توان در محدودیت‌های generic به عنوان trait عادی استفاده کرد.
ja: これらは通常のトレイトと同じように、ジェネリック境界の中で利用することができます。
ko: 이 두 트레이트는 제너릭에서 제약 조건을 나타내는 트레이트로 사용될 수도 있습니다.
pt_br: Eles podem ser usados nas restrições genéricas como _traits_ normais.
uk: Їх можна використовувати в загальних обмеженнях як звичайні трейти.

source: A type `T` is [`Send`](https://doc.rust-lang.org/std/marker/trait.Send.html) if it is safe to move a `T` value to another thread.
es: Un tipo `T` es [`Send`](https://doc.rust-lang.org/std/marker/trait.Send.html) si es seguro mover un valor `T` a otro hilo.
fa: اگر انتقال مقدار `T` به thread دیگری امن باشد، تایپ `T` در [`Send`](https://doc.rust-lang.org/std/marker/trait.Send.html) است.
ja: 型`T`の値を安全に別のスレッドにムーブできる場合、型`T`は[`Send`](https://doc.rust-lang.org/std/marker/trait.Send.html)である。
ko: `T`가 스레드 간에 안전하게 이동될 수 있다면, `T`의 타입은 `Send`입니다.
pt_br: Um tipo `T` é [`Send`](https://doc.rust-lang.org/std/marker/trait.Send.html) se for seguro mover um valor `T` para outro _thread_.
uk: Тип `T` є [`Send`](https://doc.rust-lang.org/std/marker/trait.Send.html), якщо безпечно переміщати значення `T` в інший потік.

source: The effect of moving ownership to another thread is that _destructors_ will run in that thread. So the question is when you can allocate a value in one thread and deallocate it in another.
es: El efecto de mover la propiedad a otro hilo es que los _destructores_ se ejecutarán en ese hilo. Por tanto, la cuestion es cuándo se puede asignar un valor a un hilo y desasignarlo en otro.
fa: تأثیر انتقال مالکیت (moving ownership) به یک thread دیگر این است که _نابودگرها_ ( _destructors_ ) در آن thread اجرا می شوند. بنابراین سوال این است که چه زمانی می‌توانید یک مقدار را در یک thread تخصیص دهید و آن را در thread دیگر توزیع کنید.
ja: 所有権を別のスレットにムーブするということは、_デストラクタ_ がそのスレッドで実行されるということです。つまり、あるスレッドでアロケートされた値を別のスレッドで解放しても良いかというのが判断基準になります。
ko: 소유권을 다른 스레드로 이동하면 소멸자가 해당 스레드에서 실행됩니다. 여기서 의문은 "언제 한 스레드에서 값을 할당하고 다른 스레드에서 값을 할당 해제할 수 있는가" 입니다.
pt_br: O efeito de mover a propriedade (ownership) para outro _thread_ é que os _destructors_ serão executados nessa _thread_. Então a questão é: quando você pode alocar um valor em um _thread_ e desalocá-lo em outro?
uk: Наслідком перенесення права власності на інший потік є те, що _деструктори_ будуть виконани в цьому потоці. Отже, питання полягає в тому, коли ви можете виділити значення в одному потоці та звільнити його в іншому.

source: As an example, a connection to the SQLite library must only be accessed from a single thread.
es: Por ejemplo, solo se puede acceder a una conexión a la biblioteca SQLite desde un único hilo.
fa: به عنوان مثال، اتصال به کتابخانه SQLite فقط باید از یک thread قابل دسترسی باشد.
ja: 例を挙げると、SQLiteライブラリへのコネクションは、一つのスレッドからのみアクセスされる必要があります。
ko: 예를 들어 SQLite 라이브러리 연결은 단일 스레드에서만 액세스해야 합니다.
pt_br: Como exemplo, uma conexão com a biblioteca SQLite só pode ser acessada de um único _thread_.
uk: Як приклад, підключення до бібліотеки SQLite має бути доступне лише з одного потоку.

source: A type `T` is [`Sync`](https://doc.rust-lang.org/std/marker/trait.Sync.html) if it is safe to access a `T` value from multiple threads at the same time.
es: Un tipo `T` es [`Sync`](https://doc.rust-lang.org/std/marker/trait.Sync.html) si es seguro acceder a un valor `T` desde varios hilos al mismo tiempo.
fa: یک تایپ `T` در واقع نوعی [`Sync`](https://doc.rust-lang.org/std/marker/trait.Sync.html) است، اگر در دسترسی به یک مقدار`T` از طریق چندین رشته به طور همزمان امن باشد.
ja: 型`T`の値を複数のスレッドから同時にアクセスしても安全な場合、型`T`は [`Sync`](https://doc.rust-lang.org/std/marker/trait.Sync.html) である。
ko: `&T`가 여러 스레드에서 안전하게 접근될 수 있다면, `&T`의 타입은 `Sync`입니다.
pt_br: Um tipo `T` é [`Sync`](https://doc.rust-lang.org/std/marker/trait.Sync.html) se for seguro acessar um valor `T` de várias threads ao mesmo tempo.
uk: Тип `T` є [`Sync`](https://doc.rust-lang.org/std/marker/trait.Sync.html), якщо безпечно отримувати доступ до значення `T` з кількох потоків водночас.

source: More precisely, the definition is:
es: En concreto, la definición es la siguiente:
fa: به طور دقیق‌تر، تعریف این طور است:
ja: より正確には、以下のような定義です：
ko: 좀 더 정확한 정의는 다음과 같습니다:
pt_br: Mais precisamente, a definição é:
uk: Точніше, визначення таке:

source: `T` is `Sync` if and only if `&T` is `Send`
es: `T` es `Sync` únicamente si `&T` es `Send`.
fa: `T` یک نوع `Sync` فقط و فقط زمانی که `&T` یک نوع `Send` باشد
ja: `&T`が`Send`である場合、かつその場合に限り、`T`は`Sync`である
ko: `&T`가 `Send`인 경우에만 `T`의 타입이 `Sync`가 됩니다
pt_br: `T` é `Sync` se e somente se `&T` é `Send`
uk: `T` є `Sync` тоді і тільки тоді коли `&T` є `Send`

source: This statement is essentially a shorthand way of saying that if a type is thread-safe for shared use, it is also thread-safe to pass references of it across threads.
es: Esta instrucción es, básicamente, una forma resumida de indicar que, si un tipo es seguro para los hilos en uso compartido, también lo es para pasar referencias de él a través de los hilos.
fa: این عبارت به طور کلی روشی مختصر برای گفتن این است که اگر یک تایپ برای استفاده مشترک امن باشد، انتقال ارجاعات (pass references) آن به threadها نیز امن است.
ja: これはつまり、「ある型の共有がスレッドセーフであれば、その参照をスレッド間で受け渡すこともスレッドセーフである」ということを手短に表したものです。
ko: 위 문장을 풀어서 이야기 하면, 어떤 타입이 스레드 간에 공유되어서 사용되기에 안전하다면 그 타입의 참조 타입은 스레드 간에 이동 가능하다는 것입니다.
pt_br: Essa instrução é essencialmente uma maneira abreviada de dizer que, se um tipo é _thread-safe_ para uso compartilhado, também é _thread-safe_ passar referências a ele entre _threads_.
uk: Це твердження, по суті, є скороченим способом сказати, що якщо тип є потокобезпечним для спільного використання, також потоково безпечно передавати посилання на нього між потоками.

source: This is because if a type is Sync it means that it can be shared across multiple threads without the risk of data races or other synchronization issues, so it is safe to move it to another thread. A reference to the type is also safe to move to another thread, because the data it references can be accessed from any thread safely.
es: Esto se debe a que, si el tipo es Sync, significa que se puede compartir entre múltiples hilos sin el riesgo de que haya carreras de datos u otros problemas de sincronización, por lo que es seguro moverlo a otro hilo. También es seguro mover una referencia al tipo a otro hilo, ya que se puede acceder de forma segura a los datos a los que hace referencia desde cualquier hilo.
fa: این به خاطراست که اگر یک تایپ از جنس Sync باشد، به این معنی است که می‌توان آن را در چند thread بدون خطر در مورد وضعیت رقابتی داده یا سایر مشکلات Sync به اشتراک گذاشت، بنابراین انتقال آن به thread‌ای دیگر امن است. ارجاع به تایپ نیز برای انتقال به threadای دیگر ایمن است، زیرا داده‌هایی که به آن ارجاع می‌دهد می‌توانند از هر threadای با خیال راحت دسترسی داشته باشند.
ja: なぜなら、ある型がSyncである場合、データ競合や他の同期の問題などのリスクなしにその型を複数のスレッド間で共有でき、その型を別のスレッドにムーブしても安全だからです。また、型への参照は別のスレッドにムーブしても安全です。それは、それが参照するデータは任意のスレッドから安全にアクセスすることができるからです。
ko: 이는 다음과 같이 증명할 수 있습니다: 어떤 타입이 `Sync`라는 말은 곧 그 타입이 여러 스레드들 사이에서 데이터 레이스나 여타 동기화 문제 없이 공유 가능하다는 말입니다. 스레드 간 공유가 안전하다면, 스레드간 이동도 안전할 수 밖에 없습니다. 어떤 타입의 스레드간 이동이 안전하다면, 그 타입의 참조 또한 스레드간 이동이 안전할 수 밖에 없습니다.
pt_br: Isso ocorre porque, se um tipo for `Sync`, significa que ele pode ser compartilhado entre vários _threads_ sem o risco de corridas de dados ou outros problemas de sincronização, portanto, é seguro movê-lo para outro _thread_. Uma referência ao tipo também é segura para mover para outro _thread_, porque os dados a que ela faz referência podem ser acessados de qualquer _thread_ com segurança.
uk: Це пояснюється тим, що якщо тип є Sync, це означає, що він може використовуватися кількома потоками без ризику перегонів даних або інших проблем із синхронізацією, тому його безпечно перемістити в інший потік. Посилання на тип також безпечно перемістити в інший потік, оскільки дані, на які воно посилається, можуть бути безпечно доступні з будь-якого потоку.

source: minutes: 6
uk: хвилин: 6

source: Most types you come across are `Send + Sync`:
es: La mayoría de los tipos que encuentras son `Send + Sync`:
fa: اکثر انواعی که با آنها روبرو می شوید `Send + Sync` هستند:
ja: 見かけるほとんどの型は`Send + Sync`です：
ko: 여러분이 다루게 될 대부분의 타입은 `Send + Sync`입니다:
pt_br: A maioria dos tipos que você encontra são `Send + Sync`:
uk: Більшість типів, які ви зустрічаєте, це `Send + Sync`:

source: `Arc<T>`: Explicitly thread-safe via atomic reference count.
es: `Arc<T>`: explícitamente seguro para los hilos mediante el recuento atómico de referencias.
fa: `String`, `Option<T>`, `Vec<T>`, `Box<T>`, ...
ja: `Arc<T>`: アトミック参照カウントにより、明示的にスレッドセーフ。
ko: `Arc<T>`: 참조 카운트 조작을 아토믹 하기 때문에 스레드 안전함.
pt_br: `Arc<T>`: Explicitamente _thread-safe_ via contagem de referência atômica.
uk: `Arc<T>`: явно потокобезпечний через кількість атомарних посилань.

source: `Mutex<T>`: Explicitly thread-safe via internal locking.
es: `Mutex<T>`: explícitamente seguro para los hilos mediante bloqueo interno.
fa: ‏`Arc<T>`:به طور صریح از طریق تعداد شمارش atomic reference با thread-safe.
ja: `Mutex<T>`: 内部ロックにより明示的にスレッドセーフ。
ko: `Mutex<T>`: 값을 접근하기 위해 뮤택스를 잠궈야 하기 때문에 스레드 안전함.
pt_br: `Mutex<T>`: Explicitamente _thread-safe_ via bloqueio interno.
uk: `Mutex<T>`: явно потокобезпечний через внутрішнє блокування.

source: `mpsc::Sender<T>`: As of 1.72.0.
fa: `mpsc::Sender<T>`: از 1.72.0.
uk: `mpsc::Sender<T>`: Починаючи з 1.72.0.

source: `AtomicBool`, `AtomicU8`, ...: Uses special atomic instructions.
es: `AtomicBool`, `AtomicU8`, etc.: utiliza instrucciones atómicas especiales.
fa: ‏`AtomicBool`، `AtomicU8`، ...: از دستورالعمل های atomic ویژه استفاده می‌کند.
ja: `AtomicBool`, `AtomicU8`, …: 特別なアトミック命令を利用。
ko: `AtomicBool`, `AtomicU8`, ...: 값을 접근할 때 특별한 아토믹 명령어들을 사용합니다.
pt_br: `AtomicBool`, `AtomicU8`, ...: Usa instruções atômicas especiais.
uk: `AtomicBool`, `AtomicU8`, ...: використовує спеціальні атомарні інструкції.

source: The generic types are typically `Send + Sync` when the type parameters are `Send + Sync`.
es: Los tipos genéricos suelen ser `Send + Sync` cuando los parámetros del tipo son `Send + Sync`.
fa: در صورت وجود پارامترهای نوع، تایپ‌های generic معمولاً از نوع `Send + Sync` هستند.`Send + Sync`.
ja: ジェネリクスは、型パラメタが`Send + Sync`であるとき、通常は`Send + Sync`です。
ko: 제네릭 타입은 일반적으로 타입 파라메터가 `Send + Sync`이면 `Send + Sync` 입니다.
pt_br: Os tipos genéricos são tipicamente `Send + Sync` quando os parâmetros de tipo são `Send + Sync`.
uk: Загальні типи, як правило, є `Send + Sync, коли параметри типу є також `Send + Sync.

source: These types can be moved to other threads, but they're not thread-safe. Typically because of interior mutability:
es: Estos tipos se pueden mover a otros hilos, pero no son seguros para los hilos. Normalmente, esto se debe a la mutabilidad interior:
fa: این تایپ‌ها را می‌توان به رشته‌های دیگر منتقل کرد، اما آنها ایمن نیستند. به طور معمول به دلیل تغییرپذیری داخلی(interior mutability):
ja: これらの型は別のスレッドにムーブすることができますが、このようなムーブはスレッドセーフではありません。通常は内部可変性がその原因です：
ko: 아래 타입들은 다른 스레드로 이동될 수 있지만 내부적으로 값이 변경될 수 있기 때문에 스레드 안전하지 않습니다:
pt_br: Esses tipos podem ser movidos para outras _threads_, mas não são seguros para _threads_. Normalmente por causa da mutabilidade interior:
uk: Ці типи можна переміщувати в інші потоки, але вони не є потокобезпечними. Зазвичай через внутрішню мутабільність:

source: These types are safe to access (via shared references) from multiple threads, but they cannot be moved to another thread:
uk: До цих типів можна безпечно отримати доступ (через спільні посилання) з декількох потоків, але їх не можна перемістити в інший потік:

source: `MutexGuard<T: Sync>`: Uses OS level primitives which must be deallocated on the thread which created them. However, an already-locked mutex can have its guarded variable read by any thread with which the guard is shared.
uk: `MutexGuard<T: Sync>`: Використовує примітиви рівня ОС, які мають бути звільнені у потоці, що їх створив. Проте, вже заблокований м'ютекс може мати захищену змінну, яку може читати будь-який потік, з яким розділяється захист.

source: These types are not thread-safe and cannot be moved to other threads:
es: Estos tipos no son seguros para los hilos y no se pueden mover a otros hilos:
fa: این تایپ‌ها از نظر thread ایمن نیستند و نمی توان آنها را به رشته های دیگر منتقل کرد:
ja: このような型はスレッドセーフではないため、別のスレッドにムーブすることはできません：
ko: 아래 타입들은 스레드 안전하지도 않고 다른 스레드로 이동될 수도 없습니다:
pt_br: Esses tipos não são _thread-safe_ e não podem ser movidos para outros _threads_:
uk: Ці типи є потоконебезпечними і не можуть бути переміщені в інші потоки:

source: `Rc<T>`: each `Rc<T>` has a reference to an `RcBox<T>`, which contains a non-atomic reference count.
es: `Rc<T>`: cada `Rc<T>` tiene una referencia a un `RcBox<T>`, que contiene un recuento de referencias no atómico.
fa: ‏"Rc<T>": هر "Rc<T>" دارای یک ارجاع به "RcBox<T>" است که حاوی تعداد مراجع غیر atomic است.
ja: `Rc<T>`: それぞれの `Rc<T>` は`RcBox<T>`への参照を持っています。これは、アトミックでない参照カウントを持っています。
ko: `Rc<T>`: `Rc<T>` 는 아토믹하지 않은 방식으로 참조 카운트를 조작하는 `RcBox<T>`를 참조합니다.
pt_br: `Rc<T>`: cada `Rc<T>` tem uma referência a um `RcBox<T>`, que contém uma contagem de referência não atômica.
uk: `Rc<T>`: кожен `Rc<T>` має посилання на `RcBox<T>`, який містить неатомарний лічильник посилань.

source: `*const T`, `*mut T`: Rust assumes raw pointers may have special concurrency considerations.
es: `*const T`, `*mut T`: Rust asume que los punteros sin procesar pueden tener consideraciones especiales de concurrencia.
fa: درمورد `*const T`, `*mut T`: زبان فرض Rust می کند که اشاره گرهای خام ممکن است ملاحظات همزمانی خاصی داشته باشند.
ja: `*const T`, `*mut T`: Rust は、生ポインターは同時実行性に関する特別な考慮事項がある可能性があることを仮定しています。
ko: `*const T`, `*mut T`: 러스트는 포인터가 스레드 안전하지 않다고 가정합니다.
pt_br: `*const T`, `*mut T`: Rust assume que ponteiros brutos podem ter considerações de especiais de concorrência.
uk: `*const T`, `*mut T`: Rust припускає, що необроблені покажчики можуть мати особливі міркування щодо одночасного використання.

source: [`Arc<T>`](https://doc.rust-lang.org/std/sync/struct.Arc.html) allows shared read-only access via `Arc::clone`:
es: [`Arc<T>`](https://doc.rust-lang.org/std/sync/struct.Arc.html) permite el acceso compartido de solo lectura a través de `Arc::clone`:
fa: ‏[`Arc<T>`](https://doc.rust-lang.org/std/sync/struct.Arc.html) اجازه می‌دهد تا دسترسی read-only مشترک از طریق `Arc::clone` صورت پذیرد:
ja: [`Arc<T>`](https://doc.rust-lang.org/std/sync/struct.Arc.html) は読み取り専用の共有アクセスを`Arc::clone`により可能にします：
pt_br: [`Arc<T>`](https://doc.rust-lang.org/std/sync/struct.Arc.html) permite acesso somente-leitura compartilhado por meio de `Arc::clone`:
uk: [`Arc<T>`](https://doc.rust-lang.org/std/sync/struct.Arc.html) дозволяє спільний доступ лише для читання через `Arc::clone`:

source: `Arc` stands for "Atomic Reference Counted", a thread safe version of `Rc` that uses atomic operations.
es: `Arc` son las siglas de "Atomic Reference Counted" (recuento atómico de referencias), una versión de `Rc` segura para los hilos que utiliza operaciones atómicas.
fa: ‏"Arc" مخفف "Atomic Reference Counted" است، یک نسخه ایمن از `Rc` که از عملیات atomic استفاده می‌کند.
ja: `Arc` は"Atomic Reference Counted"の略で、アトミック操作を利用するという点で、`Rc`がスレッド安全になったバージョンのようなものです。
pt_br: `Arc` significa "Atomic Reference Counted", uma versão _thread-safe_ de `Rc` que usa operações atômicas.
uk: `Arc` означає "Atomic Reference Counted", потокобезпечну версію `Rc`, яка використовує атомарні операції.

source: `Arc<T>` implements `Clone` whether or not `T` does. It implements `Send` and `Sync` if and only if `T` implements them both.
es: `Arc<T>` implementa `Clone`, independientemente de si `T` lo hace o no. Implementa `Send` y `Sync` si `T` implementa ambos.
fa: ‏"Arc<T>" به طور کلی "Clone" را خواه `T` انجام دهد یا نه، پیاده سازی می کند. `Send` و `Sync` را اگر و فقط در صورتی پیاده‌سازی می‌کند که `T` هر دوی آنها را پیاده‌سازی کند.
ja: `Arc<T>` は `Clone` を実装します。このことは`T`が`Clone`を実装するしないに関係ありません。`T`が`Send`と`Sync`の両方を実装している場合で、かつその場合に限り、`Arc<T>` は両者を実装します。
pt_br: `Arc<T>` implementa `Clone` quer `T` o faça ou não. Ele implementa `Send` e `Sync` se e somente se `T` implementa os dois.
uk: `Arc<T>` реалізує `Clone` незалежно від того, чи `T` реалізує це. Він реалізує `Send` і `Sync` тоді і тільки тоді коли `T` реалізує їх обидва.

source: `Arc::clone()` has the cost of atomic operations that get executed, but after that the use of the `T` is free.
es: `Arc::clone()` tiene el coste de las operaciones atómicas que se ejecutan; después el uso de `T` es libre.
fa: `Arc::clone()` هزینه یک عملیات atomic که اجرا می‌شود را دارد، اما پس از آن استفاده از 'T' آزاد است.
ja: `Arc::clone()`にはアトミック操作のコストがかかります。ただ、その後は、`T`の利用に関するコストはかかりません。
pt_br: `Arc::clone()` tem o custo das operações atômicas que são executadas, mas depois disso o uso do `T` é gratuito.
uk: `Arc::clone()` має вартість атомарних операцій, які виконуються, але після цього використання `T` є безкоштовним.

source: Beware of reference cycles, `Arc` does not use a garbage collector to detect them.
es: Hay que prestar atención a los ciclos de referencia, ya que `Arc` no usa un recolector de memoria residual para detectarlos.
fa: مراقب reference cycleها باشید، `Arc` از garbage collector برای شناسایی آنها استفاده نمی‌کند.
ja: 参照サイクルに気をつけてください。`Arc` には参照サイクルを検知するためのガベージコレクタはありません。
pt_br: Cuidado com os ciclos de referência, `Arc` não usa um coletor de lixo para detectá-los.
uk: Остерігайтеся циклів посилань, `Arc` не використовує збирач сміття для їх виявлення.

source: `std::sync::Weak` can help.
es: `std::sync::Weak` puede resultar útil.
fa: `std::sync::Weak` می‌تواند مفید باشد.
ja: `std::sync::Weak` が役立ちます。
pt_br: `std::sync::Weak` pode ajudar.
uk: `std::sync::Weak` може допомогти.

source: minutes: 14
uk: хвилин: 14

source: [`Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html) ensures mutual exclusion _and_ allows mutable access to `T` behind a read-only interface (another form of [interior mutability](../../borrowing/interior-mutability.md)):
fa: [`Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html) تضمین می‌کند که حذف متقابل _و_ امکان دسترسی قابل تغییر (mutable) به "T" را در پشت یکread-only interface (شکل دیگری از [تغییرپذیری (mutable) داخلی](../../borrowing/interior-mutability.md)) فراهم می‌کند.
uk: [`Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html) забезпечує взаємовиключення _та_ дозволяє мутабельний доступ до `T` за інтерфейсом лише для читання (інша форма [внутрішньої мутабельності](../../borrowing/interior-mutability.md)):

source: Notice how we have a [`impl<T: Send> Sync for Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html#impl-Sync-for-Mutex%3CT%3E) blanket implementation.
es: Fíjate en cómo tenemos una implementación general de [`impl<T: Send> Sync for Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html#impl-Sync-for-Mutex%3CT%3E).
fa: توجه کنید که چگونه یک [`impl<T: Send> Sync for Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html#impl-Sync-for-Mutex%3CT%3E) برای اجرای کامل آن داریم.
ja: [`impl<T: Send> Sync for Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html#impl-Sync-for-Mutex%3CT%3E) のブランケット実装があることに注目してください。
ko: 모든 `Mutex<T>`는 [`impl<T: Send> Sync for Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html#impl-Sync-for-Mutex%3CT%3E)를 자동으로 구현함을 참조하세요.
pt_br: Observe como temos uma implementação [`impl<T: Send> Sync for Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html#impl-Sync-for-Mutex%3CT%3E) encoberta.
uk: Зверніть увагу, що ми маємо [`impl<T: Send> Sync for Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html#impl-Sync-for-Mutex%3CT%3E) загальну реалізацію.

source: `Mutex` in Rust looks like a collection with just one element --- the protected data.
fa: ‏«Mutex» در Rust مانند مجموعه‌ای با تنها یک عنصر --- داده‌های محافظت شده (protected) به نظر می‌رسد.
ja: Rustにおける`Mutex`とは、保護されるデータである、たった一つの要素から構成されたコレクションのようなものです。
pt_br: `Mutex` em Rust é semelhante a uma coleção com apenas um elemento --- os dados protegidos.
uk: `Mutex` у Rust виглядає як колекція лише з одним елементом --- захищеними даними.
