Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: When you start reading about Rust, you will soon meet [Cargo](https://doc.rust-lang.org/cargo/), the standard tool used in the Rust ecosystem to build and run Rust applications. Here we want to give a brief overview of what Cargo is and how it fits into the wider ecosystem and how it fits into this training.
es: Cuando empieces a informarte sobre Rust, conocerás [Cargo](https://doc.rust-lang.org/cargo/), la herramienta estándar que se utiliza en el ecosistema de Rust para crear y ejecutar sus aplicaciones. En este artículo, te ofrecemos una breve descripción de lo que es Cargo, cómo se integra en el ecosistema más amplio y cómo encaja en esta formación.
fa: وقتی شروع به خواندن درباره Rust می کنید، خیلی سریع با [Cargo](https://doc.rust-lang.org/cargo/) ، ابزار استانداردی که در اکوسیستم Rust برای ساخت و اجرای برنامه های Rust استفاده می شود، آشنا خواهید شد. در اینجا می‌خواهیم یک مرور مختصر از در مورد کارگو و نحوه انطباق آن با اکوسیستم Rust و برنامه‌های آن را در این آموزش ارائه دهیم.
ja: Rustを学び始めると、まもなくRustエコシステムで広く使われているビルドシステム兼パッケージマネージャである[Cargo](https://doc.rust-lang.org/cargo/)という標準ツールに出会います。ここでは、Cargoの概要や使用方法、そして本講座における重要性について簡単に説明します。
ko: 러스트를 시작하려고하면 당신은 곧 [Cargo](https://doc.rust-lang.org/cargo/)라는, 러스트 생태계에서 사용하는 표준 빌드/실행 도구를 만날 것 입니다. 여기서는 카고가 무엇인지, 그리고 카고가 러스트 생태계에서 어떤 역할을 하는지, 그리고 이 강의에서 어떻게 사용될 지에 대해 간략히 설명하겠습니다.
pt_br: Quando você começar a ler sobre Rust, logo conhecerá o [Cargo](https://doc.rust-lang.org/cargo/), a ferramenta padrão usada no ecossistema Rust para criar e executar aplicativos Rust. Aqui nós queremos dar uma breve visão geral do que é o Cargo e como ele se encaixa no ecossistema mais amplo e como ele se encaixa neste treinamento.
uk: Коли ви почнете читати про Rust, то незабаром познайомитеся з [Cargo](https://doc.rust-lang.org/cargo/), стандартним інструментом, що використовується в екосистемі Rust для створення та запуску програм. Тут ми хочемо дати короткий огляд того, що таке Cargo і як він вписується в ширшу екосистему і в цей курс.

source: Installation
es: Instalación
fa: راهنمای نصب
ja: インストール
ko: 설치하기
pt_br: Instalação
uk: Встановлення

source: **Please follow the instructions on <https://rustup.rs/>.**
es: **Sigue las instrucciones que se indican en <https://rustup.rs/>.**
fa: **لطفا دستورالعمل را دنبال کنید <https://rustup.rs>.**
ja: **<https://rustup.rs/> の手順に沿ってインストールしてください。**
ko: **<https://rustup.rs/>의 설치 방법을 따르세요.**
pt_br: **Por favor, siga as instruções em <https://rustup.rs/>.**
uk: **Дотримуйтесь інструкцій на <https://rustup.rs/>.**

source: This will give you the Cargo build tool (`cargo`) and the Rust compiler (`rustc`). You will also get `rustup`, a command line utility that you can use to install to different compiler versions.
fa: این کار به شما امکان استفاده از ابزار ساخت Cargo (`cargo`) و کامپایلر Rust (`rustc`) را می دهد. شما همچنین `rustup` را دریافت خواهید کرد، یک ابزار خط فرمان(CLI) که می توانید از آن برای نصب نسخه های مختلف کامپایلر استفاده کنید.
pt_br: Isso fornecerá a ferramenta de compilação Cargo (`cargo`) e o compilador Rust (`rustc`). Você também obterá o `rustup`, um utilitário de linha de comando que você pode usar para instalar diferentes versões do compilador.
uk: Як результат, ви отримаэте інструмент побудови Cargo (`cargo`) та компілятор Rust (`rustc`). Ви також отримаэте `rustup`, утиліту командної стрічки, яку виможете використовувати для встановлення різних версій компілятора.

source: After installing Rust, you should configure your editor or IDE to work with Rust. Most editors do this by talking to [rust-analyzer](https://rust-analyzer.github.io/), which provides auto-completion and jump-to-definition functionality for [VS Code](https://code.visualstudio.com/), [Emacs](https://rust-analyzer.github.io/manual.html#emacs), [Vim/Neovim](https://rust-analyzer.github.io/manual.html#vimneovim), and many others. There is also a different IDE available called [RustRover](https://www.jetbrains.com/rust/).
fa: پس از نصب Rust، باید ویرایشگر یا IDE خود را برای کار با Rust پیکربندی کنید. اکثر ویرایشگرها این کار را با ارتباط گرفتن با [rust-analyzer](https://rust-analyzer.github.io/) انجام می‌دهند، که قابلیت تکمیل خودکار و پرش به تعریف را برای [VS Code](https://code.visualstudio.com/)، [Emacs](https://rust-analyzer.github.io/manual.html#emacs)، [Vim/Neovim](https://rust-analyzer.github.io/manual.html#vimneovim) و بسیاری دیگر فراهم می کند. همچنین یک IDE متفاوت به نام [RustRover](https://www.jetbrains.com/rust/) در دسترس است.
ja: Rust をインストールしたら、Rust で動作するようにエディタまたは IDE を設定する必要があります。ほとんどのエディタでは、[rust-analyzer](https://rust-analyzer.github.io/) と通信することでこれを行います。rust-analyzer は、[VS Code](https://code.visualstudio.com/)、[Emacs](https://rust-analyzer.github.io/manual.html#emacs)、[Vim / Neovim](https://rust-analyzer.github.io/manual.html#vimneovim) など、多くのエディタ向けにオートコンプリート機能と「定義に移動」機能を提供します。[RustRover](https://www.jetbrains.com/rust/) という別の IDE も用意されています。
pt_br: Depois de instalar o Rust, você deve configurar seu editor ou IDE para trabalhar com o Rust. A maioria dos editores faz isso conversando com o [rust-analyzer](https://rust-analyzer.github.io/), que fornece auto-completar e funcionalidade de salto para definição para [VS Code](https://code.visualstudio.com/), [Emacs](https://rust-analyzer.github.io/manual.html#emacs), [Vim/Neovim](https://rust-analyzer.github.io/manual.html#vimneovim) e muitos outros. Também há um IDE diferente disponível chamado [RustRover](https://www.jetbrains.com/rust/).
uk: Після встановлення Rust вам слід налаштувати редактор або IDE для роботи з Rust. Більшість редакторів роблять це, звертаючись до [rust-analyzer](https://rust-analyzer.github.io/), який забезпечує автозаповнення та функцію переходу до визначення для [VS Code](https://code.visualstudio.com/), [Emacs](https://rust-analyzer.github.io/manual.html#emacs), [Vim/Neovim](https://rust-analyzer.github.io/manual.html#vimneovim), та багато інших. Існує також інша доступна IDE під назвою [RustRover](https://www.jetbrains.com/rust/).

source: On Debian/Ubuntu, you can also install Cargo, the Rust source and the [Rust formatter](https://github.com/rust-lang/rustfmt) via `apt`. However, this gets you an outdated rust version and may lead to unexpected behavior. The command would be:
fa: در دبیان/اوبونتو، می‌توانید Cargo و Rust و [Rust formatter](https://github.com/rust-lang/rustfmt) را نیز از طریق `apt` نصب کنید. با این حال، این به شما یک نسخه قدیمی Rust را جهت نصب می دهد و ممکن است منجر به رفتار غیرمنتظره برنامه شود. command مورد نظر این خواهد بود:
ko: 데비안/우분투 시스템에서는 `apt`를 이용해서 카고, 러스트 소스, [러스트 포매터](https://github.com/rust-lang/rustfmt)를 설치할 수 있습니다. 그러나 이 방법을 따를 경우 최신 버전이 아닌 러스트를 사용게되며, 그 결과 예상치 못한 문제를 겪을 수도 있습니다. 설치 명령어는 아래와 같습니다:
pt_br: No Debian/Ubuntu, você também pode instalar o Cargo, o código-fonte do Rust e o [formatador Rust](https://github.com/rust-lang/rustfmt) com `apt`. Entretanto, isto lhe fornece uma versão desatualizada do Rust e pode levar a comportamentos inesperados. O comando seria:
uk: У Debian/Ubuntu ви можете встановити Cargo, вихідний код Rust та [Rust formatter](https://github.com/rust-lang/rustfmt) за допомогою `apt`. Однак це може призвести до встановлення застарілої версії Rust і неочікуваної поведінки. Використовуйте таку команду:

source: On macOS, you can use [Homebrew](https://brew.sh/) to install Rust, but this may provide an outdated version. Therefore, it is recommended to install Rust from the official site.
fa: در macOS، می‌توانید از [Homebrew](https://brew.sh/) برای نصب Rust استفاده کنید، اما ممکن است یک نسخه قدیمی باشد. بنابراین توصیه می شود Rust را از سایت رسمی نصب کنید.
uk: На macOS ви можете використовувати [Homebrew](https://brew.sh/) для установки Rust, але він може надати застарілу версію. Тому рекомендується встановлювати Rust з офіційного сайту.

source: The Rust Ecosystem
es: El ecosistema de Rust
fa: اکوسیستم Rust
ja: Rust エコシステム
ko: 러스트 생태계
pt_br: O Ecossistema Rust
uk: Екосистема Rust

source: The Rust ecosystem consists of a number of tools, of which the main ones are:
es: El ecosistema de Rust se compone de varias herramientas, entre las que se incluyen las siguientes:
fa: اکوسیستم Rust از تعدادی ابزار تشکیل شده است که مهمترین آنها عبارتند از:
ja: Rustエコシステムの主要ツールは以下の通りです：
ko: 러스트의 생태계는 여러가지 도구들로 구성되어 있으며, 그 중 중요한 것들은 아래와 같습니다:
pt_br: O ecossistema Rust consiste em várias ferramentas, das quais as principais são:
uk: Екосистема Rust складається з ряду інструментів, основними з яких є:

source: `rustc`: the Rust compiler which turns `.rs` files into binaries and other intermediate formats.
es: `rustc`: el compilador de Rust que convierte archivos `.rs` en binarios y otros formatos intermedios.
fa: `rustc`: کامپایلر Rust که فایل‌های `.rs` را به باینری و سایر فرمت‌های میانی تبدیل می‌کند.
ja: `rustc`： Rustのコンパイラです。`.rs`ファイルをバイナリや他の中間形式に変換します。
ko: `rustc`: `.rs` 확장자 파일을 바이너리 혹은 다른 중간 형식으로 변환해주는 Rust 컴파일러입니다.
pt_br: `rustc`: o compilador Rust que converte arquivos `.rs` em binários e outros formatos intermediários.
uk: `rustc`: компілятор Rust, який перетворює файли `.rs` на бінарні файли та інші проміжні формати.

source: `cargo`: the Rust dependency manager and build tool. Cargo knows how to download dependencies, usually hosted on <https://crates.io>, and it will pass them to `rustc` when building your project. Cargo also comes with a built-in test runner which is used to execute unit tests.
fa: `cargo`: مدیر وابستگی Rust و build tool آن است. Cargo می داند که چگونه وابستگی ها را که معمولاً در <https://crates.io> میزبانی می شوند دانلود کند و هنگام ساخت پروژه آنها را به `rustc` منتقل می‌کند. Cargo همچنین دارای یک دستگاه تست داخلی است که برای اجرای unit test استفاده می شود.
ko: `cargo`: 러스트 의존성 관리자이자 빌드 시스템 입니다. 여러분의 프로젝트에 명시된 의존성들을 <https://crates.io>에서 자동으로 다운로드 받고, 그 소스코드를 `rustc`로 전달하여 빌드를 시킵니다. 또한 유닛 테스트를 실행하는 테스트 러너를 내장하고 있습니다.
pt_br: `cargo`: o gerenciador de dependências e ferramenta de compilação do Rust. O Cargo sabe como baixar dependências, normalmente hospedadas em <https://crates.io>, e as passará para o `rustc` quando compilar o seu projeto. O Cargo também vem com um gerenciador de testes embutido que é utilizado para a execução de testes unitários.
uk: `cargo`: менеджер залежностей Rust та інструмент збірки. Cargo знає, як завантажити залежності, розміщені на <https://crates.io>, і передати їх `rustc` при збірці вашого проекту. Cargo також поставляється з вбудованим інструментом запуску тестів, який використовується для виконання модульних тестів.

source: `rustup`: the Rust toolchain installer and updater. This tool is used to install and update `rustc` and `cargo` when new versions of Rust are released. In addition, `rustup` can also download documentation for the standard library. You can have multiple versions of Rust installed at once and `rustup` will let you switch between them as needed.
fa: 'rustup': نصب کننده و به روز رسانی rustchain ابزار. این ابزار برای نصب و به روز رسانی "rustc" و "cargo" در هنگام انتشار نسخه های جدید Rust استفاده می شود. علاوه بر این، "rustup" همچنین می تواند اسناد را برای کتابخانه استاندارد دانلود کند. شما می توانید چندین نسخه از Rust را در یک زمان نصب کنید و "rustup" به شما اجازه می دهد تا در صورت نیاز بین انها تغییر دهید.
pt_br: `rustup`: o instalador e atualizador do conjunto de ferramentas do Rust. Esta ferramenta é utilizada para instalar e atualizar o `rustc` e o `cargo` quando novas versões do Rust forem lançadas. Além disso, `rustup` também pode baixar a documentação da biblioteca padrão. Você pode ter múltiplas versões do Rust instaladas ao mesmo tempo e `rustup` permitirá que você alterne entre elas conforme necessário.
uk: `rustup`: програма встановлення та оновлення набору інструментів Rust. Цей інструмент використовується для встановлення та оновлення `rustc` і `cargo` при виході нових версій Rust. Окрім того, `rustup` також може завантажувати документацію стандартної бібліотеки. Ви можете встановити кілька версій Rust одночасно і `rustup` дозволить вам перемикатися між ними за необхідності.

source: Key points:
es: Puntos clave:
fa: نکات کلیدی:
ja: 要点：
ko: 키 포인트:
pt_br: Pontos chave:
uk: Ключові моменти:

source: Rust has a rapid release schedule with a new release coming out every six weeks. New releases maintain backwards compatibility with old releases --- plus they enable new functionality.
es: Rust cuenta con un programa de lanzamiento rápido en el que se publica una nueva versión cada seis semanas. Las nuevas versiones mantienen la retrocompatibilidad con las versiones anteriores, además de habilitar nuevas funciones.
fa: Rust یک برنامه سریع برای انتشار نسخه‌های جدید دارد و هر شش هفته یک نسخه جدید منتشر می شود. نسخه‌های جدید سازگاری با نسخه‌های قدیمی را حفظ می‌کنند --- به علاوه قابلیت‌های جدید را فعال می‌کنند.
ja: Rust言語とコンパイラは、6週間のリリースサイクルを採用しています。新しいリリースは、古いリリースとの後方互換性を維持しながら、新機能を提供します。
ko: 러스트는 6주마다 새로운 릴리즈가 발표되며 이전 릴리즈와의 호환성을 유지하고 있습니다.
pt_br: O Rust tem um cronograma de lançamento rápido com um novo lançamento saindo a cada seis semanas. Novos lançamentos mantêm compatibilidade com versões anteriores — além disso, eles habilitam novas funcionalidades.
uk: У Rust стрімкий графік релізів: нова версія виходить кожні шість тижнів. Нові версії підтримують зворотну сумісність із старими версіями --- на додаток вони надають нові функціональні можливості.

source: There are three release channels: "stable", "beta", and "nightly".
es: Hay tres canales de lanzamiento: "stable", "beta" y "nightly".
fa: سه کانال انتشار وجود دارد: "stable"، "beta"، و "nightly".
ja: リリースチャネルは3つあります：「stable」「beta」「nightly」。
ko: 릴리즈는 3가지 버전으로 제공됩니다: "stable", "beta" 그리고 "nightly".
pt_br: Existem três canais de lançamento: _"stable"_, _"beta"_ e _"nightly"_.
uk: Існує три канали релізів: "stable", "beta" та "nightly".

source: New features are being tested on "nightly", "beta" is what becomes "stable" every six weeks.
es: Las funciones nuevas se prueban en "nightly", y "beta" es lo que se convierte en "estable" cada seis semanas.
fa: ویژگی های جدید در "nightly" آزمایش می شوند ، "beta" چیزی است که هر شش هفته "stable" می شود.
ja: 新機能は「nightly」でテストされ、「beta」が6週間毎に「stable」となります。
ko: 새로운 기능은 "nightly" -> "beta" -(6주 후)-> "stable" 로 변경됩니다.
pt_br: Novos recursos estão sendo testados em "nightly", "beta" é o que se torna "stable" a cada seis semanas.
uk: Нові функції тестуються на "nightly", "beta" це те, що стає "stable" кожні шість тижнів.

source: Dependencies can also be resolved from alternative [registries](https://doc.rust-lang.org/cargo/reference/registries.html), git, folders, and more.
es: Las dependencias también pueden resolverse desde \[registros\] alternativos, git, carpetas, etc.
fa: همچنین می‌توان وابستگی‌ها را از [registries](https://doc.rust-lang.org/cargo/reference/registries.html)، پوشه‌ها و git و موارد دیگر برطرف کرد.
ja: 依存関係は、代替の [レジストリ](https://doc.rust-lang.org/cargo/reference/registries.html)、git、フォルダなどから解決することもできます。
ko: 의존성은 다양한 [저장소](registries), git 프로젝트, 디렉터리 등에서 제공될 수 있습니다.
pt_br: Dependências também podem ser resolvidas a partir de [registros](https://doc.rust-lang.org/cargo/reference/registries.html) alternativos, git, pastas, e outros mais.
uk: Залежності також можна вирішити за допомогою альтернативних [реєстрів](https://doc.rust-lang.org/cargo/reference/registries.html), git, папок тощо.

source: Rust also has [editions](https://doc.rust-lang.org/edition-guide/): the current edition is Rust 2021. Previous editions were Rust 2015 and Rust 2018.
es: Rust también tiene varias \[ediciones\]: la más actual es Rust 2021. Las ediciones anteriores son Rust 2015 y Rust 2018.
fa: Rust همچنین نسخه [editions](https://doc.rust-lang.org/edition-guide/) دارد: نسخه فعلی Rust 2021 است. نسخه های قبلی Rust 2015 و Rust 2018 بودند.
ja: Rustには[editions](https://doc.rust-lang.org/edition-guide/)（エディション）があります：現在のエディションはRust2021です。以前はRust2015とRust2018でした。
ko: 러스트는 [에디션](https://doc.rust-lang.org/edition-guide/)으로 구분됩니다. 현재는 Rust 2021 에디션입니다. 이 전 에디션으로 Rust 2015와 Rust 2018이 있습니다.
pt_br: O Rust também tem [edições](https://doc.rust-lang.org/edition-guide/): a edição atual é o Rust 2021. As edições anteriores foram o Rust 2015 e o Rust 2018.
uk: Rust також має \[редакції\]: поточна редакція це Rust 2021. Попередніми редакціями були Rust 2015 та Rust 2018.

source: The editions are allowed to make backwards incompatible changes to the language.
es: Las ediciones pueden introducir cambios de incompatibilidad con versiones anteriores en el lenguaje.
fa: نسخه ها مجاز به ایجاد تغییرات backwards incompatible در زبان هستند.
ja: エディションでは、後方非互換な変更を加える事ができます。
ko: 에디션은 이전 에디션과 호환이 되지 않을 수 있습니다.
pt_br: As edições podem fazer alterações incompatíveis com versões anteriores da linguagem.
uk: Редакціям дозволено вносити зворотно-несумісні зміни до мови.

source: To prevent breaking code, editions are opt-in: you select the edition for your crate via the `Cargo.toml` file.
es: Para evitar que se rompa el código, las ediciones son opcionales: selecciona la edición para tu crate a través del archivo `Cargo.toml`.
fa: برای جلوگیری از breaking code، نسخه‌ها اختیاری انتخاب می‌شوند که: شما نسخه‌ مورد نظر برای crate خود از طریق فایل `Cargo.toml` انتخاب می‌کنید.
ja: コードの破損を防ぐために、エディションはオプトイン方式です：`Cargo.toml`で、クレートに対して適用したいエディションを選択します。
ko: 에디션이 바뀌면서 프로그램이 의도치 않게 깨지는 문제를 막기 위해, 각 프로그램은 자신이 빌드될 에디션을 명시적으로 `Cargo.toml`에 지정해야 합니다.
pt_br: Para evitar quebra de código, as edições são opcionais: você seleciona a edição para o seu _crate_ através do arquivo `Cargo.toml`.
uk: Щоб уникнути збоїв коду, редакцію для свого пакета можна явно вказати у файлі `Cargo.toml`.

source: To avoid splitting the ecosystem, Rust compilers can mix code written for different editions.
es: Para evitar la división del ecosistema, los compiladores de Rust pueden mezclar el código escrito para distintas ediciones.
fa: برای جلوگیری از شکاف در اکوسیستم، کامپایلرهای Rust می توانند کدهای نوشته شده برای نسخه های مختلف را ترکیب کنند.
ja: エコシステムの分断を避けるために、コンパイラは異なるエディションのコードを混在させる事ができます。
ko: 러스트 생태계가 에디션 별로 파편회 되는 것을 막기 위해, 러스트 컴파일러는 서로 다른 에디션에서 작성된 코드들을 하나의 바이너리로 묶을 수 있습니다.
pt_br: Para evitar a divisão do ecossistema, os compiladores Rust podem misturar código escrito para diferentes edições.
uk: Щоб уникнути поділу екосистеми, компілятор Rust може змішувати код, написаний для різних редакцій.

source: Mention that it is quite rare to ever use the compiler directly not through `cargo` (most users never do).
es: Hay que mencionar que es bastante raro utilizar el compilador directamente y no a través de `cargo` (la mayoría de los usuarios nunca lo hacen).
fa: لازم به ذکر است که استفاده از کامپایلر به طور مستقیم(rustc) و نه از طریق `cargo` بسیار غیرمعمول است (اکثر کاربران هرگز این کار را نمی کنند).
ja: コンパイラを直接使用する事は非常に稀であり、基本的には`cargo`を介します。
ko: `cargo`를 사용하지 않고 컴파일러를 직접 사용하는 경우는 거의 없음을 언급해 주시기 바랍니다.
pt_br: Mencione que é muito raro usar o compilador diretamente, não através do `cargo` (a maioria dos usuários nunca o faz).
uk: Варто нагадати, що використання компілятора безпосередньо, а не через `cargo`, є рідкісним явищем (більшість користувачів ніколи цього не роблять).

source: It might be worth alluding that Cargo itself is an extremely powerful and comprehensive tool. It is capable of many advanced features including but not limited to:
fa: ممکن است لازم به ذکر باشد که Cargo خود یک ابزار بسیار قدرتمند و جامع است. این است که قادر به بسیاری از ویژگی های پیشرفته از جمله اما نه محدود به:
pt_br: Pode valer a pena mencionar que o próprio Cargo é uma ferramenta extremamente poderosa e abrangente. Ele é capaz de muitos recursos avançados, incluindo, entre outros:
uk: Варто зазначити, що Cargo сам по собі є надзвичайно потужним і всеосяжним інструментом. Він має багато додаткових функцій, включаючи, але не обмежуючись:

source: Project/package structure
es: Estructura del proyecto/package
fa: ساختار پروژه/بسته
ja: プロジェクト・パッケージの構造管理
ko: 프로젝트/패키지 구조화
pt_br: Estrutura do projeto/pacote
uk: Структуру проекту/пакета

source: [workspaces](https://doc.rust-lang.org/cargo/reference/workspaces.html)
ja: [workspaces](https://doc.rust-lang.org/cargo/reference/workspaces.html)（ワークスペース）
ko: [워크스페이스](https://doc.rust-lang.org/cargo/reference/workspaces.html)
pt_br: [Espaços de trabalho](https://doc.rust-lang.org/cargo/reference/workspaces.html)
uk: [робочі області](https://doc.rust-lang.org/cargo/reference/workspaces.html)

source: Dev Dependencies and Runtime Dependency management/caching
es: Manejo/Caché de Dependencias de Desarrollo y de Runtime
fa: وابستگی های Dev و وابستگی‌های Runtime Management/Caching
ja: 開発用とランタイム用の依存関係管理・キャッシュ
ko: 개발/런타임 종속성 관리 및 캐싱
pt_br: Dependências de desenvolvimento e gerenciamento/cache de dependência de tempo de execução
uk: Управління/кешування залежностями для розробки (dev) та часу виконання (runtime)

source: [build scripting](https://doc.rust-lang.org/cargo/reference/build-scripts.html)
es: Consulta el libro [Rust Reference](https://doc.rust-lang.org/reference/type-layout.html).
ja: [build scripting](https://doc.rust-lang.org/cargo/reference/build-scripts.html)（ビルドスクリプト）
ko: [빌드 스크립트](https://doc.rust-lang.org/cargo/reference/build-scripts.html)
pt_br: [Criar scripts](https://doc.rust-lang.org/cargo/reference/build-scripts.html)
uk: [сценарії побудови](https://doc.rust-lang.org/cargo/reference/build-scripts.html)

source: [global installation](https://doc.rust-lang.org/cargo/commands/cargo-install.html)
ko: [전역 설치](https://doc.rust-lang.org/cargo/commands/cargo-install.html)
pt_br: [Instalação global](https://doc.rust-lang.org/cargo/commands/cargo-install.html)
uk: [глобальна установка](https://doc.rust-lang.org/cargo/commands/cargo-install.html)

source: It is also extensible with sub command plugins as well (such as [cargo clippy](https://github.com/rust-lang/rust-clippy)).
es: Consulta más información en el \[libro oficial de Cargo\].
fa: همچنین با command plugin فرعی (مانند [cargo clippy](https://github.com/rust-lang/rust-clippy)) قابل توسعه است.
ja: [cargo clippy](https://github.com/rust-lang/rust-clippy)などのサブコマンドプラグインによる拡張
ko: [cargo clippy](https://github.com/rust-lang/rust-clippy)와 같은 하위 플러그인으로 확장 가능.
pt_br: Também é extensível com plugins de sub-comando (tais como [cargo clippy](https://github.com/rust-lang/rust-clippy)).
uk: Він також розширюється за допомогою плагінів підкоманд (таких як [cargo clippy](https://github.com/rust-lang/rust-clippy)).

source: Read more from the [official Cargo Book](https://doc.rust-lang.org/cargo/)
fa: در [official Cargo Book](https://doc.rust-lang.org/cargo/) بیشتر بخوانید.
ja: 詳細は[official Cargo Book](https://doc.rust-lang.org/cargo/)を参照してください。
ko: [공식 Cargo Book](https://doc.rust-lang.org/cargo/)에서 자세한 사항을 확인하시기 바랍니다.
pt_br: Leia mais no [Livro Oficial do Cargo](https://doc.rust-lang.org/cargo/)
uk: Докладніше читайте в [офіційній Cargo Book](https://doc.rust-lang.org/cargo/)

source: Code Samples in This Training
es: Código de ejemplo en esta formación
fa: نمونه کد در این آموزش
ja: 講座のサンプルコード
ko: 강의에서의 코드 샘플
pt_br: Exemplos de Código neste Treinamento
uk: Приклади коду в цьому курсі
