Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: This slide is intended to help students coming from other languages to put Rust in context.
fa: این اسلاید به منظور کمک به دانش‌آموزانی است که از زبان‌های دیگر می‌آیند تا Rust را در زمینه مناسب قرار دهند.
ja: このスライドは、他の言語を習得済みの受講者に、その文脈の中で Rust を理解してもらうことを目的としています。
pt_br: Este slide tem a intenção de ajudar os alunos que vêm de outras linguagens a colocar o Rust em contexto.
uk: Цей слайд має на меті допомогти студентам, які вивчають інші мови, помістити Rust у контекст.

source: C must manage heap manually with `malloc` and `free`. Common errors include forgetting to call `free`, calling it multiple times for the same pointer, or dereferencing a pointer after the memory it points to has been freed.
fa: C باید حافظه heap را به‌طور دستی با استفاده از `malloc` و `free` مدیریت کند. خطاهای رایج شامل فراموش کردن فراخوانی `free`، فراخوانی آن چندین بار برای یک اشاره‌گر، یا dereference کردن یک اشاره‌گر پس از آزاد شدن حافظه‌ای است که به آن اشاره می‌کند.
ja: C では、`malloc` と `free` を使用してヒープを手動で管理する必要があります。よくあるエラーとしては、`free`の呼び出しを忘れる、同じポインタに対して複数回呼び出す、ポイントしているメモリが解放された後にポインタを逆参照する、などがあります。
pt_br: Em C, o gerenciamento do heap é feito manualmente com `malloc` e `free`. Os erros comuns incluem esquecer de chamar `free`, chamá-lo várias vezes para o mesmo ponteiro ou desreferenciar um ponteiro depois que a memória para a qual ele aponta foi liberada.
uk: C має керувати купою вручну за допомогою `malloc` та `free`. Типові помилки включають забування виклику `free`, виклик `free` декілька разів для одного і того ж вказівника або розіменування вказівника після того, як пам'ять, на яку він вказує, було звільнено.

source: Java, Go, and Python rely on the garbage collector to identify memory that is no longer reachable and discard it. This guarantees that any pointer can be dereferenced, eliminating use-after-free and other classes of bugs. But, GC has a runtime cost and is difficult to tune properly.
fa: جاوا، گو و پایتون به جمع‌آوری‌کننده زباله (garbage collector) برای شناسایی حافظه‌ای که دیگر در دسترس نیست و دور ریختن آن متکی هستند. این امر تضمین می‌کند که هر اشاره‌گری می‌تواند dereference شود و از بروز خطاهای استفاده پس از آزادسازی (use-after-free) و سایر دسته‌های باگ جلوگیری می‌کند. اما، GC هزینه‌ای در زمان اجرا دارد و تنظیم مناسب آن دشوار است.
ja: Java、Go、Pythonでは、アクセスできなくなったメモリの特定と破棄をガーベジコレクタに依存します。これにより、あらゆるポインタの逆参照が可能になり、解放後の使用などのバグがなくなります。ただし、GC (ガーベジコレクション) にはランタイムコストがかかり、適切なチューニングが困難です。
pt_br: Java, Go e Python dependem do coletor de lixo para identificar a memória que não é mais acessível e descartá-la. Isso garante que qualquer ponteiro possa ser desreferenciado, eliminando o uso após a liberação e outras classes de bugs. Mas, o coletor de lixo tem um custo de tempo de execução e é difícil de ajustar corretamente.
uk: У C++ є такі інструменти, як розумні вказівники (`unique_ptr`, `shared_ptr`), які використовують гарантії мови щодо виклику деструкторів для забезпечення звільнення пам'яті при завершенні функції. Але все одно досить легко неправильно використовувати ці інструменти і створювати помилки, подібні до помилок у мові C.

source: Rust's ownership and borrowing model can, in many cases, get the performance of C, with alloc and free operations precisely where they are required -- zero cost. It also provides tools similar to C++'s smart pointers. When required, other options such as reference counting are available, and there are even third-party crates available to support runtime garbage collection (not covered in this class).
fa: مدل مالکیت و قرض‌گیری Rust (ownership and borrowing) می‌تواند در بسیاری از موارد عملکرد C را با عملیات‌های تخصیص و آزادسازی دقیقاً در مکان‌های مورد نیاز -- با هزینه صفر -- به دست آورد. همچنین ابزارهایی مشابه به اشاره‌گرهای هوشمند ++C را فراهم می‌کند. در صورت نیاز، گزینه‌های دیگری مانند شمارش ارجاع نیز در دسترس هستند و حتی crates شخص ثالثی برای پشتیبانی از جمع‌آوری زباله در زمان اجرا موجود است (که در این کلاس پوشش داده نمی‌شود).
ja: Rust の所有権と借用モデルは、多くの場合、割り当てオペレーションと解放オペレーションを正確に必要な場所で行うことにより、ゼロコストで C のパフォーマンスを実現できます。また、C++ のスマートポインタに似たツールも用意されています。必要に応じて、参照カウントなどの他のオプションを利用できます。また、ランタイムガベージコレクションをサポートするためのサードパーティのクレートも使用できます（このクラスでは扱いません）。
pt_br: O modelo de _ownership_ e _borrowing_ do Rust pode, em muitos casos, obter o desempenho do C, com operações de alocação e liberação precisamente onde elas são necessárias - custo zero. Ele também fornece ferramentas semelhantes aos ponteiros inteligentes do C++. Quando necessário, outras opções, como contagem de referência, estão disponíveis, e até mesmo crates de terceiros estão disponíveis para suportar a coleta de lixo em tempo de execução (não abordada nesta aula).
uk: Модель володіння та запозичення Rust у багатьох випадках дозволяє отримати продуктивність C, з операціями alloc та free саме там, де вони потрібні - з нульовими витратами. Він також надає інструменти, подібні до розумних вказівників C++. За необхідності, доступні інші опції, такі як підрахунок посилань, і навіть є сторонні крейти для підтримки збирання сміття під час виконання (не розглядаються у цьому класі).

source: All variable bindings have a _scope_ where they are valid and it is an error to use a variable outside its scope:
es: Todos los enlaces a variables tienen un _ámbito_ donde son válidos y se produce un error cuando se usan fuera de él:
fa: تمام پیوندهای متغیر دارای یک **دامنه** هستند که در آن معتبر هستند و استفاده از متغیر خارج از دامنه‌اش یک خطاست:
ja: すべての変数バインディングには有効なスコープがあり、スコープ外で変数を使用するとエラーになります。
ko: 모든 변수 바인딩은 유효한 "범위(스코프)"를 가지며, 범위 밖에서 변수 사용하면 에러가 발생합니다:
pt_br: Todas as associações de variáveis têm um _escopo_ onde são válidas e é um erro usar uma variável fora de seu escopo:
uk: Усі прив’язки змінних мають _область_, де вони дійсні, і використання змінної поза її областю є помилкою:

source: We say that the variable _owns_ the value. Every Rust value has precisely one owner at all times.
fa: می‌گوییم که متغیر _مالک_ مقدار است. هر مقدار در Rust در هر لحظه دقیقاً یک مالک دارد.
ja: これを、変数が値を _所有_ していると表現します。すべての Rustの値所有者は常に 1 人です。
pt_br: Dizemos que a variável _owns_ (_possui_) o valor. Todo valor em Rust tem precisamente um _owner_ (dono) em todos os momentos.
uk: Ми говоримо, що змінна _володіє_ значенням. Кожне значення у Rust завжди має лише одного власника.

source: At the end of the scope, the variable is _dropped_ and the data is freed. A destructor can run here to free up resources.
fa: در پایان دامنه، متغیر **حذف** می‌شود و داده‌ها آزاد می‌شوند. یک ویرایشگر (destructor) می‌تواند در اینجا اجرا شود تا منابع را آزاد کند.
ja: スコープから外れると変数が破棄 _(drop)_ され、データが解放されます。ここでデストラクタを実行してリソースを解放できます。
pt_br: No final do escopo, a variável é descartada e os dados são liberados. Um destrutor pode ser executado aqui para liberar recursos.
uk: В кінці області видимості змінна _знищується_ і дані звільняються. Тут може бути запущено деструктор, щоб звільнити ресурси.

source: Students familiar with garbage-collection implementations will know that a garbage collector starts with a set of "roots" to find all reachable memory. Rust's "single owner" principle is a similar idea.
fa: دانش‌آموزانی که با پیاده‌سازی‌های جمع‌آوری زباله آشنا هستند، خواهند دانست که یک جمع‌آوری‌کننده زباله با مجموعه‌ای از "ریشه‌ها" برای یافتن تمام حافظه‌های قابل دسترسی شروع می‌کند. اصول "مالکیت تک‌گانه" Rust ایده مشابهی است.
ja: ガベージ コレクションの実装に精通している受講者は、ガベージ コレクタが一連の「ルート」から開始して到達可能なすべてのメモリを見つけることを知っています。Rust の「単一オーナー」の原則も、同様の考え方に基づいています。
pt_br: Os alunos familiarizados com implementações de coleta de lixo saberão que um coletor de lixo começa com um conjunto de "raízes" para encontrar toda a memória acessível. O princípio do _"single owner"_ ("único dono") do Rust é uma ideia semelhante.
uk: Студенти, знайомі з реалізаціями збирачів сміття, знають, що збирач сміття починає роботу з набору "коренів", щоб виявити всю доступну пам'ять. Принцип "єдиного власника" у Rust має схожу ідею.

source: An assignment will transfer _ownership_ between variables:
es: Una asignación transferirá su _ownership_ entre variables:
fa: انتساب, *مالکیت* را بین متغیرها منتقل می‌کند:
ja: 代入すると、変数間で _所有権_ が移動します。
ko: (변수의) 할당은 \_소유권_을 변수 간에 이동시킵니다:
pt_br: Uma atribuição transferirá o _ownership_ entre variáveis:
uk: Присвоєння переміщує _володіння_ між змінними:

source: "Hello!"
fa: "سلام!"
pt_br: "Olá!"
uk: "Привіт!"

source: The assignment of `s1` to `s2` transfers ownership.
es: La asignación de `s1` a `s2` transfiere el _ownership_.
fa: انتساب `s1`به `s2` مالکیت را منتقل می‌کند.
ja: `s1` を `s2` に代入すると、所有権が移動します。
ko: `s1`을 `s2`에 할당하여 소유권을 이전시킵니다.
pt_br: A atribuição de `s1` a `s2` transfere o _ownership_.
uk: Присвоєння `s1` до `s2` переміщує володіння.

source: When `s1` goes out of scope, nothing happens: it does not own anything.
es: Cuando `s1` queda fuera del ámbito, no ocurre nada: no le pertenece nada.
fa: زمانی که دیگر در اسکوپ `s1` نیستیم, هیچ اتفاقی نمی‌افتد: چون `s1` مالک چیزی نیست.
ja: `s1` がスコープ外になると、何も所有してないからです（何も所有しません）。
ko: `s1`의 스코프가 종료되면 아무 일도 없습니다: 왜냐하면 `s1`은 아무런 소유권이 없기 때문입니다.
pt_br: Quando `s1` sai do escopo, nada acontece: ele não tem _ownership_.
uk: Коли `s1` виходить за межі області видимості, нічого не відбувається: вона нічим не володіє.

source: When `s2` goes out of scope, the string data is freed.
es: Cuando `s2` sale del ámbito, los datos de la cadena se liberan.
fa: زمانی که دیگر در اسکوپ `s2` نیستیم, داده‌های رشته آزاد می‌شوند.
ja: `s2` がスコープ外になると、文字列データは解放されます。
ko: `s2`의 스코프가 종료되면 문자열 데이터는 해제됩니다.
pt_br: Quando `s2` sai do escopo, os dados da string são liberados.
uk: Коли `s2` виходить за межі, дані рядка звільняються.

source: Before move to `s2`:
es: Antes de mover a `s2`:
fa: قبل از انتقال به `s2` :
ja: `s2` に移動する前:
ko: `s2`로 이동 전 메모리:
pt_br: Antes de mover para `s2`:
uk: Перед переміщенням до `s2`:

source: After move to `s2`:
es: Después de mover a `s2`:
fa: بعد از انتقال به `s2` :
ja: `s2` に移動した後:
ko: `s2`로 이동 후 메모리:
pt_br: Depois de mover para `s2`:
uk: Після переміщення до `s2`:

source: ```bob Stack Heap .- - - - - - - - - - - - - -. .- - - - - - - - - - - - - - - - - - -. : : : : : s1 "(inaccessible)" : : : : +-----------+-------+ : : +----+----+----+----+----+----+ : : | ptr | o---+---+--+--+-->| H | e | l | l | o | ! | : : | len | 6 | : | : +----+----+----+----+----+----+ : : | capacity | 6 | : | : : : +-----------+-------+ : | : : : : | `- - - - - - - - - - - - - - - - - - -' : s2 : | : +-----------+-------+ : | : | ptr | o---+---+--' : | len | 6 | : : | capacity | 6 | : : +-----------+-------+ : : : `- - - - - - - - - - - - - -' ```
uk: ```bob Стек Купа .- - - - - - - - - - - - - -. .- - - - - - - - - - - - - - - - - - -. : : : : : s1 "(inaccessible)" : : : : +-----------+-------+ : : +----+----+----+----+----+----+ : : | ptr | o---+---+--+--+-->| H | e | l | l | o | ! | : : | len | 6 | : | : +----+----+----+----+----+----+ : : | capacity | 6 | : | : : : +-----------+-------+ : | : : : : | `- - - - - - - - - - - - - - - - - - -' : s2 : | : +-----------+-------+ : | : | ptr | o---+---+--' : | len | 6 | : : | capacity | 6 | : : +-----------+-------+ : : : `- - - - - - - - - - - - - -' ```

source: When you pass a value to a function, the value is assigned to the function parameter. This transfers ownership:
es: Cuando pasas un valor a una función, el valor se asigna al parámetro de la función. Esta acción transfiere el _ownership_:
fa: هنگامی که یک مقدار را به یک تابع منتقل می‌کنید، مقدار به آرگمان تابع اختصاص داده می‌شود. به این شکل مالکیت را منتقل می‌کند:
ja: 次の例のように、関数に値を渡すと、その値は関数パラメータに代入されます。これにより、所有権が移動します。
ko: 값을 함수에 전달할때, 그 값은 매개변수에 할당됩니다. 이때 소유권의 이동이 일어납니다:
pt_br: Quando você passa um valor para uma função, o valor é atribuído ao parâmetro da função. Isso transfere a _ownership_:
uk: Коли ви передаєте значення функції, це значення присвоюється параметру функції. Це переміщує володіння:

source: "Hello {name}"
fa: "سلام {name}"
pt_br: "Olá {name}"
uk: "Привіт {name}"

source: Mention that this is the opposite of the defaults in C++, which copies by value unless you use `std::move` (and the move constructor is defined!).
es: Menciona que es lo contrario de los valores predeterminados de C++, que se copian por valor, a menos que utilices `std::move` (y que el constructor de movimiento esté definido).
fa: اشاره کنید که این رویه راست بر خلاف پیش‌فرض زبان <span dir=ltr>C++</span> است که در ان مقدار کپی میشود مگر که از <span dir=ltr>`std::move`</span> استفاده کنیم ( تا یک مقدار را جا به جا کنیم!)
ja: これは、`std::move` を使用しない限り（かつムーブ コンストラクタが定義されていない限り）値をコピーする、C++ のデフォルトとは逆であることを説明します。
ko: 이는 C++과 정반대 임을 설명하세요. C++에서는 복사가 기본이고, `std::move` 를 이용해야만 (그리고 이동 생성자가 정의되어 있어야만!) 소유권 이전이 됩니다.
pt_br: Mencione que isso é o oposto dos _defaults_ (padrões) em C++, que copia por valor, a menos que você use `std::move` (e seu construtor esteja definido!).
uk: Зауважте, що це протилежність поведінки за замовчуванням у C++, яка копіює за значенням, якщо ви не використовуєте `std::move` (і конструктор переміщення визначено!).

source: It is only the ownership that moves. Whether any machine code is generated to manipulate the data itself is a matter of optimization, and such copies are aggressively optimized away.
es: Es únicamente el ownership el que se mueve. Si se genera algún código máquina para manipular los datos en sí, se trata de una cuestión de optimización, y esas copias se optimizan de forma agresiva.
fa: این رویه فقط برای انتقال مالکیت است. اینکه آیا هیچ کد ماشینی برای دستکاری خود داده‌ها تولید می‌شود یا خیر، موضوعی برای بهینه‌سازی است و چنین کپی‌هایی به‌طور تهاجمی (aggressively) بهینه‌سازی می‌شوند.
ja: 移動するのは所有権のみです。データ自体を操作するためにマシンコードが生成されるかどうかは最適化の問題であり、そのようなコピーのためのマシンコードは積極的に最適化されてなくなります。
ko: 실제로 이동되는 것은 소유권일 뿐입니다. 머신 코드 레벨에서 데이터 복사가 일어날 지 말 지에 대한 것은 컴파일러 내부에서 일어나는 최적화 문제입니다. 이런 복사는 최적화 과정에서 제거가 됩니다.
pt_br: Apenas o _ownership_ é movido. A geração de código de máquina para manipular os dados é uma questão de otimização, e essas cópias são agressivamente otimizadas.
uk: Переміщується лише володіння. Чи генерується машинний код для маніпулювання самими даними - це питання оптимізації, і такі копії агресивно оптимізуються.

source: Simple values (such as integers) can be marked `Copy` (see later slides).
es: Los valores simples (como los enteros) se pueden marcar como `Copy` (consulta las diapositivas posteriores).
fa: مقادیر ساده (مانند اعداد صحیح) را می‌توان `Copy` کرد (اسلایدهای بعدی را ببینید).
ja: 単純な値（整数など）には `Copy` のマークを付けることができます（後のスライドを参照）。
ko: 정수와 같은 간단한 값들은 `Copy` (뒤에 설명합니다)로 마킹될 수 있습니다.
pt_br: Valores simples (tais como inteiros) podem ser marcados como `Copy` (cópia) (veja slides mais adiante).
uk: Прості значення (наприклад, цілі числа) можна позначити `Copy` (див. наступні слайди).

source: In Rust, clones are explicit (by using `clone`).
es: En Rust, la clonación es explícita (usando `clone`).
fa: در Rust، کلون‌ها واضح بیان می‌شوند (با استفاده از `clone`).
ja: Rust では、クローンは明示的に `clone` を使用して行われます。
ko: 러스트에서는 복사할때에는 명시적으로 `clone`을 사용합니다.
pt_br: No Rust, clones são explícitos (utilizando-se `clone`).
uk: У Rust клони є явними (за допомогою `clone`).

source: In the `say_hello` example:
fa: در مثال `say_hello`:
ja: `say_hello` の例の内容は次のとおりです。
pt_br: No exemplo `say_hello`:
uk: У прикладі `say_hello`:

source: With the first call to `say_hello`, `main` gives up ownership of `name`. Afterwards, `name` cannot be used anymore within `main`.
es: Con la primera llamada a `say_hello`, `main` deja de tener el _ownership_ de `name`. Después, ya no se podrá usar `name` dentro de `main`.
fa: با اولین فراخوانی `say_hello`، تابع `main` مالکیت `name` را انتقال می‌دهد. پس از آن، `name` دیگر نمی‌تواند در `main` استفاده شود.
ja: `say_hello` の最初の呼び出しで、`main` は `name` の所有権を放棄します。その後は `main` 内で `name` が使用できなくなります。
ko: `say_hello`함수의 첫번째 호출시 `main`함수는 자신이 가진 `name`에 대한 소유권을 포기하므로, 이후 `main`함수에서는 `name`을 사용할 수 없습니다.
pt_br: Com a primeira chamada para `diga_ola`, `main` desiste da ownership de `nome`. Depois disso, `nome` não pode mais ser usado dentro de `main`.
uk: З першим викликом `say_hello` `main` втрачає володіння `name`. Після цього `name` більше не можна використовувати в `main`.

source: The heap memory allocated for `name` will be freed at the end of the `say_hello` function.
es: La memoria de _heap_ asignada a `name` se liberará al final de la función `say_hello`.
fa: حافظه انباشت اختصاص داده شده برای `name` در انتهای تابع `say_hello` آزاد خواهد شد.
ja: `name` に割り当てられたヒープメモリは、`say_hello` 関数の最後で解放されます。
ko: `name`에 할당되있는 힙 메모리는 `say_hello`함수의 끝에서 해제됩니다.
pt_br: A memória do heap alocada para `name` será liberada no final da função `say_hello`.
uk: Пам’ять купи, виділена для `name`, буде звільнено в кінці функції `say_hello`.

source: `main` can retain ownership if it passes `name` as a reference (`&name`) and if `say_hello` accepts a reference as a parameter.
es: main` podrá conservar el _ownership_ si pasa`name` como referencia (`&name`) y si `say_hello` acepta una referencia como parámetro.
fa: تابع `main` می‌تواند مالکیت `name` را حفظ کند اگر آن را به عنوان یک مرجع (<span dir=ltr>`&name`</span>) منتقل کند و صد البته که `say_hello` یک مرجع را به عنوان پارامتر باید بپذیرد.
ja: `main` が`name` を参照として渡し（`&name`）、`say_hello` がパラメータとして参照を受け入れる場合、`main` は所有権を保持できます。
ko: `main`함수에서 `name`을 참조로 전달(빌림)하고(`&name`), `say_hello`에서 매개변수를 참조형으로 수정한다면 `main`함수는 `name`의 소유권을 유지할 수 있습니다.
pt_br: `main` pode manter a ownership se passar `nome` como uma referência (`&name`) e se `say_hello` aceitar uma referência como um parâmetro.
uk: `main` може зберігти володіння, якщо передасть `name` як посилання (`&name`) і якщо `say_hello` приймає посилання як параметр.

source: Alternatively, `main` can pass a clone of `name` in the first call (`name.clone()`).
es: Por otro lado, `main` puede pasar un clon de `name` en la primera llamada (`name.clone()`).
fa: به عنوان گزینه دیگر، `main` می‌تواند یک کلون از `name` را در فراخوانی اولیه تابع ای که در نظر داریم (<span dir=ltr>`name.clone()`</span>) منتقل کند.
ja: または、`main` が最初の呼び出しで `name` のクローン（`name.clone()`）を渡すこともできます。
ko: 또는 첫번째 호출 시 `main`함수에서 `name`을 복제하여 전달할 수도 있습니다.(`name.clone()`)
pt_br: Alternativamente, `main` pode passar um clone de `nome` na primeira chamada (`name.clone()`).
uk: Крім того, `main` може передати клон `name` під час першого виклику (`name.clone()`).

source: Rust makes it harder than C++ to inadvertently create copies by making move semantics the default, and by forcing programmers to make clones explicit.
es: Rust hace que resulte más difícil que en C++ crear copias por error al definir la semántica de movimiento como predeterminada y al obligar a los programadores a clonar sólo de forma explícita.
fa: در زبان Rust سخت‌تر از <span dir=ltr>C++</span> است که سهوا کپی ایجاد کنیم, زیر به صورت پیش‌فرض از مفهوم «انتقال» استفاده میکنیم و برنامه نویس مجبور است هر جا که لازم هست به صورت صریح کلون را ایجاد کند.
ja: Rust では、ムーブ セマンティクスをデフォルトにし、クローンをプログラマに明示的に行わせています。これにより、C++ に比べて意図せずコピーを作成するリスクが低減されています。
ko: 러스트는 이동을 기본으로 하고 복제를 명시적으로 선언하도록 만듬으로, 의도치 않게 복사본을 만드는 것이 C++에서보다 어렵습니다.
pt_br: Rust torna mais difícil a criação de cópias inadvertidamente do que o C++, tornando padrão a semântica de movimento e forçando os programadores a tornar os clones explícitos.
uk: Rust ускладнює ненавмисне створення копій, на відмінну від C++, роблячи семантику переміщення за замовчуванням і змушуючи програмістів робити клони явними.

source: Defensive Copies in Modern C++
fa: نسخههای دفاعی در ++C مدرن
pt_br: Cópias Defensivas em C++ Moderno
uk: Захисні копії в сучасному C++

source: Modern C++ solves this differently:
es: La versión moderna de C++ soluciona este problema de forma diferente:
fa: <span dir=ltr>C++</span> مدرن این مشکل را به شیوه متفاوتی حل می‌کند:
ja: 最新の C++ では、この問題を別の方法で解決します。
ko: Modern C++은 이 문제를 다르게 해결합니다:
pt_br: O C++ moderno resolve isso de maneira diferente:
uk: Сучасний C++ вирішує це інакше:

source: // Duplicate the data in s1.
ja: // s1 にデータを複製します。
pt_br: // Duplica os dados em s1.
uk: // Дублювання даних в s1.

source: The heap data from `s1` is duplicated and `s2` gets its own independent copy.
es: Los datos de la _stack_ de `s1` se duplican y `s2` obtiene su propia copia independiente.
fa: داده‌های انباشت از داده‌های `s1` یک کپی برابر اصل برای `s2` گرفته می‌شود که این کپی به صورت مستقل است.
ja: `s1` からのヒープデータが複製され、`s2` は自身の独立したコピーを取得します。
ko: `s1`의 힙 데이터는 복제되고, `s2`는 독립적인 복사본을 얻습니다.
pt_br: Os dados de `s1` no heap são duplicados e `s2` obtém sua própria cópia independente.
uk: Дані купи з `s1` дублюються, а `s2` отримує власну незалежну копію.

source: When `s1` and `s2` go out of scope, they each free their own memory.
es: Cuando `s1` y `s2` salen del ámbito, cada uno libera su propia memoria.
fa: حالا هر موقع `s1` یا `s2` از اسکوپ موردنظرشون خارج شوند هر کدام به صورت جداگانه‌ای حافظه خود را آزاد میکنند.
ja: `s1` と `s2` がスコープ外になると、それぞれ自身のメモリを解放します。
ko: `s1` 와 `s2`의 스코프가 종료되면 각각의 메모리가 해제됩니다.
pt_br: Quando `s1` e `s2` saem de escopo, cada um libera sua própria memória.
uk: Коли `s1` і `s2` виходять за межі видимості, кожен з них звільняє власну пам'ять.

source: Before copy-assignment:
es: Antes de la asignación de copias:
fa: قبل از انتساب همراه کپی:
ja: コピー代入前:
ko: 복사 전:
pt_br: Antes da atribuição por cópia:
uk: Перед копіюванням:

source: After copy-assignment:
es: Después de la asignación de copia:
fa: بعد از انتساب همراه کپی:
ja: コピー代入後:
ko: 복사 후:
pt_br: Após atribuição por cópia:
uk: Після копіювання:

source: C++ has made a slightly different choice than Rust. Because `=` copies data, the string data has to be cloned. Otherwise we would get a double-free when either string goes out of scope.
fa: زبان <span dir=ltr>C++</span> انتخاب کمی متفاوت نسبت به زبان Rust انجام داده است. زیرا `=` داده‌ها را کپی می‌کند، داده‌های رشته باید کلون شوند. در غیر این صورت، هر موقع از اسکوپ یکی از آنها خارج شویم امکان به وجود آمدن اشتباه آزادسازی مجدد حافظه رخ دهد.
ja: C++ のアプローチは、Rust とは若干異なります。`=` を使用するとデータがコピーされるため、文字列データのクローンを作成する必要があるためです。そうしないと、いずれかの文字列がスコープ外になったときに二重解放が発生します。
pt_br: O C++ fez uma escolha ligeiramente diferente do Rust. Como `=` copia dados, os dados da string devem ser clonados. Caso contrário, obteríamos uma dupla liberação quando qualquer string saísse de escopo.
uk: C++ зробив дещо інший вибір, ніж Rust. Оскільки `=` копіює дані, дані рядка потрібно клонувати. Інакше ми отримаємо подвійне звільнення, коли будь-який рядок виходить за межі видимості.
