Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Recursive data types or data types with dynamic sizes cannot be stored inline without a pointer indirection, which can be worked around using `Box`:
fa: تایپ‌های داده‌های بازگشتی یا انواع داده با اندازه‌های دینامیک را نمی‌توان به صورت inline بدون pointer indirection ذخیره کرد، که می‌توان با استفاده از `Box` آن کار را کرد:
uk: Рекурсивні типи даних або типи даних з динамічним розміром не можуть зберігатися вбудованими без перенаправлення вказівника, що можна обійти за допомогою `Box`:

source: /// A non-empty list: first element and the rest of the list.
ja: /// 空でないリスト: 最初の要素とリストの残り。
pt_br: /// Uma lista não vazia: primeiro elemento e o resto da lista.
uk: /// Непорожній список: перший елемент та решта списку.

source: /// An empty list.
ja: /// 空のリスト。
pt_br: /// Uma lista vazia.
uk: /// Порожній список.

source: ```bob Stack Heap .- - - - - - - - - - - - - - . .- - - - - - - - - - - - - - - - - - - - - - - - -. : : : : : list : : : : +---------+----+----+ : : +---------+----+----+ +------+----+----+ : : | Element | 1 | o--+----+-----+--->| Element | 2 | o--+--->| Nil | // | // | : : +---------+----+----+ : : +---------+----+----+ +------+----+----+ : : : : : : : : : '- - - - - - - - - - - - - - ' '- - - - - - - - - - - - - - - - - - - - - - - - -' ```
pt_br: ```bob Pilha Heap .- - - - - - - - - - - - -. .- - - - - - - - - - - - - - - - - - - - - - - -. : : : : : lista : : : : +------+----+----+ : : +------+----+----+ +------+----+----+ : : | Elem | 1 | o--+----+-----+--->| Elem | 2 | o--+--->| Nil | // | // | : : +------+----+----+ : : +------+----+----+ +------+----+----+ : : : : : : : : : '- - - - - - - - - - - - -' '- - - - - - - - - - - - - - - - - - - - - - - -' ```
uk: ```bob Стек Купа .- - - - - - - - - - - - - - . .- - - - - - - - - - - - - - - - - - - - - - - - -. : : : : : list : : : : +---------+----+----+ : : +---------+----+----+ +------+----+----+ : : | Element | 1 | o--+----+-----+--->| Element | 2 | o--+--->| Nil | // | // | : : +---------+----+----+ : : +---------+----+----+ +------+----+----+ : : : : : : : : : '- - - - - - - - - - - - - - ' '- - - - - - - - - - - - - - - - - - - - - - - - -' ```

source: `Box` is like `std::unique_ptr` in C++, except that it's guaranteed to be not null.
fa: `Box` مانند `std::unique_ptr` در ++C است، با این تفاوت که تضمین شده است که هیچ‌گاه تهی (null) نخواهد بود.
ja: `Box` は C++ の `std::unique_ptr` と似ていますが、null ではないことが保証されている点が異なります。
pt_br: `Box` é parecido com `std::unique_ptr` em C++, exceto que ele é garantidamente não nulo.
uk: `Box` схожий на `std::unique_ptr` у C++, за винятком того, що він гарантовано не буде null.

source: A `Box` can be useful when you:
es: Un `Box` puede resultar útil en los siguientes casos:
fa: `Box` می‌تواند زمانی مفید باشد که شما:
ja: `Box` は次のような場合に役立ちます。
ko: `Box`는 아래의 경우에 유용합니다:
pt_br: Uma `Box` é útil quando você:
uk: `Box` може бути корисним, коли ви:

source: have a type whose size can't be known at compile time, but the Rust compiler wants to know an exact size.
uk: маєте тип, розмір якого не може бути відомий під час компіляції, але компілятор Rust хоче знати точний розмір.

source: want to transfer ownership of a large amount of data. To avoid copying large amounts of data on the stack, instead store the data on the heap in a `Box` so only the pointer is moved.
es: Si quieres transferir la propiedad de una gran cantidad de datos. Para evitar que se copien grandes cantidades de datos en la _stack_, almacena los datos del _heap_ en un `Box` para que solo se mueva el puntero.
fa: می‌خواهید مالکیت مقدار زیادی داده را انتقال دهید. برای جلوگیری از کپی کردن حجم زیادی از داده‌ها در پشته، به جای آن داده‌ها را در heap در یک `Box` ذخیره کنید تا فقط اشاره‌گر منتقل شود.
ja: 大量のデータの所有権をムーブしたい場合。スタック上の大量のデータがコピーされないようにするには、代わりに`Box` によりヒープ上にデータを格納し、ポインタのみが移動されるようにします。
ko: 아주 큰 데이터의 소유권을 전달하고 싶은 경우. 스택에 있는 큰 데이터를 복사하는 대신 `Box`를 이용하여 데이터는 힙에 저장하고 포인터만 이동하면 됩니다.
pt_br: quer transferir o _ownership_ de um grande volume de dados. Ao invés de copiar grandes volumes de dados na pilha, eles são armazenados usando uma `Box` no _heap_ e apenas o ponteiro é movido.
uk: хочете передати володіння на великий обсяг даних. Щоб уникнути копіювання великих обсягів даних у стеку, натомість зберігайте дані в купі в `Box`, щоб переміщувався лише вказівник.

source: If `Box` was not used and we attempted to embed a `List` directly into the `List`, the compiler would not be able to compute a fixed size for the struct in memory (the `List` would be of infinite size).
fa: اگر از `Box` استفاده نمی‌کردیم و سعی می‌کردیم یک `List` را مستقیماً در داخل `List` قرار دهیم، کامپایلر نمی‌توانست اندازه ثابتی برای ساختار در حافظه محاسبه کند (زیرا `List` اندازه‌ای بی‌نهایت پیدا می‌کرد).
ja: 仮に`Box` を使用せずに `List` を `List` に直接埋め込もうとすると、コンパイラはメモリ内の構造体の固定サイズを計算しようとしません（`List` は無限サイズになります）。
uk: Якщо би `Box` не використовувався, і ми намагалися вставити `List` безпосередньо в `List`, компілятор не зміг би обчислити фіксований розмір структури в пам’яті (`List` мав би нескінченний розмір).

source: `Box` solves this problem as it has the same size as a regular pointer and just points at the next element of the `List` in the heap.
es: `Box` resuelve este problema, ya que tiene el mismo tamaño que un puntero normal y solo apunta al siguiente elemento de la `List` en el _heap_.
fa: `Box` این مشکل را حل می‌کند زیرا اندازه‌ای برابر با یک اشاره‌گر عادی دارد و فقط به عنصر بعدی `List` در heap اشاره می‌کند.
ja: `Box` がこの問題を解決できるのは、そのサイズが通常のポインタと同じであり、単にヒープ内の List の次の要素を指すだけだけだからです。
ko: `Box`는 일반 포인터와 크기가 같기 때문에 크기를 계산하는 데 문제가 없습니다. 다만 힙에 위치한 `List`의 다음 요소를 가리킬 뿐입니다.
pt_br: `Box` resolve esse problema, pois tem o mesmo tamanho de um ponteiro normal e apenas aponta para o próximo elemento da `List` no _heap_.
uk: `Box` вирішує цю проблему, оскільки має той самий розмір, що й звичайний вказівник, і лише вказує на наступний елемент `List` у купі.

source: Remove the `Box` in the List definition and show the compiler error. We get the message "recursive without indirection", because for data recursion, we have to use indirection, a `Box` or reference of some kind, instead of storing the value directly.
fa: `Box` را از تعریف `List` حذف کنید و خطای کامپایلر را نمایش دهید. پیام خطا "recursive without indirection" را دریافت خواهیم کرد، زیرا برای رکورسیون داده‌ها باید از یک روش غیرمستقیم، مانند `Box` یا ارجاعی از نوعی، به جای ذخیره مستقیم مقدار استفاده کنیم.
uk: Видаліть `Box` у визначенні списку та відобразіть помилку компілятора. Ми отримаємо повідомлення "recursive without indirection", тому що для рекурсії даних ми повинні використовувати посередництво, `Box` або якесь посилання, замість того, щоб зберігати значення безпосередньо.

source: Niche Optimization
es: Optimización de la Memoria
fa: بهینه سازی Niche
ja: Niche最適化
ko: 니치(틈새) 최적화(Niche Optimization)
pt_br: Otimização de Nicho
uk: Нішева оптимізація

source: Though `Box` looks like `std::unique_ptr` in C++, it cannot be empty/null. This makes `Box` one of the types that allow the compiler to optimize storage of some enums.
fa: اگرچه `Box` مشابه `std::unique_ptr` در ++C به نظر می‌رسد، اما نمی‌تواند خالی/null باشد. این ویژگی باعث می‌شود که `Box` یکی از تایپ‌هایی باشد که به کامپایلر اجازه می‌دهد ذخیره‌سازی برخی از `enum`ها را بهینه‌سازی کند.
uk: Хоча `Box` виглядає як `std::unique_ptr` у C++, він не може бути порожнім/нульовим. Це робить `Box` одним з типів, які дозволяють компілятору оптимізувати зберігання деяких переліків.

source: For example, `Option<Box<T>>` has the same size, as just `Box<T>`, because compiler uses NULL-value to discriminate variants instead of using explicit tag (["Null Pointer Optimization"](https://doc.rust-lang.org/std/option/#representation)):
fa: برای مثال، `<<Option<Box<T` همان اندازه را دارد که `<Box<T`، زیرا کامپایلر از مقدار NULL برای تمایز بین variant‌ ها به جای استفاده از تگ صریح استفاده می‌کند (["بهینه‌سازی اشاره‌گر خالی"](https://doc.rust-lang.org/std/option/#representation)):
uk: Наприклад, `Option<Box<T>>` має такий самий розмір, як і просто `Box<T>`, оскільки компілятор використовує NULL-значення для розрізнення варіантів замість використання явного тегу (["Оптимізація нульового вказівника"](https://doc.rust-lang.org/std/option/#representation)):

source: "Size of just_box: {}"
uk: "Розмір just_box: {}"

source: "Size of optional_box: {}"
uk: "Розмір optional_box: {}"

source: "Size of none: {}"
uk: "Розмір none: {}"

source: [`Rc`](https://doc.rust-lang.org/std/rc/struct.Rc.html) is a reference-counted shared pointer. Use this when you need to refer to the same data from multiple places:
es: [`Rc`](https://doc.rust-lang.org/std/rc/struct.Rc.html) es un puntero compartido de referencia contada. Utilízalo cuando necesites hacer referencia a los mismos datos desde varios lugares:
fa: [`Rc`](https://doc.rust-lang.org/std/rc/struct.Rc.html) یک اشاره‌گر مشترک با شمارش ارجاع است. از این هنگام استفاده کنید که نیاز دارید به داده‌های یکسان از مکان‌های متعدد اشاره کنید:
ja: [`Rc`](https://doc.rust-lang.org/std/rc/struct.Rc.html) は、参照カウントされた共有ポインタです。複数の場所から同じデータを参照する必要がある場合に使用します。
ko: [`Rc`](https://doc.rust-lang.org/std/rc/struct.Rc.html)는 참조 카운팅 공유 포인터입니다. 여러 위치에서 동일한 데이터를 참조해야할 경우 사용합니다:
pt_br: [`Rc`](https://doc.rust-lang.org/std/rc/struct.Rc.html) é um ponteiro compartilhado com contagem de referência. Use-o quando precisar consultar os mesmos dados a partir de vários locais:
uk: [`Rc`](https://doc.rust-lang.org/std/rc/struct.Rc.html) — це спільний вказівник із підрахунком посилань. Використовуйте це, коли вам потрібно звернутися до тих самих даних з кількох місць:

source: See [`Arc`](../concurrency/shared-state/arc.md) and [`Mutex`](https://doc.rust-lang.org/std/sync/struct.Mutex.html) if you are in a multi-threaded context.
fa: اگر در یک محیط چند-رشته‌ای (multi-threaded) هستید، به [`Arc`](../concurrency/shared-state/arc.md) و [`Mutex`](https://doc.rust-lang.org/std/sync/struct.Mutex.html) نگاه کنید.
uk: Дивіться [`Arc`](../concurrency/shared-state/arc.md) та [`Mutex`](https://doc.rust-lang.org/std/sync/struct.Mutex.html), якщо ви працюєте у багатопотоковому контексті.

source: You can _downgrade_ a shared pointer into a [`Weak`](https://doc.rust-lang.org/std/rc/struct.Weak.html) pointer to create cycles that will get dropped.
es: Puedes _degradar_ un puntero compartido en un puntero [`Weak`](https://doc.rust-lang.org/std/rc/struct.Weak.html) para crear ciclos que se abandonarán.
fa: شما می‌توانید یک اشاره‌گر مشترک را به یک اشاره‌گر [`Weak`](https://doc.rust-lang.org/std/rc/struct.Weak.html) تغییر دهید تا دوره‌هایی ایجاد کنید که در نهایت حذف خواهند شد.
ja: 共有ポインタを [`Weak`](https://doc.rust-lang.org/std/rc/struct.Weak.html) ポインタにダウングレード _(downgrade)_ すると、ドロップされるサイクルを作成できます。
ko: drop 가능한 순환 구조를 만들기 위해 공유 포인터를 [`Weak`](https://doc.rust-lang.org/std/rc/struct.Weak.html) 포인터로 _다운그레이드_할 수도 있습니다.
pt_br: Você pode demover (_downgrade_) um ponteiro compartilhado para um ponteiro [`Weak`](https://doc.rust-lang.org/std/rc/struct.Weak.html) (fraco) para criar ciclos que serão descartados.
uk: Ви можете _понизити_ спільний вказівник на [`Weak`](https://doc.rust-lang.org/std/rc/struct.Weak.html) вказівник, щоб створити цикли, які буде відкинуті.

source: `Rc`'s count ensures that its contained value is valid for as long as there are references.
es: El recuento de `Rc` asegura que el valor que contiene sea válido mientras haya referencias.
fa: شمارش `Rc` تضمین می‌کند که مقدار درون آن به مدت زمانی که ارجاع‌هایی وجود دارد، معتبر خواهد بود.
ja: `Rc` のカウントは、参照がある限り有効であることを保証します。
ko: `Rc`는 참조 카운트를 통해 참조가 있는 동안은 `Rc`가 가리키고 있는 값이 메모리에서 해제되지 않음을 보장합니다.
pt_br: O contador do `Rc` garante que os seus valores contidos sejam válidos enquanto houver referências.
uk: Рахунок `Rc` гарантує, що значення, яке міститься в ньому, буде дійсним до тих пір, поки існують посилання.

source: `Rc` in Rust is like `std::shared_ptr` in C++.
es: `Rc` en Rust es como `std::shared_ptr` en C++.
fa: `Rc` در Rust مشابه `std::shared_ptr` در ++C است.
ja: Rust の `Rc` は C++ の `std::shared_ptr` に似ています。
ko: C++의 `std::shared_ptr`와 유사합니다.
pt_br: `Rc` em Rust é como `std::shared_ptr` em C++.
uk: `Rc` у Rust схожий на `std::shared_ptr` у C++.

source: `Rc::clone` is cheap: it creates a pointer to the same allocation and increases the reference count. Does not make a deep clone and can generally be ignored when looking for performance issues in code.
es: `Rc::clone` es simple: crea un puntero en la misma asignación y aumenta el recuento de referencias. No hace clones completos y, por lo general, se puede ignorar cuando se buscan problemas de rendimiento en el código.
fa: `Rc::clone` ارزان است: این تابع یک اشاره‌گر به همان تخصیص (allocation) ایجاد می‌کند و شمارش ارجاع را افزایش می‌دهد. این عمل کپی عمیق (deep clone) انجام نمی‌دهد و به طور کلی هنگام جستجو برای مسائل عملکردی در کد می‌توان آن را نادیده گرفت.
ja: `Rc::clone`の動作は軽量です。同じ割り当て領域へのポインタを作成し、参照カウントを増やすだけです。デープクローンを作成しないので、性能上の問題箇所をコードから探す場合には通常無視することが出来ます。
ko: `clone`은 비용이 거의 들지 않습니다. 같은 곳을 가리키는 포인터를 하나 더 만들고, 참조 카운트를 늘립니다. 포인터가 가리키는 값 자체가 복제(깊은 복제)되지는 않으며, 그래서 코드에서 성능 문제가 있는지 검토할 때 일반적으로 `Rc`를 `clone`하는 것은 무시할 수 있습니다.
pt_br: `Rc::clone` é barato: ele cria um ponteiro para a mesma alocação e aumenta a contagem de referência. Ele não faz um "clone profundo" (_deep clone_) e geralmente pode ser ignorado ao procurar problemas de desempenho no código.
uk: `Rc::clone` дешевий: він створює вказівник на той самий розділ пам’яті і збільшує кількість посилань. Він не робить глибокого клонування, і, як правило, його можна ігнорувати, шукаючи проблеми з продуктивністю в коді.

source: `make_mut` actually clones the inner value if necessary ("clone-on-write") and returns a mutable reference.
es: `make_mut` clona el valor interno si es necesario ("copiar al escribir") y devuelve una referencia mutable.
fa: `make_mut` در واقع در صورت نیاز مقدار درونی را کپی می‌کند ("clone-on-write") و یک ارجاع قابل تغییر (mutable reference) برمی‌گرداند.
ja: `make_mut` は、必要に応じて内部の値のクローンを作成し（「clone-on-write」）、可変参照を返します。
ko: `make_mut`는 실제로 필요한 경우에 내부 값을 복제하고("clone-on-write") 가변 참조를 반환합니다.
pt_br: `make_mut` realmente clona o valor interno se necessário ("_clone-on-write_") e retorna uma referência mutável.
uk: `make_mut` насправді клонує внутрішнє значення, якщо необхідно ("clone-on-write") і повертає мутабельне посилання.

source: Use `Rc::strong_count` to check the reference count.
es: Comprueba el recuento de referencias con `Rc::strong_count`.
fa: از `Rc::strong_count` برای بررسی شمارش ارجاع‌ها استفاده کنید.
ja: `Rc::strong_count` を使用して参照カウントを確認します。
ko: 참조 카운트를 확인하려면 `Rc::strong_count`를 사용하세요.
pt_br: Use `Rc::strong_count` para verificar a contagem de referência.
uk: Використовуйте `Rc::strong_count`, щоб перевірити кількість посилань.

source: `Rc::downgrade` gives you a _weakly reference-counted_ object to create cycles that will be dropped properly (likely in combination with `RefCell`).
fa: `Rc::downgrade` یک شیء _با شمارش ارجاع ضعیف_ به شما می‌دهد تا دوره‌هایی ایجاد کنید که به درستی حذف خواهند شد (احتمالاً به همراه `RefCell`).
ja: `Rc::downgrade` は、（多くの場合、`RefCell` と組み合わせて）適切にドロップされるサイクルを作成するための弱参照カウント _(weakly reference-counted)_ オブジェクトを提供します。
pt_br: `Rc::downgrade` fornece um objeto com _contagem de referência fraca_ (_weakly reference-counted_) para criar ciclos que serão descartados corretamente (provavelmente em combinação com `RefCell`).
uk: `Rc::downgrade` дає вам _слабкий об'єкт з підрахунком посилань_ для створення циклів, які будуть відкинуті належним чином (ймовірно, у поєднанні з `RefCell`).

source: We previously saw how trait objects can be used with references, e.g `&dyn Pet`. However, we can also use trait objects with smart pointers like `Box` to create an owned trait object: `Box<dyn Pet>`.
fa: پیش‌تر دیدیم که چگونه می‌توان ازویژگی اشیاء (trait objects) با ارجاعات استفاده کرد، مثلاً `dyn Pet&`. با این حال، می‌توانیم از اشیاء ویژگی با اشاره‌گرهای هوشمند مانند `Box` نیز استفاده کنیم تا یک شیء ویژگی مالک (owned trait object) ایجاد کنیم: `<Box<dyn Pet`.
uk: Раніше ми бачили, як об'єкти трейтів можна використовувати з посиланнями, наприклад, `&dyn Pet`. Однак, ми також можемо використовувати об'єкти трейтів з розумними вказівниками, такими як `Box`, щоб створити власний об'єкт трейту: `Box<dyn Pet>`.

source: Memory layout after allocating `pets`:
es: Diseño de la memoria después de asignar `pets`:
fa: چیدمان حافظه پس از تخصیص `pets`:
ja: `pets`を割り当てた後のメモリレイアウト：
ko: `pets`를 할당한 이후의 메모리 레이아웃:
pt_br: Layout da memória após alocar `pets`:
uk: Розташування пам’яті після виділення `pets`:

source: ```bob Stack Heap .- - - - - - - - - - - - - -. .- - - - - - - - - - - - - - - - - - - - - - -. : : : : : "pets: Vec<dyn Pet>" : : "data: Cat" +----+----+----+----+ : : +-----------+-------+ : : +-------+-------+ | F | i | d | o | : : | ptr | o---+---+--. : | lives | 9 | +----+----+----+----+ : : | len | 2 | : | : +-------+-------+ ^ : : | capacity | 2 | : | : ^ | : : +-----------+-------+ : | : | '-------. : : : | : | data:"Dog"| : : : | : | +-------+--|-------+ : `- - - - - - - - - - - - - -' | : +---|-+-----+ | name | o, 4, 4 | : `--+-->| o o | o o-|----->| age | 5 | : : +-|---+-|---+ +-------+----------+ : : | | : `- - -| - - |- - - - - - - - - - - - - - - - -' | | | | "Program text" .- - -| - - |- - - - - - - - - - - - - - - - -. : | | vtable : : | | +----------------------+ : : | `----->| "<Dog as Pet>::talk" | : : | +----------------------+ : : | vtable : : | +----------------------+ : : '----------->| "<Cat as Pet>::talk" | : : +----------------------+ : : : '- - - - - - - - - - - - - - - - - - - - - - -' ```
uk: ```bob Стек Купа .- - - - - - - - - - - - - -. .- - - - - - - - - - - - - - - - - - - - - - -. : : : : : "pets: Vec<dyn Pet>" : : "data: Cat" +----+----+----+----+ : : +-----------+-------+ : : +-------+-------+ | F | i | d | o | : : | ptr | o---+---+--. : | lives | 9 | +----+----+----+----+ : : | len | 2 | : | : +-------+-------+ ^ : : | capacity | 2 | : | : ^ | : : +-----------+-------+ : | : | '-------. : : : | : | data:"Dog"| : : : | : | +-------+--|-------+ : `- - - - - - - - - - - - - -' | : +---|-+-----+ | name | o, 4, 4 | : `--+-->| o o | o o-|----->| age | 5 | : : +-|---+-|---+ +-------+----------+ : : | | : `- - -| - - |- - - - - - - - - - - - - - - - -' | | | | "Program text" .- - -| - - |- - - - - - - - - - - - - - - - -. : | | vtable : : | | +----------------------+ : : | `----->| "<Dog as Pet>::talk" | : : | +----------------------+ : : | vtable : : | +----------------------+ : : '----------->| "<Cat as Pet>::talk" | : : +----------------------+ : : : '- - - - - - - - - - - - - - - - - - - - - - -' ```

source: Types that implement a given trait may be of different sizes. This makes it impossible to have things like `Vec<dyn Pet>` in the example above.
fa: تایپ‌هایی که ویژگی معین را پیاده‌سازی می‌کنند ممکن است اندازه‌های مختلفی داشته باشند. این موضوع باعث می‌شود که داشتن مواردی مانند `<Vec<dyn Pet` در مثال بالا غیرممکن باشد.
ja: 同じトレイトを実装する型であってもそのサイズは異なることがあります。そのため、上の例でVec<dyn Pet>と書くことはできません。
pt_br: Tipos que implementam um dado `trait` podem ter tamanhos diferentes. Isto torna impossível haver coisas como `Vec<dyn Pet>` no exemplo anterior.
uk: Типи, що реалізують певний трейт, можуть бути різних розмірів. Це унеможливлює створення таких типів, як `Vec<dyn Pet>` у наведеному вище прикладі.

source: `dyn Pet` is a way to tell the compiler about a dynamically sized type that implements `Pet`.
es: `dyn Pet` es una forma de indicar al compilador un tipo de tamaño dinámico que implementa `Pet`.
fa: `dyn Pet` راهی است برای اطلاع دادن به کامپایلر درباره یک تایپ با اندازه پویا که ویژگی `Pet` را پیاده‌سازی می‌کند.
ja: `dyn Pet` はコンパイラに、この型が`Pet`トレイトを実装する動的なサイズの型であることを伝えます。
ko: `dyn Pet`이라고 하면이 타입의 크기는 동적이며 `Pet`을 구현하고 있다고 컴파일러에게 알려주는 것입니다.
pt_br: `dyn Pet` é uma maneira de dizer ao compilador sobre um tipo de tamanho dinâmico que implementa `Pet`.
uk: `dyn Pet` — це спосіб повідомити компілятору про тип динамічного розміру, який реалізує `Pet`.

source: In the example, `pets` is allocated on the stack and the vector data is on the heap. The two vector elements are _fat pointers_:
fa: در این مثال، `pets` در stack تخصیص داده می‌شود و داده‌های vector در heap هستند. دو عنصر vector _اشاره‌گرهای چاق_ (fat pointers) هستند:
ja: 上の例では `pets` はスタックに確保され、ベクターのデータはヒープ上にあります。二つのベクターの要素は _ファットポインタ_ です：
pt_br: No exemplo, `pets` é alocado na pilha e os dados do vetor estão no heap. Os dois elementos do vetor são _fat pointers_ (ponteiros "gordos"):
uk: У прикладі `pets` розміщується у стеку, а векторні дані - у купі. Два векторні елементи є _жирними вказівниками_:

source: A fat pointer is a double-width pointer. It has two components: a pointer to the actual object and a pointer to the [virtual method table](https://en.wikipedia.org/wiki/Virtual_method_table) (vtable) for the `Pet` implementation of that particular object.
fa: اشاره‌گر چاق (fat pointer) یک اشاره‌گر با عرض دو برابر است. این اشاره‌گر دو مؤلفه دارد: یک اشاره‌گر به شیء واقعی و یک اشاره‌گر به [روش‌های جدول مجازی](https://en.wikipedia.org/wiki/Virtual_method_table) (vtable) برای پیاده‌سازی `Pet` آن شیء خاص.
ja: ファットポインタはdouble-widthポインタです。これは二つの要素からなります：実際のオブジェクトへのポインタと、そのオブジェクトの`Pet`の実装のための[仮想関数テーブル](https://ja.wikipedia.org/wiki/%E4%BB%AE%E6%83%B3%E9%96%A2%E6%95%B0%E3%83%86%E3%83%BC%E3%83%96%E3%83%AB) (vtable)です。
pt_br: Um _fat pointer_ é um ponteiro de dupla largura. Ele tem dois componentes: um ponteiro para o objeto real e um ponteiro para a [tabela de métodos virtuais](https://en.wikipedia.org/wiki/Virtual_method_table) (vtable) para a implementação `Pet` desse objeto em particular.
uk: Жирний вказівник - це вказівник подвійної ширини. Він складається з двох компонентів: вказівника на власне об'єкт і вказівника на [таблицю віртуальних методів](https://en.wikipedia.org/wiki/Virtual_method_table) (vtable) для реалізації `Pet` цього конкретного об'єкта.

source: The data for the `Dog` named Fido is the `name` and `age` fields. The `Cat` has a `lives` field.
fa: داده‌های مربوط به `Dog` به نام Fido شامل فیلدهای `name` و `age` است. `Cat` دارای فیلد `lives` است.
ja: "Fido"と名付けられた`Dog`のデータは`name` と `age` のフィールドに対応します。（訳注: "Fido"とはよくある犬の愛称で、日本語でいう「ポチ」のような名前です。）例の`Cat`には`lives` フィールドがあります。（訳注: ここで`Cat`が`lives`というフィールドを持ち、9で初期化しているのは"A cat has nine lives" —猫は９つの命を持つ—ということわざに由来します。）
pt_br: Os dados para o `Dog` chamado Fido são os campos `name` e `age`. O `Cat` tem um campo `lives`.
uk: Дані для `Dog` на ім'я Фідо - це поля `name` та `age`. Для `Cat` є поле `lives`.

source: Compare these outputs in the above example:
es: Compara estas salidas en el ejemplo anterior:
fa: خروجی‌های زیر را در مثال بالا مقایسه کنید:
ja: 上の例において、下のコードによる出力結果を比べてみましょう：
ko: 아래 코드의 결과와 비교해보세요:
pt_br: Compare estas saídas no exemplo anterior::
uk: Порівняйте ці результати в наведеному вище прикладі:
