Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: A tool called `gnrt` knows how to download crates and how to generate `BUILD.gn` rules.
fa: ابزاری به نام `gnrt` می‌داند که چگونه جعبه‌ها را بارگیری کند و چگونه قواعد `BUILD.gn` را ایجاد کند.
pt_br: Uma ferramenta chamada `gnrt` sabe como baixar _crates_ e como criar regras `BUILD.gn`.
uk: Інструмент під назвою `gnrt` знає, як завантажувати крейти і як генерувати правила `BUILD.gn`.

source: To start, download the crate you want like this:
fa: برای شروع، crate مورد نظر خود را به صورت زیر دانلود کنید:
pt_br: Para começar, baixe o _crate_ que você deseja assim:
uk: Для початку завантажте потрібний вам крейт ось так:

source: Although the `gnrt` tool is part of the Chromium source code, by running this command you will be downloading and running its dependencies from `crates.io`. See [the earlier section](../cargo.md) discussing this security decision.
fa: اگرچه ابزار`gnrt` بخشی از کد منبع Chromium است، با اجرای این دستور، وابستگی‌های آن را از `crates.io` دانلود و اجرا می‌کنید. [بخش قبلی](../cargo.md) را در مورد این تصمیم امنیتی ببینید.
pt_br: Embora a ferramenta `gnrt` faça parte do código-fonte do Chromium, ao executar este comando, você estará baixando e executando suas dependências de `crates.io`. Veja [a seção anterior](../cargo.md) que discute essa decisão de segurança.
uk: Хоча інструмент `gnrt` є частиною вхідного коду Chromium, виконуючи цю команду, ви завантажите і запустите його залежності з `crates.io`. Дивіться [попередній розділ](../cargo.md), де описано це рішення з безпеки.

source: This `vendor` command may download:
fa: این `vendor` command ممکن است بارگیری کند:
pt_br: Este comando `vendor` pode baixar:
uk: Ця команда `vendor` може завантажити:

source: Your crate
fa: جعبه‌های (crates) کاربردی شما
pt_br: Seu _crate_
uk: Ваш крейт

source: Direct and transitive dependencies
fa: وابستگی های مستقیم و گذرا
pt_br: Dependências diretas e transitivas
uk: Прямі та транзитивні залежності

source: New versions of other crates, as required by `cargo` to resolve the complete set of crates required by Chromium.
fa: نسخه‌های جدید crateهای دیگر، همانطور که `cargo` برای حل کردن مجموعه کامل جعبه‌های مورد نیاز Chromium لازم است.
pt_br: Novas versões de outros _crates_, conforme exigido pelo `cargo` para resolver o conjunto completo de _crates_ requeridos pelo Chromium.
uk: Нові версії інших крейтів, які вимагаються `cargo` для встановлення повного набору крейтів, необхідних для Chromium.

source: Chromium maintains patches for some crates, kept in `//third_party/rust/chromium_crates_io/patches`. These will be reapplied automatically, but if patching fails you may need to take manual action.
fa: ‏ Chromium وصله‌هایی را برای برخی crateها نگهداری می‌کند که در`//third_party/rust/chromium_crates_io/patches` نگهداری می‌شوند. این‌ها به‌طور خودکار دوباره اعمال می‌شوند، اما اگر وصله نشد، ممکن است نیاز به اقدام دستی داشته باشید.
pt_br: O Chromium mantém _patches_ para alguns _crates_ em `//third_party/rust/chromium_crates_io/patches`. Eles serão reaplicados automaticamente, mas se a aplicação do _patch_ falhar, você poderá precisar realizar manualmente.
uk: Chromium підтримує патчі для деяких крейтів, які зберігаються у `//third_party/rust/chromium_crates_io/patches`. Їх буде повторно застосовано автоматично, але якщо виправлення не вдасться, вам може знадобитися вжити заходів вручну.

source: Once you've downloaded the crate, generate the `BUILD.gn` files like this:
fa: هنگامی که crate را دانلود کردید، فایل‌های `BUILD.gn` را مانند این تولید کنید:
pt_br: Depois de baixar o _crate_, gere os arquivos `BUILD.gn` assim:
uk: Після того, як ви завантажили крейт, згенеруйте файли `BUILD.gn`, як показано нижче:

source: Now run `git status`. You should find:
fa: اکنون `git status` را اجرا کنید. شما باید این موارد را پیدا کنید:
pt_br: Agora execute `git status`. Você deve encontrar:
uk: Тепер запустіть `git status`. Ви повинні знайти:

source: At least one new crate source code in `third_party/rust/chromium_crates_io/vendor`
fa: حداقل یک کد منبع جعبه جدید در `third_party/rust/chromium_crates_io/vendor`
pt_br: Pelo menos um novo código-fonte de _crate_ em `third_party/rust/chromium_crates_io/vendor`
uk: Щонайменше один новий вхідний код скриньки у `third_party/rust/chromium_crates_io/vendor`

source: At least one new `BUILD.gn` in `third_party/rust/<crate name>/v<major semver version>`
fa: حداقل یک `BUILD.gn` جدید در `third_party/rust/<crate name>/v<major semver version>`
pt_br: Pelo menos um novo `BUILD.gn` em `third_party/rust/<nome do _crate_>/v<versão semver principal>`
uk: Щонайменше один новий `BUILD.gn` у `third_party/rust/<crate name>/v<major semver version>`

source: An appropriate `README.chromium`
fa: یک `README.chromium` مناسب
pt_br: Um `README.chromium` apropriado
uk: Відповідний `README.chromium`

source: The "major semver version" is a [Rust "semver" version number](https://doc.rust-lang.org/cargo/reference/semver.html).
fa: لطفا به [مرجع Rust ](https://doc.rust-lang.org/reference/type-layout.html) مراجعه کنید.
pt_br: A "versão semver principal" é um [número de versão "semver" Rust](https://doc.rust-lang.org/cargo/reference/semver.html).
uk: Тут "major semver version" - це [номер версії "semver" Rust ](https://doc.rust-lang.org/cargo/reference/semver.html).

source: Take a close look, especially at the things generated in `third_party/rust`.
fa: نگاهی دقیق بیندازید، به‌خصوص به چیزهایی که در `third_party/rust` ایجاد می‌شوند.
pt_br: Dê uma olhada de perto, especialmente nas coisas geradas em `third_party/rust`.
uk: Уважно подивіться, особливо на те, що генерується в `third_party/rust`.

source: Talk a little about semver --- and specifically the way that in Chromium it's to allow multiple incompatible versions of a crate, which is discouraged but sometimes necessary in the Cargo ecosystem.
fa: کمی در مورد semver --- و به‌ویژه روشی که در Chromium اجازه می‌دهد چندین نسخه ناسازگار از crateها را مجاز کند، صحبت کنید. این مورد که در اکوسیستم Cargo منع می‌شود ولی گاهی اوقات ضروری است.
pt_br: Fale um pouco sobre semver --- e especificamente a maneira como no Chromium é permitir várias versões incompatíveis de um _crate_, o que é desencorajado, mas às vezes necessário no ecossistema Cargo.
uk: Поговоримо трохи про семантичну версифікацію (semver) --- і, зокрема, про те, як у Chromium вона дозволяє створювати кілька несумісних версій крейту, що не рекомендується, але іноді необхідно в екосистемі Cargo.

source: If your build fails, it may be because of a `build.rs`: programs which do arbitrary things at build time. This is fundamentally at odds with the design of `gn` and `ninja` which aim for static, deterministic, build rules to maximize parallelism and repeatability of builds.
fa: اگر build شما با شکست مواجه شد، ممکن است به دلیل `build.rs` باشد: برنامه‌هایی که کارهای دلخواه را در زمان build انجام می‌دهند. این مورد به‌طورکلی در تضاد با طراحی `gn` و `ninja` است که هدفشان قواعد build ایستا، قطعی برای به حداکثر رساندن موازی‌سازی و تکرارپذیری buildها است.
pt_br: Se a sua compilação falhar, pode ser por causa de um `build.rs`: programas que fazem coisas arbitrárias no momento da compilação. Isso é fundamentalmente incompatível com o design do `gn` e do `ninja`, que visam regras de compilação estáticas e determinísticas para maximizar o paralelismo e a repetibilidade das compilações.
uk: Якщо ваша збірка не вдається, це може бути пов'язано з `build.rs`: програмами, які виконують довільні дії під час збирання. Це принципово суперечить принципам роботи `gn` та `ninja`, які передбачають статичні, детерміновані правила збирання для максимізації паралелізму та повторюваності збірок.

source: Some `build.rs` actions are automatically supported; others require action:
fa: برخی از اقدامات `build.rs` به طور خودکار پشتیبانی می‌شوند. دیگران نیاز به اقدام دارند:
pt_br: Algumas ações `build.rs` são suportadas automaticamente; outras exigem ação:
uk: Деякі дії `build.rs` підтримуються автоматично, інші потребують втручання:

source: build script effect
fa: ساخت افکت اسکریپت
uk: ефект скрипту збірки

source: Supported by our gn templates
fa: توسط قالب‌های gn ما پشتیبانی می‌شود
pt_br: Suportado por nossos _templates_ gn
uk: Підтримується нашими шаблонами gn

source: Work required by you
fa: کار مورد نیاز شما
pt_br: Trabalho exigido por você
uk: Робота, яка потрібна від вас

source: Checking rustc version to configure features on and off
fa: بررسی نسخه rustc برای پیکربندی ویژگی‌ها روشن و خاموش
pt_br: Verificando a versão do rustc para configurar recursos ativados e desativados
uk: Перевірка версії rustc для ввімкнення та вимкнення можливостей

source: Yes
es: Sí
fa: بلی
ja: はい
ko: 예
pt_br: Sim
uk: Так

source: None
pt_br: Nenhum
uk: Нічого

source: Checking platform or CPU to configure features on and off
fa: بررسی پلتفرم یا CPU برای پیکربندی ویژگی‌های روشن و خاموش
pt_br: Verificando a plataforma ou CPU para configurar recursos ativados e desativados
uk: Перевірка платформи або процесора для ввімкнення та вимкнення можливостей

source: Generating code
fa: تولید کردن کد
pt_br: Gerando código
uk: Генерація коду

source: Yes - specify in `gnrt_config.toml`
fa: بله - در `gnrt_config.toml` مشخص کنید
pt_br: Sim - especifique em `gnrt_config.toml`
uk: Так - вкажіть у файлі `gnrt_config.toml`

source: Building C/C++
pt_br: Compilando C/C++
uk: Збірка C/C++

source: No
fa: خیر
ja: いいえ
ko: 아니오
pt_br: Não
uk: Немає

source: Patch around it
fa: اطراف آن را Patch کنید
pt_br: Corrigir
uk: Залатати навколо

source: Arbitrary other actions
fa: سایر اقدامات دلخواه
pt_br: Outras ações arbitrárias
uk: Довільні інші дії

source: Fortunately, most crates don't contain a build script, and fortunately, most build scripts only do the top two actions.
fa: خوشبختانه، اکثر crateها حاوی build script نیستند و خوشبختانه، اکثر build scriptها تنها دو عمل اصلی را انجام می‌دهند.
pt_br: Felizmente, a maioria dos _crates_ não contém um script de compilação e, felizmente, a maioria dos scripts de compilação faz apenas as duas ações principais.
uk: На щастя, більшість крейтів не містять скриптів збірки, і, на щастя, більшість скриптів збірки виконують лише перші дві дії.

source: If `ninja` complains about missing files, check the `build.rs` to see if it writes source code files.
fa: اگه `ninja` درباره نبودن فایل‌ها اعتراض کرد، `build.rs` را بررسی کنید و ببینید که آیا کدهای منبع را می‌نویسد.
pt_br: Se o `ninja` reclamar sobre arquivos ausentes, verifique o `build.rs` para
uk: Якщо `ninja` скаржиться на відсутність файлів, перевірте `build.rs`, чи пише він файли вхідного коду.

source: If so, modify [`gnrt_config.toml`](../configuring-gnrt-config-toml.md) to add `build-script-outputs` to the crate. If this is a transitive dependency, that is, one on which Chromium code should not directly depend, also add `allow-first-party-usage=false`. There are several examples already in that file:
fa: در این صورت، [`gnrt_config.toml`](../configuring-gnrt-config-toml.md) را تغییر دهید تا `build-script-outputs` به crate اضافه شود. اگر این یک وابستگی گذرا است، یعنی وابستگی که کد Chromium نباید مستقیماً به آن وابسته باشد، پس `allow-first-party-usage=false` را نیز اضافه کنید. چندین نمونه از قبل در آن فایل وجود دارد:
pt_br: Se for esse o caso, modifique [`gnrt_config.toml`](../configuring-gnrt-config-toml.md) para adicionar `build-script-outputs` ao _crate_. Se esta for uma dependência transitiva, ou seja, uma na qual o código do Chromium não deve depender diretamente, adicione também `allow-first-party-usage=false`. Já existem vários exemplos neste arquivo:
uk: Якщо так, змініть [`gnrt_config.toml`](../configuring-gnrt-config-toml.md), щоб додати `build-script-outputs` до сховища. Якщо це транзитивна залежність, тобто така, від якої код Chromium не повинен безпосередньо залежати, також додайте `allow-first-party-usage=false`. У цьому файлі вже є кілька прикладів:

source: Now rerun [`gnrt.py -- gen`](../generating-gn-build-rules.md) to regenerate `BUILD.gn` files to inform ninja that this particular output file is input to subsequent build steps.
fa: اکنون [`gnrt.py -- gen`](../generating-gn-build-rules.md) را مجدداً اجرا کنید تا فایل‌های `BUILD.gn` را دوباره تولید کنید تا به ninja اطلاع دهید که این فایل خروجی خاص ورودی مراحل build بعدی است.
pt_br: Agora, execute novamente [`gnrt.py -- gen`](../generating-gn-build-rules.md) para re-gerar os arquivos `BUILD.gn` para informar ao ninja que este arquivo de saída específico é a entrada para etapas de compilação subsequentes.
uk: Тепер повторно запустіть [`gnrt.py -- gen`](../generating-gn-build-rules.md) для регенерації файлів `BUILD.gn`, щоб повідомити ninja , що саме цей вихідний файл буде використано на наступних кроках збірки.

source: Some crates use the [`cc`](https://crates.io/crates/cc) crate to build and link C/C++ libraries. Other crates parse C/C++ using [`bindgen`](https://crates.io/crates/bindgen) within their build scripts. These actions can't be supported in a Chromium context --- our gn, ninja and LLVM build system is very specific in expressing relationships between build actions.
fa: برخی از crateها از crate مربوط به [`cc`](https://crates.io/crates/cc) برای build و link کتابخانه‌های C/C++ استفاده می‌کنند. crateهای دیگر C/C++ را با استفاده از [`bindgen`](https://crates.io/crates/bindgen) در اسکریپت‌های build خود تجزیه می‌کنند. این فعالیت‌ها را نمی‌توان در زمینه Chromium پشتیبانی کرد --- سیستم ساخت gn، ninja و LLVM ما در بیان روابط بین build actionsها بسیار خاص است.
pt_br: Alguns _crates_ usam o _crate_ [`cc`](https://crates.io/crates/cc) para compilar e vincular bibliotecas C/C++. Outros _crates_ analisam C/C++ usando o [`bindgen`](https://crates.io/crates/bindgen) em seus scripts de compilação. Essas ações não podem ser suportadas em um contexto do Chromium --- nosso sistema de compilação gn, ninja e LLVM é muito específico na expressão de relacionamentos entre ações de compilação.
uk: Деякі крейти використовують крейт [`cc`](https://crates.io/crates/cc) для збірки та компонування бібліотек C/C++. Інші крейти розбирають C/C++ за допомогою [`bindgen`](https://crates.io/crates/bindgen) у своїх скриптах збірки. Ці дії не підтримуються у контексті Chromium --- наша система збірки gn, ninja та LLVM дуже специфічна у вираженні взаємозв'язків між діями збірки.

source: So, your options are:
fa: بنابراین، گزینه‌های شما عبارتند از:
pt_br: Então, suas opções são:
uk: Отже, у вас є наступні варіанти:

source: Avoid these crates
fa: از این crateها اجتناب کنید
pt_br: Evite esses _crates_
uk: Уникайте цих крейтів

source: Apply a patch to the crate.
fa: یک وصله (patch) روی crate بزنید.
pt_br: Aplique um _patch_ ao _crate_.
uk: Накладіть патч на крейт.

source: Patches should be kept in `third_party/rust/chromium_crates_io/patches/<crate>` - see for example the [patches against the `cxx` crate](https://source.chromium.org/chromium/chromium/src/+/main:third_party/rust/chromium_crates_io/patches/cxx/) - and will be applied automatically by `gnrt` each time it upgrades the crate.
fa: وصله‌ها (Patches) باید در`third_party/rust/chromium_crates_io/patches/<crate>` نگهداری شوند - برای مثال [Patchها در مقابل `](https://source.chromium.org/chromium/chromium/src/+/main:third_party/rust/chromium_crates_io/patches/cxx/) - و هر بار که crate را upgrade می‌کند به‌طور خودکار توسط`gnrt` اعمال می‌شود.
pt_br: Os _patches_ devem ser mantidos em `third_party/rust/chromium_crates_io/patches/<crate>` - veja, por exemplo, os [patches para o _crate_ `cxx`](https://source.chromium.org/chromium/chromium/src/+/main:third_party/rust/chromium_crates_io/patches/cxx/) - e serão aplicados automaticamente pelo `gnrt` sempre que ele atualizar o _crate_.
uk: Патчі слід зберігати у `third_party/rust/chromium_crates_io/patches/<crate>` - дивіться, наприклад, [патчі на крейти`cxx`](https://source.chromium.org/chromium/chromium/src/+/main:third_party/rust/chromium_crates_io/patches/cxx/) - і вони будуть автоматично застосовуватися `gnrt` під час кожного оновлення крейту.

source: Once you've added a third-party crate and generated build rules, depending on a crate is simple. Find your `rust_static_library` target, and add a `dep` on the `:lib` target within your crate.
fa: هنگامی که یک crate شخص ثالث اضافه کردید و قواعد build را ایجاد کردید که با توجه به نوع crate می‌تواند ساده باشد. درنتیجه هدف `rust_static_library` خود را پیدا کنید و یک `dep` روی هدف `:lib` در crate خود اضافه کنید.
pt_br: Depois de adicionar um _crate_ de terceiros e gerar regras de compilação, depender de um _crate_ é simples. Encontre seu alvo `rust_static_library` e adicione um `dep` no alvo `:lib` dentro do seu _crate_.
uk: Після того, як ви додали сторонній крейт і згенерували правила збірки, залежність від крейту є простою. Знайдіть ціль `rust_static_library` і додайте `dep` до цілі `:lib` у вашій збірці.

source: Specifically,
fa: به‌طور‌مشخص،
pt_br: Especificamente,
uk: А саме,

source: Auditing Third Party Crates
fa: حسابرسی Crateهای شخص ثالث
pt_br: Auditoria de _Crates_ de Terceiros
uk: Аудит сторонніх крейтів

source: Adding new libraries is subject to Chromium's standard [policies](https://chromium.googlesource.com/chromium/src/+/refs/heads/main/docs/rust.md#Third_party-review), but of course also subject to security review. As you may be bringing in not just a single crate but also transitive dependencies, there may be a lot of code to review. On the other hand, safe Rust code can have limited negative side effects. How should you review it?
fa: افزودن کتابخانه‌های جدید تابع [قواعد](https://chromium.googlesource.com/chromium/src/+/refs/heads/main/docs/rust.md#Third_party-review) مربوط به Chromium است، اما البته موضوع بررسی امنیتی نیز وجود دارد. از آنجایی که ممکن است نه تنها یک crate، بلکه وابستگی‌های گذرا را نیز وارد کنید، ممکن است کدهای زیادی برای بررسی وجود داشته باشد. از سوی دیگر، safe Rust code می‌تواند عوارض جانبی محدودی داشته باشد. پس چگونه باید آن را بررسی کنید؟
pt_br: A adição de novas bibliotecas está sujeita às políticas padrão do Chromium (https://chromium.googlesource.com/chromium/src/+/refs/heads/main/docs/rust.md#Third_party-review), mas, é claro, também está sujeita à verificação de segurança. Como você pode estar trazendo não apenas um único _crate_, mas também dependências transitivas, pode haver muito código para revisar. Por outro lado, o código Rust seguro pode ter efeitos colaterais negativos limitados. Como você deve revisá-lo?
uk: Додавання нових бібліотек підпорядковується стандартним [політикам Chromium](https://chromium.googlesource.com/chromium/src/+/refs/heads/main/docs/rust.md#Third_party-review), але, звісно, також підлягає перевірці безпеки. Оскільки ви можете додати не лише один крейт, але й транзитивні залежності, то може бути багато коду для перевірки. З іншого боку, безпечний код Rust може мати обмежені негативні побічні ефекти. Як ви повинні його перевіряти?

source: Over time Chromium aims to move to a process based around [cargo vet](https://mozilla.github.io/cargo-vet/).
fa: با گذشت زمان، Chromium قصد دارد به فرآیندی بر اساس [cargo vet](https://mozilla.github.io/cargo-vet/) حرکت کند.
pt_br: Ao longo do tempo, o Chromium visa a migrar para um processo baseado em [cargo vet](https://mozilla.github.io/cargo-vet/).
uk: З часом Chromium планує перейти на процес, заснований навколо [cargo vet](https://mozilla.github.io/cargo-vet/).

source: Meanwhile, for each new crate addition, we are checking for the following:
fa: در همین حال، برای هر crate جدید اضافه شده، موارد زیر را بررسی می کنیم:
pt_br: Enquanto isso, para cada nova adição de _crate_, estamos verificando o seguinte:
uk: Тим часом, для кожного нового доданого крейту ми перевіряємо наступне:

source: Understand why each crate is used. What's the relationship between crates? If the build system for each crate contains a `build.rs` or procedural macros, work out what they're for. Are they compatible with the way Chromium is normally built?
fa: بدانید که چرا هر crate استفاده می‌شود. رابطه بین crateها چیست؟ اگر سیستم ساخت هر جعبه حاوی `build.rs` یا ماکروهای رویه‌ای (procedural macros) است، مشخص کنید که آن‌ها برای چه چیزی هستند. آیا آنها با روشی که Chromium به طور معمول ساخته و built می‌شود سازگار هستند؟
pt_br: Entenda por que cada _crate_ é usado. Qual é a relação entre os _crates_? Se o sistema de compilação de cada _crate_ contiver um `build.rs` ou macros procedurais, descubra para que servem. Eles são compatíveis com a maneira como o Chromium é normalmente construído?
uk: Зрозуміти, для чого використовується кожен крейт. Який взаємозв'язок між крейтами? Якщо система збірки для кожного крейту містить `build.rs` або процедурні макроси, з'ясуйвати, для чого вони призначені. Чи сумісні вони зі звичайним способом збирання Chromium?

source: Check each crate seems to be reasonably well maintained
pt_br: Verifique se cada _crate_ parece estar razoavelmente bem mantido
uk: Перевірити, щоб кожен крейт був достатньо добре доглянутий

source: Use `cd third-party/rust/chromium_crates_io; cargo audit` to check for known vulnerabilities (first you'll need to `cargo install cargo-audit`, which ironically involves downloading lots of dependencies from the internet[2](../cargo.md))
fa: از `cd third-party/rust/chromium_crates_io; cargo audit` استفاده کنید. بررسی cargo برای بررسی آسیب‌پذیری‌های شناخته‌شده (ابتدا باید `cargo install cargo-audit` که از قضا شامل دانلود وابستگی‌های زیادی از اینترنت می‌شود[2](../cargo.md))
pt_br: Use `cd third-party/rust/chromium_crates_io; cargo audit` para verificar se há vulnerabilidades conhecidas (primeiro você precisará `cargo install cargo-audit`, o que ironicamente envolve baixar muitas dependências da internet[2](../cargo.md))
uk: За допомогою `cd third-party/rust/chromium_crates_io; cargo audit` перевірити наявність відомих уразливостей (спочатку потрібно `cargo install cargo-audit`, що за іронією долі передбачає завантаження великої кількості залежностей з інтернету[2](../cargo.md)).

source: Ensure any `unsafe` code is good enough for the [Rule of Two](https://chromium.googlesource.com/chromium/src/+/main/docs/security/rule-of-2.md#unsafe-code-in-safe-languages)
fa: مطمئن شوید هر کد `unsafe` به اندازه کافی برای [قاعده دو](https://chromium.googlesource.com/chromium/src/+/main/docs/security/rule-of-2.md#unsafe-code-in-safe-languages) خوب است
pt_br: Certifique-se de que qualquer código `unsafe` seja bom o suficiente para a [Regra de Dois](https://chromium.googlesource.com/chromium/src/+/main/docs/security/rule-of-2.md#unsafe-code-in-safe-languages)
uk: Переконатися, що будь-який `unsafe` код достатньо підходить для [Правила двох](https://chromium.googlesource.com/chromium/src/+/main/docs/security/rule-of-2.md#unsafe-code-in-safe-languages).

source: Check for any use of `fs` or `net` APIs
fa: هرگونه استفاده از APIهای `fs` یا `net` را بررسی کنید
pt_br: Verifique se há uso de APIs `fs` ou `net`
uk: Перевірити, чи не використовуються API `fs` або `net`

source: Read all the code at a sufficient level to look for anything out of place that might have been maliciously inserted. (You can't realistically aim for 100% perfection here: there's often just too much code.)
fa: تمام کدها را در سطح کافی بخوانید تا به دنبال هر چیزی که ممکن است به طور مخرب وارد شده باشد را بگردید. (در اینجا نمی توانید به طور واقع بینانه به دنبال نتیجه ۱۰۰ درصدی باشید: اغلب کدهای زیادی وجود دارد.)
pt_br: Leia todo o código em um nível suficiente para procurar qualquer coisa fora do lugar que possa ter sido inserida maliciosamente. (Você não pode realisticamente visar 100% de perfeição aqui: muitas vezes há simplesmente muito código).
uk: Прочитати весь код на достатньому рівні, щоб знайти все, що могло бути вставлено зловмисниками. (Ви не можете реально прагнути до 100% досконалості тут: часто коду просто занадто багато).
