Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Here is a bit of background information about how we've been running the course internally at Google.
es: A continuación, te ofrecemos información general sobre cómo se ha desarrollado el curso en Google.
fa: اینجا بخشی از پیشینه نحوه برگزاری دوره توسط گوگل به صورت درون سازمانی است.
ja: 以下は、Google内での講座の運営方法に関する情報です。
ko: 다음은 구글 내부에서 이 과정을 어떤식으로 운영해왔는지에 대한 배경 정보입니다.
pt_br: Aqui estão algumas informações básicas sobre como estamos conduzindo o curso internamente no Google.
uk: Ось коротка довідкова інформація про те, як ми проводили цей курс всередині Google.

source: We typically run classes from 9:00 am to 4:00 pm, with a 1 hour lunch break in the middle. This leaves 3 hours for the morning class and 3 hours for the afternoon class. Both sessions contain multiple breaks and time for students to work on exercises.
fa: ما معمولا کلاس‌ها را از ساعت ۱۰:۰۰ تا ۱۶:۰۰ برگزار می کنیم، با یک ساعت استراحت ناهار در میانه روز با این رویه ۲.۵ ساعت برای کلاس صبح و ۲.۵ ساعت برای کلاس بعدازظهر باقی می‌گذارد. توجه داشته باشید که این فقط یک توصیه است: شما می‌توانید ۳ ساعت از جلسه صبح را صرف تمرین بیشتر برای افراد کنید. نکته منفی این کار این است که با جلسه طولانی تر افراد بعد از ۶ ساعت کلاس در بعد از ظهر خیلی خسته میشوند.
ja: クラスは通常午前9時から午後4時までで、途中で1時間の昼食休憩があります。つまり、午前のクラスが3時間、午後のクラスが3時間となります。どちらのセッションにも、休憩と、受講者が演習に取り組むための時間が複数回含まれています。
pt_br: Normalmente realizamos as aulas das 9h às 16h, com uma pausa de 1 hora para o almoço no meio. Isso deixa 3 horas para a aula da manhã e 3 horas para a aula da tarde. Ambas as sessões contêm várias pausas e tempo para os alunos trabalharem nos exercícios.
uk: Зазвичай ми проводимо заняття з 9:00 до 16:00, з 1-годинною перервою на обід посередині. Це залишає 3 години для ранкового заняття та 3 години для післяобіднього заняття. Обидві сесії містять кілька перерв і час для роботи студентів над вправами.

source: Before you run the course, you will want to:
es: Antes de impartir el curso, te recomdamos hacer lo siguiente:
fa: قبل از اجرای دوره، شما می‌خواهید:
ja: 講座開始までに、以下にあげる準備を済ませておくと良いでしょう：
ko: 강의를 실행하기 위한 준비:
pt_br: Antes de oferecer o curso, você precisa:
uk: Перед проведенням курсу бажано:

source: Make yourself familiar with the course material. We've included speaker notes to help highlight the key points (please help us by contributing more speaker notes!). When presenting, you should make sure to open the speaker notes in a popup (click the link with a little arrow next to "Speaker Notes"). This way you have a clean screen to present to the class.
es: Familiarízate con el material del curso. Hemos incluido notas del orador para destacar los puntos clave (ayúdanos a añadir más notas de este tipo). Cuando hagas una presentación, asegúrate de abrir las notas del orador en una ventana emergente (haz clic en el enlace que tiene una pequeña flecha junto a "Notas del orador"). De esta manera, tendrás una pantalla despejada para mostrar a la clase.
fa: با مطالب دوره آشنا شوید. ما یادداشت های سخنرانی را برای کمک به برجسته کردن نکات کلیدی گنجانده‌ایم (لطفا با مشارکت بیشتر در یادداشت‌های سخنران به ما کمک کنید!). هنگام ارائه، باید مطمئن شوید که یادداشت‌های سخنران را در یک پنجره پاپ‌آپ باز کنید (روی پیوند با یک فلش کوچک در کنار «یادداشت‌های سخنران» کلیک کنید). به این ترتیب یک صفحه نمایش تمیز برای ارائه به کلاس خواهید داشت.
ja: 資料に慣れておいてください。要点を強調するためにスピーカーノートが用意されています（内容の追加にご協力ください！）。プレゼン時には、スクリーンを見やすい状態で保つために、スピーカーノートはポップアップウィンドウで開いてください（スピーカーノートの横にある小さな矢印をクリック）。
ko: 강의 자료를 숙지합니다. 주요 요점을 강조하기 위해 강의 참조 노트를 포함하였습니다. (추가적인 노트를 작성하여 제공해 주시면 감사하겠습니다.) 강의 참조 노트의 링크를 누르면 별도의 팝업으로 분리가 되며, 메인 화면에서는 사라집니다. 깔끔한 화면으로 강의를 진행할 수 있습니다.
pt_br: Familiarize-se com o material do curso. Incluímos notas do instrutor para ajudar a destacar os pontos principais (ajude-nos contribuindo com mais notas!). Ao apresentar, certifique-se de abrir as notas do instrutor em um pop-up (clique no link com uma pequena seta ao lado de "Speaker Notes" ou "Notas do Instrutor"). Desta forma você tem uma tela limpa para apresentar à turma.
uk: Ознайомитись з матеріалами курсу. Ми додали нотатки для викладача на деяких сторінках, щоб виділити ключові моменти (будь ласка, допомагайте нам, додаючи свої нотатки для викладачів!). Під час презентації переконайтеся, що відкрили нотатки для викладача у спливаючому вікні (натисніть на посилання з маленькою стрілкою поруч з "Нотатки для викладача"). Таким чином ви матимете чистий екран, який можна представити класу.

source: Decide on the dates. Since the course takes four days, we recommend that you schedule the days over two weeks. Course participants have said that they find it helpful to have a gap in the course since it helps them process all the information we give them.
fa: در مورد زمان‌بندی دوره تصمیم بگیرید. از آنجایی که دوره حداقل سه روز کامل طول می‌کشد، توصیه می‌کنیم که دوره را در دو هفته برنامه‌ریزی کنید. شرکت کنندگان در دوره گفته‌اند که داشتن فاصله‌ای در دوره مفید است، زیرا به آنها کمک می‌کند تا تمام اطلاعاتی را که به آنها می‌دهیم پردازش کنند.
pt_br: Decida as datas. Como o curso leva pelo menos quatro dias completos, recomendamos que você agende os dias ao longo de duas semanas. Os participantes do curso disseram que eles acham útil ter um espaço no curso, pois os ajuda a processar todas as informações que lhes damos.
uk: Визначитись з датами. Оскільки курс вимагає щонайменше чотири дні, ми рекомендуємо вам запланувати ці дні протягом двох тижнів. Учасники курсу сказали, що вони вважають корисним наявність прогалин у курсі, оскільки це допомагає їм обробити всю інформацію, яку ми їм надаємо.

source: Find a room large enough for your in-person participants. We recommend a class size of 15-25 people. That's small enough that people are comfortable asking questions --- it's also small enough that one instructor will have time to answer the questions. Make sure the room has _desks_ for yourself and for the students: you will all need to be able to sit and work with your laptops. In particular, you will be doing a lot of live-coding as an instructor, so a lectern won't be very helpful for you.
es: Busca una sala con capacidad suficiente para los participantes presenciales. Recomendamos una sala para entre 15 y 25 personas. Es el tamaño ideal para que los alumnos se sientan cómodos haciendo preguntas y para que el profesor tenga tiempo de responderlas. Asegúrate de que en la sala haya _mesas_ para ti y para los alumnos: todos necesitaréis sentaros y trabajar con vuestros portátiles. Además, como instructor, programarás mucho en directo, por lo que un atril no te resultará muy útil.
fa: یک اتاق بزرگ برای حضور شرکت کنندگان پیدا کنید. ما کلاسی با گنجایش ۱۵ الی ۲۵ نفر را پیشنهاد می‌کنیم. افراد در این تعداد می‌توانند به راحتی سوال بپرسند --- همچنین مدرس وقت کافی برای پاسخ‌ دادن به سوالات را نیز دارد. مطمئن شوید که اتاق مورد نظر _میز_ برای شما و دانشجویان دارد: شما همگی نیاز دارید که بتونید بشنید و با لپتاپ های خود کار کنید. به خصوص شما به عنوان مدرس کلی live-coding انجام خواهید داد پس صرفا یک میز بدون جا برای لپتاپ برای شما مناسب نخواهد بود.
ja: 十分な広さの部屋を確保しておいてください。15~25名程度のクラスを推奨しています。受講者にとって質問がしやすい人数であり、1人の講師が質問に答える時間も確保できる規模だからです。また、皆さんはPCで作業をする必要があるため、講師を含めた人数分の机を用意しておいてください。ライブコーディング形式での実施を想定しているため、講壇は不要です。
ko: 충분한 공간을 확보합니다. 15에서 20명 규모의 공간을 추천합니다. 수강생과 강사가 질의를 하기에 충분한 시간과 공간이어야 합니다. 강사나 수강생 모두 \_책상_을 사용할 수 있는 강의실이면 좋습니다. 강의 중에 강사가 라이브 코딩을 하게 될 경우가 많으며, 이때 자리에 앉아 노트북을 사용하는 것이 도움이 됩니다.
pt_br: Encontre uma sala grande o suficiente para seus participantes presenciais. Recomendamos turmas de 15 a 25 pessoas. Isso é pequeno o suficiente para que as pessoas se sintam confortáveis fazendo perguntas --- também é pequeno o suficiente para que um instrutor tenha tempo para responder às perguntas. Certifique-se de que a sala tenha _mesas_ para você e para os alunos: todos vocês precisam ser capazes de sentar e trabalhar com seus laptops. Em particular, você fará muita codificação ao vivo como instrutor, portanto, um pódio não será muito útil para você.
uk: Знайти приміщення досить просторе для очної участі. Ми рекомендуємо, щоб у класі було 15-20 чоловік. Це досить небагато для того, щоб людям було комфортно ставити запитання --- також достатньо мало, щоб один інструктор мав час відповісти на запитання. Переконайтеся, що в кімнаті є _парти_ для вас і для студентів: ви всі повинні мати можливість сидіти і працювати за своїми ноутбуками. Зокрема, ви будете виконувати багато програмування в реальному часі як інструктор, тому кафедра вам не дуже допоможе.

source: On the day of your course, show up to the room a little early to set things up. We recommend presenting directly using `mdbook serve` running on your laptop (see the [installation instructions](https://github.com/google/comprehensive-rust#building)). This ensures optimal performance with no lag as you change pages. Using your laptop will also allow you to fix typos as you or the course participants spot them.
es: El mismo día del curso, llega con antelación a la clase para preparar todo lo necesario. Te recomendamos que realices la presentación directamente desde `mdbook serve` en tu portátil (consulta las \[instrucciones de instalación\]\[3\]). Así conseguirás un rendimiento óptimo y que no haya demoras al pasar de una página a otra. También podrás corregir las erratas a medida que tú o los participantes del curso las detectéis.
fa: در روز برگزاری دوره، کمی زودتر به کلاس بیایید تا همه چیز را آماده کنید. ما توصیه می کنیم مستقیماً با استفاده از `mdbook serve`را در لپتاپ خود اجرا کنید. ([راهنمای نصب](https://github.com/google/comprehensive-rust#building) را ببنیید). با این کار عملکرد بدون تاخیر در هنگام تغییر صفحات تضمین می شود. استفاده از لپ تاپ همچنین به شما امکان می دهد اشتباهات تایپی ا در صورت مشاهده شما یا شرکت کنندگان در دوره اصلاح کنید.
ja: 当日は少し早めに到着して準備をしてください。自分のPCで実行する`mdbook serve`から直接プレゼンを行う事を推奨します（[インストール手順](https://github.com/google/comprehensive-rust#building)はこちら）。これにより、ページ切り替え時に遅延なしで最適なパフォーマンスが得られます。また、PCを使用する事で、受講者や自分自身が見つけたタイプミスなども修正可能になります。
ko: 강의 당일 조금 일찍 와서 준비합니다. 강사 노트북에서 `mdbook serve`를 이용해 직접 프레젠테이션 하면 페이지 이동 시의 지연이 없습니다.([설치 방법](https://github.com/google/comprehensive-rust#building)을 참조하세요.) 또한, 그렇게 하면 강의 도중 오타를 발견했을 때 그 자리에서 바로 수정 가능하다는 장점도 있습니다.
pt_br: No dia do seu curso, chegue um pouco mais cedo na sala para acertar as coisas. Recomendamos apresentar diretamente usando `mdbook serve` rodando em seu laptop (consulte as [instruções de instalação](https://github.com/google/comprehensive-rust#building)). Isso garante um desempenho ideal sem atrasos conforme você muda de página. Usar seu laptop também permitirá que você corrija erros de digitação enquanto você ou os participantes do curso os identificam.
uk: У день заняття приходьте в кімнату трохи раніше, щоби все підготувати. Ми рекомендуємо презентувати безпосередньо за допомогою `mdbook serve`, запущеного на вашому ноутбуці (дивиться [installation instructions](https://github.com/google/comprehensive-rust#building)). Це забезпечує оптимальну продуктивність без затримок під час зміни сторінок. Використання ноутбука також дозволить вам виправляти друкарські помилки в міру їх виявлення вами або учасниками курсу.

source: Let people solve the exercises by themselves or in small groups. We typically spend 30-45 minutes on exercises in the morning and in the afternoon (including time to review the solutions). Make sure to ask people if they're stuck or if there is anything you can help with. When you see that several people have the same problem, call it out to the class and offer a solution, e.g., by showing people where to find the relevant information in the standard library.
es: Deja que los alumnos resuelvan los ejercicios por sí mismos o en pequeños grupos. Solemos dedicar entre 30 y 45 minutos a los ejercicios por la mañana y por la tarde (incluido el tiempo para revisar las soluciones). Asegúrate de preguntar a los asistentes si les está costando hacerlo o si hay algo en lo que puedas ayudarles. Cuando veas que varias personas tienen el mismo problema, coméntalo delante de la clase y ofrece una solución. Por ejemplo, enséñales dónde encontrar la información importante en la biblioteca estándar.
fa: بگذارید افراد خودشان یا در گروه های کوچک تمرینات را حل کنند. مابه طور معمول ۳۰ الی ۴۵ دقیقه را برای تمرینات در صبح و بعد‌از‌ظهر (از جمله زمان بررسی راه حل ها ) صرف می‌کنیم. حتما از افراد بخواهید که اگر گیر کرده‌اند یا چیزی وجود دارد که می‌توانید به آنها کمک کنید. وقتی که می‌بینید چندین نفر مشکل یکسانی دارند, خطاب به کلاس راه‌حل را پیشنهاد دهید؛ به عنوان مثال، با نشان دادن جایی که می‌توانند اطلاعات مربوطه را در کتابخانه استاندارد (standard library) پیدا کنند.
ja: 練習問題は個人か小さいグループで解いてください。回答をレビューする時間も含め、各練習問題に30~45分を費やします。受講者が行き詰まっているかどうか、何か質問があるかなど確認してください。複数の受講者が同じ問題で詰まっている場合、クラス全体に対してそれを共有し、解決策を提供してください。例えば、探している情報が標準ライブラリのどこにあるかを示す、など。
ko: 수강생들이 직접 (개별 혹은 그룹으로) 연습문제를 풀도록 합니다. 대체로 오전, 오후에 각각 30-45분 정도를 연습문제에 할당합니다 (이는 해답을 보고 설명하는 시간까지 포함합니다). 막혀 도움을 필요로 하는 수강생이 없는지 수시로 확인합니다. 만약 같은 문제를 여러 사람이 겪고 있다면, 그 문제를 강의실 전체 인원에게 알리고 해결책을 제시합니다. 예를 들어 표준 라이브러리 어디에 가면 그 문제에 대한 해답을 찾을 수 있는지 알려 줍니다.
pt_br: Deixe as pessoas resolverem os exercícios sozinhas ou em pequenos grupos. Normalmente gastamos de 30 a 45 minutos em exercícios pela manhã e à tarde (incluindo o tempo para revisar as soluções). Tenha certeza de perguntar às pessoas se elas estão em dificuldades ou se há algo em que você possa ajudar. Quando você vir que várias pessoas têm o mesmo problema, chame a turma e ofereça uma solução, por exemplo, mostrando às pessoas onde encontrar as informações relevantes na biblioteca padrão ("standard library").
uk: Дозвольте учасникам вирішувати вправи самостійно або у невеликих групах. Зазвичай ми приділяємо вправам по 30-45 хвилин вранці та у другій половині дня (включаючи час на розбір рішень). Обов'язково запитуйте людей, чи не мають вони труднощів і чи є щось, з чим ви можете допомогти. Коли ви бачите, що у кількох людей одна і та ж проблема, повідомте про цей клас і запропонуйте рішення, наприклад, показавши, де знайти відповідну інформацію у стандартній бібліотеці.

source: That is all, good luck running the course! We hope it will be as much fun for you as it has been for us!
es: Eso es todo. ¡Buena suerte con el curso! Esperamos que te diviertas tanto como nosotros.
fa: همش همین بود! در تدریس دوره موفق باشید! امیدواریم که برای شما هم به همان اندازه که برای ما لذت‌بخش بوده، لذت‌بخش باشد!
ja: 以上です。運営頑張ってください！皆さんにとっても楽しい時間になりますように！
ko: 이제 준비는 끝났습니다. 우리가 그랬듯이 여러분들도 이 강의를 즐기시길 바랍니다!
pt_br: Isso é tudo, boa sorte no curso! Esperamos que seja tão divertido para você como tem sido para nós!
uk: На цьому все, удачі у проходженні курсу! Ми сподіваємося, що вам буде так само весело, як і нам!

source: Please [provide feedback](https://github.com/google/comprehensive-rust/discussions/86) afterwards so that we can keep improving the course. We would love to hear what worked well for you and what can be made better. Your students are also very welcome to [send us feedback](https://github.com/google/comprehensive-rust/discussions/100)!
es: Después, [envíanos un comentario](https://github.com/google/comprehensive-rust/discussions/86) para que podamos seguir mejorando el curso. Estaremos encantados de que nos cuentes qué aspectos destacarías y qué se puede mejorar. Tus alumnos también pueden [enviarnos sus sugerencias](https://github.com/google/comprehensive-rust/discussions/100)!
fa: لطفاً [بازخورد خود را ارائه دهید](https://github.com/google/comprehensive-rust/discussions/86) تا در آینده بتوانیم به بهبود دوره ادامه دهیم. ما دوست داریم بشنویم چه چیزی برای شما خوب بوده و چه چیزی می تواند بهتر شود. همینطور شما دانش‌آموزان نیز بسیار خوش آمدید [برای ما بازخورد ارسال کنید](https://github.com/google/comprehensive-rust/discussions/100) !
ja: 本講座の改善に向けて[フィードバック](https://github.com/google/comprehensive-rust/discussions/86)をお願いします。うまくいった点や改善点について幅広くご意見お聞かせください。[受講者からのフィードバック](https://github.com/google/comprehensive-rust/discussions/100)も歓迎しております！
ko: 강의를 계속 개선할 수 있도록 [피드백](https://github.com/google/comprehensive-rust/discussions/86)을 제공해 주십시오. 우리는 무엇이 좋았고, 무엇이 모자랐는지 듣고 싶습니다. 수강생들로 부터의 [피드백](https://github.com/google/comprehensive-rust/discussions/100)도 환영합니다!
pt_br: Por favor, [dê seu feedback](https://github.com/google/comprehensive-rust/discussions/86) depois para que possamos continuar melhorando o curso. Adoraríamos saber o que funcionou bem para você e o que pode ser melhorado. Seus alunos também são muito bem-vindos para [nos enviar feedback](https://github.com/google/comprehensive-rust/discussions/100)!
uk: Будь ласка, [залишіть відгук](https://github.com/google/comprehensive-rust/discussions/86), щоб ми могли продовжувати удосконалювати курс. Ми хотіли б почути, що було добре і що можна зробити краще. Ваші студенти також можуть [надіслати нам свої відгуки](https://github.com/google/comprehensive-rust/discussions/100)!

source: Rust Fundamentals
es: Fundamentos de Rust
fa: مبانی Rust
ja: Rust の基礎
pt_br: Fundamentos do Rust
uk: Основи Rust

source: The first four days make up [Rust Fundamentals](../welcome-day-1.md). The days are fast paced and we cover a lot of ground!
fa: سه روز اول دوره را [مبانی Rust ](../welcome-day-1.md)تشکیل میدهند. این این سه روز با سرعت بالایی پیش می‌روند و ما موارد زیادی را پوشش می‌دهیم!
ja: [Rust の基礎](../welcome-day-1.md) を構成する最初の 4 日間で、さまざまな項目を駆け足で学びます。
pt_br: Os primeiros quatro dias compõem os [Fundamentos do Rust](../welcome-day-1.md). Os dias são rápidos e cobrimos bastante counteúdo!
uk: Перші чотири дні складають [Основи Rust](../welcome-day-1.md). Дні протікають швидко, і ми багато робимо!

source: {{%course outline Fundamentals}}
uk: Основи Rust

source: Deep Dives
es: Información más detallada
fa: عمیق تر شدن
ja: 専門的なトピック
ko: 심화 학습
pt_br: Análises Detalhadas
uk: Глибоке занурення

source: In addition to the 4-day class on Rust Fundamentals, we cover some more specialized topics:
fa: علاوه بر کلاس 4 روزه Rust Fundamentals، موضوعات تخصصی تری را نیز پوشش می دهیم:
pt_br: Além do curso de 4 dias sobre Fundamentos de Rust, nós abordamos alguns tópicos mais especializados:
uk: На додаток до 4-денного курсу з основ Rust, ми розглянемо ще кілька спеціалізованих тем:

source: Rust in Android
es: Rust en Android
fa: Rust در اندروید
pt_br: Rust para Android
uk: Rust в Android

source: The [Rust in Android](../android.md) deep dive is a half-day course on using Rust for Android platform development. This includes interoperability with C, C++, and Java.
es: [Rust en Android](../android.md) es un curso de medio día sobre el uso de Rust para el desarrollo de la plataforma Android. En él se incluye la interoperabilidad con C, C++ y Java.
fa: در [Rust در اندروید](../android.md) توی دوره یک دوره نیم روزه در مورد استفاده از Rust برای توسعه پلتفرم اندروید عمیق می‌شیم. این شامل قابلیت تعامل با C، <span dir=ltr>C++</span> و جاوا می‌شود.
pt_br: O [Rust para Android](../android.md) é um curso de meio dia sobre o uso de Rust para o desenvolvimento na plataforma Android. Isso inclui interoperabilidade com C, C++ e Java.
uk: [Rust в Android](../android.md) --- це напівденний курс з використання Rust для розробки на Android платформі. Сюди входить взаємодія з C, C++ та Java.

source: You will need an [AOSP checkout](https://source.android.com/docs/setup/download/downloading). Make a checkout of the [course repository](https://github.com/google/comprehensive-rust) on the same machine and move the `src/android/` directory into the root of your AOSP checkout. This will ensure that the Android build system sees the `Android.bp` files in `src/android/`.
es: Necesitarás [conseguir el AOSP](https://source.android.com/docs/setup/download/downloading). Descarga el [repositorio del curso](https://github.com/google/comprehensive-rust) en el mismo ordenador y mueve el directorio `src/android/` a la raíz del AOSP. De esta forma, el sistema de compilación de Android verá los archivos `Android.bp` en `src/android/`.
fa: شما نیاز دارید که یک نسخه از [مخزن ASOP](https://source.android.com/docs/setup/download/downloading) بگیرید, همچنین یک نسخه از [مخزن دوره](https://github.com/google/comprehensive-rust) بگیرید و روی همون ماشین در مسیر `src/android/`مخزن ASOP قرار دهید. با این کار طمینان حاصل می‌کنید که سیستم build اندروید فایل های `Android.bp` را در `src/android/` می‌بینید.
ja: [AOSPのチェックアウト](https://source.android.com/docs/setup/download/downloading)が必要です。同じ端末から[講座のリポジトリ](https://github.com/google/comprehensive-rust)をチェックアウトし、`src/android/`ディレクトリをAOSPチェックアウトのルートに移動してください。これにより、Androidビルドシステムが`src/android/`内の`Android.bp`を確認できるようになります。
ko: [AOSP 코드](https://source.android.com/docs/setup/download/downloading)를 여러분의 컴퓨터에 체크아웃해야 합니다. 그런 다음, 그 컴퓨터에서 [과정 저장소](https://github.com/google/comprehensive-rust)를 체크아웃하고 `src/android/` 디렉터리를 AOSP 코드의 루트로 이동합니다. 이렇게 하면 안드로이드 빌드 시스템에서 과제용으로 추가된 `Android.bp`파일을 인식할 수 있습니다.
pt_br: Você precisará de um [_checkout_ do AOSP](https://source.android.com/docs/setup/download/downloading). Faça um checkout do [repositório do curso](https://github.com/google/comprehensive-rust) no mesmo computador e mova o diretório `src/android/` para a raiz do seu checkout do AOSP. Isso garantirá que o sistema de compilação do Android veja os arquivos `Android.bp` em `src/android/`.
uk: Вам знадобиться [AOSP](https://source.android.com/docs/setup/download/downloading). Завантажте [репозиторій курсу](https://github.com/google/comprehensive-rust) на той же комп'ютер, що і курс та перемістіть каталог `src/android/` в кореневий каталог вашого AOSP. Це гарантує, що система збирання Android побачить файли `Android.bp` в `src/android/`.

source: Ensure that `adb sync` works with your emulator or real device and pre-build all Android examples using `src/android/build_all.sh`. Read the script to see the commands it runs and make sure they work when you run them by hand.
es: Asegúrate que `adb sync` funciona con tu emulador o en un dispositivo físico y haz pre-build en todos los ejemplos de Android usando `src/android/build_all.sh`. Lee el script para ver los comandos que corren y asegúrate que funcionan cuando lo corres a mano.
fa: اطمینان حاصل کنید که `adb sync` با شبیه‌ساز یا دستگاه واقعی شما کار می‌کند و همه نمونه‌های Android را با استفاده از `src/android/build_all.sh` از قبل بسازید. اسکریپت را بخوانید تا دستوراتی را که اجرا می‌کند ببینید و مطمئن شوید که وقتی آنها را اجرا می‌کنید به درستی کار می‌کنند.
ja: エミュレータまたは実際のデバイスで`adb sync`が機能する事を確認し、`src/android/build_all.sh`を使用して全てのAndroidの例を事前にビルドしてください。スクリプトを読んで実行コマンドを確認し、手動で実行した際に正常に動作する事を確認してください。
ko: `adb sync` 명렁어가 에뮬레이터 혹은 실제 장치와 작동하는지 확인합니다. 그리고 `src/android/build_all.sh`를 수행해서 모든 안드로이드 예제를 미리 빌드해 보세요. 그 쉘 스크립트를 읽고, 그 안에서 수행되는 명령어들을 확인한 후 각 명령어들을 수동으로 실행해도 잘 되는지 확인하세요.
pt_br: Certifique-se de que `adb sync` funcione com seu emulador ou dispositivo físico e pré-compile todos os exemplos do Android usando `src/android/build_all.sh`. Leia o roteiro para ver os comandos executados e verifique se eles funcionam quando você os executa manualmente.
uk: Переконайтеся, що `adb sync` працює з вашим емулятором або реальним пристроєм, та попередньо зберіть усі приклади Android, використовуючи `src/android/build_all.sh`. Прочитайте скрипт, щоб побачити команди, які він запускає, і переконайтеся, що вони працюють, коли ви запускаєте їх вручну.

source: Rust in Chromium
fa: Rust در اندروید
pt_br: Rust para Chromium
uk: Rust в Chromium
