Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: `gtest` tests authored in Rust and using the crate under test through its public API (using `pub mod for_testing { ... }` if needed). This is the subject of the next few slides.
fa: آزمایش‌های `gtest` که در Rust نوشته شده‌اند و از crate تحت آزمایش از طریق API عمومی آن استفاده می‌کنند (در صورت نیاز از `pub mod for_testing { ... }` » استفاده می‌کنند. این موضوع در چند اسلاید بعد معرفی شده است.
pt_br: Testes `gtest` escritos em Rust e usando o _crate_ sob teste por meio de sua API pública (usando `pub mod for_testing { ... }` se necessário). Este é o assunto dos próximos slides.
uk: Тести `gtest`, написані на Rust, що використовують крейт який тестується через його публічний API (з використанням `pub mod for_testing { ... }`, якщо потрібно). Це тема наступних кількох слайдів.

source: Mention that native Rust tests of third-party crates should eventually be exercised by Chromium bots. (Such testing is needed rarely --- only after adding or updating third-party crates.)
fa: ذکر کنید که تست‌هایnative Rust در مورد crateهای شخص ثالث باید در نهایت توسط روبات‌های Chromium انجام شود. (چنین آزمایشی به ندرت مورد نیاز است --- فقط پس از افزودن یا به‌روز‌رسانی crateهای شخص ثالث.)
pt_br: Mencione que os testes nativos Rust de _crates_ de terceiros devem eventualmente ser exercitados pelos robôs do Chromium. (Esses testes são raramente necessários --- apenas após adicionar ou atualizar _crates_ de terceiros.)
uk: Зауважте, що нативне Rust-тестування сторонніх крейтів має зрештою здійснюватися ботами Chromium. (Таке тестування потрібне рідко --- лише після додавання або оновлення сторонніх крейтів).

source: Some examples may help illustrate when C++ `gtest` vs Rust `gtest` should be used:
fa: برخی از مثال‌ها ممکن است به توضیح اینکه چه زمانی باید از C++ `gtest` در مقابل Rust `gtest` استفاده شود کمک کند:
pt_br: Alguns exemplos podem ajudar a ilustrar quando o `gtest` C++ vs Rust `gtest` deve ser usado:
uk: Деякі приклади можуть допомогти проілюструвати, коли слід використовувати C++ `gtest` проти Rust `gtest`:

source: QR has very little functionality in the first-party Rust layer (it's just a thin FFI glue) and therefore uses the existing C++ unit tests for testing both the C++ and the Rust implementation (parameterizing the tests so they enable or disable Rust using a `ScopedFeatureList`).
fa: ‏ QR عملکرد بسیار کمی در لایه Rust شخص اول دارد (این فقط یک چسب FFI باریک است) و بنابراین از unit testهای++C موجود برای آزمایش ++C و اجرای Rust استفاده می‌کند (تست‌ها را پارامتر می‌کند تا Rust را با استفاده از یک `ScopedFeatureList` آن را فعال یا غیرفعال کند.
pt_br: QR tem muito pouca funcionalidade na camada Rust original (é apenas uma cola FFI fina) e, portanto, usa os testes unitários C++ existentes para testar tanto a implementação C++ quanto a Rust (parametrizando os testes para que eles ativem ou desativem o Rust usando um `ScopedFeatureList`).
uk: QR має дуже мало функціональності у сторонньому прошарку Rust (це просто тонкий FFI клей) і тому використовує існуючі модульні тести C++ для тестування як C++, так і Rust-реалізації (параметризуючи тести так, щоб вони вмикали або вимикали Rust за допомогою `ScopedFeatureList`).

source: Hypothetical/WIP PNG integration may need to implement memory-safe implementation of pixel transformations that are provided by `libpng` but missing in the `png` crate - e.g. RGBA => BGRA, or gamma correction. Such functionality may benefit from separate tests authored in Rust.
fa: ‏ Hypothetical/WIP PNG ممکن است نیاز به پیاده‌سازی ایمن از حافظه تبدیل‌های پیکسلی داشته باشد که توسط `libpng` ارائه شده‌اند اما در `png` crate وجود ندارند - به عنوان مثال. RGBA => BGRA یا تصحیح‌گر گاما (gamma correction). چنین عملکردی ممکن است از آزمایش های جداگانه‌ای که در Rust نوشته شده است بهره‌مند شود.
pt_br: A integração hipotética/em andamento do PNG pode precisar de uma implementação segura de memória das transformações de pixels fornecidas pelo `libpng`, mas ausentes no _crate_ `png` - por exemplo, RGBA => BGRA ou correção gama. Tal funcionalidade pode se beneficiar de testes separados escritos em Rust.
uk: Гіпотетична/WIP інтеграція з PNG може потребувати безпечної реалізації перетворень пікселів, які надаються `libpng`, але відсутні у крейті `png` - наприклад, RGBA => BGRA, або гамма-корекція. Така функціональність може отримати вигоду від окремих тестів, написаних у Rust.

source: The [`rust_gtest_interop`](https://chromium.googlesource.com/chromium/src/+/main/testing/rust_gtest_interop/README.md) library provides a way to:
fa: کتابخانه [`rust_gtest_interop`](https://chromium.googlesource.com/chromium/src/+/main/testing/rust_gtest_interop/README.md) راهی را ارائه می‌دهد:
pt_br: A biblioteca [`rust_gtest_interop`](https://chromium.googlesource.com/chromium/src/+ /main/testing/rust_gtest_interop/README.md) fornece uma maneira de:
uk: Бібліотека [`rust_gtest_interop`](https://chromium.googlesource.com/chromium/src/+/main/testing/rust_gtest_interop/README.md) надає можливість для:

source: Use a Rust function as a `gtest` testcase (using the `#[gtest(...)]` attribute)
fa: از یک تابع Rust به عنوان یک تست `gtest` استفاده کنید (با استفاده از `#[gtest(...)]` attribute)
pt_br: Use uma função Rust como um caso de teste `gtest` (usando o atributo `#[gtest(...)]`)
uk: Використовувати функцію Rust як тестовий приклад `gtest` (використовуючи атрибут `#[gtest(...)]`)

source: Use `expect_eq!` and similar macros (similar to `assert_eq!` but not panicking and not terminating the test when the assertion fails).
fa: از `expect_eq!` و ماکروهای مشابه (شبیه به `assert_eq!` استفاده کنید، اما وقتی assertion ناموفق بود، panic نکنید و تست را خاتمه ندهید).
pt_br: Use `expect_eq!` e macros semelhantes (semelhantes a `assert_eq!` mas não falhando e não terminando o teste quando a asserção falha).
uk: Використовувати `expect_eq!` та подібні макроси (подібні до `assert_eq!`, але не панікувати і не завершувати тест, коли твердження не спрацьовує).

source: Example:
fa: مثال:
pt_br: Exemplo:
uk: Приклад:

source: The simplest way to build Rust `gtest` tests is to add them to an existing test binary that already contains tests authored in C++. For example:
fa: ساده‌ترین راه برای build Rust `gtest` اضافه‌کردن آن‌ها به یک باینری تست موجود است که از قبل حاوی تست‌هایی است که در ++C نوشته شده‌اند. به عنوان مثال:
pt_br: A maneira mais simples de compilar testes `gtest` Rust é adicioná-los a um binário de teste existente que já contém testes escritos em C++. Por exemplo:
uk: Найпростіший спосіб створити тести Rust `gtest` - це додати їх до існуючого тестового бінарного файлу, який вже містить тести, написані на C++. Наприклад:

source: Authoring Rust tests in a separate `static_library` also works, but requires manually declaring the dependency on the support libraries:
fa: نگارش تست‌های Rust در یک `static_library` جداگانه نیز کار می‌کند، اما نیاز به اعلام دستی وابستگی به کتابخانه‌های پشتیبانی دارد:
pt_br: Escrever testes Rust em uma `static_library` separada também funciona, mas exige a declaração manual da dependência das bibliotecas de suporte:
uk: Створення тестів Rust в окремій `static_library` також працює, але вимагає ручного оголошення залежності від допоміжних бібліотек:

source: After adding `:my_rust_lib` to GN `deps`, we still need to learn how to import and use `my_rust_lib` from `my_rust_lib_unittest.rs`. We haven't provided an explicit `crate_name` for `my_rust_lib` so its crate name is computed based on the full target path and name. Fortunately we can avoid working with such an unwieldy name by using the `chromium::import!` macro from the automatically-imported `chromium` crate:
fa: پس از افزودن `:my_rust_lib` به GN `deps`، همچنان باید نحوه وارد کردن و استفاده از `my_rust_lib` را از `my_rust_lib_unittest.rs` یاد بگیریم. ما یک `crate_name` صریح برای `my_rust_lib` ارائه نکرده‌ایم، بنابراین نام crate آن بر اساس مسیر و نام کامل هدف محاسبه می‌شود. خوشبختانه ما می‌توانیم با استفاده از ماکرو `chromium::import!` از `chromium` crate که به‌طور خودکار وارد می‌شود، درنتیجه از کار با چنین نامی پرهیز کنیم:
pt_br: Depois de adicionar `:my_rust_lib` às `deps` do GN, ainda precisamos aprender como importar e usar `my_rust_lib` de `my_rust_lib_unittest.rs`. Não fornecemos um `crate_name` explícito para `my_rust_lib`, portanto, seu nome de _crate_ é calculado com base no caminho e nome do alvo completo. Felizmente, podemos evitar trabalhar com um nome tão difícil de usar usando o macro `chromium::import!` do _crate_ `chromium` automaticamente importado:
uk: Після додавання `:my_rust_lib` до GN `deps` нам все ще потрібно навчитися імпортувати та використовувати `my_rust_lib` з `my_rust_lib_unittest.rs`. Ми не надали явного `crate_name` для `my_rust_lib`, тому його ім'я буде обчислено на основі повного шляху та імені. На щастя, ми можемо уникнути роботи з такою громіздкою назвою за допомогою макросу `chromium::import!` з автоматично імпортованого крейту `chromium`:

source: Under the covers the macro expands to something similar to:
fa: در زیر جلدها، ماکرو به چیزی شبیه به زیر گسترش می یابد:
pt_br: Por baixo dos panos, a macro se expande para algo semelhante a:
uk: Під ковдрою макрос розширюється до чогось схожого на це:

source: More information can be found in [the doc comment](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/chromium_prelude/chromium_prelude.rs?q=f:chromium_prelude.rs%20pub.use.*%5Cbimport%5Cb;%20-f:third_party&ss=chromium%2Fchromium%2Fsrc) of the `chromium::import` macro.
fa: اطلاعات بیشتر را می‌توانید در [ doc comment](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/chromium_prelude/chromium_prelude.rs?q=f:chromium_prelude.rs%20pub.use.*%5Cbimport%5Cb;%20-f:third_party&ss=chromium%2Fchromium%2Fsrc) پیدا کنید. ماکرو مربوطه `chromium::import`.
pt_br: Mais informações podem ser encontradas no [comentário de documentação](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/chromium_prelude/chromium_prelude.rs?q=f:chromium_prelude.rs%20pub.use.*%5Cbimport%5Cb;%20-f:third_party&ss=chromium%2Fchromium%2Fsrc) da macro `chromium::import`.
uk: Додаткову інформацію можна знайти у [коментарі документації](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/chromium_prelude/chromium_prelude.rs?q=f:chromium_prelude.rs%20pub.use.*%5Cbimport%5Cb;%20-f:third_party&ss=chromium%2Fchromium%2Fsrc) макросу `chromium::import`.

source: `rust_static_library` supports specifying an explicit name via `crate_name` property, but doing this is discouraged. And it is discouraged because the crate name has to be globally unique. crates.io guarantees uniqueness of its crate names so `cargo_crate` GN targets (generated by the `gnrt` tool covered in a later section) use short crate names.
fa: ‏`rust_static_library` از تعیین نام صریح از طریق ویژگی`crate_name` پشتیبانی می‌کند، اما انجام این کار ممنوع است و از آن جلوگیری می‌شود زیرا نام crate باید در سطح سراسری منحصر‌به‌فرد باشد. crates.io منحصر‌به‌فرد بودن نام crateهای خود را تضمین می‌کند، بنابراین اهداف`cargo_crate` GN (تولید شده توسط ابزار `gnrt` که در بخش بعدی پوشش داده شده است) از نام‌های crate کوتاه استفاده می‌کنند.
pt_br: `rust_static_library` suporta a especificação de um nome explícito via propriedade `crate_name`, mas isso é desencorajado. E é desencorajado porque o nome do _crate_ tem que ser globalmente único. crates.io garante a unicidade de seus nomes de _crate_, portanto, os alvos `cargo_crate` GN (gerados pela ferramenta `gnrt` abordada em uma seção posterior) usam nomes curtos de _crate_.
uk: Бібліотека `rust_static_library` підтримує вказівку явної назви через властивість `crate_name`, але робити це не рекомендується. Не рекомендується, тому що ім'я крейту має бути глобально унікальним. crates.io гарантує унікальність імен своїх крейтів, тому GN цілі `cargo_crate` (створені за допомогою інструменту `gnrt`, описаного в наступному розділі) використовують короткі імена крейтів.

source: Testing exercise
fa: تمرین تستی
pt_br: Exercício sobre testes
uk: Тестова вправа

source: Time for another exercise!
fa: وقت یک تمرین دیگر است!
pt_br: Hora de mais um exercício!
uk: Час для наступної вправи!

source: In your Chromium build:
fa: درChromium build شما باید:
pt_br: Em sua compilação do Chromium:
uk: У вашій збірці Chromium:

source: Add a testable function next to `hello_from_rust`. Some suggestions: adding two integers received as arguments, computing the nth Fibonacci number, summing integers in a slice, etc.
fa: یک تابع قابل آزمایش در کنار `hello_from_rust` اضافه کنید. چند پیشنهاد: اضافه کردن دو عدد صحیح دریافت شده به عنوان آرگومان، محاسبه عدد فیبوناچی nام، جمع اعداد صحیح در یک برش و غیره.
pt_br: Adicione uma função testável ao lado de `hello_from_rust`. Algumas sugestões: adicionar dois inteiros recebidos como argumentos, calcular o n-ésimo número de Fibonacci, somar inteiros em uma _slice_, etc.
uk: Додайте тестову функцію поруч з `hello_from_rust`. Деякі пропозиції: додавання двох цілих чисел, отриманих як аргументи, обчислення n-го числа Фібоначчі, підсумовування цілих чисел у зрізі тощо.

source: Add a separate `..._unittest.rs` file with a test for the new function.
fa: یک فایل`..._unittest.rs` جداگانه با یک تست برای تابع جدید اضافه کنید.
pt_br: Adicione um arquivo `..._unittest.rs` separado com um teste para a nova função.
uk: Додайте окремий файл `..._unittest.rs` з тестом для нової функції.

source: Add the new tests to `BUILD.gn`.
fa: تست‌های جدید را به `BUILD.gn` اضافه کنید.
pt_br: Adicione os novos testes a `BUILD.gn`.
uk: Додайте нові тести до `BUILD.gn`.

source: Build the tests, run them, and verify that the new test works.
fa: تست‌ها را بسازید، اجرا کنید و بررسی کنید که آيا تست جدید به درستی کار می‌کند.
pt_br: Compile os testes, execute-os e verifique se o novo teste funciona.
uk: Побудуйте тести, запустіть їх і перевірте, чи працює новий тест.

source: The Rust community offers multiple options for C++/Rust interop, with new tools being developed all the time. At the moment, Chromium uses a tool called CXX.
fa: جامعه Rust گزینه‌های متعددی را برای C++/Rust interop ارائه می‌دهد، با ابزارهای جدیدی که همیشه در حال توسعه هستند. در حال حاضر، Chromium از ابزاری به نام CXX استفاده می‌کند.
pt_br: A comunidade Rust oferece várias opções para interoperabilidade C++/Rust, com novas ferramentas sendo desenvolvidas o tempo todo. No momento, o Chromium usa uma ferramenta chamada CXX.
uk: Спільнота Rust пропонує кілька варіантів взаємодії C++/Rust, при цьому постійно розробляються нові інструменти. Наразі у Chromium використовується інструмент під назвою CXX.

source: You describe your whole language boundary in an interface definition language (which looks a lot like Rust) and then CXX tools generate declarations for functions and types in both Rust and C++.
fa: شما کل مرز زبان (language boundary) خود را در یک زبان تعریف interface (که بسیار شبیه Rust به نظر می رسد) توصیف می کنید و سپس ابزارهای CXX اعلان‌هایی را برای توابع و تایپ‌ها در Rust و ++C ایجاد می‌کنند.
pt_br: Você descreve toda a fronteira da linguagem em uma linguagem de definição de interface (que se parece muito com Rust) e, em seguida, as ferramentas CXX geram declarações para funções e tipos em Rust e C++.
uk: Ви описуєте всю вашу мовну границю мовою визначення інтерфейсів (яка дуже схожа на Rust), а потім інструменти CXX генерують оголошення для функцій і типів як на Rust, так і на C++.

source: See the [CXX tutorial](https://cxx.rs/tutorial.html) for a full example of using this.
fa: برای مثال کامل استفاده از این [آموزش CXX](https://cxx.rs/tutorial.html) را ببینید.
pt_br: Veja o [tutorial CXX](https://cxx.rs/tutorial.html) para um exemplo completo de como usá-lo.
uk: Перегляньте [підручник з CXX](https://cxx.rs/tutorial.html), щоб отримати повний приклад використання цього.

source: Talk through the diagram. Explain that behind the scenes, this is doing just the same as you previously did. Point out that automating the process has the following benefits:
fa: از طریق دیاگرام صحبت کنید. توضیح دهید که در پشت صحنه، این دقیقاً همان کاری را انجام می‌دهد که قبلاً انجام می‌دادید. به این نکته اشاره کنید که خودکارسازی فرآیند دارای مزایای زیر است:
pt_br: Fale com o auxílio do diagrama. Explique que, nos bastidores, isso está fazendo exatamente o mesmo que você fez anteriormente. Aponte que automatizar o processo tem os seguintes benefícios:
uk: Поговоріть про схему. Поясніть, що за лаштунками відбувається те саме, що ви робили раніше. Зазначте, що автоматизація процесу має такі переваги:

source: The tool guarantees that the C++ and Rust sides match (e.g. you get compile errors if the `#[cxx::bridge]` doesn't match the actual C++ or Rust definitions, but with out-of-sync manual bindings you'd get Undefined Behavior)
fa: این ابزار تضمین می‌کند که مجانب ++C و Rust مطابقت کامل دارند (مثلاً اگر `#[cxx::bridge]` با تعاریف واقعی ++C یا Rust مطابقت نداشته باشد، درنتیجه با خطاهای کامپایل مواجه می‌شوید اما با اتصال‌های دستی غیرهمگام‌شده (out-of-sync manual bindings) می‌توانید رفتار نامشخص دریافت کنید)
pt_br: A ferramenta garante que os lados C++ e Rust correspondam (por exemplo, você obterá erros de compilação se o `#[cxx::bridge]` não corresponder às definições C++ ou Rust reais, mas com _bindings_ manuais fora de sincronia, você obteria Comportamento Indefinido)
uk: Інструмент гарантує, що сторони C++ та Rust збігаються (наприклад, ви отримаєте помилки компіляції, якщо `#[cxx::bridge]` не збігається з фактичними визначеннями C++ або Rust, а з несинхронізованими ручними прив'язками ви отримаєте Undefined Behavior).

source: The tool automates generation of FFI thunks (small, C-ABI-compatible, free functions) for non-C features (e.g. enabling FFI calls into Rust or C++ methods; manual bindings would require authoring such top-level, free functions manually)
fa: این ابزار تولید Thunk‌های FFI (کارکردهای کوچک، سازگار با C-ABI، و رایگان) را برای ویژگی های غیر C (به عنوان مثال فعال کردن تماس‌های FFI به‌ متدهای Rust) به طور خودکار انجام می دهد؛ اتصال های دستی نیاز به نوشتن چنین عملکردهای سطح بالا و رایگان به صورت دستی دارد.
pt_br: A ferramenta automatiza a geração de _thunks_ FFI (pequenas funções livres compatíveis com C-ABI) para recursos não-C (por exemplo, permitindo chamadas FFI para métodos Rust ou C++; _bindings_ manuais exigiriam a autoria de tais funções livres de alto nível manualmente)
uk: Інструмент автоматизує генерацію заглушок FFI (невеликих, C-ABI-сумісних, вільних функцій) для не-C функціоналу (наприклад, увімкнення викликів FFI в методи Rust або C++; ручне прив'язування вимагало б написання таких вільних функцій верхнього рівня вручну).

source: The tool and the library can handle a set of core types - for example:
fa: ابزارها و کتابخانه می‌توانند مجموعه‌ای از انواع هسته (core types) را مدیریت کنند - به عنوان مثال:
pt_br: A ferramenta e a biblioteca podem lidar com um conjunto de tipos principais - por exemplo:
uk: Інструмент і бібліотека можуть працювати з набором основних типів, наприклад:

source: `&[T]` can be passed across the FFI boundary, even though it doesn't guarantee any particular ABI or memory layout. With manual bindings `std::span<T>` / `&[T]` have to be manually destructured and rebuilt out of a pointer and length - this is error-prone given that each language represents empty slices slightly differently)
fa: ‏ `&[T]` را می‌توان از مرز FFI عبور داد، حتی اگر هیچ‌گونه طرح‌بندی ABI یا حافظه خاصی را تضمین نکند. با اتصال‌های (bindings) دستی،`std::span<T>` / `&[T]` باید به‌صورت دستی تخریب شود و از یک pointer و length به صورت مجدد ساخته شود - با توجه به اینکه هر زبان sliceهای خالی را کمی متفاوت نشان می‌دهد، درنتیجه مستعد خطا است)
pt_br: `&[T]` pode ser passado pela fronteira FFI, embora não garanta nenhum layout de memória ou ABI específico. Com _bindings_ manuais, `std::span<T>` / `&[T]` devem ser manualmente destruturados e reconstruídos a partir de um ponteiro e comprimento - isso é propenso a erros, dado que cada linguagem representa fatias vazias de maneira ligeiramente diferente)
uk: `&[T]` можна передавати через межу FFI, навіть якщо це не гарантує певного ABI або розміщення пам'яті. При ручному зв'язуванні `std::span<T>` / `&[T]` потрібно вручну деструктурувати і відновити з вказівника і довжини - це може призвести до помилок, оскільки кожна мова представляє порожні зрізи дещо по-різному

source: Smart pointers like `std::unique_ptr<T>`, `std::shared_ptr<T>`, and/or `Box` are natively supported. With manual bindings, one would have to pass C-ABI-compatible raw pointers, which would increase lifetime and memory-safety risks.
fa: اشاره گرهای هوشمند مانند `std::unique_ptr<T>`, `std::shared_ptr<T>` و/یا `Box` به صورت native پشتیبانی می‌شوند. با کمک اتصال‌های دستی (manual bindings)، باید C-ABI-compatible raw pointers را پاس کنید که خطرات ایمنی و طول عمر را افزایش می‌دهد.
pt_br: Ponteiros inteligentes como `std::unique_ptr<T>`, `std::shared_ptr<T>` e/ou `Box` são suportados nativamente. Com _bindings_ manuais, seria necessário passar ponteiros brutos (_raw pointers_) compatíveis com C-ABI, o que aumentaria os riscos de tempo de vida e segurança de memória.
uk: Розумні вказівники типу `std::unique_ptr<T>`, `std::shared_ptr<T>` та/або `Box` підтримуються за замовчуванням. При ручному прив'язуванні потрібно було б передавати C-ABI-сумісні необроблені вказівники, що збільшило б ризики для тривалості життя та безпеки пам'яті.

source: `rust::String` and `CxxString` types understand and maintain differences in string representation across the languages (e.g. `rust::String::lossy` can build a Rust string from non-UTF8 input and `rust::String::c_str` can NUL-terminate a string).
fa: تایپ‌های `rust::String` و `CxxString` تفاوت‌ها را در نمایش stringها در بین زبان‌ها درک و حفظ می‌کنند (به عنوان مثال، `rust::String::lossy` می‌تواند یک Rust string را از ورودی غیر UTF8 و `rust::String::c_str` بسازد و می‌تواند یک string را با NUL خاتمه دهد).
pt_br: Os tipos `rust::String` e `CxxString` entendem e mantêm as diferenças na representação de strings entre as linguagens (por exemplo, `rust::String::lossy` pode construir uma string Rust a partir de uma entrada não UTF8 e `rust::String::c_str` pode terminar uma string com NUL).
uk: Типи `rust::String` і `CxxString` розуміють і підтримують відмінності у представленні рядків у різних мовах (наприклад, `rust::String::lossy` може створити рядок Rust із вхідних даних не у форматі UTF8, а `rust::String::c_str` може завершити рядок NUL).

source: CXX requires that the whole C++/Rust boundary is declared in `cxx::bridge` modules inside `.rs` source code.
fa: ‏ CXX مستلزم آن است که کل مرز C++/Rust در ماژول‌های `cxx::bridge` در کد منبع `.rs` اعلام شود.
pt_br: O CXX requer que toda a fronteira C++/Rust seja declarada em módulos `cxx::bridge` dentro do código-fonte `.rs`.
uk: CXX вимагає, щоб вся межа C++/Rust була оголошена в модулях `cxx::bridge` у вхідному коді `.rs`.

source: // Definitions of Rust types and functions go here
pt_br: // Definições de tipos e funções Rust vão aqui
uk: // Визначення типів та функцій Rust можна знайти тут

source: Point out:
fa: اشاره کنید:
pt_br: Aponte:
uk: Вкажіть:
