Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: You can also combine `join_all` with `join!` for instance to join all requests to an http service as well as a database query. Try adding a `tokio::time::sleep` to the future, using `futures::join!`. This is not a timeout (that requires `select!`, explained in the next chapter), but demonstrates `join!`.
es: También puedes combinar `join_all` con `join!`, por ejemplo, para unir todas las solicitudes a un servicio HTTP, así como una consulta a la base de datos. Prueba a añadir un tokio::time::sleep`al futuro mediante`futures::join!`. No se trata de un tiempo de espera (para eso se requiere `select!`, que se explica en el siguiente capítulo), sino que muestra `join!\`.
fa: همچنین می‌توانید `join_all` را با `join!` ترکیب کنید، به‌عنوان مثال برای پیوستن (`join!`) همه درخواست‌ها به یک سرویس http و همچنین یک کوئری پایگاه داده سعی کنید `tokio::time::sleep` را با استفاده از `futures::join!` به future اضافه کنید. این یک timeout نیست (که به `select!`نیاز دارد و در فصل بعدی توضیح داده ‌می‌شود) بلکه `join!` را نشان می‌دهد.
ja: また、`join_all`と`join!`を組み合わせることもできます。それは、例えばデータベースのクエリと一緒にhttpサービスへの全てのリクエストをjoinする場合です。futureに`futures::join!`を用いて、`tokio::time::sleep`を追加してみてください。これは（次のチャプターで説明する、`select!`を必要とする）タイムアウトではありませんが、`join!`の良い実演となっています。
ko: `join_all`을 `join!`과 결합하여 http 서비스와 데이터베이스에 대한 모든 요청들을 한꺼번에 진행시킬 수도 있습니다. `futures::join!`을 사용하여 `tokio::time::sleep`을 future에 추가해 보세요. 이건 타임아웃을 구현하는 것이 아님을 주의하세요. 실제로, 타임아웃은 다음 장에서 설명하는 `select!`를 사용해서 구현해야 합니다. 여기서는 `tokio::time::sleep`을 사용한 것은 단순히 `join!`의 동작을 설명하기 위함입니다.
pt_br: Você também pode combinar `join_all` com `join!`, por exemplo, para unir todas as solicitações a um serviço http, bem como uma consulta ao banco de dados. Tente adicionar um `tokio::time::sleep` para o futuro, usando `futures::join!`. Isso não é um _timeout_ (isso requer `select!`, explicado no próximo capítulo), mas demonstra `join!`.
uk: Ви також можете поєднати `join_all` з `join!`, наприклад, щоб об’єднати всі запити до служби http, а також запит до бази даних. Спробуйте додати `tokio::time::sleep` до ф'ючерсу, використовуючи `futures::join!`. Це не тайм-аут (який вимагає `select!`, пояснюється в наступному розділі), але демонструє `join!`.

source: A select operation waits until any of a set of futures is ready, and responds to that future's result. In JavaScript, this is similar to `Promise.race`. In Python, it compares to `asyncio.wait(task_set, return_when=asyncio.FIRST_COMPLETED)`.
es: Una operación select espera hasta que un conjunto de futuros esté listo y responde al resultado de ese futuro. En JavaScript, esto es similar a `Promise.race`. En Python, se compara con `asyncio.wait(task_set, return_when=asyncio.FIRST_COMPLETED)`.
fa: یک عملیات انتخابی منتظر می‌ماند تا هر یک از مجموعه‌ای از futureها آماده شود و به نتیجه آن future پاسخ می‌دهد. در JavaScript این مورد شبیه به `Promise.race` است و در پایتون با `asyncio.wait(task_set, return_when=asyncio.FIRST_COMPLETED)` قابل مقایسه می‌باشد.
ja: Selectという操作では、futureの集合のうち、いずれか１つの準備が整うまで待機し、そのfutureが提供する結果に対して応答します。これはJavaScriptにおける`Promise.race`に似ています。また、Pythonにおける `asyncio.wait(task_set, return_when=asyncio.FIRST_COMPLETED)`と比べることができます。
ko: Select 연산은 여러 future들 모두에 대해서 준비될 때 까지 기다리다가, 그 중 어떤 한 future가 최초로 준비 상태가 되면 해당 future의 결과값을 리턴합니다. 이것은 자바스크립트에서의 `Promise.race`와 비슷합니다. 파이썬에서라면 `asyncio.wait(task_set, return_when=asyncio.FIRST_COMPLETED)`가 하는 동작과 비슷합니다.
pt_br: Uma operação de _select_ espera até que qualquer uma das _futures_ de um conjunto esteja pronta e responde ao resultado dessa _future_. Em JavaScript, isso é semelhante a `Promise.race`. Em Python, compara-se a `asyncio.wait(task_set, return_when=asyncio.FIRST_COMPLETED)`.
uk: Операція select очікує, поки будь-який із набору ф’ючерсів буде готовий, і відповідає на результат цього ф’ючерсу. У JavaScript це схоже на `Promise.race`. У Python це порівнюється з `asyncio.wait(task_set, return_when=asyncio.FIRST_COMPLETED)`.

source: Similar to a match statement, the body of `select!` has a number of arms, each of the form `pattern = future => statement`. When a `future` is ready, its return value is destructured by the `pattern`. The `statement` is then run with the resulting variables. The `statement` result becomes the result of the `select!` macro.
fa: مانند یک عبارت تطبیقی (match statement)، بدنه `pattern` دارای تعدادی بازو است که هر کدام به شکل عبارت `pattern = future => statement` هستند. هنگامی که `future` آماده است، مقدار بازگشتی آن توسط `pattern` تخریب می‌شود. سپس `statement` با متغیرهای حاصل اجرا می‌شود. در نتیجه `statement` نتیجه‌ي ماکرو `select!` می‌شود.
uk: Подібно до оператора порівняння, тіло `select!` має кілька гілок, кожен з яких має вигляд `pattern = future => statement`. Коли `future` готовий, його значення, що повертається, деструктурується за допомогою `pattern`. Потім виконується `statement` з отриманими змінними. Результат `statement` стає результатом макросу `select!`.

source: "got: {msg}"
uk: "отримав: {msg}"

source: "timeout"
uk: "тайм-аут"

source: "Failed to send greeting"
uk: "Не вдалося надіслати привітання."

source: "Listener failed"
fa: "شنونده شکست خورد"
uk: "Listener зазнав невдачі"

source: The `listener` async block here is a common form: wait for some async event, or for a timeout. Change the `sleep` to sleep longer to see it fail. Why does the `send` also fail in this situation?
fa: بلوک async `listener` در اینجا یک شکل رایج است: منتظر برخی رویدادهای async یا به‌عنوان مثال برای timeoutها باشید. `sleep` را به sleep طولانی‌تر تغییر دهید تا شاهد شکست آن باشید. چرا `send` نیز در این شرایط شکست می‌خورد؟
uk: Блок асинхронізації `listener` тут є звичайною формою: очікування деякої асинхронної події або таймауту. Змініть `sleep` на довший час, щоб побачити, що він не спрацює. Чому в цій ситуації також не спрацьовує `send`?

source: `select!` is also often used in a loop in "actor" architectures, where a task reacts to events in a loop. That has some pitfalls, which will be discussed in the next segment.
uk: Команда `select!` також часто використовується у циклі в "actor" архітектурах, де завдання реагує на події у циклі. Це має деякі підводні камені, які буде обговорено у наступному розділі.

source: Async / await provides convenient and efficient abstraction for concurrent asynchronous programming. However, the async/await model in Rust also comes with its share of pitfalls and footguns. We illustrate some of them in this chapter.
fa: ‏ Async / await انتزاع راحت و کارآمدی را برای برنامه نویسی concurrent asynchronous فراهم می‌کند. با‌این‌حال، مدل async/wait در Rust نیز با سهم خود از مشکلات و pitfallها و footgunها همراه است. برخی از آنها را در این فصل توضیح می‌دهیم.
uk: Async / await забезпечує зручну та ефективну абстракцію для асинхронного програмування з одночасним виконанням. Однак, модель async/await у Rust також має свої підводні камені та пастки. Ми проілюструємо деякі з них у цьому розділі.

source: Blocking the executor
es: Bloqueo del ejecutor
fa: مسدود کردن executor
ja: エグゼキュータのブロック
ko: 실행자(executor)를 블록시킴
pt_br: Bloqueando o _executor_
uk: Блокування виконавця

source: Most async runtimes only allow IO tasks to run concurrently. This means that CPU blocking tasks will block the executor and prevent other tasks from being executed. An easy workaround is to use async equivalent methods where possible.
es: La mayoría de los tiempos de ejecución asíncronos solo permiten que las tareas de E/S se ejecuten de forma simultánea. Esto significa que las tareas que bloquean la CPU bloquearán el ejecutor e impedirán que se ejecuten otras tareas. Una solución alternativa y sencilla es utilizar métodos asíncronos equivalentes siempre que sea posible.
fa: اکثر async runtimeهای تنها به IO task اجازه می‌دهند که به صورت همزمان (concurrent) اجرا شوند. این بدان معنی است که تسک‌های block کردن CPU باعث مسدود شدن executor و جلوگیری از اجرای سایر تسک‌ها می‌شود. یک راه حل آسان این است که در صورت امکان از متدهای معادل async استفاده کنید.
ja: ほとんどの非同期ランタイムは、IO タスクの同時実行のみを許可します。つまり、CPU ブロックタスクはエグゼキュータをブロックし、他のタスクの実行を妨げます。簡単な回避策は、可能であれば非同期の同等のメソッドを使用することです。
ko: 대부분의 비동기 런타임은 IO 작업만 동시에 실행되도록 허용합니다. 즉, CPU를 블럭하는 태스크가 있는 경우, 이는 실행자(executor)를 블럭하게 되며, 그 결과로 다른 태스크가 실행되지 않습니다. 이 문제를 해결하는 간단한 방법은, 항상 async를 지원하는 메서드를 사용하는 것입니다.
pt_br: A maioria dos _runtimes_ _async_ só permite que tarefas de I/O sejam executadas concorrentemente. Isso significa que tarefas que bloqueiam a CPU bloquearão o _executor_ e impedirão que outras tarefas sejam executadas. Uma solução fácil é usar métodos equivalentes _async_ sempre que possível.
uk: Більшість асинхронних середовищ виконання дозволяють лише одночасний запуск завдань вводу/виводу. Це означає, що завдання, що блокують процесор, блокуватимуть виконавця та запобігатимуть виконанню інших завдань. Простим обхідним шляхом є використання еквівалентних асинхронних методів, де це можливо.

source: "future {id} slept for {duration_ms}ms, finished after {}ms"
pt_br: "_future_ {id} dormiu por {duration_ms}ms, terminou após {}ms"
uk: "ф'ючерс {id} спав протягом {duration_ms}ms, закінчив після {}ms"

source: Run the code and see that the sleeps happen consecutively rather than concurrently.
es: Ejecuta el código y comprueba que las suspensiones se producen de forma consecutiva y no simultánea.
fa: کد را اجرا کنید و ببینید که sleep‌ها به طور متوالی اتفاق می‌افتند و نه به صورت همزمان (concurrent).
ja: コードを続けて、スリープが同時ではなく連続して発生することを確認します。
ko: 코드를 실행하여 sleep들이 동시에 진행되지 않고 순차적으로으로 진행되는지 확인하세요.
pt_br: Execute o código e veja que os _sleeps_ acontecem consecutivamente em vez de concorrentemente.
uk: Запустіть код і подивіться, що засинання відбуваються послідовно, а не одночасно.

source: The `"current_thread"` flavor puts all tasks on a single thread. This makes the effect more obvious, but the bug is still present in the multi-threaded flavor.
es: La versión `"current_thread"` reúne todas las tareas en un solo hilo. Esto consigue que el efecto sea más obvio, pero el error sigue estando presente en la versión multihilo.
fa: این `"current_thread"` همه taskها را روی یک thread قرار می‌دهد. این اثرگذاری را آشکارتر می‌کند، اما این اشکال همچنان در طبیعت multi-threaded وجود دارد.
ja: `"current_thread"` フレーバーは、すべてのタスクを 1 つのスレッドに配置します。これにより、影響はより明確になりますが、バグはまだマルチスレッド フレーバーに存在します。
ko: `flavor`를 `"current_thread"` 로 설정하면 모든 태스크가 하나의 스레드에서 수행됩니다. 이렇게 하면 문제 상황이 더 분명히 드러납니다. 그러나 이 버그는 멀티스레드인 경우에도 여전히 존재합니다.
pt_br: A variante `"current_thread"` coloca todas as tarefas em um único _thread_. Isso torna o efeito mais óbvio, mas o bug ainda está presente na variante multi-threaded.
uk: Варіант `"current_thread"` поміщає всі завдання в один потік. Це робить ефект більш очевидним, але помилка все ще присутня в багатопоточному варіанті.

source: Switch the `std::thread::sleep` to `tokio::time::sleep` and await its result.
es: Cambia `std::thread::sleep` a `tokio::time::sleep`. y espera su resultado.
fa: ‏ `std::thread::sleep` را به `tokio::time::sleep` تغییر دهید و منتظر نتیجه باشید.
ja: `std::thread::sleep` を `tokio::time::sleep` に切り替えて、その結果を待ちます。
ko: `std::thread::sleep`을 `tokio::time::sleep`으로 바꾸고 그 결과를 `await`해 보세요.
pt_br: Troque o `std::thread::sleep` por `tokio::time::sleep` e aguarde seu resultado.
uk: Переключіть `std::thread::sleep` на `tokio::time::sleep` і дочекайтеся результату.

source: Another fix would be to `tokio::task::spawn_blocking` which spawns an actual thread and transforms its handle into a future without blocking the executor.
es: Otra solución sería `tokio::task::spawn_blocking`, que genera un hilo real y transforma su controlador en un futuro sin bloquear el ejecutor.
fa: راه‌حل دیگر `tokio::task::spawn_blocking` است که یک thread واقعی ایجاد می‌کند و handle آن را بدون مسدود کردن executor به future تبدیل می‌کند.
ja: もう 1 つの修正策は、`tokio::task::spawn_blocking` を使用することです。これは、実際のスレッドを生成し、エグゼキュータをブロックせずにそのハンドルを Future に変換します。
ko: 또 다른 해결 방법은 `tokio::task::spawn_blocking`입니다. 이는 실제 스레드를 생성하고, 그 스레드에 대한 핸들을 future로 변환함으로써 실행자가 블록되는 것을 막습니다.
pt_br: Outra correção seria `tokio::task::spawn_blocking` que inicia um _thread_ real e transforma seu _handle_ em uma _future_ sem bloquear o _executor_.
uk: Іншим виправленням було б `tokio::task::spawn_blocking`, який породжує фактичний потік і перетворює його дескриптор у ф'ючерс, не блокуючи виконавця.

source: You should not think of tasks as OS threads. They do not map 1 to 1 and most executors will allow many tasks to run on a single OS thread. This is particularly problematic when interacting with other libraries via FFI, where that library might depend on thread-local storage or map to specific OS threads (e.g., CUDA). Prefer `tokio::task::spawn_blocking` in such situations.
es: No debes pensar en las tareas como hilos del sistema operativo. No se asignan 1 a 1 y la mayoría de los ejecutores permitirán que se ejecuten muchas tareas en un solo hilo del sistema operativo. Esta situación es especialmente problemática cuando se interactúa con otras bibliotecas a través de FFI, donde dicha biblioteca puede depender del almacenamiento local de hilos o puede asignarse a hilos específicos del sistema operativo (por ejemplo, CUDA). En estos casos es preferible usar `tokio::task::spawn_blocking`.
fa: شما نباید taskها را به عنوان thread‌های سیستم عامل در نظر بگیرید. آنها از نگاشت ۱ به ۱ پشتیبانی نمی‌کنند و اکثر executorها به بسیاری از taskها اجازه می‌دهند روی یک thread سیستم عامل اجرا شوند. این امر به‌ویژه هنگام تعامل با کتابخانه‌های دیگر از طریق FFI مشکل‌ساز است، جایی که آن کتابخانه ممکن است به ذخیره‌سازی محلی thread یا نگاشت (map) به threadهای سیستم‌عامل خاص (مانند CUDA) بستگی داشته باشد. در چنین شرایطی `tokio::task::spawn_blocking` را ترجیح دهید.
ja: タスクは OS スレッドとはみなすべきではありません。これらは 1 対 1 に対応しておらず、ほとんどのエグゼキュータは、単一の OS スレッドで多くのタスクを実行することを許可します。これは、FFI を介して他のライブラリとやり取りする場合に特に問題となります。FFI では、そのライブラリはスレッド ローカル ストレージに依存しているか、特定の OS スレッド（CUDA など）にマッピングされている可能性があるためです。そのような場合は `tokio::task::spawn_blocking` を使用することをおすすめします。
ko: 태스크를 OS 스레드라고 생각하면 안 됩니다. 태스크와 OS스레드는 일대일 매핑 관계에 있지 않습니다. 대부분의 실행자는 하나의 OS 스레드에서 최대한 많은 태스크를 수행하도록 설계되어 있습니다. 이점은 FFI를 통해 다른 라이브러리와 상호작용할 때 특히 문제가 됩니다. 예를 들어, 해당 라이브러리가 스레드 로컬 저장소를 이용하거나 특정 OS 스레드에 매핑될 수 있습니다(예: CUDA). 이러한 상황에서는 `tokio::task::spawn_blocking`을 사용하는 것이 좋습니다.
pt_br: Você não deve pensar em tarefas como _threads_ do SO. Elas não mapeiam 1 para 1 e a maioria dos _executors_ permitirá que muitas tarefas sejam executadas em um único _thread_ do SO. Isso é particularmente problemático ao interagir com outras bibliotecas via FFI, onde essa biblioteca pode depender de armazenamento local de _thread_ ou mapear para _threads_ específicos do SO (por exemplo, CUDA). Prefira `tokio::task::spawn_blocking` em tais situações.
uk: Ви не повинні думати про завдання як про потоки ОС. Вони не відображаються 1 до 1, і більшість виконавців дозволять виконувати багато завдань в одному потоці ОС. Це особливо проблематично під час взаємодії з іншими бібліотеками через FFI, де ця бібліотека може залежати від локального сховища потоку або зіставлятися з певними потоками ОС (наприклад, CUDA). У таких ситуаціях віддайте перевагу `tokio::task::spawn_blocking`.

source: Use sync mutexes with care. Holding a mutex over an `.await` may cause another task to block, and that task may be running on the same thread.
es: Utiliza las exclusión mutuas de sincronización con cuidado. Si mantienes una exclusión mutua sobre un `.await`, puede que se bloquee otra tarea y que esta se esté ejecutando en el mismo hilo.
fa: با احتیاط از همگام‌سازی mutexها استفاده کنید. نگه داشتن یک mutex روی یک `.await` ممکن است باعث مسدود شدن task دیگری شود و آن task ممکن است در همان thread در حال اجرا باشد.
ja: 同期ミューテックスは慎重に使用してください。`.await` でミューテックスを保持すると、別のタスクがブロックされ、そのタスクが同じスレッドで実行される可能性があります。
ko: 동기화 뮤텍스를 주의해서 사용하세요. `.await` 위에 뮤텍스를 적용하면 다른 작업이 차단될 수 있으며 해당 작업은 동일한 스레드에서 실행 중일 수 있습니다.
pt_br: Use _mutexes sync_ com cuidado. Manter um _mutex_ sobre um `.await` pode fazer com que outra tarefa bloqueie, e essa tarefa pode estar sendo executada no mesmo _thread_.
uk: Обережно використовуйте м’ютекси синхронізації. Утримування м'ютексу над `.await` може призвести до блокування іншого завдання, яке може виконуватися в тому самому потоці.

source: Async blocks and functions return types implementing the `Future` trait. The type returned is the result of a compiler transformation which turns local variables into data stored inside the future.
fa: بلوک‌ها و توابع Async انواعی را برمی‌گردانند که ویژگی `Future` را پیاده‌سازی می‌کنند. نوع برگشتی نتیجه تبدیل کامپایلر است که متغیرهای محلی را به داده های ذخیره شده در future تبدیل می کند.
ja: 非同期ブロックと関数は、`Future` トレイトを実装する型を返します。返される型は、ローカル変数を Future の内部に格納されるデータに変換するコンパイラ変換の結果です。
uk: Асинхронні блоки та функції повертають типи, що реалізують трейт `Future`. Тип, що повертається, є результатом трансформації компілятора, який перетворює локальні змінні на дані, що зберігаються у ф'ючерсі.

source: Some of those variables can hold pointers to other local variables. Because of that, the future should never be moved to a different memory location, as it would invalidate those pointers.
fa: برخی از این متغیرها می‌توانند اشاره‌گرهایی را برای سایر متغیرهای محلی نگه دارند. به همین دلیل، future هرگز نباید به مکان حافظه دیگری منتقل شود، زیرا این pointerها را باطل می‌کند.
ja: これらの変数の一部は、他のローカル変数へのポインタを保持できます。これらのポインタが無効になるため、Futureを別のメモリ位置に移動しないでください。
uk: Деякі з цих змінних можуть містити вказівники на інші локальні змінні. Через це ф'ючерс ніколи не слід переміщувати в іншу комірку пам'яті, оскільки це зробить ці вказівники недійсними.

source: To prevent moving the future type in memory, it can only be polled through a pinned pointer. `Pin` is a wrapper around a reference that disallows all operations that would move the instance it points to into a different memory location.
fa: برای جلوگیری از جابجایی تایپ future در حافظه، فقط از طریق یک pointer پین شده می توان آن را بررسی کرد. `Pin` یک wrapper در اطراف یک reference است که تمام عملیاتی را که می‌تواند نمونه‌ای را که به آن اشاره می‌کند به یک مکان حافظه متفاوت منتقل کند را ممنوع می‌کند.
ja: メモリ内の Future 型が移動するのを防ぐには、固定されたポインタのみを介してポーリングするようにします。`Pin` は参照のラッパーで、参照先のインスタンスを別のメモリ位置に移動するオペレーションをすべて禁止します。
uk: Щоб запобігти переміщенню ф'ючерсного типу у пам'яті, його можна опитувати лише через закріплений вказівник. Закріплення - це обгортка навколо посилання, яка забороняє всі операції, що можуть перемістити екземпляр, на який воно вказує, в іншу ділянку пам'яті.

source: // A work item. In this case, just sleep for the given time and respond // with a message on the `respond_on` channel.
ja: // 作業アイテム。この場合、指定された時間だけスリープし、 // `respond_on` チャンネルでメッセージを返します。
pt_br: // Um item de trabalho. Neste caso, apenas dormir pelo tempo dado e responder com uma mensagem no canal `respond_on`.
uk: // Робочий елемент. У цьому випадку просто заснути на заданий час і // відповісти повідомленням на каналі `respond_on`.

source: // A worker which listens for work on a queue and performs it.
ja: // キュー上の処理をリッスンして実行するワーカー。
pt_br: // Um trabalhador que escuta o trabalho em uma fila e o executa.
uk: // Робочий, який чекає на роботу у черзі та виконує її.

source: // Pretend to work.
pt_br: // Fingir trabalhar.
uk: // Вдається, що працює.

source: "failed to send response"
pt_br: "falha ao enviar resposta"
uk: "не вдалося надіслати відповідь"

source: // TODO: report number of iterations every 100ms
ja: // TODO: 100 ミリ秒ごとの反復処理の回数をレポート
pt_br: // TODO: relatar o número de iterações a cada 100ms
uk: // TODO: виводити кількість ітерацій кожні 100 мс

source: // A requester which requests work and waits for it to complete.
ja: // 処理をリクエストし、処理が完了するまで待機するリクエスト元。
pt_br: // Um solicitante que solicita trabalho e aguarda sua conclusão.
uk: // Запитувач, який надсилає запит на виконання роботи і чекає на її завершення.

source: "failed to send on work queue"
pt_br: "falha ao enviar na fila de trabalho"
uk: "не вдалося відправити в робочу чергу"

source: "failed waiting for response"
pt_br: "falha ao esperar pela resposta"
uk: "не вдалося дочекатися відповіді"

source: "work result for iteration {i}: {resp}"
fa: "نتیجه کار برای تکرار {i}: {resp}"
pt_br: "resultado do trabalho para a iteração {i}: {resp}"
uk: "результат роботи для ітерації {i}: {resp}"

source: You may recognize this as an example of the actor pattern. Actors typically call `select!` in a loop.
es: Puede que reconozcas esto como un ejemplo del patrón actor. Los actores suelen llamar a `select!` en un bucle.
fa: شما ممکن است این را به عنوان نمونه ای از الگوی بازیگر (actor pattern) تشخیص دهید. بازیگران معمولاً `select!` را در یک حلقه صدا می‌زنند.
ja: これはアクターのパターンの一例です。アクターは通常、ループ内で `select!` を呼び出します。
ko: 위에서 소개한 것은 액터(actor) 패턴의 한 예라고 봐도 무방합니다. 액터는 일반적으로 루프 안에서 `select!`를 호출합니다.
pt_br: Você pode reconhecer isso como um exemplo do padrão _actor_. Os _actors_ tipicamente chamam `select!` em um loop.
uk: Ви можете розпізнати це як приклад шаблону актора. Актори зазвичай викликають `select!` у циклі.

source: This serves as a summation of a few of the previous lessons, so take your time with it.
es: Esta sección es un resumen de algunas de las lecciones anteriores, así que tómate tu tiempo .
fa: این به عنوان یک جمع‌بندی از چند درس قبلی عمل می کند، بنابراین وقت خود را صرف آن کنید.
ja: これはこれまでのレッスンの一部をまとめたものですので、時間をかけて復習してください。
ko: 이전 강의 몇 개의 내용을 요약한 것이기 때문에 천천히 살펴보세요.
pt_br: Isso serve como uma síntese de algumas das lições anteriores, então leve seu tempo com isso.
uk: Це є підсумком кількох попередніх уроків, тож не поспішайте з цим.

source: Naively add a `_ = sleep(Duration::from_millis(100)) => { println!(..) }` to the `select!`. This will never execute. Why?
es: Si añade un `_ = sleep(Duration::from_millis(100)) => { println!(..) }` a `select!`, nunca se ejecutará. ¿Por qué?
fa: به‌سادگی یک `_ = sleep(Duration::from_millis(100)) => { println!(..) }` را به `select!` اضافه کنید. این مورد هرگز اجرا نمی شود. چرا؟
ja: `_ = sleep(Duration::from_millis(100)) => { println!(..) }` を `select!` に追加しただけでは、実行されません。なぜでしょうか？
ko: `_ = sleep(Duration::from_millis(100)) => { println!(..) }`을 `select!`에 추가해 보세요. 이 작업은 실행되지 않습니다. 왜 그럴까요?
pt_br: Adicione ingenuamente um `_ = sleep(Duration::from_millis(100)) => { println!(..) }` ao `select!`. Isso nunca será executado. Por quê?
uk: Наївно додайте `_ = sleep(Duration::from_millis(100)) => { println!(..) }` до `select!`. Це ніколи не буде виконано. Чому?

source: Instead, add a `timeout_fut` containing that future outside of the `loop`:
es: En su lugar, añade un `timeout_fut` que contenga ese futuro fuera de `loop`:
fa: درعوض، یک `timeout_fut` حاوی آن future خارج از `loop` اضافه کنید:
ja: 代わりに、`loop` の外側で、その Future を含む `timeout_fut` を追加します。
ko: 대신, 해당 future가 포함된 `timeout_fut`를 `loop` 외부에 추가해 보세요.
pt_br: Em vez disso, adicione um `timeout_fut` contendo essa _future_ fora do `loop`:
uk: Замість цього додайте `timeout_fut`, що містить цей ф'юсчерс за межами `loop`:

source: This still doesn't work. Follow the compiler errors, adding `&mut` to the `timeout_fut` in the `select!` to work around the move, then using `Box::pin`:
es: Continuará sin funcionar. Sigue los errores del compilador y añade `&mut` a `timeout_fut` en `select!` para ir despejando el problema. A continuación, usa `Box::pin`:
ja: これでもうまくいきません。コンパイルエラーにあるように、`select!` 内の `timeout_fut` に `&mut` を追加して移動を回避してから、`Box::pin` を使用します。
ko: 여전히 작동하지 않습니다. 컴파일러 오류를 따라 `select!`의 `timeout_fut`에 `&mut`를 추가하여 Move 시멘틱 관련한 문제를 해결하고 `Box::pin`을 사용하세요.
pt_br: Isso ainda não funciona. Siga os erros do compilador, adicionando `&mut` ao `timeout_fut` no `select!` para contornar a movimentação, e então usando `Box::pin`.
uk: Це все ще не працює. Слідкуйте за помилками компілятора, додавши `&mut` до `timeout_fut` у `select!`, щоб обійти переміщення, а потім використовуючи `Box::pin`:
