Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Like tuples, enums can also be destructured by matching:
fa: مانند tuple ها، enum ها را نیز می توان با تطبیق تخریب کرد:
pt_br: Como tuplas, _enums_ também podem ser desestruturados por meio de correspondência:
uk: Як і кортежі, переліки також можуть бути деструктуровані шляхом зіставлення:

source: Patterns can also be used to bind variables to parts of your values. This is how you inspect the structure of your types. Let us start with a simple `enum` type:
es: Los patrones también se pueden usar para enlazar variables a partes de los valores. Así es como se inspecciona la estructura de tus tipos. Empecemos con un tipo `enum` sencillo:
fa: الگوها همچنین می‌توانند برای متصل کردن متغیرها به بخش‌هایی از مقادیر شما استفاده شوند. این روش به شما اجازه می‌دهد ساختار انواع خود را بررسی کنید. بیایید با یک نوع ساده `enum` شروع کنیم:
ja: パターンは、変数を値の一部にバインドするためにも使用できます。以下のようにして、型の構造を調べることができます。単純な `enum` から始めましょう。
ko: 구조체나 열거형 값의 일부를 패턴 매치를 통해 변수에 바인딩할 수 있습니다. 간단한 `enum` 타입을 먼저 살펴보겠습니다:
pt_br: Os padrões também podem ser usados para vincular variáveis a partes de seus valores. É assim que você inspeciona a estrutura de seus tipos. Vamos começar com um tipo `enum` simples:
uk: Шаблони також можна використовувати для прив’язки змінних до частин ваших значень. Таким чином ви перевіряєте структуру ваших типів. Давайте розпочнемо з простого типу `enum`:

source: "cannot divide {n} into two equal parts"
fa: "نمی توان {n} را به دو قسمت مساوی تقسیم کرد"
pt_br: "não é possível dividir {n} em duas partes iguais"
uk: "не можна поділити {n} на дві рівні частини"

source: "{n} divided in two is {half}"
fa: "{n} تقسیم به دو است {half}"
pt_br: "{n} divido em dois é {half}"
uk: "{n} поділена навпіл, це {half}"

source: "sorry, an error happened: {msg}"
fa: "با عرض‌پوزش، خطایی رخ داده است: {msg}"
pt_br: "desculpe, aconteceu um erro: {msg}"
uk: "вибачте, сталася помилка: {msg}"

source: Here we have used the arms to _destructure_ the `Result` value. In the first arm, `half` is bound to the value inside the `Ok` variant. In the second arm, `msg` is bound to the error message.
es: Aquí hemos utilizado los brazos para _desestructurar_ el valor de `Result`. En el primer brazo, `half` está vinculado al valor que hay dentro de la variante `Ok`. En el segundo, `msg` está vinculado al mensaje de error.
fa: اینجا از شاخه‌ها برای _تجزیه_ مقدار `Result` استفاده کرده‌ایم. در شاخه‌ی اول، `half` به مقداری که درون حالت `Ok` قرار دارد متصل شده است. در شاخه‌ی دوم، `msg` به پیام خطا متصل شده است.
ja: ここでは、アーム（arm, パターンを並べたもの）を使用して `Result` 値の分解を行っています。最初のアームでは、`half` は `Ok` バリアント内の値にバインドされます。2 つ目のアームでは `msg` がエラー メッセージにバインドされます。
ko: `match`구문에서 `divide_in_two`함수에서 반환되는 `Result` 값을 두 개의 팔(혹은 가지)로 _분해(destructure)_ 하였습니다. 첫번째 팔에서 `half`는 `Ok` variant에 담긴 값으로 바인딩됩니다. 두번째 팔에서 `msg`는 오류 메시지 문자열에 바인딩됩니다.
pt_br: Aqui usamos a verificação de correspondência para _desestruturar_ o valor contido em `Result`. Na primeira verificação de correspondência, `half` está vinculado ao valor dentro da variante `Ok`. Na segunda, `msg` está vinculado à mensagem de erro.
uk: Тут ми використали гілки для _деструктурування_ значення `Result`. У першій гілці `half` прив'язано до значення всередині варіанту `Ok`. У другій гілці `msg` прив'язано до повідомлення про помилку.

source: The `if`/`else` expression is returning an enum that is later unpacked with a `match`.
es: La expresión `if`/`else` devuelve una enumeración que más tarde se descomprime con `match`.
fa: عبارت `if`/`else` یک نوع enum بازمی‌گرداند که بعداً با استفاده از `match` از هم باز می‌شود.
ja: `if`/`else` 式は、後で `match` でアンパックされる列挙型を返しています。
ko: `if`/`else` 표현식은 열거형을 반환하고, 이 값은 나중에 `match`로 분해됩니다.
pt_br: A expressão `if`/`else` está retornando um `enum` que é posteriormente descompactado com um `match`.
uk: Вираз `if`/`else` повертає перелік, який пізніше розпаковується за допомогою `match`.

source: You can try adding a third variant to the enum definition and displaying the errors when running the code. Point out the places where your code is now inexhaustive and how the compiler tries to give you hints.
es: Puedes probar a añadir una tercera variante a la definición de la enumeración y mostrar los errores al ejecutar el código. Señala los lugares en los que tu código está ahora incompleto y explica cómo el compilador intenta dar sugerencias.
fa: می توانید با اضافه کردن یک فیلد دیگر `None` به `enum` اضافه کنید و نمایش خطاها هنگام اجرای کد، را تست کنید. مکان هایی را که کد شما اکنون ناقص است و نحوه تلاش کامپایلر برای ارائه نکاتی به شما را نشان دهید.
ja: 列挙型の定義に 3 つ目のバリアント（列挙型の要素のこと）を追加し、コード実行時にエラーを表示してみましょう。コードが網羅されていない箇所を示し、コンパイラがどのようにヒントを提供しようとしているかを説明します。
ko: 열거형에 세번째 variant를 추가하고 코드를 실행하여 오류를 표시해보세요. 코드 어느 부분에 누락이 있는지, 그리고 컴파일러가 어떤 식으로 힌트를 주는지 같이 살펴보세요.
pt_br: Você pode tentar adicionar uma terceira variante à definição de Enum e exibir os erros ao executar o código. Aponte os lugares onde seu código agora é "não exaustivo" e como o compilador tenta lhe dar dicas.
uk: Ви можете спробувати додати третій варіант до визначення переліку і відобразити помилки під час виконання коду. Вкажіть місця, де ваш код зараз є невичерпним, і як компілятор намагається дати вам підказки.

source: The values in the enum variants can only be accessed after being pattern matched.
fa: مقادیر در حالات enum تنها پس از تطبیق الگو قابل دسترسی هستند.
ja: 列挙型バリアントの値には、パターンが一致した場合にのみアクセスできます。
pt_br: Os valores nas variantes de uma _enum_ só podem ser acessados após uma correspondência de padrão.
uk: Доступ до значень у варіантах переліку можливий лише після зіставлення з шаблоном.

source: Demonstrate what happens when the search is inexhaustive. Note the advantage the Rust compiler provides by confirming when all cases are handled.
fa: نشان دهید چه اتفاقی می‌افتد وقتی جستجو (مطابقت) ناقص است. به مزیتی که کامپایلر Rust فراهم می‌کند، اشاره کنید که تأیید می‌کند همه حالات پوشش داده شده‌اند.
ja: 検索が網羅的でない場合にどうなるかを示します。すべてのケースが処理されるタイミングを確認することで、Rust コンパイラの利点を強調します。
pt_br: Demonstre o que acontece quando a busca não abrange todas as possibilidades. Observe a vantagem que o compilador Rust fornece ao confirmar quando todos os casos são tratados.
uk: Продемонструйте, що відбувається, коли пошук є невичерпним. Зверніть увагу на перевагу, яку надає компілятор Rust, підтверджуючи що всі випадки оброблено.

source: Rust has a few control flow constructs which differ from other languages. They are used for pattern matching:
es: Rust tiene algunas construcciones de control de flujo que difieren de otros lenguajes. Se utilizan para el patrón de coincidencia:
fa: زبان Rust چند ساختار کنترل جریان دارد که با سایر زبان‌ها متفاوت است. این ساختارها برای مطابقت الگو استفاده می‌شوند:
ja: Rust には、他の言語とは異なる制御フロー構造がいくつかあります。これらはパターン マッチングに使用されます。
pt_br: Rust possui algumas construções de fluxo de controle que diferem de outras linguagens. Elas são usadas para correspondência de padrões:
uk: Rust має кілька конструкцій потоку керування, які відрізняються від інших мов. Вони використовуються для зіставлення шаблонів:

source: `if let` expressions
es: Expresiones `if let`
fa: عبارت `if let`
ja: `if let` 式
ko: `if let` 표현식
pt_br: Expressões `if let`
uk: вирази `if let`

source: `let else` expressions
fa: عبارت `let else`
ja: `let else` 式
pt_br: Expressões `let else`
uk: вирази `let else`

source: `while let` expressions
es: Expresiones `while let`
fa: عبارت `while let`
ja: `while let` 式
pt_br: Expressões `while let`
uk: вирази `while let`

source: The [`if let` expression](https://doc.rust-lang.org/reference/expressions/if-expr.html#if-let-expressions) lets you execute different code depending on whether a value matches a pattern:
es: La [expresión `if let`][(https://doc.rust-lang.org/reference/expressions/if-expr.html#if-let-expressions) te permite ejecutar código diferente en función de si un valor coincide con un patrón:
fa: [عبارت `if let`](https://doc.rust-lang.org/reference/expressions/if-expr.html#if-let-expressions) به شما امکان می‌دهد بسته به اینکه آیا یک مقدار با یک الگو مطابقت دارد، کدهای مختلفی را اجرا کنید:
ja: [`if let` 式](https://doc.rust-lang.org/reference/expressions/if-expr.html#if-let-expressions) を使用すると、値がパターンに一致するかどうかに応じて異なるコードを実行できます。
ko: [`if let` 표현식](https://doc.rust-lang.org/reference/expressions/if-expr.html#if-let-expressions)을 사용하면 값이 패턴과 일치하는지에 따라 다른 코드를 실행할 수 있습니다:
pt_br: A [expressão `if let` ](https://doc.rust-lang.org/reference/expressions/if-expr.html#if-let-expressions) lhe permite executar um código diferente caso um valor corresponde a um padrão:
uk: Вираз [`if let`](https://doc.rust-lang.org/reference/expressions/if-expr.html#if-let-expressions) дозволяє виконувати інший код залежно від того, чи відповідає значення шаблону :

source: "slept for {:?}"
pt_br: "dormiu por {:?}"
uk: "проспав {:?}"

source: For the common case of matching a pattern and returning from the function, use [`let else`](https://doc.rust-lang.org/rust-by-example/flow_control/let_else.html). The "else" case must diverge (`return`, `break`, or panic - anything but falling off the end of the block).
fa: برای حالت رایج مطابقت با یک الگو و بازگشت از تابع، از [`let else`](https://doc.rust-lang.org/rust-by-example/flow_control/let_else.html) استفاده کنید. در اینجا، حالت "else" باید منحرف شود (مانند `return`، `break`، یا `panic` - به غیر از اینکه از انتهای بلوک خارج شود).
ja: パターンをマッチして関数から戻るという一般的なケースでは、[`let else`](https://doc.rust-lang.org/rust-by-example/flow_control/let_else.html) を使用します。「else」ケースは発散する必要があります（`return`、`break`、パニックなど、ブロックから抜けるもの以外のすべて）。
pt_br: Para o caso comum de corresponder a um padrão e retornar da função, use [`let else`](https://doc.rust-lang.org/rust-by-example/flow_control/let_else.html). O caso "else" deve divergir (`return`, `break` ou pânico - qualquer coisa, exceto cair no final do bloco).
uk: Для загального випадку зіставлення шаблону і повернення з функції використовуйте [`let else`](https://doc.rust-lang.org/rust-by-example/flow_control/let_else.html). Випадок "else" повинен відрізнятися (`return`, `break` або паніка - що завгодно, але не випадання з кінця блоку).

source: "not a hex digit"
fa: "نه یک hex digit"
pt_br: "não é um dígito hexadecimal"
uk: "не шістнадцяткова цифра"

source: "got empty string"
fa: "یک string خالی دریافت کردم"
pt_br: "obteve uma string vazia"
uk: "отримав порожній рядок"

source: "got None"
fa: "هیچ‌کدام"
pt_br: "obteve None"
uk: "отримав None"

source: "result: {:?}"
fa: "نتیجه: {:?}"
uk: "результат: {:?}"

source: Like with `if let`, there is a [`while let`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#predicate-pattern-loops) variant which repeatedly tests a value against a pattern:
es: Al igual que con `if let`, hay una variante [`while let`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#predicate-pattern-loops) que prueba repetidamente un valor con respecto a un patrón:
fa: مانند `if let`، یک دستور [`while let`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#predicate-pattern-loops) وجود دارد که مقادیر مقابل الگو به طور مکرر (تکرار شونده‌ای) بررسی می‌کند:
ja: `if let` に似た [`while let`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#predicate-pattern-loops) 派生物もあります。これは、パターンに照らして値をテストします。
ko: 마지막으로, 무한 루프를 만드는 [`loop` 키워드](https://doc.rust-lang.org/reference/expressions/loop-expr.html#infinite-loops)가 있습니다:
pt_br: Similar a `if let`, há uma variante [`while let`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#predicate-pattern-loops) que testa repetidamente se um valor corresponde a um padrão:
uk: Подібно до `if let`, існує варіант [`while let`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#predicate-pattern-loops), який багаторазово перевіряє значення на відповідність шаблону:

source: Here [`String::pop`](https://doc.rust-lang.org/stable/std/string/struct.String.html#method.pop) returns `Some(c)` until the string is empty, after which it will return `None`. The `while let` lets us keep iterating through all items.
fa: در اینجا [`String::pop`](https://doc.rust-lang.org/stable/std/string/struct.String.html#method.pop) تا زمانی که رشته خالی نشده است، `Some(c)` را برمی‌گرداند و پس از آن `None` را باز می‌گرداند. استفاده از `while let` به ما این امکان را می‌دهد که به طور مداوم از میان همه موارد عبور کنیم.
ja: ここで [`String::pop`](https://doc.rust-lang.org/stable/std/string/struct.String.html#method.pop) は、文字列が空になるまで `Some(c)` を返し、その後 `None` を返します。`while let` を使用すると、すべてのアイテムに対して反復処理を続行できます。
pt_br: Aqui [`String::pop`](https://doc.rust-lang.org/stable/std/string/struct.String.html#method.pop) retorna `Some(c)` até que a string esteja vazia e depois ela retornará `None`. O `while let` nos permite iterar por todos os itens.
uk: Тут [`String::pop`](https://doc.rust-lang.org/stable/std/string/struct.String.html#method.pop) повертає `Some(c)` поки рядок не стане порожнім, після чого поверне `None`. Використання `while let` дозволяє нам продовжувати ітерацію по всіх елементах.

source: Unlike `match`, `if let` does not have to cover all branches. This can make it more concise than `match`.
es: A diferencia de `match`, `if let` no tiene que cubrir todas las ramas, pudiendo así conseguir que sea más conciso que `match`.
fa: برخلاف دستور `match` دستور `if let` همه حالت های ممکن را برای تطبیق الگو پشتیبانی نمیکند. اگر می‌خواهید همه حالت را پوشش دهید از دستور `match` استفاده کنید.
ja: `match` とは異なり、`if let` ではすべての分岐を網羅する必要はないため、`match` よりも簡潔になります。
ko: `if let`이 `match`보다 더 간결할 수 있습니다(예: 한가지 브랜치만 흥미로운 경우). 이와 달리 `match`에서는 모든 브랜치가 처리되어야 합니다.
pt_br: Ao contrário de `match`, `if let` não precisa cobrir todas as ramificações. Isso pode torná-lo mais conciso do que `match`.
uk: На відміну від `match`, `if let` не має охоплювати всі гілки. Це може зробити його більш лаконічним, ніж `match`.

source: A common usage is handling `Some` values when working with `Option`.
es: Un uso habitual consiste en gestionar valores `Some` al trabajar con `Option`.
fa: یک استفاده رایج از دستور `if let`، رسیدگی به مقادیر `Some` هنگام کار با `Option` است.
ja: 一般的な使用方法は、`Option` を操作するときに `Some` 値を処理することです。
ko: 일반적 사용법은 `Option`을 사용할 때 `Some` 값을 처리하는 것입니다.
pt_br: Um uso comum é lidar com valores `Some` ao trabalhar-se com `Option`.
uk: Загальним використанням є обробка значень `Some` під час роботи з `Option`.

source: Unlike `match`, `if let` does not support guard clauses for pattern matching.
es: A diferencia de `match`, `if let` no admite cláusulas guardia para la coincidencia de patrones.
fa: برخلاف دستور `match` دستور `if let` از <span dir=ltr>`=>`</span> برای تطبیق الگو استفاده نمیکند.
ja: `match` とは異なり、`if let` はパターン マッチングでガード節をサポートしていません。
ko: `match`와 달리 `if let`은 패턴 일치를 위한 보호 절을 지원하지 않습니다.
pt_br: Ao contrário de `match`, `if let` não suporta cláusulas de guarda para correspondência de padrões.
uk: На відміну від `match`, `if let` не підтримує захисні вирази для збігу шаблонів.

source: `if-let`s can pile up, as shown. The `let-else` construct supports flattening this nested code. Rewrite the awkward version for students, so they can see the transformation.
fa: `if-let` ها می‌توانند به صورت تو در تو انباشته شوند، همان‌طور که در اینجا نشان داده شده است. ساختار `let-else` از فلت کردن این کدهای تو در تو پشتیبانی می‌کند. نسخه‌ی پیچیده را برای دانش‌آموزان بازنویسی کنید تا بتوانند تبدیل آن را مشاهده کنند.
ja: 次に示すように、`if let` は積み重なってしまうことがあります。`let-else` の構成は、このネストされたコードを平坦にする助けとなります。読みづらいバージョンを受講者向けに書き直して、受講者が変化を確認できるようにします。
pt_br: `if-let`s podem se acumular, como mostrado. A construção `let-else` permite o "achatamento" desse código aninhado. Reescreva a versão "estranha" para os alunos, para que eles possam ver a transformação.
uk: `if-let` може накопичуватись, як показано. Конструкція `let-else` підтримує згладжування цього вкладеного коду. Перепишіть незручну версію для студентів, щоб вони могли побачити перетворення.

source: The rewritten version is:
fa: نسخه‌ی بازنویسی شده به صورت زیر است:
ja: 書き換えたバージョンは次のとおりです。
pt_br: A versão reescrita é:
uk: Переписана версія така:

source: Point out that the `while let` loop will keep going as long as the value matches the pattern.
es: Señala que el bucle `while let` seguirá funcionando siempre que el valor coincida con el patrón.
fa: توجه داشته باشید که حلقه `while let` تا زمانی که مقادیر مقابل الگو طبیق داشته باشد (شرط برقرار باشد)، ادامه خواهد داشت.
ja: 値がパターンに一致する限り、`while let` ループが繰り返されることを説明します。
ko: `while let`은 값이 패턴에 매치되는 동안 계속됩니다.
pt_br: Ressalte que o loop `while let` continuará executando enquanto o valor corresponder ao padrão.
uk: Зверніть увагу, що цикл `while let` триватиме, доки значення відповідає шаблону.

source: You could rewrite the `while let` loop as an infinite loop with an if statement that breaks when there is no value to unwrap for `name.pop()`. The `while let` provides syntactic sugar for the above scenario.
fa: شما می‌توانید حلقه‌ی `while let` را به صورت یک حلقه بی‌پایان با یک دستور `if` بازنویسی کنید که در صورت عدم وجود مقداری برای باز کردن (unwrap) از `()name.pop`، شکسته می‌شود. `while let` یک Syntactic sugar برای این سناریو ارائه می‌دهد.
ja: `name.pop()` でunwrapする値がない場合に中断する if ステートメントを使用して、`while let` ループを無限ループに書き換えることができます。`while let` は、上記のシナリオの糖衣構文として使用できます。
pt_br: Você pode reescrever o loop `while let` como um loop infinito com uma instrução `if` que é interrompido quando não houver mais nenhum valor para _unwrap_ (desempacotar) para `name.pop()`. O `while let` fornece um atalho para o cenário acima.
uk: Ви можете переписати цикл `while let` як нескінченний цикл з оператором if, який переривається, коли для `name.pop()` немає значення для розгортання. Цикл `while let` забезпечує синтаксичний цукор для наведеного вище сценарію.

source: minutes: 30
uk: хвилин: 30

source: Let's write a simple recursive evaluator for arithmetic expressions.
fa: بیایید یک ارزیاب ساده بازگشتی برای عبارات حسابی بنویسیم.
ja: 演算式用の簡単な再帰エバリュエータを作成してみましょう。
pt_br: Vamos escrever um interpretador recursivo simples para expressões aritméticas.
uk: Давайте напишемо простий рекурсивний обчислювач арифметичних виразів.

source: The `Box` type here is a smart pointer, and will be covered in detail later in the course. An expression can be "boxed" with `Box::new` as seen in the tests. To evaluate a boxed expression, use the deref operator (`*`) to "unbox" it: `eval(*boxed_expr)`.
fa: نوع `Box` در اینجا یک اشاره‌گر هوشمند است و در ادامه دوره به طور مفصل مورد بررسی قرار خواهد گرفت. یک عبارت می‌تواند با استفاده از `Box::new` "باکس" شود، همان‌طور که در تست‌ها مشاهده می‌شود. برای ارزیابی یک عبارت باکس‌شده، از عملگر deref (`*`) برای "باز کردن باکس" استفاده کنید: `eval(*boxed_expr)`.
ja: ここでの `Box` 型はスマート ポインタです。詳細はこの講座で後ほど説明します。テストで見られるように、式は `Box::new` で「ボックス化」できます。ボックス化された式を評価するには、逆参照演算子（`*`）を使用して「ボックス化解除」します（`eval(*boxed_expr)`）。
pt_br: O tipo `Box` aqui é um ponteiro inteligente (_smart pointer_) e será abordado em detalhes mais adiante no curso. Uma expressão pode ser "encaixotada" com `Box::new` como visto nos testes. Para avaliar uma expressão encaixotada, use o operador de desreferência (`*`) para o "desencaixotar": `eval(*boxed_expr)`.
uk: Тип `Box` тут є розумним вказівником і буде детально розглянутий пізніше у курсі. Вираз може бути "упаковано" за допомогою `Box::new`, як показано у тестах. Щоб обчислити вираз, використайте оператор розіменування (`*`), щоб "розпакувати" його: `eval(*boxed_expr)`.

source: Some expressions cannot be evaluated and will return an error. The standard [`Result<Value, String>`](https://doc.rust-lang.org/std/result/enum.Result.html) type is an enum that represents either a successful value (`Ok(Value)`) or an error (`Err(String)`). We will cover this type in detail later.
fa: برخی از عبارات نمی‌توانند ارزیابی شوند و خطا برمی‌گردانند. نوع استاندارد [`Result<Value, String>`](https://doc.rust-lang.org/std/result/enum.Result.html) یک enum است که یا نمایانگر یک مقدار موفقیت‌آمیز (`Ok(Value)`) یا یک خطا (`Err(String)`) است. ما این نوع را به‌طور مفصل‌تر در آینده پوشش خواهیم داد.
ja: 一部の式は評価できず、エラーが返されます。標準の [`Result<Value, String>`](https://doc.rust-lang.org/std/result/enum.Result.html) 型は、成功した値（`Ok(Value)`）またはエラー（`Err(String)`）のいずれかを表す列挙型です。この型については、後ほど詳しく説明します。
pt_br: Algumas expressões não podem ser avaliadas e retornarão um erro. O tipo padrão [`Result<Value, String>`](https://doc.rust-lang.org/std/result/enum.Result.html) é um enum que representa um valor de sucesso (`Ok(Value)`) ou um erro (`Err(String)`). Abordaremos esse tipo em detalhes mais adiante.
uk: Деякі вирази не можуть бути обчислені і повертають помилку. Стандартний тип [`Result<Value, String>`](https://doc.rust-lang.org/std/result/enum.Result.html) - це перелік, який представляє або успішне значення (`Ok(Value)`), або помилку (`Err(String)`). Ми розглянемо цей тип більш детально пізніше.

source: Copy and paste the code into the Rust playground, and begin implementing `eval`. The final product should pass the tests. It may be helpful to use `todo!()` and get the tests to pass one-by-one. You can also skip a test temporarily with `#[ignore]`:
fa: کد را کپی و در Rust Playground پیست کنید و پیاده‌سازی تابع `eval` را آغاز کنید. محصول نهایی باید تست‌ها را پاس کند. ممکن است استفاده از `()!todo` و گذراندن تست‌ها به صورت تک به تک مفید باشد. همچنین می‌توانید به طور موقت یک تست را با استفاده از `[ignore]#` نادیده بگیرید:
ja: コードをコピーして Rust プレイグラウンドに貼り付け、`eval` の実装を開始します。完成したエバリュエータはテストに合格する必要があります。`todo!()` を使用して、テストを 1 つずつ実施することをおすすめします。`#[ignore]` を使用して、テストを一時的にスキップすることもできます。
pt_br: Copie e cole o código no playground do Rust e comece a implementar `eval`. O produto final deve passar nos testes. Pode ser útil usar `todo!()` e fazer os testes passarem um por um. Você também pode ignorar um teste temporariamente com `#[ignore]`:
uk: Скопіюйте та вставте код у середовище Rust і почніть реалізацію `eval`. Кінцевий продукт повинен пройти тести. Може бути корисно використати `todo!()` і змусити тести проходити один за одним. Ви також можете тимчасово оминути тест за допомогою `#[ignore]`:

source: If you finish early, try writing a test that results in division by zero or integer overflow. How could you handle this with `Result` instead of a panic?
fa: اگر زودتر تمام کردید، سعی کنید یک تست بنویسید که منجر به تقسیم بر صفر یا سرریز عدد صحیح شود. چگونه می‌توانید این را با استفاده از `Result` به جای panic مدیریت کنید؟
ja: 早めに終了した場合は、ゼロ除算や整数オーバーフローが発生するテストを記述してみてください。`Result` を使用して、パニックを発生させずにこれを処理するにはどうすればよいでしょうか。
pt_br: Se você terminar cedo, tente escrever um teste que resulte em divisão por zero ou _integer overflow_. Como você poderia lidar com isso com `Result` em vez de um pânico?
uk: Якщо ви закінчили раніше, спробуйте написати тест, який призводить до ділення на нуль або цілочисельного переповнення. Як ви могли б впоратися з цим за допомогою `Result` замість того, щоб панікувати?

source: /// An operation to perform on two subexpressions.
ja: /// 2 つのサブ式に対して実行する演算。
pt_br: /// Uma operação a ser realizada em duas subexpressões.
uk: /// Операція для виконання над двома під-виразами.

source: /// An expression, in tree form.
ja: /// ツリー形式の式。
pt_br: /// Uma expressão, em forma de árvore.
uk: /// Вираз у вигляді дерева.

source: /// An operation on two subexpressions.
ja: /// 2 つのサブ式に対する演算。
pt_br: /// Uma operação em duas subexpressões.
uk: /// Операція над двома підвиразами.

source: /// A literal value
ja: /// リテラル値
pt_br: /// Um valor literal
uk: /// Літеральне значення

source: "division by zero"
fa: "تقسیم بر صفر"
pt_br: "divisão por zero"
uk: "ділення на нуль"

source: minutes: 8
uk: хвилин: 8
