Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: // The sender got dropped. No more commands coming in.
ja: // 送信者がドロップされました。今後コマンドは受信されません。
pt_br: // O remetente foi descartado. Não há mais comandos chegando.
uk: // Відправника було видалено. Більше команд не надходить.

source: "Got crawling error: {:#}"
fa: "خطای crawling دریافت شد: {:#}"
pt_br: "Erro de crawling: {:#}"
uk: "Виникла помилка при скануванні: {:#}"

source: "Bad URLs: {:#?}"
pt_br: "URLs ruins: {:#?}"
uk: "Неправильні URL-адреси: {:#?}"

source: "Async" is a concurrency model where multiple tasks are executed concurrently by executing each task until it would block, then switching to another task that is ready to make progress. The model allows running a larger number of tasks on a limited number of threads. This is because the per-task overhead is typically very low and operating systems provide primitives for efficiently identifying I/O that is able to proceed.
es: "Async" es un modelo de concurrencia en el que se ejecutan varias tareas al mismo tiempo. Se ejecuta cada una de ellas hasta que se bloquea y, a continuación, se cambia a otra tarea que está lista para progresar. El modelo permite ejecutar un mayor número de tareas en un número limitado de hilos. Esto se debe a que la sobrecarga por tarea suele ser muy baja y los sistemas operativos proporcionan primitivos para identificar de forma eficiente las E/S que pueden continuar.
fa: ‏ "Async" یک مدل concurrency است که در آن چندین کار به طور هم‌زمان با اجرای هر کار تا زمانی که مسدود شود، اجرا می‌شود و سپس به کار دیگری که آماده ادامه دادن است سوئیچ می‌شود. این مدل اجازه می‌دهد تا تعداد بیشتری کار را روی تعداد محدودی از رشته‌ها اجرا کنید و به این دلیل است که سربار هر task معمولاً بسیار کم است و سیستم‌‌عامل‌ها معمولاً مقدماتی را برای شناسایی مؤثر I/O که قادر به ادامه هستند فراهم می‌کنند.
ja: 「Async」は複数のタスクが並行処理される並行性モデルです。それぞれのタスクはブロックされるまで実行され、そして次に進むことのできる他のタスクに切り替えることにより実現されます。このモデルは限られた数のスレッド上でより多くのタスクを実行することを可能にします。なぜなら、タスクごとのオーバーヘッドは通常はとても低く、効率的に実行可能なI/Oを特定するために必要なプリミティブをOSが提供してくれるからです。
ko: "Async"는 블럭될(더 이상 진행할 수 없을) 때까지 각 작업을 실행한 다음 진행할 준비가 된 다른 작업으로 전환하여 여러 작업을 동시에 실행하는 동시 실행 모델입니다. 이 모델을 사용하면 제한된 수의 스레드에서 더 많은 작업을 실행할 수 있습니다. 이는, 한 작업을 유지하고 수행하는데 필요한 오버헤드가 (스레드에 비해) 매우 낮고 운영체제가 여러 I/O들에서 현재 진행 가능한 I/O들을 효과적으로 식별해 주는 프리미티브를 제공하기 때문입니다.
pt_br: "_Async_" é um modelo de concorrência onde várias tarefas são executadas concorrentemente, executando cada tarefa até que ela bloqueie, e então mudando para outra tarefa que está pronta para fazer progresso. O modelo permite executar um número maior de tarefas em um número limitado de threads. Isso ocorre porque o custo por tarefa é tipicamente muito baixo e os sistemas operacionais fornecem primitivas para identificar eficientemente I/O que é capaz de prosseguir.
uk: "Async" — це модель одночасного виконання декількох завдань, при якій кожне завдання виконується одночасно доти, доки воно не заблокується, а потім перемикається на інше завдання, яке готове до виконання. Модель дозволяє виконувати більшу кількість завдань на обмеженій кількості потоків. Це пов'язано з тим, що накладні витрати на кожну задачу зазвичай дуже низькі, а операційні системи надають примітиви для ефективного визначення вводу/виводу, який може продовжувати роботу.

source: Rust's asynchronous operation is based on "futures", which represent work that may be completed in the future. Futures are "polled" until they signal that they are complete.
es: La operación asíncrona de Rust se basa en "valores futuros", que representan el trabajo que puede completarse más adelante. Los futuros se "sondean" hasta que indican que se han completado.
fa: عملیات Rust asynchronous بر اساس "futures" است، که نشان‌دهنده کاری است که ممکن است در آینده تکمیل شود. future‌ها تا زمانی که علامت کامل بودنشان را ندهند، «polled» می‌شوند.
ja: Rustの非同期的な操作は「future」に基づいていて、これは将来に完了するかもしれない作業を表しています。Futureは、タスクが完了したことを知らせるシグナルが得られるまでポーリングされます。
ko: Rust의 비동기 작업은 "futures"를 기반으로 하며 이는 미래에 완료될 수 있는 작업을 나타냅니다. Futures는 완료되었다는 신호를 보낼 때까지 "폴링"됩니다.
pt_br: A operação assíncrona do Rust é baseada em "futures", que representam trabalho que pode ser concluído no futuro. As _futures_ são "polled" até que elas sinalizem que estão completas.
uk: Асинхронна робота Rust базується на "ф'ючерсах", які представляють роботу, яка може бути завершена в майбутньому. Ф'ючерси "опитуються", доки вони не сигналізують, що вони завершені.

source: Futures are polled by an async runtime, and several different runtimes are available.
es: Los futuros se sondean mediante un tiempo de ejecución asíncrono y hay disponibles varios tiempos de ejecución diferentes.
fa: ‏ Futureها توسط یک زمان‌بندی ناهمزمان نظارت می‌شوند و چندین زمان‌بندی مختلف در دسترس هستند.
ja: Futureは非同期的なランタイムによりポーリングされます。ランタイムにはいくつかの選択肢があります。
ko: Futures는 비동기 런타임에 의해 폴링되며, 비동기 런타임에는 여러 다양한 종류가 있습니다.
pt_br: As _futures_ são _polled_ por um _runtime_ assíncrono, e vários _runtimes_ diferentes estão disponíveis.
uk: Ф’ючерси опитуються асинхронним середовищем виконання, і доступно кілька різних середовищ виконання.

source: Python has a similar model in its `asyncio`. However, its `Future` type is callback-based, and not polled. Async Python programs require a "loop", similar to a runtime in Rust.
es: Python tiene un modelo similar en su `asyncio`. Sin embargo, su tipo `Future` está basado en retrollamadas y no se sondea. Los programas asíncronos de Python requieren un "bucle", similar a un tiempo de ejecución en Rust.
fa: پایتون مدل مشابهی را در «asyncio» خود دارد. با‌این‌حال، تایپ «Future» آن مبتنی بر callback است و poll نشده است. برنامه‌های Async Python به یک «حلقه» شبیه به runtime در Rust نیاز دارند.
ja: Pythonには似たようなモデルが`asyncio`として搭載されています。しかし、ここでの`Future`型はコールバックに基づくものであって、ポーリングによるものではありません。Pythonの非同期プログラムは「ループ」を必要とし、Rustのランタイムに似ています。
ko: 파이썬에도 `asyncio`라는 유사한 모델이 있습니다. 그러나 파이썬의 `Future` 타입은 콜백 기반이며 폴링되지 않습니다. 파이썬으로 비동기 프로그래밍을 할 때에는, Rust에서 런타임이 내부적으로 해 주는 것과 유사한, "루프"를 명시적으로 사용해야 합니다.
pt_br: O Python tem um modelo semelhante em seu `asyncio`. No entanto, seu tipo `Future` é baseado em _callback_, e não _polled_. Programas _async_ em Python requerem um "loop", semelhante a um _runtime_ em Rust.
uk: Python має подібну модель у своєму `asyncio`. Однак його тип `Future` базується на зворотному виклику, а не опитується. Програми на асинхронному Python вимагають "циклу", подібного до середовища виконання в Rust.

source: JavaScript's `Promise` is similar, but again callback-based. The language runtime implements the event loop, so many of the details of Promise resolution are hidden.
es: `Promise` de JavaScript es parecido, pero también se basa en retrollamadas. El tiempo de ejecución del lenguaje implementa el bucle de eventos, por lo que muchos de los detalles de la resolución de Promise están ocultos.
fa: این مورد شبیه "Promise" در جاوا اسکریپت است که دوباره مبتنی بر callback است. runtime زبان حلقه رویداد (event loop) را پیاده سازی می‌کند، بنابراین بسیاری از جزئیات واضح در Promise پنهان می‌شوند.
ja: JavaScriptの`Promise`は似ているものの、これもまたもやコールバックに基づきます。 この言語のランタイムはイベントループにより実装されているため、多くのPromise解決の詳細は隠されています。
ko: 자바스크립트의 `Promise`도 비슷하지만 역시 콜백 기반입니다. 자바스크립트에서는 이벤트 루프가런타임 엔진에서 구현되므로 `Promise`가 처리되는 세부 과정이 숨겨집니다.
pt_br: O `Promise` do JavaScript é semelhante, mas novamente baseado em _callback_. O _runtime_ da linguagem implementa o _event loop_, então muitos dos detalhes da resolução de _Promise_ são ocultos.
uk: Тип `Promise` JavaScript подібний, але знову ж таки на основі зворотного виклику. Середовище виконання мови реалізує цикл подій, тому багато деталей вирішення `Promise` приховані.

source: At a high level, async Rust code looks very much like "normal" sequential code:
es: En general, el código asíncrono de Rust se parece mucho al código secuencial "normal":
ja: おおまかには、Rustの非同期コードはほとんど「通常の」逐次的なコードのように見えます:
ko: 겉에서 보았을 때, 비동기 Rust 코드는 일반적인 절차적 코드와 매우 유사합니다.
pt_br: De maneira geral, o código _async_ do Rust se parece muito com o código sequencial "normal":
uk: На високому рівні асинхронний код Rust дуже схожий на "звичайний" послідовний код:

source: "Count is: {i}!"
pt_br: "Contador é: {i}!"
uk: "Підрахунок: {i}!"

source: Note that this is a simplified example to show the syntax. There is no long running operation or any real concurrency in it!
es: Ten en cuenta que este es un ejemplo simplificado para mostrar la sintaxis. No hay ninguna operación de larga duración ni concurrencia real.
fa: توجه داشته باشید که این یک مثال ساده برای نشان دادن syntax است. هیچ عملیات طولانی مدت یا هیچ هم‌زمانی(concurrency) واقعی در آن وجود ندارد!
ja: これは構文を示すための単純化された例であることに注意してください。長く実行されうる操作や本物の並行処理はここには含まれません。
ko: Rust 비동기 문법을 보여주는 간단한 예시입니다. 여기에는 오래 실행되는 작업이나, 실제로 동시에 수행되는 것들은 없습니다.
pt_br: Observe que este é um exemplo simplificado para mostrar a sintaxe. Não há operação de longa duração ou qualquer concorrência real nele!
uk: Зауважте, що це спрощений приклад для демонстрації синтаксису. У ньому немає тривалої операції чи реального одночасного виконання!

source: What is the return type of an async call?
es: ¿Cuál es el tipo de resultado devuelto de una llamada asíncrona?
fa: نوع برگشت async call چیست؟
ja: 非同期の呼び出しの返り値の型は？
ko: `async`함수의 리턴 타입은 무엇인가요?
pt_br: Qual é o tipo de retorno de uma chamada _async_?
uk: Який тип повернення асинхронного виклику?

source: Use `let future: () = async_main(10);` in `main` to see the type.
es: Consulta el tipo con `let future: () = async_main(10);` en `main` .
fa: برای مشاهده type از `let future: () = async_main(10);` در `main` استفاده کنید.
ja: 型を知るために`main`で`let future: () = async_main(10);`を使ってみてください。
ko: `main`에서 \`let future: () = async_main(10);을 사용하여 타입을 확인하세요.
pt_br: Use `let future: () = async_main(10);` em `main` para ver o tipo.
uk: Використовуйте `let future: () = async_main(10);` в `main`, щоб побачити тип.

source: The "async" keyword is syntactic sugar. The compiler replaces the return type with a future.
fa: کلمه کلیدی "async" شیرینیِ syntax زبان Rust است. کامپایلر نوع بازگشتی را با یک future جایگزین می‌کند.
pt_br: A palavra-chave "async" é açúcar sintático. O compilador substitui o tipo de retorno por uma _future_.
uk: Ключове слово "async" - це синтаксичний цукор. Компілятор замінює тип повернення на ф'ючерс.

source: You cannot make `main` async, without additional instructions to the compiler on how to use the returned future.
es: No se puede hacer que `main` sea asíncrono sin dar instrucciones adicionales al compilador sobre cómo usar el futuro devuelto.
fa: شما نمی‌توانید بدون دستورالعمل‌های اضافی به کامپایلر در مورد نحوه استفاده از future بازگشتی، `main` را async کنید.
ja: コンパイラに対して、返されたfutureの値をその後どう扱うべきかという、追加の指示を含めない限り、`main`をasyncにすることはできません。
ko: `main`을 비동기 함수로 만들수는 없습니다. 만약 그렇게 할 경우 컴파일러는 리턴 타입인 future를 어떻게 사용할 지 모르기 때문입니다.
pt_br: Você não pode tornar `main` _async_, sem instruções adicionais para o compilador sobre como usar a _future_ retornada.
uk: Ви не можете зробити `main` асинхронним без додаткових інструкцій для компілятора щодо використання повернутого ф'ючерса.

source: You need an executor to run async code. `block_on` blocks the current thread until the provided future has run to completion.
fa: برای اجرای کدهای همگام به یک اجرا‌ کننده (executor) نیاز دارید.`block_on` که thread رشته فعلی را تا زمانی که future ارائه شده تکمیل شود مسدود می‌کند.
pt_br: Você precisa de um executor para executar código _async_. `block_on` bloqueia o thread atual até que a _future_ fornecida tenha sido executada até a conclusão.
uk: Вам потрібен виконавець для запуску асинхронного коду. `block_on` блокує поточний потік, доки наданий ф'ючерс не завершиться.

source: `.await` asynchronously waits for the completion of another operation. Unlike `block_on`, `.await` doesn't block the current thread.
es: `.await` espera de forma asíncrona la finalización de otra operación. A diferencia de `block_on`, `.await` no bloquea el hilo.
fa: همیشه `await` به طور ناهمزمان (asyn) منتظر تکمیل یک عملیات دیگر است. برخلاف `block_on` یک `await` معمولاً thread فعلی را مسدود نمی‌کند.
ja: `.await`は非同期的に他の操作の完了を待ちます。`block_on`とは異なり、`.await`は現在のスレッドをブロックしません。
ko: `.await`는 다른 작업이 완료될 때까지 비동기적으로 대기합니다. `block_on`과 달리 `.await`는 현재 스레드를 블록하지 않습니다.
pt_br: `.await` espera assincronamente pela conclusão de outra operação. Ao contrário de `block_on`, `.await` não bloqueia o thread atual.
uk: `.await` асинхронно очікує на завершення іншої операції. На відміну від `block_on`, `.await` не блокує поточний потік.

source: `.await` can only be used inside an `async` function (or block; these are introduced later).
fa: ‏ `.await` فقط می‌تواند در داخل یک تابع `async` استفاده شود (یا block؛ این مورد در آینده معرفی می‌شوند).
pt_br: `.await` só pode ser usado dentro de uma função `async` (ou bloco; estes são introduzidos mais tarde).
uk: `.await` можна використовувати тільки всередині функції `async` (або блоку; вони будуть представлені пізніше).

source: [`Future`](https://doc.rust-lang.org/std/future/trait.Future.html) is a trait, implemented by objects that represent an operation that may not be complete yet. A future can be polled, and `poll` returns a [`Poll`](https://doc.rust-lang.org/std/task/enum.Poll.html).
es: [`Future`](https://doc.rust-lang.org/std/future/trait.Future.html) es un trait implementado por objetos que representan una operación que puede que aún no se haya completado. Se puede sondear un futuro y `poll` devuelve un [`Poll`](https://doc.rust-lang.org/std/task/enum.Poll.html).
fa: [`Future`](https://doc.rust-lang.org/std/future/trait.Future.html) یک trait است، اجرا شده توسط objectهایی که نشان دهنده عملیاتی هستند که ممکن است هنوز کامل نشده باشد. می‌توان یک future را poll کرد و `poll` یک [`Poll`](https://doc.rust-lang.org/std/task/enum.Poll.html) را برمی‌گرداند.
ja: [`Future`](https://doc.rust-lang.org/std/future/trait.Future.html)はトレイトであり、まだ完了してないかもしれない操作を表現するオブジェクトにより実装されます。Futureはポーリングされることがあり、`poll`は[`Poll`](https://doc.rust-lang.org/std/task/enum.Poll.html)を返します。
ko: [`Future`](https://doc.rust-lang.org/std/future/trait.Future.html)는 트레잇입니다.이 트레잇은 아직 완료되지 않았을 수도 있는 작업을 나타냅니다. Future는 `poll` 함수를 통해 폴링될 수 있으며, 이 함수는 [`Poll`](https://doc.rust-lang.org/std/task/enum.Poll.html)을 반환합니다.
pt_br: [`Future`](https://doc.rust-lang.org/std/future/trait.Future.html) é um traço, implementado por objetos que representam uma operação que pode ainda não estar completa. Uma _future_ pode ser _polled_, e `poll` retorna um [`Poll`](https://doc.rust-lang.org/std/task/enum.Poll.html).
uk: [`Future`](https://doc.rust-lang.org/std/future/trait.Future.html) — це трейт, реалізований об’єктами, які представляють операцію, яка може бути ще не завершеною. Ф'ючерс можна опитувати, і `poll` повертає [`Poll`](https://doc.rust-lang.org/std/task/enum.Poll.html).

source: An async function returns an `impl Future`. It's also possible (but uncommon) to implement `Future` for your own types. For example, the `JoinHandle` returned from `tokio::spawn` implements `Future` to allow joining to it.
es: Una función asíncrona devuelve `impl Future`. También es posible (aunque no es habitual) implementar `Future` para tus propios tipos. Por ejemplo, el `JoinHandle` devuelto por `tokio::spawn` implementa `Future` para permitir que se una a él.
fa: یک تابع async یک `impl Future` را برمی‌گرداند. همچنین امکان (اما غیرمعمول) پیاده‌سازی `Future` برای تایپ‌های خودتان نیز وجود دارد. برای مثال، `JoinHandle` برگردانده شده از `tokio::spawn` `Future` را پیاده‌سازی می‌کند تا امکان پیوستن (joining) به آن را فراهم کند.
ja: 非同期の関数は`impl Future`を返します。自分で定義した型に対して`Future`を実装することも（あまりないことですが）可能です。例えば、`tokio::spawn`から返される`JoinHandle`は`Future`を実装することにより、joinすることを可能にしています。
ko: 비동기 함수는 `impl Future`를 반환합니다. 새로운 타입을 만들고 이 타입이 `Future`를 구현하게 할 수도 있지만 일반적이지는 않습니다. 예를 들어 `tokio::spawn`가 리턴하는 `JoinHandle`은 `Future`를 구현하며, 이를 통해 생성된 스레드에 join할 수 있습니다.
pt_br: Uma função _async_ retorna um `impl Future`. Também é possível (mas pouco comum) implementar `Future` para seus próprios tipos. Por exemplo, o `JoinHandle` retornado de `tokio::spawn` implementa `Future` para permitir juntar-se a ele.
uk: Асинхронна функція повертає `impl Future`. Також можливо (але рідко) реалізувати `Future` для ваших власних типів. Наприклад, `JoinHandle`, отриманий від `tokio::spawn`, реалізує `Future`, щоб дозволити приєднання до нього.

source: The `.await` keyword, applied to a Future, causes the current async function to pause until that Future is ready, and then evaluates to its output.
es: La palabra clave `.await`, aplicada a un futuro, provoca que la función asíncrona se detenga hasta que dicho futuro esté listo y, a continuación, se evalúa su salida.
fa: کلمه کلیدی `.await` که برای Future اعمال می‌شود، باعث می‌شود که تابع async فعلی تا زمانی که Future آماده شود متوقف شود و سپس خروجی آن ارزیابی شود.
ja: Futureに適用される`.await`キーワードは、そのFutureの準備ができるまで、現在の非同期の関数の一時停止を起こし、そしてその出力を評価します。
ko: Future에 `.await`를 호출하면, 해당 Future가 준비될 때까지 현재 비동기 함수가 일시 중지됩니다. 그런 다음 Future가 준비가 되면, 그 값이 `.await` 구문의 값이 됩니다.
pt_br: A palavra-chave `.await`, aplicada a uma _Future_, faz com que a função assíncrona atual pause até que essa _Future_ esteja pronta, e então avalia para sua saída.
uk: Ключове слово `.await`, застосоване до `Future`, змушує поточну асинхронну функцію призупинятися, доки це `Future` не буде готове, а потім обчислює її вихідні дані.

source: The `Future` and `Poll` types are implemented exactly as shown; click the links to show the implementations in the docs.
es: Los tipos `Future` y `Polll` se implementan exactamente como se indica. Haz clic en los enlaces para mostrar las implementaciones en los documentos.
fa: تایپ‌های `Future` و `Poll` دقیقاً همانطور که نشان داده شده است اجرا می شوند. برای نمایش پیاده‌سازی‌ها در اسناد، روی لینک‌ها کلیک کنید.
ja: `Future`と`Poll`の型はまさに示されたように実装されます; ドキュメントの具体的な実装を見るにはリンクをクリックしてください。
ko: `Future` 와 `Poll` 타입의 실제 정의는 위에 보이는 그대로 입니다. 링크를 클릭하면 Rust 문서에서 한 번 더 확인할 수 있습니다.
pt_br: Os tipos `Future` e `Poll` são implementados exatamente como mostrado; clique nos links para mostrar as implementações na documentação.
uk: Типи `Future` та `Poll` реалізовано саме так, як показано на малюнку; натисніть на лінки, щоб переглянути реалізацію в документації.

source: We will not get to `Pin` and `Context`, as we will focus on writing async code, rather than building new async primitives. Briefly:
es: No trataremos `Pin` ni `Context`, ya que nos centraremos en escribir código asíncrono en lugar de compilar nuevos primitivos asíncronos. Brevemente:
fa: ما به `Pin` و `Context` نخواهیم رسید، زیرا به جای ساختن کدهای اولیه async، بر نوشتن کدهای async تمرکز خواهیم کرد. به طور خلاصه:
ja: `Pin`と`Context`については詳しくは扱いません。なぜなら、新しく非同期のプリミティブを作るよりも、非同期のコードを書くことに我々は重点を置くつもりだからです。簡潔には以下で説明されます：
ko: 본 강의의 목적은 비동기 코드를 작성하는데 있기 때문에, 새로운 비동기 프리미티브를 만드는데 필요한 `Pin`과 `Context`는 다루지 않습니다. 이들에 대해 간단히 설명하자면:
pt_br: Não chegaremos a `Pin` e `Context`, pois nos concentraremos em escrever código _async_, em vez de construir novas primitivas _async_. Brevemente:
uk: Ми не будемо переходити до `Pin` і `Context`, оскільки ми зосередимося на написанні асинхронного коду, а не на створенні нових асинхронних примітивів. Коротко:

source: `Context` allows a Future to schedule itself to be polled again when an event occurs.
es: `Context` permite que un futuro se programe a sí mismo para que se vuelva a sondear cuando se produzca un evento.
fa: ‏ `Context` به Future اجازه می‌دهد تا زمانی که رویدادی رخ می دهد، خود را برای poll مجدد برنامه‌ریزی کند.
ja: `Context`は、特定のイベントが発生した時に、Futureが自分自身を再びポーリングされるようにスケジュールすることを可能にします。
ko: `Context`를 사용하면 Future가 이벤트가 발생할 때 다시 폴링되도록 예약할 수 있습니다.
pt_br: `Context` permite que uma _Future_ agende-se para ser _polled_ novamente quando um evento ocorre.
uk: `Context` дозволяє Future запланувати повторне опитування, при настанні певної події.

source: `Pin` ensures that the Future isn't moved in memory, so that pointers into that future remain valid. This is required to allow references to remain valid after an `.await`.
es: `Pin` asegura que el futuro no se mueva en la memoria, de forma que los punteros en ese futuro siguen siendo válidos. Esto es necesario para que las referencias sigan siendo válidas después de `.await`.
fa: ‏ `Pin` تضمین می‌کند که Future در حافظه جابه‌جا نمی‌شود، بنابراین pointerهای future معتبر باقی می‌مانند. این برای اجازه دادن به referenceها برای معتبر ماندن پس از `.await` لازم است.
ja: `Pin`はfutureへのポインタが有効であり続けるために、Futureがメモリの中で移動されないことを確実にします。これは、参照が`.await`の後に有効であり続けるために必要です。
ko: 'Pin'을 사용하면 메모리에서 Future의 위치가 고정되기 때문에 해당 future의 포인터가 항상 유효하게 유지됩니다. 이는 `.await` 후에 참조를 유효한 상태로 유지하기 위해 필요합니다.
pt_br: `Pin` garante que a _Future_ não seja movida na memória, para que os ponteiros para essa _future_ permaneçam válidos. Isso é necessário para permitir que as referências permaneçam válidas após um `.await`.
uk: `Pin` гарантує, що Future не буде переміщено в пам'яті, тому покажчики на цей ф'ючерс залишатимуться дійсними. Це потрібно, щоб дозволити посиланням залишатися дійсними після `.await`.

source: A _runtime_ provides support for performing operations asynchronously (a _reactor_) and is responsible for executing futures (an _executor_). Rust does not have a "built-in" runtime, but several options are available:
es: Un _runtime_ ofrece asistencia para realizar operaciones de forma asíncrona (un _reactor_) y es responsable de ejecutar futuros (un _ejecutor_). Rust no cuenta con un tiempo de ejecución "integrado", pero hay varias opciones disponibles:
fa: یک _runtime_ برای انجام عملیات به صورت ناهمزمان از (a_reactor_) پشتیبانی می کند و مسئول اجرای futureها (an _executor_) است. Rust یک runtime داخلی ندارد، اما چندین گزینه دیگر در دسترس است:
ja: \_runtime_は非同期な演算（_reactor_）のサポートを提供し、また、futureを実行すること（_executor_）を担当しています。Rustには「ビルトイン」のランタイムはありませんが、いくつかのランタイムの選択肢があります:
ko: 비동기 _런타임_은 _리액터_ (비동기식 작업 실행을 지원)와 _실행자_ (futures를 실행)의 두 가지 역할을 합니다. Rust 언어 자체에서 기본 제공하는 비동기 런타임은 없습니다. 그러나 다음과 같은 비동기 런타임 크레잇들이 있습니다.
pt_br: Um _runtime_ fornece suporte para realizar operações de forma assíncrona (um _reator_) e é responsável por executar _futures_ (um _executor_). Rust não tem um _runtime_ "integrado", mas várias opções estão disponíveis:
uk: _Середовище виконанняe_ забезпечує підтримку асинхронного виконання операцій (_реактор_) і відповідає за виконання ф’ючерсів (_виконавець_). Rust не має "вбудованого" середовища виконання, але доступні кілька варіантів:

source: [Tokio](https://tokio.rs/): performant, with a well-developed ecosystem of functionality like [Hyper](https://hyper.rs/) for HTTP or [Tonic](https://github.com/hyperium/tonic) for gRPC.
es: [Tokio](https://tokio.rs/): eficaz, con un ecosistema bien desarrollado de funciones, como [Hyper](https://hyper.rs/) para HTTP o [Tonic](https://github.com/hyperium/tonic) para usar gRPC.
fa: ‏[Tokio](https://tokio.rs/): کارایی(performant)، با یک اکوسیستم با کارایی بالا به خوبی توسعه یافته مانند [Hyper](https://hyper.rs/) برای HTTP یا [Tonic] (https://github) .com/hyperium/tonic) برای gRPC.
pt_br: [Tokio](https://tokio.rs/): performante, com um ecossistema bem desenvolvido de funcionalidades como [Hyper](https://hyper.rs/) para HTTP ou [Tonic](https://github.com/hyperium/tonic) para gRPC.
uk: [Tokio](https://tokio.rs/): ефективний, із добре розвиненою екосистемою функціональності, наприклад [Hyper](https://hyper.rs/) для HTTP або [Tonic](https://github.com/hyperium/tonic) для gRPC.

source: [async-std](https://async.rs/): aims to be a "std for async", and includes a basic runtime in `async::task`.
es: [async-std](https://async.rs/): se trata de un "std para async" e incluye un tiempo de ejecución básico en `async::task`.
fa: ‏[async-std](https://async.rs/):: هدفش این است که یک "std for async" باشد و شامل یک runtime اولیه در `async::task` است.
pt_br: [async-std](https://async.rs/): tem como objetivo ser um "std para _async_", e inclui um _runtime_ básico em `async::task`.
uk: [async-std](https://async.rs/): прагне бути "std for async" та включає базове середовище виконання в `async::task`.
