Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: The [Microsoft Debug Adapter Protocol](https://microsoft.github.io/debug-adapter-protocol/) lets VSCode and other IDEs debug code running on any supported microcontroller.
es: [El protocolo de adaptador de depuración de Microsoft](https://microsoft.github.io/debug-adapter-protocol/) permite que VSCode y otros IDEs depuren el código que se ejecuta en cualquier microcontrolador compatible.
fa: [پروتکل آداپتور Debug مایکروسافت](https://microsoft.github.io/debug-adapter-protocol/) به VSCode و سایر IDE‌ها اجازه می‌دهد کدهای موجود در هر میکروکنترلر پشتیبانی‌شده را Debug کنند.
ja: [Microsoft Debug Adapter Protocol](https://microsoft.github.io/debug-adapter-protocol/) はVSCodeや他のIDEから、サポートされたマイクロコントローラ上で実行されているコードをデバッグすることを可能にします。
ko: [Microsoft 디버그 어댑터 프로토콜](https://microsoft.github.io/debug-adapter-protocol/)을 사용하면 VSCode나 다른 IDE 상에서 마이크로컨트롤러에서 수행중인 코드를 디버깅 할 수 있습니다.
pt_br: O [Microsoft Debug Adapter Protocol](https://microsoft.github.io/debug-adapter-protocol/) permite que o VSCode e outras IDEs depurem o código executado em qualquer microcontrolador suportado.
uk: [Протокол адаптера налагодження Microsoft](https://microsoft.github.io/debug-adapter-protocol/) дозволяє VSCode та іншим IDE налагоджувати код, запущений на будь-якому підтримуваному мікроконтролері.

source: cargo-embed is a binary built using the probe-rs library.
es: cargo-embed es un binario compilado con la biblioteca probe-rs.
fa: این cargo-embed یک باینری است که با استفاده از کتابخانه probe-rs ساخته شده است.
ja: cargo-embedはprobe-rsライブラリを利用して生成されたバイナリです。
ko: cargo-embed는 probe-rs 라이브러리를 사용하여 빌드된 바이너리입니다.
pt_br: cargo-embed é um binário construído usando a biblioteca probe-rs.
uk: cargo-embed — бінарний файл, створений за допомогою бібліотеки probe-rs.

source: RTT (Real Time Transfers) is a mechanism to transfer data between the debug host and the target through a number of ringbuffers.
es: TTR (transferencias en tiempo real) es un mecanismo para transferir datos entre el host de depuración y el objetivo a través de una serie de búferes circulares.
fa: RTT (Real Time Transfers) مکانیزمی برای انتقال داده‌ها بین debug host و target از طریق تعدادی بافر حلقه‌ای (ringbuffers) است.
ja: RTT (Real Time Transfers)はデバッグホストとターゲット間のデータを多くのリングバッファを介してやりとりするためのメカニズムです。
ko: RTT(Real Time Transfers)는 여러 링 버퍼를 통해 디버그 호스트와 타겟 간에 데이터를 전송하는 메커니즘입니다.
pt_br: RTT (Real Time Transfers) é um mecanismo para transferir dados entre o host de depuração e o destino através de um número de _ringbuffers_.
uk: RTT (Real Time Transfers) — це механізм передачі даних між хостом налагодження та налагоджуваною цільовою системою через кілька кільцевих буферів.

source: In one terminal under `src/bare-metal/microcontrollers/examples/`:
es: En un terminal en `src/bare-metal/microcontrollers/examples/`:
fa: در یک ترمینال تحت `src/bare-metal/microcontrollers/examples/`:
ja: ひとつのターミナルで、`src/bare-metal/microcontrollers/examples/`において下記を実行:
ko: `src/bare-metal/microcontrollers/examples/` 아래 하나의 터미널에서:
pt_br: Em um terminal em `src/bare-metal/microcontrollers/examples/` (exemplos):
uk: В одному терміналі в `src/bare-metal/microcontrollers/examples/`:

source: In another terminal in the same directory:
es: En otro terminal del mismo directorio:
fa: در ترمینال دیگری در همان دایرکتوری:
ja: 別のターミナルで、同じディレクトリで下記を実行:
pt_br: Em outro terminal no mesmo diretório:
uk: В іншому терміналі в тому ж каталозі:

source: On gLinux or Debian:
fa: در gLinux یا Debian:
ja: gLinuxまたはDebianの場合:
pt_br: No gLinux ou Debian:
uk: На gLinux або Debian:

source: In GDB, try running:
es: En GDB, prueba a ejecutar:
fa: در GDB، اجرا کنید:
ja: GDBで下記を実行してみてください:
ko: GDB에서 다음을 실행해 보세요.
pt_br: No GDB, tente executar:
uk: У GDB спробуйте запустити:

source: Other projects
es: Otros proyectos
fa: پروژه‌های دیگر
ja: 他のプロジェクト
ko: 다른 프로젝트
pt_br: Outros projetos
uk: Інші проекти

source: "Real-Time Interrupt-driven Concurrency"
es: "Concurrencia en tiempo real basada en interrupciones"
fa: "همراهی مبتنی بر وقفه بلادرنگ"
ja: "Real-Time Interrupt-driven Concurrency"の略
ko: "실시간 인터럽트 기반 동시 실행(Real-Time Interrupt-driven Concurrency)"
pt_br: "Concorrência controlada por interrupção em tempo real"
uk: "Параллельність, керована перериваннями в реальному часі"

source: Shared resource management, message passing, task scheduling, timer queue
es: Gestión de recursos compartidos, envío de mensajes, programación de tareas, cola del temporizador, etc.
fa: مدیریت منابع مشترک، ارسال پیام، زمان‌بندی تسک (task scheduling)، صف تایمر (timer queue)
ja: 共有リソース管理、メッセージパッシング、タスクスケジューリング、タイマキューを提供
ko: 공유 리소스 관리, 메시지 전달, 태스크 스케줄링, 타이머 대기열 지원
pt_br: Gerenciamento de recursos compartilhados, passagem de mensagens, agendamento de tarefas, fila de temporizadores
uk: Управління спільними ресурсами, передача повідомлень, планування завдань, черга таймера

source: `async` executors with priorities, timers, networking, USB
es: Ejecutores `async` con prioridades, temporizadores, redes, USB, etc.
fa: اجرا کننده‌های `async` اولویت‌دار، تایمرها، شبکه، USB
ja: 優先度付き`async` エグゼキュータ、タイマ、ネットワーク、USB
ko: 우선순위, 타이머, 네트워킹, USB가 포함된 `async` 실행자
pt_br: Executores `async` com prioridades, temporizadores, rede, USB
uk: `async` виконавці з пріоритетами, таймерами, мережею, USB

source: Security-focused RTOS with preemptive scheduling and Memory Protection Unit support
es: RTOS centrado en la seguridad con programación interrumpible y compatibilidad con la unidad de protección de memoria.
fa: RTOS متمرکز بر امنیت با برنامه‌ریزی پیشگیرانه و پشتیبانی از واحد حفاظت از حافظه
ja: セキュリティに焦点をあてたRTOSで、プリエンプティブ・スケジューリングとMemory Protection Unitをサポート
ko: 선점형 스케줄링 및 MMU를 지원하는, 보안에 중점을 둔 실시간 운영체제
pt_br: RTOS focado em segurança com agendamento preemptivo e suporte a Unidade de Proteção de Memória
uk: Орієнтована на безпеку RTOS з випереджальним плануванням і підтримкою модуля захисту пам’яті

source: Microkernel RTOS from Oxide Computer Company with memory protection, unprivileged drivers, IPC
es: RTOS de microkernel de Oxide Computer Company con protección de memoria, controladores sin privilegios, IPC, etc.
fa: یک Microkernel RTOS از شرکت Oxide Computer با protection از حافظه، درایورهای غیرمجاز و IPC
ja: Oxide Computer CompanyによるマイクロカーネルのRTOSでメモリ保護、非特権ドライバ、IPCを提供
ko: Oxide Computer Company에서 만든 마이크로커널 기반 실시간 운영체제로, 메모리 보호, 권한이 없이 수행되는 드라이버 등을 지원함.
pt_br: RTOS de microkernel da Oxide Computer Company com proteção de memória, drivers não privilegiados, IPC
uk: Мікроядерна RTOS від Oxide Computer Company із захистом пам'яті, непривілейованими драйверами, IPC

source: [Bindings for FreeRTOS](https://github.com/lobaro/FreeRTOS-rust)
es: [Enlaces para FreeRTOS](https://github.com/lobaro/FreeRTOS-rust)
ja: [FreeRTOSに対するRustバインディング](https://github.com/lobaro/FreeRTOS-rust)
ko: [FreeRTOS용 바인딩](https://github.com/lobaro/FreeRTOS-rust)
pt_br: [Bindings para FreeRTOS](https://github.com/lobaro/FreeRTOS-rust)
uk: [Прив’язки для FreeRTOS](https://github.com/lobaro/FreeRTOS-rust)

source: Some platforms have `std` implementations, e.g. [esp-idf](https://esp-rs.github.io/book/overview/using-the-standard-library.html).
es: Algunas plataformas tienen implementaciones `std`, como [esp-idf](https://esp-rs.github.io/book/overview/using-the-standard-library.html).
fa: برخی از پلتفرم‌ها پیاده‌سازی `std` دارند، به عنوان مثال. [esp-idf](https://esp-rs.github.io/book/overview/using-the-standard-library.html).
ja: いくつかのプラットフォームでは `std`の実装あり、例えば [esp-idf](https://esp-rs.github.io/book/overview/using-the-standard-library.html)。
ko: `std`가 구현된 플랫폼도 있습니다(예: [esp-idf](https://esp-rs.github.io/book/overview/using-the-standard-library.html)).
pt_br: Algumas plataformas têm implementações `std`, por exemplo, [esp-idf](https://esp-rs.github.io/book/overview/using-the-standard-library.html).
uk: Деякі платформи мають реалізацію `std`, наприклад [esp-idf](https://esp-rs.github.io/book/overview/using-the-standard-library.html).

source: RTIC can be considered either an RTOS or a concurrency framework.
es: RTIC se puede considerar un RTOS o un framework de concurrencia.
fa: RTIC را می‌توان یک RTOS یا یک چارچوب همزمان (concurrency framework) در نظر گرفت.
ja: RTICはRTOSとして捉えることもできますし、並行実行のフレームワークとして捉えることもできます。
ko: RTIC는 실시간 운영체제로 볼 수도 있고, 동시성 지원을 위한 프레임워크로 볼 수도 있습니다.
pt_br: O RTIC pode ser considerado um RTOS ou um framework de concorrência.
uk: RTIC можна вважати або RTOS, або фреймворком паралельного виконання.

source: It doesn't include any HALs.
es: No incluye ningún HAL.
fa: این شامل هیچ HAL نیست.
ja: 他のHALを全く含んでいません。
ko: HAL을 포함하지는 않습니다.
pt_br: Não inclui nenhum HAL.
uk: Він не містить HAL.

source: It uses the Cortex-M NVIC (Nested Virtual Interrupt Controller) for scheduling rather than a proper kernel.
es: Usa el NVIC (controlador de interrupción virtual anidado) Cortex‐M para la programación en lugar de un kernel propio.
fa: از Cortex-M NVIC (کنترل‌کننده وقفه مجازی تودرتو-Nested Virtual Interrupt Controller) برای زمان‌بندی به جای یک هسته مناسب استفاده می‌کند.
ja: スケジューリングはカーネルではなく、Cortex-M NVIC (Nested Virtual Interrupt Controller)を利用して行います。
ko: 스케줄링은 커널이 아니라 Cortex-M NVIC(Nested Virtual Interrupt Controller)로 구현이 됩니다.
pt_br: Ele usa o NVIC (Nested Virtual Interrupt Controller) Cortex-M para agendamento em vez de um kernel adequado.
uk: Він використовує Cortex-M NVIC (вкладений віртуальний контролер переривань) для планування, а не належне ядро.

source: Cortex-M only.
es: Solo Cortex-M.
fa: Cortex-M فقط.
ja: Cortex-Mのみの対応です。
ko: Cortex-M 전용입니다.
pt_br: Apenas Cortex-M.
uk: Тільки Cortex-M.

source: Google uses TockOS on the Haven microcontroller for Titan security keys.
es: Google utiliza TockOS en el microcontrolador Haven para las llaves de seguridad Titan.
fa: گوگل از TockOS در میکروکنترلر Haven برای کلیدهای امنیتی Titan استفاده می‌کند.
ja: GoogleはTockOSをTitanセキュリティキーのHavenマイクロコントローラで利用しています。
ko: Google에서는 Titan 보안 키에 사용되는 Haven 마이크로컨트롤러에서 TockOS를 사용합니다.
pt_br: O Google usa o TockOS no microcontrolador Haven para chaves de segurança Titan.
uk: Google використовує TockOS на мікроконтролері Haven для ключів безпеки Titan.

source: FreeRTOS is mostly written in C, but there are Rust bindings for writing applications.
es: FreeRTOS está escrito principalmente en C, pero hay enlaces de Rust para aplicaciones de escritura.
fa: در واقع FreeRTOS بیشتر به زبان C نوشته شده است، اما رابط‌های Rust برای نوشتن برنامه‌ها در این حالت وجود دارد.
ja: FreeRTOS はほとんどCで書かれていますが、アプリケーションを開発するためのRustバインディングが存在します。
ko: FreeRTOS는 대부분 C로 작성되지만, 애플리케이션을 Rust로 작성할 수 있도록 해 주는 Rust 바인딩이 제공됩니다.
pt_br: O FreeRTOS é escrito principalmente em C, mas existem _bindings_ Rust para escrever aplicativos.
uk: FreeRTOS здебільшого написаний на C, але є прив’язки Rust для написання програм.

source: We will read the direction from an I2C compass, and log the readings to a serial port.
es: Leeremos la dirección desde una brújula I2C, y registraremos las lecturas en un puerto serie.
fa: ما جهت را از قطب‌نمای I2C می‌خوانیم و خوانش‌ها را در یک پورت سریال ثبت می‌کنیم.
ja: I2C接続のコンパスから方位を読み取り、その結果をシリアルポートに出力します。
pt_br: Leremos a direção de uma bússola I2C e registraremos as leituras em uma porta serial.
uk: Ми прочитаємо напрямок із компаса I2C і запишемо показання до послідовного порту.

source: After looking at the exercises, you can look at the [solutions](solutions-morning.md) provided.
es: Después de realizar los ejercicios, puedes consultar las [soluciones](solutions-morning.md) correspondientes.
fa: پس از دیدن تمرین‌ها، می‌توانید به [راه حل‌ها] (solutions-morning.md) ارائه شده نگاه کنید.
ja: 練習問題に取り組んだあとは、 [解答](solutions-morning.md)をみても構いません。
pt_br: Depois de ver os exercícios, você pode ver as [soluções](solutions-morning.md) fornecidas.
uk: Переглянувши вправи, ви можете переглянути надані [рішення](solutions-morning.md).

source: We will read the direction from an I2C compass, and log the readings to a serial port. If you have time, try displaying it on the LEDs somehow too, or use the buttons somehow.
es: Leeremos la dirección desde una brújula I2C, y registraremos las lecturas en un puerto serie. Si tienes tiempo, prueba a mostrarlo también en los LED o usa los botones de alguna forma.
fa: ما جهت را از قطب‌نمای I2C می خوانیم و خوانش‌ها را در یک پورت سریال ثبت می‌کنیم. اگر وقت دارید، سعی کنید آن را به نحوی روی LED‌ها نیز نمایش دهید یا به نوعی از دکمه‌ها استفاده کنید.
ja: I2C接続のコンパスから方位を読み取り、その結果をシリアルポートに出力します。もし時間があれば、LEDやボタンをなんとか利用して方位を出力してみてください。
pt_br: Leremos a direção de uma bússola I2C e registraremos as leituras em uma porta serial. Se você tiver tempo, tente exibi-lo nos LEDs de alguma forma também, ou use os botões de alguma forma.
uk: Ми прочитаємо напрямок із компаса I2C і запишемо показання до послідовного порту. Якщо у вас є час, спробуйте ще якось відобразити його на світлодіодах або якось кнопками.

source: Hints:
es: Sugerencias:
fa: نکته‌ها:
ja: ヒント:
pt_br: Dicas:
uk: Підказки:

source: Check the documentation for the [`lsm303agr`](https://docs.rs/lsm303agr/latest/lsm303agr/) and [`microbit-v2`](https://docs.rs/microbit-v2/latest/microbit/) crates, as well as the [micro:bit hardware](https://tech.microbit.org/hardware/).
es: Consulta la documentación sobre los crates [`lsm303agr`](https://docs.rs/lsm303agr/latest/lsm303agr/) y [`microbit-v2`](https://docs.rs/microbit-v2/latest/microbit/), así como [el hardware de micro:bit](https://tech.microbit.org/hardware/).
fa: مستندات [`lsm303agr`](https://docs.rs/lsm303agr/latest/lsm303agr/) و [`microbit-v2`](https://docs.rs/microbit-v2/latest/microbit/) به همراه crateهای آن را بررسی کنید همانطور که [micro:bit hardware](https://tech.microbit.org/hardware/) را بررسی می‌کنید.
ja: [`lsm303agr`](https://docs.rs/lsm303agr/latest/lsm303agr/) クレートと [`microbit-v2`](https://docs.rs/microbit-v2/latest/microbit/)クレートのドキュメント、ならびに[micro:bitハードウェア仕様](https://tech.microbit.org/hardware/)を確認してみてください。
pt_br: Verifique a documentação dos _crates_ [`lsm303agr`](https://docs.rs/lsm303agr/latest/lsm303agr/) e [`microbit-v2`](https://docs.rs/microbit-v2/latest/microbit/), bem como o [hardware micro:bit](https://tech.microbit.org/hardware/).
uk: Перегляньте документацію для [`lsm303agr`](https://docs.rs/lsm303agr/latest/lsm303agr/) і [`microbit-v2`](https://docs.rs/microbit-v2/latest/microbit /) крейтів, а також [micro:bit hardware](https://tech.microbit.org/hardware/).

source: The LSM303AGR Inertial Measurement Unit is connected to the internal I2C bus.
es: La unidad de medición inercial LSM303AGR está conectada al bus I2C interno.
fa: واحد اندازه‌گیری اینرسی در قطعه LSM303AGR به bus داخلی I2C متصل است.
ja: LSM303AGR慣性計測器は内部のI2Cバスに接続されています。
pt_br: A Unidade de Medição Inercial LSM303AGR está conectada ao barramento I2C interno.
uk: Інерційний вимірювальний блок LSM303AGR підключено до внутрішньої шини I2C.

source: TWI is another name for I2C, so the I2C master peripheral is called TWIM.
es: TWI es otro nombre para I2C, por lo que el periférico I2C maestro se llama TWIM.
fa: TWI نام دیگری برای I2C است، بنابراین دستگاه جانبی اصلی I2C TWIM نامیده می‌شود.
ja: TWIはI2Cの別名なので、I2CマスタはTWIMという名前になっています。
pt_br: TWI é outro nome para I2C, portanto, o periférico mestre I2C é chamado de TWIM.
uk: TWI — це інша назва I2C, тому головний периферійний пристрій I2C називається TWIM.

source: The LSM303AGR driver needs something implementing the `embedded_hal::i2c::I2c` trait. The [`microbit::hal::Twim`](https://docs.rs/microbit-v2/latest/microbit/hal/struct.Twim.html) struct implements this.
fa: درایور LSM303AGR به چیزی نیاز دارد که ویژگی `embedded_hal::i2c::I2c` را اجرا کند. ساختار[`microbit::hal::Twim`](https://docs.rs/microbit-v2/latest/microbit/hal/struct.Twim.html) این مورد را پیاده‌سازی می‌کند.
uk: Драйверу LSM303AGR потрібно щось, що реалізує трейт `embedded_hal::i2c::I2c`. Структура [`microbit::hal::Twim`](https://docs.rs/microbit-v2/latest/microbit/hal/struct.Twim.html) реалізує це.

source: You have a [`microbit::Board`](https://docs.rs/microbit-v2/latest/microbit/struct.Board.html) struct with fields for the various pins and peripherals.
es: Tienes una estructura [`microbit::Board`](https://docs.rs/microbit-v2/latest/microbit/struct.Board.html) con campos para los distintos pines y periféricos.
fa: شما یک ساختار ['microbit::Board'](https://docs.rs/microbit-v2/latest/microbit/struct.Board.html) با فیلدهایی برای پین‌ها و تجهیزات جانبی مختلف دارید.
ja: 様々なピンや周辺I/Oのための [`microbit::Board`](https://docs.rs/microbit-v2/latest/microbit/struct.Board.html)という構造体があります。
pt_br: Você tem uma estrutura [`microbit::Board`](https://docs.rs/microbit-v2/latest/microbit/struct.Board.html) com campos para os vários pinos e periféricos.
uk: У вас є структура [`microbit::Board`](https://docs.rs/microbit-v2/latest/microbit/struct.Board.html) з полями для різних контактів і периферійних пристроїв.

source: You can also look at the [nRF52833 datasheet](https://infocenter.nordicsemi.com/pdf/nRF52833_PS_v1.5.pdf) if you want, but it shouldn't be necessary for this exercise.
es: También puedes consultar la \[hoja de datos nRF52833\][nRF52833 datasheet](https://infocenter.nordicsemi.com/pdf/nRF52833_PS_v1.5.pdf) si quieres, pero no debería ser necesario para este ejercicio.
fa: در صورت تمایل می‌توانید به [nRF52833 datasheet](https://infocenter.nordicsemi.com/pdf/nRF52833_PS_v1.5.pdf) نیز نگاه کنید، اما برای این تمرین لازم نیست.
ja: [nRF52833データシート](https://infocenter.nordicsemi.com/pdf/nRF52833_PS_v1.5.pdf)を見ることもできますが、この練習問題のためには必要ないはずです。
pt_br: Você também pode olhar a [datasheet nRF52833](https://infocenter.nordicsemi.com/pdf/nRF52833_PS_v1.5.pdf) se quiser, mas não deve ser necessário para este exercício.
uk: Ви також можете переглянути [технічну таблицю nRF52833](https://infocenter.nordicsemi.com/pdf/nRF52833_PS_v1.5.pdf), якщо хочете, але це не обов’язково для цієї вправи.

source: Download the [exercise template](../../comprehensive-rust-exercises.zip) and look in the `compass` directory for the following files.
es: Descarga la [plantilla de ejercicio](../../comprehensive-rust-exercises.zip) y busca los siguientes archivos en el directorio `compass`.
fa: این [الگوی تمرین](../../comprehensive-rust-exercises.zip) را دانلود کنید و فایل‌های زیر را در دایرکتوری `compass` جستجو کنید.
ja: [練習問題のテンプレート](../../comprehensive-rust-exercises.zip) をダウンロードして、`compass`というディレクトリの中にある下記のファイルを見てください。
pt_br: Baixe o [modelo de exercício](../../comprehensive-rust-exercises.zip) e procure os seguintes arquivos no diretório `compass`.
uk: Завантажте [шаблон вправи](../../comprehensive-rust-exercises.zip) і знайдіть у каталозі `compass` наступні файли.

source: _Cargo.toml_ (you shouldn't need to change this):
fa: _Cargo.toml_ (نیاز به تغییر ندارد):
ja: _Cargo.toml_ (変更は不要なはずです):
pt_br: _Cargo.toml_ (você não deve precisar alterar isso):
uk: _Cargo.toml_ (це не потрібно змінювати):

source: _Embed.toml_ (you shouldn't need to change this):
fa: _Embed.toml_ (نیازی به تغییر این نیست):
ja: _Embed.toml_ (変更は不要なはずです):
pt_br: _Embed.toml_ (você não deve precisar alterar isso):
uk: _Embed.toml_ (це не потрібно змінювати):

source: _.cargo/config.toml_ (you shouldn't need to change this):
ja: _.cargo/config.toml_ (変更は不要なはずです):
pt_br: _.cargo/config.toml_ (você não deve precisar alterar isso):
uk: _.cargo/config.toml_ (це не потрібно змінювати):

source: See the serial output on Linux with:
es: Consulta la salida de serie en Linux con:
fa: مشاهده خروجی سریال در لینوکس با:
ja: Linuxではシリアルポート出力を下記のコマンドで確認します:
pt_br: Veja a saída serial no Linux com:
uk: Перегляньте послідовний вивід у Linux за допомогою:

source: Or on Mac OS something like (the device name may be slightly different):
es: En Mac OS debería ser algo como lo siguiente (el nombre del dispositivo puede ser algo diferente):
fa: یا در سیستم‌عامل Mac چیزی شبیه به (نام دستگاه ممکن است کمی متفاوت باشد):
ja: Mac OSではこんな感じになります（デバイス名が少し違うかもしれません）:
pt_br: Ou no Mac OS algo como (o nome do dispositivo pode ser um pouco diferente):
uk: Або в Mac OS щось на зразок (назва пристрою може трохи відрізнятися):

source: Use Ctrl+A Ctrl+Q to quit picocom.
es: Pulsa Ctrl+A Ctrl+Q para salir de Picocom.
fa: برای خروج از picocom از Ctrl+A و Ctrl+Q استفاده کنید.
ja: Ctrl+A Ctrl+Q でpicocomを終了します。
pt_br: Use `Ctrl+A Ctrl+Q` para sair do picocom.
uk: Використовуйте Ctrl+A Ctrl+Q, щоб вийти з picocom.

source: Bare Metal Rust Morning Exercise
es: Rust Bare Metal: Ejercicio de la Mañana
fa: تمرین صبحگاهی Bare Metal Rust
pt_br: Exercício da manhã de Rust Bare Metal
uk: Ранкова зарядка Bare Metal Rust

source: ([back to exercise](compass.md))
es: ([volver al ejercicio](compass.md))
pt_br: ([voltar ao exercício](compass.md))
uk: ([назад до вправи](compass.md))

source: // Configure serial port.
pt_br: // Configure a porta serial.
uk: // Налаштувати послідовний порт.

source: // Use the system timer as a delay provider.
uk: // Використовувати системний таймер як джерело затримки.

source: // Set up the I2C controller and Inertial Measurement Unit.
pt_br: // Configure o controlador I2C e a Unidade de Medição Inercial.
uk: // Налаштувати контролер I2C та блок інерційних вимірювань.

source: "Setting up IMU..."
fa: "راه اندازی IMU..."
pt_br: "Configurando IMU..."
uk: "Налаштування IMU..."

source: // Set up display and timer.
pt_br: // Configure o display e o timer.
uk: // Налаштувати дисплей і таймер.

source: "Ready."
fa: "آماده."
pt_br: "Pronto."
uk: "Готовий."

source: // Read compass data and log it to the serial port.
pt_br: // Leia os dados da bússola e registre-os na porta serial.
uk: // Зчитати дані компаса і записати їх у послідовний порт.

source: // If button A is pressed, switch to the next mode and briefly blink all LEDs // on.
pt_br: // Se o botão A for pressionado, alterne para o próximo modo e pisque rapidamente todos os LEDs // ligado.
uk: // Якщо натиснута кнопка A, перейти в наступний режим і короткочасно // увімкнути всі світлодіоди.

source: Application processors
es: Procesadores de aplicaciones
ja: アプリケーションプロセッサ
ko: 애플리케이션 프로세서
pt_br: Processadores de aplicações
uk: Прикладні процесори

source: So far we've talked about microcontrollers, such as the Arm Cortex-M series. Now let's try writing something for Cortex-A. For simplicity we'll just work with QEMU's aarch64 ['virt'](https://qemu-project.gitlab.io/qemu/system/arm/virt.html) board.
es: Hasta ahora hemos hablado de microcontroladores, como la serie Cortex‐M de Arm. Ahora vamos a probar a escribir algo para Cortex-A. Para simplificar, solo trabajaremos con la placa ['virt'](https://qemu-project.gitlab.io/qemu/system/arm/virt.html) aarch64 de QEMU.
fa: تا اینجا در مورد میکروکنترلرهایی مانند سری Arm Cortex-M صحبت کردیم. حالا بیایید سعی کنیم چیزی برای Cortex-A بنویسیم. برای سادگی، ما فقط با بردQEMU's aarch64 ['virt'](https://qemu-project.gitlab.io/qemu/system/arm/virt.html) کار می‌کنیم.
ja: ここまではArm Cortex-Mシリーズのようなマイクロコントローラについて見てきました。今度はCortex-Aを対象として何かを書いてみましょう。簡単化のために、ここでは（本物のハードウェアではなく）QEMUのaarch64 ['virt'](https://qemu-project.gitlab.io/qemu/system/arm/virt.html)ボードを利用します。
ko: 지금까지 Arm Cortex-M 시리즈와 같은 마이크로컨트롤러에 관해 알아봤습니다. 이제 애플리케이션 프로세서인 Cortex-A를 위한 코드를 작성해 보겠습니다. 편의상 QEMU의 aarch64 ['virt'](https://qemu-project.gitlab.io/qemu/system/arm/virt.html) 보드를 사용합니다.
pt_br: Até agora, falamos sobre microcontroladores, como a série Arm Cortex-M. Agora vamos tentar escrever algo para Cortex-A. Para simplificar, vamos trabalhar apenas com a placa ['virt'](https://qemu-project.gitlab.io/qemu/system/arm/virt.html) aarch64 do QEMU.
uk: Досі ми говорили про мікроконтролери, такі як серія Arm Cortex-M. Тепер давайте спробуємо написати щось для Cortex-A. Для простоти ми просто працюватимемо з платою QEMU aarch64 ['virt'](https://qemu-project.gitlab.io/qemu/system/arm/virt.html).
