Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: // Layout according to the Linux man page for readdir(3), where ino_t and // off_t are resolved according to the definitions in // /usr/include/x86_64-linux-gnu/{sys/types.h, bits/typesizes.h}.
ja: // readdir(3) の Linux マニュアル ページに沿ったレイアウト。ino_t と // off_t は // /usr/include/x86_64-linux-gnu/{sys/types.h, bits/typesizes.h} の定義に従って解決されます。
pt_br: // Layout de acordo com a página man do Linux para readdir(3), onde ino_t e // off_t são resolvidos de acordo com as definições em // /usr/include/x86_64-linux-gnu/{sys/types.h, bits/typesizes.h}.
uk: // Розміщення відповідно до man-сторінки Linux для readdir(3), де ino_t та // off_t розгорнуто відповідно до визначень у // /usr/include/x86_64-linux-gnu/{sys/types.h, bits/typesizes.h}.

source: // Layout according to the macOS man page for dir(5).
ja: // macOSマニュアル ページのdir(5)に沿ったレイアウト。
pt_br: // Layout de acordo com a página man do macOS man page para dir(5).
uk: // Розміщення відповідно до man-сторінки macOS для dir(5).

source: // See https://github.com/rust-lang/libc/issues/414 and the section on // _DARWIN_FEATURE_64_BIT_INODE in the macOS man page for stat(2). // // "Platforms that existed before these updates were available" refers // to macOS (as opposed to iOS / wearOS / etc.) on Intel and PowerPC.
ja: // https://github.com/rust-lang/libc/issues/414、および macOS 版マニュアル ページのstat(2)における // _DARWIN_FEATURE_64_BIT_INODE に関するセクションをご覧ください。 // // 「これらのアップデートが利用可能になる前に存在していたプラットフォーム("Platforms that existed before these updates were available")」とは、 // Intel および PowerPC 上の macOS（iOS / wearOS などではない）を指します。
pt_br: // Veja https://github.com/rust-lang/libc/issues/414 e a seção sobre // _DARWIN_FEATURE_64_BIT_INODE na página man do macOS para stat(2). // // "Plataformas que existiram antes destas atualizações estarem disponíveis" refere-se // ao macOS (ao contrário do iOS / wearOS / etc.) em Intel e PowerPC.
uk: // Дивіться https://github.com/rust-lang/libc/issues/414 та розділ про // _DARWIN_FEATURE_64_BIT_INODE у man-сторінці macOS про stat(2). // // "Платформи, які існували до виходу цих оновлень" відносяться // до macOS (на відміну від iOS / wearOS / тощо) на Intel і PowerPC.

source: // Call opendir and return a Ok value if that worked, // otherwise return Err with a message.
ja: // opendir を呼び出し、成功した場合は Ok 値を返し、 // それ以外の場合はメッセージとともに Err を返します。
pt_br: // Chama opendir e retorna um valor Ok se funcionar, // ou retorna Err com uma mensagem.
uk: // Викликати opendir і повернути значення Ok, якщо це спрацювало, // інакше повернути Err з повідомленням.

source: // Keep calling readdir until we get a NULL pointer back.
ja: // NULL ポインタが返されるまで readdir を呼び出し続けます。
pt_br: // Continua chamando readdir até nós obtermos um ponteiro NULL de volta.
uk: // Продовжуємо викликати readdir до тих пір, поки не отримаємо назад вказівник NULL.

source: // Call closedir as needed.
ja: // 必要に応じて closedir を呼び出します。
pt_br: // Chama closedir se necessário.
uk: // Викликати closedir за необхідністю.

source: "files: {:#?}"
uk: "файли: {:#?}"

source: "Invalid path: {err}"
fa: "مسیر نامعتبر: {err}"
uk: "Неправильний путь: {err}"

source: // SAFETY: path.as_ptr() cannot be NULL.
ja: // SAFETY: path.as_ptr()がNULLであることはありません。
pt_br: // SEGURANÇA: path.as_ptr() não pode ser NULL.
uk: // БЕЗПЕКА: path.as_ptr() не може бути NULL.

source: "Could not open {:?}"
fa: "نمی‌توان {:?} را باز کرد"
pt_br: "Não foi possível abrir {:?}"
uk: "Не вдалося відкрити {:?}"

source: // Keep calling readdir until we get a NULL pointer back. // SAFETY: self.dir is never NULL.
ja: // NULL ポインタが返されるまで readdir を呼び出し続けます。 // SAFETY: self.dir は決して NULL になりません。
pt_br: // Continua chamando readdir até nós obtermos um ponteiro NULL de volta. // SEGURANÇA: self.dir nunca é NULL.
uk: // Продовжуємо викликати readdir, доки не отримаємо назад вказівник NULL. // БЕЗПЕКА: self.dir ніколи не є NULL.

source: // We have reached the end of the directory.
ja: // ディレクトリの最後に到達しました。
pt_br: // Chegamos ao final do diretório.
uk: // Ми досягли кінця директорії.

source: // SAFETY: dirent is not NULL and dirent.d_name is NUL // terminated.
ja: // 安全: dirent は NULL ではなく、dirent.d_name は NUL // 文字終端されています。
pt_br: // SEGURANÇA: dirent não é NULL e dirent.d_name é terminado em NUL
uk: // БЕЗПЕКА: dirent не є NULL і dirent.d_name є NULL // завершено.

source: // SAFETY: self.dir is not NULL.
ja: // 安全: self.dir は NULL ではありません。
pt_br: // SEGURANÇA: self.dir não é NULL.
uk: // БЕЗПЕКА: self.dir не є NULL.

source: "Could not close {:?}"
fa: "نمی‌توان {:?} را ببندد"
pt_br: "Não foi possível fechar {:?}"
uk: "Не вдалося закрити {:?}"

source: "Non UTF-8 character in path"
fa: "نویسه غیر UTF-8 در مسیر"
pt_br: "Caracter não UTF-8 no caminho"
uk: "Не UTF-8 символ у путі"

source: Welcome to Rust in Android
es: Te Damos la Bienvenida a Rust en Android
fa: به Rust در Android خوش‌آمدید
ja: Android での Rust へようこそ
pt_br: Bem-vindo ao Rust para Android
uk: Ласкаво просимо до Rust в Android

source: Rust is supported for system software on Android. This means that you can write new services, libraries, drivers or even firmware in Rust (or improve existing code as needed).
fa: ‏ Rust برای system software در اندروید پشتیبانی می‌شود. این بدان معناست که می توانید سرویس‌ها، کتابخانه‌‌ها، درایورها یا حتی سیستم‌عامل جدید را در Rust بنویسید (یا در صورت نیاز کدهای موجود را بهبود ببخشید).
ja: Rust は Android のシステム ソフトウェアでサポートされています。つまり、新しいサービス、ライブラリ、ドライバ、さらにはファームウェアを Rust で作成できます（または、必要に応じて既存のコードを改善できます）。
pt_br: O Rust é suportado para software de sistema no Android. Isso significa que você pode escrever novos serviços, bibliotecas, drivers ou até mesmo firmware em Rust (ou melhorar o código existente conforme necessário).
uk: Rust підтримується для системного програмного забезпечення на Android. Це означає, що ви можете писати нові сервіси, бібліотеки, драйвери або навіть прошивки на Rust (або покращувати існуючий код за потреби).

source: We will attempt to call Rust from one of your own projects today. So try to find a little corner of your code base where we can move some lines of code to Rust. The fewer dependencies and "exotic" types the better. Something that parses some raw bytes would be ideal.
es: Hoy intentaremos llamar a Rust desde un proyecto personal. Intenta encontrar una pequeña esquina de tu código base donde podamos mover algunas líneas de código a Rust. Cuantas menos dependencias y tipos "exóticos" tenga, mejor. Lo ideal sería algo que analizara bytes sin procesar.
fa: ما امروز سعی خواهیم کرد Rust را از یکی از پروژه‌های خودتان فراخوانی کنیم. بنابراین سعی کنید گوشه کوچکی از پایه کد خود را پیدا کنید تا بتوانیم برخی از خطوط کد را به Rust منتقل کنیم. هر چه وابستگی‌ها و انواع "exotic" کمتر باشد برای ما بهتر است. چیزی که برخی از بایت‌های خام را تجزیه کند ایده آل خواهد بود.
ja: 本日は、皆さんのプロジェクトの一つから Rust を呼び出してみたいと思います。コードベースの小さな隅を見つけて、数行のコードを Rust に書き換えてみましょう。依存関係が少なく、「珍しい」型がよいでしょう。未加工のバイトを解析するものが理想的です。
ko: 우리는 오늘 여러분의 프로젝트에서 러스트 코드를 호출해볼 것입니다. 그 프로젝트에서 러스트로 옮길만 한 작은 부분을 정하세요. 의존성이 적고 "특이한" 타입이 적을 수록 좋습니다. 바이트 몇 개를 파싱하는 코드라면 완벽합니다.
pt_br: Hoje tentaremos chamar Rust a partir de um de seus próprios projetos. Então tente encontrar um cantinho da sua base de código onde podemos mover algumas linhas de código para o Rust. Quanto menos dependências e tipos "exóticos", melhor. Algo que analise alguns bytes brutos seria o ideal.
uk: Сьогодні ми спробуємо викликати Rust з одного з ваших проектів. Тож спробуйте знайти маленький куточок вашої кодової бази, куди ми можемо перенести кілька рядків коду в Rust. Чим менше залежностей і "екзотичних" типів, тим краще. Щось, що аналізує деякі необроблені байти, було б ідеальним.

source: The speaker may mention any of the following given the increased use of Rust in Android:
fa: با‌توجه‌به افزایش استفاده از Rust در اندروید، سخنران ممکن است به یکی از موارد زیر اشاره کند:
ja: Android で Rust が使用されることが増えているため、次のいずれかに言及することをおすすめします。
pt_br: O instrutor pode mencionar qualquer um dos seguintes, dada a crescente utilização do Rust no Android:
uk: Доповідач може згадати будь-яку з наступних тем, враховуючи зростаюче використання Rust в Android:

source: Service example: [DNS over HTTP](https://security.googleblog.com/2022/07/dns-over-http3-in-android.html)
fa: ‏ مثال سرویس: [DNS over HTTP](https://security.googleblog.com/2022/07/dns-over-http3-in-android.html)
ja: サービスの例: [DNS over HTTP](https://security.googleblog.com/2022/07/dns-over-http3-in-android.html)
pt_br: Exemplo de serviço: [DNS sobre HTTP](https://security.googleblog.com/2022/07/dns-over-http3-in-android.html)
uk: Приклад сервісу: [DNS через HTTP](https://security.googleblog.com/2022/07/dns-over-http3-in-android.html)

source: Libraries: [Rutabaga Virtual Graphics Interface](https://crosvm.dev/book/appendix/rutabaga_gfx.html)
fa: کتابخانه‌ها: [Rutabaga Virtual Graphics Interface]‌(https://crosvm.dev/book/appendix/rutabaga_gfx.html)
ja: ライブラリ: [Rutabaga Virtual Graphics Interface](https://crosvm.dev/book/appendix/rutabaga_gfx.html)
pt_br: Bibliotecas: [Interface Gráfica Virtual Rutabaga](https://crosvm.dev/book/appendix/rutabaga_gfx.html)
uk: Бібліотеки: [Rutabaga Virtual Graphics Interface](https://crosvm.dev/book/appendix/rutabaga_gfx.html)

source: Kernel Drivers: [Binder](https://lore.kernel.org/rust-for-linux/20231101-rust-binder-v1-0-08ba9197f637@google.com/)
ja: カーネル ドライバ: [Binder](https://lore.kernel.org/rust-for-linux/20231101-rust-binder-v1-0-08ba9197f637@google.com/)
pt_br: Drivers de kernel: [Binder](https://lore.kernel.org/rust-for-linux/20231101-rust-binder-v1-0-08ba9197f637@google.com/)
uk: Драйвери ядра: [Binder](https://lore.kernel.org/rust-for-linux/20231101-rust-binder-v1-0-08ba9197f637@google.com/)

source: Firmware: [pKVM firmware](https://security.googleblog.com/2023/10/bare-metal-rust-in-android.html)
ja: ファームウェア: [pKVM ファームウェア](https://security.googleblog.com/2023/10/bare-metal-rust-in-android.html)
pt_br: Firmware: [firmware pKVM](https://security.googleblog.com/2023/10/bare-metal-rust-in-android.html)
uk: Прошивка: [прошивка pKVM](https://security.googleblog.com/2023/10/bare-metal-rust-in-android.html)

source: We will be using a Cuttlefish Android Virtual Device to test our code. Make sure you have access to one or create a new one with:
fa: ما از یک دستگاه Cuttlefish Android Virtual برای آزمایش کد خود استفاده خواهیم کرد. مطمئن شوید که به یکی از آنها دسترسی دارید یا یک مورد جدید ایجاد کنید:
ja: コードのテストのためにCuttlefish Android Virtual Device を使用します。既存のDeviceがあればそれにアクセスできることを確認し、そうでなければ以下のコマンドにより作成しておいてください。
pt_br: Usaremos um Dispositivo Virtual Android Cuttlefish para testar nosso código. Certifique-se de ter acesso a um ou crie um novo com:
uk: Для тестування нашого коду ми будемо використовувати Cuttlefish Android Virtual Device. Переконайтеся, що у вас є доступ до нього або створіть новий:

source: Please see the [Android Developer Codelab](https://source.android.com/docs/setup/start) for details.
es: Consulta el [Codelab para desarrolladores de Android](https://source.android.com/docs/setup/start) para obtener más información.
fa: لطفاً برای جزئیات به [Android Developer Codelab]‌(https://source.android.com/docs/setup/start) مراجعه کنید.
ja: 詳しくは、[Android デベロッパー Codelab](https://source.android.com/docs/setup/start) をご覧ください。
ko: 자세한 내용은 [Android Developer Codelab](https://source.android.com/docs/setup/start)을 참조하십시오.
pt_br: Consulte o [Codelab para Desenvolvedor Android](https://source.android.com/docs/setup/start) para maiores detalhes.
uk: Докладнішу інформацію можна знайти в [Android Developer Codelab](https://source.android.com/docs/setup/start).

source: Cuttlefish is a reference Android device designed to work on generic Linux desktops. MacOS support is also planned.
fa: ‏ Cuttlefish یک Android device مرجع است که برای کار بر روی دسکتاپ های لینوکس عمومی طراحی شده است. پشتیبانی از MacOS نیز برنامه‌ریزی شده است.
ja: Cuttlefish は、一般的な Linux デスクトップで動作するように設計されたリファレンス Android デバイスです。macOS のサポートも予定されています。
pt_br: Cuttlefish é um dispositivo Android de referência projetado para funcionar em desktops Linux genéricos. O suporte ao MacOS também está planejado.
uk: Cuttlefish - це еталонний пристрій Android, призначений для роботи на типових робочих столах Linux. Також планується підтримка MacOS.

source: The Cuttlefish system image maintains high fidelity to real devices, and is the ideal emulator to run many Rust use cases.
fa: این Cuttlefish system image تعهد بالایی به دستگاه‌های واقعی دارد و شبیه‌ساز ایده آل برای اجرای بسیاری از موارد استفاده از Rust است.
ja: Cuttlefish システム イメージは、実際のデバイスに対する高い忠実度を維持しているため、多くの Rust ユースケースを実行するのに理想的なエミュレータです。
pt_br: A imagem do sistema Cuttlefish mantém alta fidelidade aos dispositivos reais, e é o emulador ideal para executar muitos casos de uso do Rust.
uk: Образ системи Cuttlefish зберігає високу точність до реальних пристроїв і є ідеальним емулятором для запуску багатьох сценаріїв використання Rust.

source: The Android build system (Soong) supports Rust via a number of modules:
es: El sistema de compilación de Android (Soong) es compatible con Rust a través de una serie de módulos:
fa: ‏ Android build system (Soong) از Rust از طریق تعدادی ماژول پشتیبانی می‌کند:
ja: Android ビルドシステム（Soong）は、さまざまなモジュールを通じて Rust をサポートしています。
ko: 안드로이드 빌드 시스템(Soong)은 다음과 같은 여러 모듈을 통해 러스트를 지원합니다:
pt_br: O sistema de compilação do Android (Soong) oferece suporte ao Rust por meio de vários módulos:
uk: Система збірки Android (Soong) підтримує Rust за допомогою кількох модулів:

source: Module Type
es: Tipo de módulo
ja: モジュール タイプ
pt_br: Tipo de Módulo
uk: Тип модуля

source: Description
es: Descripción
fa: توضیحات
ja: 説明
pt_br: Descrição
uk: Опис

source: Produces a Rust binary.
es: Produce un binario de Rust.
fa: یک Rust binary تولید می‌کند.
ja: Rust バイナリを生成します。
ko: 러스트 바이너리를 생성합니다.
pt_br: Produz um binário Rust.
uk: Створює бінарний файл Rust.

source: Produces a Rust library, and provides both `rlib` and `dylib` variants.
es: Produce una biblioteca de Rust y proporciona las variantes `rlib` y `dylib`.
fa: یک کتابخانه Rust تولید می‌کند و هر دو نوع `rlib` و `dylib` را ارائه می‌دهد.
ja: Rust ライブラリを生成し、`rlib` と `dylib` の両方のバリアントを提供します。
ko: 러스트 라이브러리(rlib혹은 dylib)를 생성합니다.
pt_br: Produz uma biblioteca Rust e fornece as variantes `rlib` e `dylib`.
uk: Створює бібліотеку Rust і надає варіанти `rlib` та `dylib`.

source: Produces a Rust C library usable by `cc` modules, and provides both static and shared variants.
es: Produce una biblioteca de Rust C que pueden usar los módulos `cc` y proporciona variantes estáticas y compartidas.
fa: یک کتابخانه Rust C قابل استفاده توسط ماژول‌های `cc` تولید می‌کند و انواع متغیرهای static و share را ارائه می‌کند.
ja: `cc` モジュールで使用できる Rust C ライブラリを生成し、静的バリアントと共有バリアントの両方を提供します。
ko: cc 모듈에서 사용할 수 있는 C library (정적 혹은 동적)를 생성합니다.
pt_br: Produz uma biblioteca Rust C utilizável por módulos `cc` e fornece variantes estáticas e compartilhadas.
uk: Створює бібліотеку Rust C, яку використовують модулі `cc`, і надає як статичні, так і спільні варіанти.

source: Produces a `proc-macro` Rust library. These are analogous to compiler plugins.
es: Produce una biblioteca de Rust `proc-macro`. Son similares a complementos del compilador.
fa: یک کتابخانه `proc-macro` تولید می‌کند. اینها مشابه پلاگین‌های کامپایلر هستند.
ja: `proc-macro` Rust ライブラリを生成します。これらはコンパイラ プラグインに似ています。
ko: `proc-macro`를 구현하는 러스트 라이브러리를 생성합니다. 컴파일러의 플러그인으로 생각해도 좋습니다.
pt_br: Produz uma biblioteca Rust `proc-macro`. Estes são análogos aos plugins do compilador.
uk: Створює бібліотеку `proc-macro` Rust. Вони аналогічні плагінам компілятора.

source: Produces a Rust test binary that uses the standard Rust test harness.
es: Produce un binario de prueba de Rust que utiliza el agente de prueba estándar de Rust.
fa: یک باینری تست Rust تولید می‌کند که از استاندارد Rust test مهار شده استفاده می‌کند.
ja: 標準の Rust テストハーネスを使用する Rust テストバイナリを生成します。
ko: 표준 러스트 테스트 러너를 사용하는 테스트 바이너리를 생성합니다.
pt_br: Produz um binário de teste Rust que usa a funcionalidade padrão de teste do Rust.
uk: Створює бінарний файл тесту Rust, який використовує стандартну систему тестування Rust.

source: Produces a Rust fuzz binary leveraging `libfuzzer`.
es: Produce un binario de fuzz de Rust que aprovecha `libfuzzer`.
fa: یک `libfuzzer` باینری Rust fuzz تولید می‌کند.
ja: `libfuzzer` を利用して、Rust ファズバイナリを生成します。
ko: `libfuzzer`를 사용하여 fuzz 바이너리를 생성합니다.
pt_br: Produz um binário Rust fuzz aproveitando `libfuzzer`.
uk: Створює бінарний файл Rust fuzz, використовуючи `libfuzzer`.

source: Generates source and produces a Rust library that provides an interface for a particular protobuf.
es: Genera código fuente y produce una biblioteca Rust que proporciona una interfaz para un protobuf en particular.
fa: یک source تولید می‌کند و یک کتابخانه Rust تولید می‌کند که یک interface برای یک protobuf خاص فراهم می‌کند.
ja: ソースを生成し、特定の protobuf 用のインターフェースを提供する Rust ライブラリを生成します。
ko: 프로토버프(protobuf) 인터페이스를 제공하는 러스트 라이브러리를 생성합니다.
pt_br: Gera o código-fonte e produz uma biblioteca Rust que fornece uma interface para um _protobuf_ específico.
uk: Генерує вихідний код і створює бібліотеку Rust, яка надає інтерфейс для певного protobuf.

source: Generates source and produces a Rust library containing Rust bindings to C libraries.
es: Genera código fuente y produce una biblioteca de Rust que contiene enlaces de Rust a bibliotecas de C.
fa: یک source تولید می‌کند و یک کتابخانه Rust حاوی پیوندهای Rust به کتابخانه‌های C تولید می‌کند.
ja: ソースを生成し、C ライブラリへの Rust バインディングを含む Rust ライブラリを生成します。
ko: C 라이브러리에 대한 러스트 바인딩을 제공하는 러스트 라이브러리를 생성합니다.
pt_br: Gera fonte e produz uma biblioteca Rust contendo vínculos em Rust para bibliotecas C.
uk: Генерує вихідний код і створює бібліотеку Rust, яка містить прив’язки Rust до бібліотек C.

source: We will look at `rust_binary` and `rust_library` next.
es: A continuación, hablaremos de `rust_binary` y `rust_library`.
fa: در ادامه به `rust_binary` و `rust_binary` نگاه خواهیم کرد.
ja: 次に `rust_binary` と `rust_library` を見ていきます。
ko: 다음은 `rust_binary`와 `rust_library`를 살펴봅니다.
pt_br: Veremos `rust_binary` e `rust_library` a seguir.
uk: Далі ми розглянемо `rust_binary` і `rust_library`.

source: Additional items speaker may mention:
fa: موارد دیگری که سخنران ممکن است ذکر کند:
ja: 追加で次の項目に言及することをおすすめします。
pt_br: Itens adicionais que o instrutor pode mencionar:
uk: Спікер може згадати додаткові деталі:

source: Cargo is not optimized for multi-language repos, and also downloads packages from the internet.
fa: ‏ Cargo برای repoهای چند‌زبانه بهینه‌سازی نشده است و همچنین packageها را از اینترنت دانلود می‌کند.
ja: Cargo は多言語リポジトリ用に最適化されていません。また、インターネットからパッケージをダウンロードします。
pt_br: Cargo não é otimizado para repositórios multi-idiomas e também baixa pacotes da internet.
uk: Cargo не оптимізований для багатомовних репозиторіїв, а також завантажує пакети з інтернету.

source: For compliance and performance, Android must have crates in-tree. It must also interop with C/C++/Java code. Soong fills that gap.
fa: برای انطباق و کارایی، اندروید باید crates in-tree داشته باشد. همچنین باید با کد C/C++/Java همکاری داشته باشد. Soong این شکاف را پر می کند.
ja: コンプライアンスおよびパフォーマンス上の理由から、Android ではクレートをツリー内に配置する必要があります。また、C /C++ / Java コードとの相互運用性も必要です。Soong を使用することで、そのギャップを埋めることができます。
pt_br: Para conformidade e desempenho, o Android deve ter _crates_ no repositório. Também deve interoperar com código C/C++/Java. Soong preenche essa lacuna.
uk: Для сумісності та продуктивності, Android повинен мати крейти в межах дерева. Він також повинен взаємодіяти з кодом C/C++/Java. Soong заповнює цю прогалину.

source: Soong has many similarities to [Bazel](https://bazel.build/), which is the open-source variant of Blaze (used in google3).
uk: Soong має багато спільного з [Bazel](https://bazel.build/), який є варіантом Blaze з відкритим вихідним кодом (використовується в google3).

source: Fun fact: Data from Star Trek is a Soong-type Android.
ja: 豆知識: スタートレックの「データ」は、スン（Soong）型アンドロイドです。
pt_br: Curiosidade: Data de Star Trek é um Android do tipo Soong.
uk: Цікавий факт: Дані із "Зоряного шляху" - це Android типу Soong

source: Rust Binaries
es: Binarios de Rust
ja: Rust バイナリ
ko: 러스트 바이너리
pt_br: Binários do Rust
uk: Бінарні файли Rust

source: Let us start with a simple application. At the root of an AOSP checkout, create the following files:
es: Empecemos con una sencilla aplicación. Desde la raíz de un AOSP revisado, crea los siguientes archivos:
fa: اجازه دهید با یک برنامه ساده شروع کنیم. در ریشه یک AOSP، فایل های زیر را ایجاد کنید:
ja: 簡単なアプリから始めましょう。AOSP チェックアウトのルートで、次のファイルを作成します。
ko: 간단한 응용 프로그램으로 시작해 보겠습니다. AOSP 체크아웃의 루트에서 다음 파일을 생성합니다:
pt_br: Vamos começar com um aplicativo simples. Na raiz de um checkout AOSP, crie os seguintes arquivos:
uk: Почнемо з простої програми. У корені AOSP-каси створіть наступні файли:

source: //! Rust demo.
ja: //! Rust のデモ。
uk: //! Демонстрація Rust.

source: /// Prints a greeting to standard output.
ja: /// 挨拶を標準出力に出力します。
pt_br: /// Imprime uma saudação na saída padrão.
uk: /// Виводить привітання у стандартний вивід.

source: "Hello from Rust!"
fa: "سلام از Rust!"
pt_br: "Olá do Rust!"
uk: "Привіт від Rust!"

source: You can now build, push, and run the binary:
es: Ahora puedes compilar, insertar y ejecutar el binario:
fa: اکنون می‌توانید باینری را بسازید، push و اجرا کنید:
ja: これで、バイナリをビルド、push、実行できます。
ko: 그런 다음, 이 바이너리를 빌드하고, 가상 디바이스에 넣고, 실행합니다:
pt_br: Agora você pode compilar, enviar e executar o binário:
uk: Тепер ви можете створювати, завантажувати та запускати бінарний файл:

source: Rust Libraries
es: Bibliotecas de Rust
fa: کتابخانه‌های Rust
ja: Rust ライブラリ
ko: 러스트 라이브러리
pt_br: Bibliotecas de Rust
uk: Бібліотеки Rust

source: You use `rust_library` to create a new Rust library for Android.
es: Crea una biblioteca de Rust para Android con `rust_library`.
fa: شما از `rust_library` برای ایجاد یک کتابخانه Rust جدید برای Android استفاده می‌کنید.
ja: `rust_library` を使用して、Android 用の新しい Rust ライブラリを作成します。
ko: `rust_library`를 사용하여 안드로이드용 새 러스트 라이브러리를 만듭니다.
pt_br: Você usa `rust_library` para criar uma nova biblioteca Rust para Android.
uk: Ви використовуєте `rust_library`, щоб створити нову бібліотеку Rust для Android.

source: Here we declare a dependency on two libraries:
es: Aquí declaramos una dependencia en dos bibliotecas:
fa: در اینجا ما یک وابستگی به دو کتابخانه را اعلام می‌کنیم:
ja: ここでは、2 つのライブラリへの依存関係を宣言します。
ko: 여기서 두 개의 라이브러리에 대한 의존성을 선언합니다:
pt_br: Aqui declaramos uma dependência em duas bibliotecas:
uk: Тут ми оголошуємо залежність від двох бібліотек:

source: `libgreeting`, which we define below,
es: `libgreeting`, que definimos más abajo.
fa: ‏ `libgreeting`, چیزی که در زیر تعریف می‌کنیم,
ja: `libgreeting`: 以下で定義します。
ko: 아래에 정의한 `libgreeting`.
pt_br: `libgreeting`, que definimos abaixo,
uk: `libgreeting`, який ми визначаємо нижче,

source: `libtextwrap`, which is a crate already vendored in [`external/rust/crates/`](https://cs.android.com/android/platform/superproject/+/master:external/rust/crates/).
es: `libtextwrap`, que es un crate ya incluido en [`external/rust/crates/`](https://cs.android.com/android/platform/superproject/+/master:external/rust/crates/).
ja: `libtextwrap`: すでに[`external/rust/crates/`](https://cs.android.com/android/platform/superproject/+/master:external/rust/crates/) に取り込まれているクレートです。
ko: [`external/rust/crates/`](https://cs.android.com/android/platform/superproject/+/master:external/rust/crates/)에 존재하는 `libtextwrap`.
pt_br: `libtextwrap`, que é um `crate` já oferecido em [`external/rust/crates/`](https://cs.android.com/android/platform/superproject/+/master:external/rust/crates/).
uk: `libtextwrap`, який є крейтом, який уже поставляється в [`external/rust/crates/`](https://cs.android.com/android/platform/superproject/+/master:external/rust/crates/).

source: // Need this to avoid dynamic link error.
ja: // ダイナミック リンク エラーを回避するために必要です。
pt_br: // Precisamos disso para evitar erro de ligação dinâmica.
uk: // Це потрібно, щоб уникнути помилки динамічного лінкування.

source: "greetings"
uk: "привіт"
