Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Operator overloading is implemented via traits in [`std::ops`](https://doc.rust-lang.org/std/ops/index.html):
es: La sobrecarga de operadores se implementa mediante _traits_ en [`std::ops`](https://doc.rust-lang.org/std/ops/index.html):
fa: بارگذاری مجدد عملگرها از طریق traits در [`std::ops`](https://doc.rust-lang.org/std/ops/index.html) پیاده‌سازی شده است:
ja: 演算子のオーバーロードは、[`std::ops`](https://doc.rust-lang.org/std/ops/index.html) 内のトレイトを介して実装されます。
ko: 연산자 오버로드는 `std::ops`에 있는 다양한 트레잇들을 통해 구현됩니다:
pt_br: A sobrecarga de operadores é implementada por meio do `trait` contido em [`std::ops`](https://doc.rust-lang.org/std/ops/index.html):
uk: Перевантаження операторів реалізовано за допомогою трейтів у [`std::ops`](https://doc.rust-lang.org/std/ops/index.html):

source: Discussion points:
es: Cuestiones de debate:
fa: نکات بحث:
ja: 議論のポイント:
ko: 논의점:
pt_br: Pontos de discussão:
uk: Пункти обговорення:

source: You could implement `Add` for `&Point`. In which situations is that useful?
fa: می‌توانید `Add` را برای `Point&` پیاده‌سازی کنید. در چه موقعیت‌هایی این کار مفید است؟
ja: `&Point` に `Add` を実装できます。これはどのような状況で役に立ちますか？
pt_br: Você pode implementar `Add` para `&Point`. Em quais situações isso é útil?
uk: Ви можете реалізувати `Add` для `&Point`. У яких ситуаціях це може бути корисно?

source: Answer: `Add:add` consumes `self`. If type `T` for which you are overloading the operator is not `Copy`, you should consider overloading the operator for `&T` as well. This avoids unnecessary cloning on the call site.
es: Respuesta: `Add:add` consume a `self`. Si el tipo `T` para el que se sobrecarga el operador no es `Copy`, deberías plantearte también sobrecargar el operador para `&T`. Así se evita la clonación innecesaria en el sitio de la llamada.
fa: پاسخ: `Add:add` خود `self` را مصرف می‌کند. اگر تایپ `T` که برای آن عملگر را بارگذاری می‌کنید، `Copy` نباشد، باید پیاده‌سازی عملگر را برای `T&` نیز در نظر بگیرید. این کار از ایجاد کپی‌های غیرضروری در محل فراخوانی جلوگیری می‌کند.
ja: 回答: `Add:add` は `self` を使用します。演算子をオーバーロードする型 `T` が `Copy` でない場合は、`&T` の演算子もオーバーロードすることを検討する必要があります。これにより、呼び出し箇所での不要なクローン作成を回避できます。
ko: 답: `Add:add`는 `self`를 소모합니다. 만약 타입 `T`가 `Copy`트레잇을 구현하고 있지 않다면 `&T`에 대해서도 연산자 오버로딩을 고려해야 합니다. 이렇게 하면 호출부에서 불필요한 복사를 피할 수 있습니다.
pt_br: Resposta: `Add:add` consome `self`. Se o tipo `T` para o qual você está sobrecarregando o operador não implementa `Copy`, você deve considerar sobrecarregar o operador para `&T` também. Isso evita a clonagem desnecessária no local da chamada.
uk: Відповідь: `Add:add` споживає `self`. Якщо тип `T`, для якого ви перевантажуєте оператор, не є `Copy`, ви також повинні розглянути можливість перевантаження оператора `&T`. Це дозволяє уникнути непотрібного клонування на сайті виклику.

source: Why is `Output` an associated type? Could it be made a type parameter of the method?
es: ¿Por qué `Output` es un tipo asociado? ¿Se podría convertir en un parámetro tipo del método?
fa: چرا `Output` یک تایپ مرتبط است؟ آیا می‌توان آن را به‌عنوان یک پارامترتایپ برای متد تعریف کرد؟
ja: `Output` が関連型であるのはなぜですか？これをメソッドの型パラメータにできるでしょうか？
ko: 왜 `Output`이 연관된 타입인가요? 타입 파라메터로 만들 수 있을까요?
pt_br: Por que `Output` é um tipo associado? Poderia ser feito um parâmetro de tipo do método?
uk: Чому `Output` є асоційованим типом? Чи можна зробити це параметром типу методу?

source: Short answer: Function type parameters are controlled by the caller, but associated types (like `Output`) are controlled by the implementer of a trait.
fa: پاسخ کوتاه: پارامترهای تایپ تابع توسط فراخوانی‌کننده کنترل می‌شوند، اما تایپ‌های مرتبط (مانند `Output`) توسط پیاده‌ساز trait کنترل می‌شوند.
ja: 短い回答: 関数型のパラメータは呼び出し元によって制御されますが、関連型（`Output` など）はトレイトの実装者によって制御されます。
pt_br: Resposta curta: os parâmetros de tipo de função são controlados pelo chamador, mas os tipos associados (como `Output`) são controlados pelo implementador de um `trait`.
uk: Коротка відповідь: параметри типу функції контролюються тим, хто її викликає, а асоційовані типи (як `Output`) контролюються реалізатором трейту.

source: You could implement `Add` for two different types, e.g. `impl Add<(i32, i32)> for Point` would add a tuple to a `Point`.
es: Se podría implementar `Add` para dos tipos distintos; por ejemplo, `impl Add<(i32, i32)> for Point` añadiría una tupla a un `Point`.
fa: شما می‌توانید `Add` را برای دو تایپ مختلف پیاده‌سازی کنید، به‌عنوان مثال `impl Add<(i32, i32)> for Point` می‌تواند یک tuple را به یک `Point` اضافه کند.
ja: 2 種類の型に対して `Add` を実装できます。たとえば、`impl Add<(i32, i32)> for Point` は `Point` にタプルを追加します。
ko: `Add`를 이용해서 서로 다른 두 개의 타입을 더할 수도 있습니다. 예를 들어 `impl Add<(i32, i32)> for Point`는 튜플을 `Point`에 더할 수 있게 해 줍니다.
pt_br: Você pode implementar `Add` para dois tipos diferentes, por exemplo, `impl Add<(i32, i32)> for Point` adicionaria uma tupla a um `Point`.
uk: Ви можете реалізувати `Add` для двох різних типів, напр. `impl Add<(i32, i32)> for Point` додасть кортеж до `Point`.

source: The `Not` trait (`!` operator) is notable because it does not "boolify" like the same operator in C-family languages; instead, for integer types it negates each bit of the number, which arithmetically is equivalent to subtracting it from -1: `!5 == -6`.
uk: Трейт `Not` (оператор `!`) примітний тим, що він не "буліфікується", як той самий оператор у мовах сімейства C; натомість, для цілих типів він заперечує кожен біт числа, що арифметично еквівалентно відніманню від -1: `!5 == -6`.

source: Types implement [`From`](https://doc.rust-lang.org/std/convert/trait.From.html) and [`Into`](https://doc.rust-lang.org/std/convert/trait.Into.html) to facilitate type conversions. Unlike `as`, these traits correspond to lossless, infallible conversions.
uk: Типи реалізують [`From`](https://doc.rust-lang.org/std/convert/trait.From.html) і [`Into`](https://doc.rust-lang.org/std /convert/trait.Into.html), щоб полегшити перетворення типів. На відміну від `as`, ці трейти відповідають безпомилковим перетворенням без втрат.

source: [`Into`](https://doc.rust-lang.org/std/convert/trait.Into.html) is automatically implemented when [`From`](https://doc.rust-lang.org/std/convert/trait.From.html) is implemented:
es: [`Into`](https://doc.rust-lang.org/std/convert/trait.Into.html) se implementa automáticamente cuando se implementa [`From`](https://doc.rust-lang.org/std/convert/trait.From.html):
fa: [`Into`](https://doc.rust-lang.org/std/convert/trait.Into.html) به‌طور خودکار زمانی پیاده‌سازی می‌شود که [`From`](https://doc.rust-lang.org/std/convert/trait.From.html) پیاده‌سازی شده باشد:
ja: [`From`](https://doc.rust-lang.org/std/convert/trait.From.html) が実装されると、[`Into`](https://doc.rust-lang.org/std/convert/trait.Into.html) が自動的に実装されます。
ko: [`From`](https://doc.rust-lang.org/std/convert/trait.From.html)이 구현되면 [`Into`](https://doc.rust-lang.org/std/convert/trait.Into.html) 역시 자동으로 구현됩니다:
pt_br: [`Into`](https://doc.rust-lang.org/std/convert/trait.Into.html) é implementado automaticamente quando [`From`](https://doc.rust-lang.org/std/convert/trait.From.html) é implementado:
uk: [`Into`](https://doc.rust-lang.org/std/convert/trait.Into.html) реалізується автоматично, коли [`From`](https://doc.rust-lang.org/ std/convert/trait.From.html) реалізовано:

source: That's why it is common to only implement `From`, as your type will get `Into` implementation too.
es: Por eso se suele implementar solo `From`, ya que el tipo ya habrá implementado también `Into`.
fa: به همین دلیل معمولاً تنها `From` پیاده‌سازی می‌شود، زیرا تایپ شما به‌طور خودکار پیاده‌سازی `Into` را نیز دریافت می‌کند.
ja: このように `Into` も実装されるため、型には `From` のみを実装するのが一般的です。
ko: 그렇기 때문에 사용자 정의 타입의 경우에도 `From` 만 구현하는 것이 일반적입니다.
pt_br: É por isso que é comum implementar apenas `From`, já que seu tipo também receberá a implementação de `Into`.
uk: Ось чому прийнято реалізовувати лише `From`, оскільки ваш тип також отримає реалізацію `Into`.

source: When declaring a function argument input type like "anything that can be converted into a `String`", the rule is opposite, you should use `Into`. Your function will accept types that implement `From` and those that _only_ implement `Into`.
es: Cuando se declara un tipo de entrada de argumento de función como "cualquier elemento que se pueda convertir en `String`", la regla es la contraria y se debe usar `Into`. La función aceptará tipos que implementen `From` y aquellos que _solo_ implementen `Into`.
fa: هنگام اعلام تایپ ورودی تابعی مانند "هر چیزی که می‌تواند به یک `String` تبدیل شود"، قاعده برعکس است، باید از `Into` استفاده کنید. تابع شما تایپ‌های را قبول می‌کند که پیاده‌سازی `From` دارند و همچنین تاید‌هایی که فقط `Into` را پیاده‌سازی کرده‌اند.
ja: 「`String` に変換できるすべて」のような関数引数の入力型を宣言する場合、このルールは逆となり、`Into`を使用する必要があります。関数は、`From` を実装する型と、`Into` _のみ_ を実装する型を受け入れます。
ko: "`String`으로 변환할 수 있는 모든 것"과 같은 함수의 인수 타입을 선언할 때에는 `Into`를 사용해야 함을 조심하세요. 그래야만, 함수는 `From`을 구현한 타입과 `Into` _만_ 구현한 타입 모두를 인자로 받을 수 있습니다.
pt_br: Ao declarar um tipo de entrada de argumento de função como "qualquer coisa que possa ser convertida em `String`", a regra é oposta, você deve usar `Into`. Sua função aceitará tipos que implementam `From` e aqueles que _apenas_ implementam `Into`.
uk: При оголошенні вхідного типу аргументу функції типу "все, що можна перетворити на `String`", правило протилежне, ви повинні використовувати `Into`. Ваша функція прийматиме типи, які реалізують `From`, і ті, які _лише_ реалізують `Into`.

source: Rust has no _implicit_ type conversions, but does support explicit casts with `as`. These generally follow C semantics where those are defined.
fa: Rust هیچ _implicit_ ندارد، اما از تبدیل‌های صریح با استفاده از `as` پشتیبانی می‌کند. این تبدیل‌ها معمولاً پیرو معنای C هستند که در آنجا تعریف شده‌اند.
ja: Rust には _暗黙的_ な型変換はありませんが、`as` による明示的なキャストはサポートされています。これらのキャストは通常、それらが定義されている C セマンティクスに従います。
pt_br: O Rust não tem conversões de tipo _implícitas_, mas suporta conversões explícitas com `as`. Essas geralmente seguem a semântica de C onde elas são definidas.
uk: Rust не має _неявних_ перетворень типів, але підтримує явні приведення за допомогою `as`. Вони зазвичай відповідають семантиці C, де вони визначені.

source: "as u16: {}"
pt_br: "como u16: {}"
uk: "як u16: {}"

source: "as i16: {}"
pt_br: "como i16: {}"
uk: "як i16: {}"

source: "as u8: {}"
pt_br: "como u8: {}"
uk: "як u8: {}"

source: The results of `as` are _always_ defined in Rust and consistent across platforms. This might not match your intuition for changing sign or casting to a smaller type -- check the docs, and comment for clarity.
fa: نتایج استفاده از `as` _همیشه_ در Rust تعریف شده و در تمامی پلتفرم‌ها ثابت هستند. این ممکن است با شهود شما برای تغییر علامت یا تبدیل به تایپ کوچکتر مطابقت نداشته باشد -- مستندات را بررسی کنید و برای وضوح بیشتر نظر دهید.
ja: `as` の結果は Rust で _常に_ 定義され、プラットフォーム間で一貫しています。これは、正負の符号を変えたり、より小さな型にキャストしたりする際に得られる直感に反しているかもしれません。ドキュメントを確認し、明確にするためにコメントを記述してください。
pt_br: Os resultados de `as` são _sempre_ definidos no Rust e consistentes em todas as plataformas. Isso pode não corresponder à sua intuição para alterar o sinal ou converter para um tipo menor - verifique a documentação e comente
uk: Результати функції `as` _завжди_ визначені у Rust і є стабільними на всіх платформах. Це може не збігатися з вашою інтуїцією щодо зміни знаку або приведення до меншого типу - зверніться до документації та коментарів для уточнення.

source: Casting with `as` is a relatively sharp tool that is easy to use incorrectly, and can be a source of subtle bugs as future maintenance work changes the types that are used or the ranges of values in types. Casts are best used only when the intent is to indicate unconditional truncation (e.g. selecting the bottom 32 bits of a `u64` with `as u32`, regardless of what was in the high bits).
fa: تبدیل تایپ با استفاده از `as` ابزاری نسبتاً حساس است که استفاده نادرست از آن آسان است و می‌تواند منبعی از اشکالات ظریف باشد، به خصوص زمانی که کار نگهداری آینده باعث تغییر تایپ‌های مورد استفاده یا دامنه مقادیر در تایپ‌ها شود. تبدیل‌ها بهتر است تنها زمانی استفاده شوند که قصد شما نشان دادن برش بدون قید و شرط باشد (مثلاً انتخاب 32 بیت پایین از یک `u64` با `as u32`، بدون توجه به آنچه در بیت‌های بالا وجود دارد).
ja: `as` を使用したキャストは比較的扱いにくく、誤って使用することが少なくありません。また、将来のメンテナンス作業で、使用される型や型の値の範囲が変更された際に、わかりにくいバグが発生する可能性があります。キャストは、無条件の切り捨てを示すことを目的としている場合にのみ、最適に使用されます（たとえば、上位ビットの内容に関係なく、`as u32` で `u64` の下位 32 ビットを選択する場合）。
pt_br: Converter com `as` é uma ferramenta relativamente afiada que é fácil de usar incorretamente e pode ser uma fonte de bugs sutis à medida que o trabalho de manutenção futuro altera os tipos que são usados ou os intervalos de valores nos tipos. As conversões são melhores usadas apenas quando a intenção é indicar truncamento incondicional (por exemplo, selecionar os 32 bits inferiores de um `u64` com `as u32`, independentemente do que estava nos bits altos).
uk: Приведення за допомогою `as` є відносно гнучким інструментом, який легко використовувати неправильно, і може бути джерелом малопомітних помилок, оскільки майбутні роботи супроводження змінюють типи, які використовуються, або діапазони значень у типах. Приведення до типу найкраще використовувати лише тоді, коли потрібно вказати безумовне усічення (наприклад, виділити молодші 32 біти `u64` за допомогою `as u32`, незалежно від того, що було у старших бітах).

source: For infallible casts (e.g. `u32` to `u64`), prefer using `From` or `Into` over `as` to confirm that the cast is in fact infallible. For fallible casts, `TryFrom` and `TryInto` are available when you want to handle casts that fit differently from those that don't.
fa: برای تبدیل‌های بدون خطا (مانند تبدیل `u32` به `u64`)، استفاده از `From` یا `Into` بر `as` ارجح است تا تأیید شود که تبدیل در واقع بدون خطا است. برای تبدیل‌های با احتمال خطا، `TryFrom` و `TryInto` در دسترس هستند وقتی که می‌خواهید تبدیل‌هایی را که به شیوه‌ای متفاوت از آن‌هایی که مطابقت ندارند، مدیریت کنید.
ja: 絶対に正しいキャスト（例: `u32` から `u64` へのキャスト）では、キャストが実際に完璧であることを確認するために、`as` ではなく `From` または `Into` を使用することをおすすめします。正しくない可能性があるキャストについては、絶対に正しいキャストとは異なる方法でそれらを処理したい場合に、`TryFrom` と `TryInto` を使用できます。
pt_br: Para conversões infalíveis (por exemplo, `u32` para `u64`), prefira usar `From` ou `Into` em vez de `as` para confirmar que a conversão é de fato infalível. Para conversões falíveis, `TryFrom` e `TryInto` estão disponíveis quando você deseja lidar com conversões que se encaixam de maneira diferente daquelas que não se encaixam.
uk: Для безпомилкового приведення (наприклад, `u32` до `u64`) краще використовувати `From` або `Into` замість `as`, щоб переконатися, що приведення дійсно є безпомилковими. Для помилкових приведень доступні `TryFrom` і `TryInto`, якщо ви хочете обробити приведення, які відрізняються від тих, які не підходять.

source: Consider taking a break after this slide.
fa: در نظر داشته باشید که پس از این اسلاید استراحت کنید.
ja: このスライドの後で休憩を取ることを検討してください。
pt_br: Considere fazer uma pausa após este slide.
uk: Подумайте про перерву після цього слайда.

source: `as` is similar to a C++ static cast. Use of `as` in cases where data might be lost is generally discouraged, or at least deserves an explanatory comment.
fa: `as` مشابه به `static_cast` در ++C است. استفاده از `as` در مواردی که ممکن است داده‌ها از دست برود، معمولاً توصیه نمی‌شود یا حداقل نیاز به توضیحی کامنتی دارد.
ja: `as` は C++ の静的キャストに似ています。データが失われる可能性がある状況で `as` を使用することは、一般的に推奨されません。使用する場合は、少なくとも説明のコメントを記述することをおすすめします。
pt_br: `as` é semelhante a um _cast_ estático do C++. O uso de `as` em casos em que os dados podem ser perdidos geralmente é desencorajado, ou pelo menos merece um comentário explicativo.
uk: Оператор `as` подібний до статичного приведення у C++. Використання `as` у випадках, коли дані може бути втрачено, зазвичай не рекомендується або, принаймні, заслуговує на пояснювальний коментар.

source: This is common in casting integers to `usize` for use as an index.
fa: این موضوع در تبدیل اعداد صحیح به `usize` برای استفاده به عنوان ایندکس رایج است.
ja: これは、整数を`usize` にキャストしてインデックスとして使用する場合に一般的です。
pt_br: Isso é comum na conversão de inteiros para `usize` para uso como índice.
uk: Це типовий випадок приведення цілих чисел до `usize` для використання у якості індексу.

source: Using [`Read`](https://doc.rust-lang.org/std/io/trait.Read.html) and [`BufRead`](https://doc.rust-lang.org/std/io/trait.BufRead.html), you can abstract over `u8` sources:
es: Usando [`Read`](https://doc.rust-lang.org/std/io/trait.Read.html) y [`BufRead`](https://doc.rust-lang.org/std/io/trait.BufRead.html), se puede abstraer sobre fuentes `u8`:
fa: با استفاده از [`Read`](https://doc.rust-lang.org/std/io/trait.Read.html) و [`BufRead`](https://doc.rust-lang.org/std/io/trait.BufRead.html)، می‌توانید بر روی منابع `u8` انتزاع کنید:
ja: [`Read`](https://doc.rust-lang.org/std/io/trait.Read.html) と [`BufRead`](https://doc.rust-lang.org/std/io/trait.BufRead.html) を使用することで、`u8` ソースを抽象化できます。
ko: [`Read`](https://doc.rust-lang.org/std/io/trait.Read.html)와 [`BufRead`](https://doc.rust-lang.org/std/io/trait.BufRead.html)를 사용하면 `u8` 타입의 데이터 스트림을 읽을 수 있습니다:
pt_br: Usando [`Read`](https://doc.rust-lang.org/std/io/trait.Read.html) e [`BufRead`](https://doc.rust-lang.org/std/io/trait.BufRead.html), você pode abstrair as fontes de dados do tipo `u8`:
uk: Використовуючи [`Read`](https://doc.rust-lang.org/std/io/trait.Read.html) і [`BufRead`](https://doc.rust-lang.org/std/io/trait.BufRead.html), ви можете абстрагуватися над джерелами `u8`:

source: "lines in slice: {}"
pt_br: "linhas na _slice_: {}"
uk: "рядків у зрізі: {}"

source: "lines in file: {}"
pt_br: "linhas no arquivo: {}"
uk: "рядків у файлі: {}"

source: Similarly, [`Write`](https://doc.rust-lang.org/std/io/trait.Write.html) lets you abstract over `u8` sinks:
es: De forma similar, [`Write`](https://doc.rust-lang.org/std/io/trait.Write.html) te permite abstraer sobre fuentes `u8`:
fa: به طور مشابه، [`Write`](https://doc.rust-lang.org/std/io/trait.Write.html) به شما امکان می‌دهد که بر روی منابع `u8` انتزاع کنید:
ja: 同様に、[`Write`](https://doc.rust-lang.org/std/io/trait.Write.html) を使用すると、`u8` シンクを抽象化できます。
ko: 이와 비슷하게, `Write`를 사옹하면 `u8` 타입의 데이터를 쓸 수 있습니다:
pt_br: Da mesma forma, [`Write`](https://doc.rust-lang.org/std/io/trait.Write.html) permite abstrair a escrita de dados do tipo `u8`:
uk: Подібним чином, [`Write`](https://doc.rust-lang.org/std/io/trait.Write.html) дозволяє вам абстрагуватися над `u8` прийомниками:

source: "Logged: {:?}"
pt_br: "Registrado: {:?}"
uk: "Записано: {:?}"

source: The `Default` Trait
es: El trait `Default`
ja: `Default` トレイト
ko: `Default` 트레잇
pt_br: O Trait `Default`
uk: Трейт `Default`

source: [`Default`](https://doc.rust-lang.org/std/default/trait.Default.html) trait produces a default value for a type.
es: El trait [`Default`](https://doc.rust-lang.org/std/default/trait.Default.html) produce un valor predeterminado para un tipo.
fa: ویژگی [`Default`](https://doc.rust-lang.org/std/default/trait.Default.html) یک مقدار پیش‌فرض برای یک تایپ تولید می‌کند.
ja: [`Default`](https://doc.rust-lang.org/std/default/trait.Default.html) トレイトは、型のデフォルト値を生成します。
ko: [`Default`](https://doc.rust-lang.org/std/default/trait.Default.html) 트레잇은 어떤 타입에 대한 기본값을 제공합니다.
pt_br: O _trait_ [`Default`](https://doc.rust-lang.org/std/default/trait.Default.html) fornece uma implementação padrão para um tipo.
uk: Трейт [`Default`](https://doc.rust-lang.org/std/default/trait.Default.html) створює значення за замовчуванням для типу.

source: "Y is set!"
pt_br: "Y está definido!"
uk: "Y встановлено!"

source: It can be implemented directly or it can be derived via `#[derive(Default)]`.
es: Se puede implementar directamente o se puede derivar a través de `#[derive(Default)]`.
fa: این ویژگی می‌تواند به طور مستقیم پیاده‌سازی شود یا می‌تواند از طریق `[derive(Default)]#` به صورت خودکار تولید شود.
ja: 直接実装することも、`#[derive(Default)]` で導出することもできます。
ko: 트레잇을 직접 구현하거나 `#[derive(Default)]`를 붙여서 컴파일러에게 구현을 맡길 수 있습니다.
pt_br: Ele pode ser implementado diretamente ou derivado usando `#[derive(Default)]`.
uk: Це може бути реалізовано безпосередньо або може бути отримано за допомогою `#[derive(Default)]`.

source: A derived implementation will produce a value where all fields are set to their default values.
es: Una implementación derivada producirá un valor en el que todos los campos tendrán sus valores predeterminados.
fa: یک پیاده‌سازی خودکار، مقداری تولید می‌کند که در آن تمامی فیلدها به مقادیر پیش‌فرض خود تنظیم شده‌اند.
ja: 導出による実装では、すべてのフィールドがデフォルト値に設定された値が生成されます。
ko: 컴파일러가 제공하는 자동 구현의 경우 모든 필드에 대해 기본 값을 설정한 새 인스턴스를 반환합니다.
pt_br: A implementação usando `derive` produz um valor onde todos os campos são preenchidos com seus valores padrão.
uk: Похідна реалізація створить значення, в якому всі поля мають значення за замовчуванням.

source: This means all types in the struct must implement `Default` too.
es: Esto significa que todos los tipos de la estructura también deberán implementar `Default`.
fa: این بدان معناست که تمام تایپ‌های موجود در ساختار نیز باید `Default` را پیاده‌سازی کنند.
ja: つまり、構造体内のすべての型にも `Default` を実装する必要があります。
ko: 이는 구조체의 각 필드 타입들이 모두 `Default` 트레잇을 구현해야 함을 의미합니다.
pt_br: Consequentemente, todos os tipos usados no struct devem implementar `Default` também.
uk: Це означає, що всі типи в структурі також мають реалізовувати `Default`.

source: Standard Rust types often implement `Default` with reasonable values (e.g. `0`, `""`, etc).
es: Los tipos estándar de Rust suelen implementar `Default` con valores razonables (por ejemplo, `0`, `""`, etc.).
fa: نوع‌های استاندارد Rust اغلب `Default` را با مقادیر معقول پیاده‌سازی می‌کنند (مثل `0`، `""` و غیره).
ja: 標準の Rust 型は多くの場合、妥当な値（`0`、`""` など）の `Default` を実装します。
ko: 러스트 표준 타입들은 대부분 `Default`를 구현하고 있으며, 기본 값은 `0`이나 `""`처럼 예상 가능한 값들입니다.
pt_br: Frequentemente, os tipos padrão do Rust implementam `Default` com valores razoáveis (p.ex.: `0`, `""`, etc).
uk: Стандартні типи Rust часто реалізують `Default` із прийнятними значеннями (наприклад, `0`, `""` тощо).

source: The partial struct initialization works nicely with default.
fa: مقداردهی جزئی ساختارها با `Default` به خوبی کار می‌کند.
ja: 部分的な構造体の初期化は、デフォルトで適切に機能します。
pt_br: A inicialização parcial do struct funciona bem com o default.
uk: Часткова ініціалізація структур чудово працює за замовчуванням.

source: The Rust standard library is aware that types can implement `Default` and provides convenience methods that use it.
fa: کتابخانه استاندارد Rust آگاه است که تایپ‌های مختلف می‌توانند `Default` را پیاده‌سازی کنند و روش‌های کمکی را فراهم می‌کند که از آن استفاده می‌کنند.
ja: Rust 標準ライブラリは、型が `Default` を実装できることを認識しており、それを使用するコンビニエンス メソッドを提供しています。
pt_br: A bilioteca padrão do Rust sabe que tipos podem implementar o `trait` `Default` e, convenientemente, provê métodos para isso.
uk: Стандартна бібліотека Rust усвідомлює, що типи можуть реалізовувати `Default` і надає зручні методи, які його використовують.

source: The `..` syntax is called [struct update syntax](https://doc.rust-lang.org/book/ch05-01-defining-structs.html#creating-instances-from-other-instances-with-struct-update-syntax).
fa: سینتکس `..` به نام [سینتکس به‌روزرسانی ساختار](https://doc.rust-lang.org/book/ch05-01-defining-structs.html#creating-instances-from-other-instances-with-struct-update-syntax) شناخته می‌شود.
ja: `..` 構文は、[構造体更新記法](https://doc.rust-lang.org/book/ch05-01-defining-structs.html#creating-instances-from-other-instances-with-struct-update-syntax)と呼ばれています。
pt_br: A sintaxe `..` é chamada de [sintaxe de atualização de struct](https://doc.rust-lang.org/book/ch05-01-defining-structs.html#creating-instances-from-other-instances-with-struct-update-syntax).
uk: Синтаксис `..` називається [синтаксис оновлення структури](https://doc.rust-lang.org/book/ch05-01-defining-structs.html#creating-instances-from-other-instances-with-struct-update-syntax).
