Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: /// Rust struct implementing the `IBirthdayInfoProvider` interface.
uk: /// Rust структурна структура, що реалізує інтерфейс `IBirthdayInfoProvider`.

source: // Create a binder object for the `IBirthdayInfoProvider` interface.
uk: // Створюємо об'єкт-зв'язувач для інтерфейсу `IBirthdayInfoProvider`.

source: // Send the binder object to the service.
uk: // Надсилаємо об'єкт-зв'язку до сервісу.

source: // Perform the same operation but passing the provider as an `SpIBinder`.
uk: // Виконуємо ту саму операцію, але передаємо провайдера як `SpIBinder`.

source: Note the usage of `BnBirthdayInfoProvider`. This serves the same purpose as `BnBirthdayService` that we saw previously.
fa: به استفاده از `BnBirthdayInfoProvider` توجه کنید. این همان هدف `BnBirthdayService` است که قبلاً دیدیم.
uk: Зверніть увагу на використання `BnBirthdayInfoProvider`. Він слугує тій самій меті, що й `BnBirthdayService`, який ми бачили раніше.

source: Binder for Rust supports sending parcelables directly:
uk: Binder для Rust підтримує пряме надсилання посилкових данних:

source: /** The same thing, but with a parcelable. */
uk: /** Те саме, але з посилковими даними. */

source: Files can be sent between Binder clients/servers using the `ParcelFileDescriptor` type:
fa: فایل‌ها را می‌توان با استفاده از نوع `ParcelFileDescriptor` بین کلاینت‌ها/سرورهای Binder ارسال کرد:
uk: Файли можна надсилати між клієнтами/серверами Binder, використовуючи тип `ParcelFileDescriptor`:

source: /** The same thing, but loads info from a file. */
uk: /** Те саме, але завантажує інформацію з файлу. */

source: // Open a file and put the birthday info in it.
uk: // Відкриваємо файл і записуємо до нього інформацію про день народження.

source: // Create a `ParcelFileDescriptor` from the file and send it.
uk: // Створюємо `ParcelFileDescriptor` з файлу та надсилаємо його.

source: // Convert the file descriptor to a `File`. `ParcelFileDescriptor` wraps // an `OwnedFd`, which can be cloned and then used to create a `File` // object.
uk: // Перетворюємо дескриптор файлу в `File`. `ParcelFileDescriptor` обертає // `OwnedFd`, який може бути клонований і потім використаний для створення об'єкту // `File`.

source: "Invalid file handle"
fa: "کنترل فایل نامعتبر"
uk: "Неправильний дескриптор файлу"

source: `ParcelFileDescriptor` wraps an `OwnedFd`, and so can be created from a `File` (or any other type that wraps an `OwnedFd`), and can be used to create a new `File` handle on the other side.
fa: ‏ `ParcelFileDescriptor` یک `OwnedFd` را احاطه می‌کند و بنابراین می‌تواند از یک `File` (یا هر نوع دیگری که یک `OwnedFd` را احاطه می‌کند) ایجاد کند و می‌تواند برای ایجاد یک دسته `File` جدید در طرف دیگر استفاده شود.
uk: Дескриптор `ParcelFileDescriptor` обгортає `OwnedFd`, тому може бути створений з `File` (або будь-якого іншого типу, який обгортає `OwnedFd`), і може бути використаний для створення нового дескриптора `File` на іншій стороні.

source: Other types of file descriptors can be wrapped and sent, e.g. TCP, UDP, and UNIX sockets.
fa: انواع دیگر توصیف‌گرهای فایل را می توان بسته‌بندی و ارسال کرد، به‌عنوان‌مثال. سوکت های TCP، UDP و UNIX.
uk: Інші типи дескрипторів файлів можуть бути загорнуті та надіслані, наприклад, TCP, UDP та UNIX-сокети.

source: Testing in Android
fa: تست‌کردن در Android
uk: Тестування в Android

source: Building on [Testing](../testing.md), we will now look at how unit tests work in AOSP. Use the `rust_test` module for your unit tests:
fa: بر اساس [Testing](../testing.md)، اکنون به نحوه عملکرد unit testها در AOSP خواهیم پرداخت. از ماژول `rust_test` برای تست های واحد خود استفاده کنید:
uk: Спираючись на [Тестування](../testing.md), ми розглянемо, як працюють юніт-тести в AOSP. Використовуйте модуль `rust_test` для ваших модульних тестів:

source: //! Left-padding library.
uk: //! Бібліотека лівих відступів.

source: /// Left-pad `s` to `width`.
uk: /// Додати `s` зліва до `width`.

source: You can now run the test with
fa: اکنون می توانید تست را با
uk: Тепер ви можете запустити тест за допомогою

source: The output looks like this:
fa: خروجی به شکل زیر است:
uk: Результат має такий вигляд:

source: Notice how you only mention the root of the library crate. Tests are found recursively in nested modules.
fa: توجه کنید که چگونه فقط ریشه crate کتابخانه را ذکر می‌کنید. تست‌ها به صورت بازگشتی در ماژول‌های تودرتو یافت می‌شوند.
uk: Зверніть увагу, що ви згадуєте лише корінь крейта бібліотеки. Тести знаходяться рекурсивно у вкладених модулях.

source: The [GoogleTest](https://docs.rs/googletest/) crate allows for flexible test assertions using _matchers_:
fa: جعبه [GoogleTest](https://docs.rs/googletest/) با استفاده از _matchers_ اجازه می‌دهد تا assertهای آزمایشی انعطاف‌پذیر را انجام دهید:
ja: [GoogleTest](https://docs.rs/googletest/) クレートにより、マッチャーを使用した柔軟なテスト アサーションが可能になります。
pt_br: O _crate_ [GoogleTest](https://docs.rs/googletest/) permite assertividade de testes flexível usando _matchers_ (correspondentes):
uk: Крейт [GoogleTest](https://docs.rs/googletest/) дозволяє створювати гнучкі тестові твердження за допомогою _зрівнювачів_.

source: If we change the last element to `"!"`, the test fails with a structured error message pin-pointing the error:
fa: اگر آخرین عنصر را به`"!"`تغییر دهیم، آزمایش با یک پیغام خطای ساختار یافته که خطا را pin-pointing می‌کند، شکست می خورد:
ja: 最後の要素を `"!"` に変更すると、テストは失敗し、エラー箇所を示す構造化されたエラー メッセージが表示されます。
pt_br: Se mudarmos o último elemento para `"!"`, o teste falha com uma mensagem de erro estruturada apontando o erro:
uk: Якщо ми змінимо останній елемент на `"!"`, тест завершиться невдачею зі структурованим повідомленням про помилку, яке точно вказує на помилку:

source: GoogleTest is not part of the Rust Playground, so you need to run this example in a local environment. Use `cargo add googletest` to quickly add it to an existing Cargo project.
fa: ‏ GoogleTest بخشی از Rust Playground نیست، بنابراین باید این مثال را در یک محیط local اجرا کنید. برای افزودن سریع آن به پروژه Cargo موجود، از `cargo add googletest` استفاده کنید.
ja: GoogleTest は Rust プレイグラウンドの一部ではないため、この例はローカル環境で実行する必要があります。`cargo add googletest` を使用して、既存の Cargo プロジェクトにすばやく追加します。
pt_br: GoogleTest não faz parte do _playground_ do Rust, então você precisa executar este exemplo em um ambiente local. Use `cargo add googletest` para adicioná-lo rapidamente a um projeto Cargo existente.
uk: GoogleTest не є частиною Rust Playground, тому вам потрібно запустити цей приклад у локальному середовищі. Скористайтеся `cargo add googletest`, щоб швидко додати його до існуючого проекту Cargo.

source: The `use googletest::prelude::*;` line imports a number of [commonly used macros and types](https://docs.rs/googletest/latest/googletest/prelude/index.html).
fa: خط `use googletest::prelude::*;` تعدادی از [ماکروها و typeهای پرکاربرد](https://docs.rs/googletest/latest/googletest/prelude/index.html) را وارد می‌کند.
ja: `use googletest::prelude::*;` 行は、[一般的に使用されるマクロと型](https://docs.rs/googletest/latest/googletest/prelude/index.html)をインポートします。
pt_br: A linha `use googletest::prelude::*;` importa uma série de [macros e tipos comumente usados](https://docs.rs/googletest/latest/googletest/prelude/index.html).
uk: У стрічці `use googletest::prelude::*;` імпортується низка [загальновживаних макросів і типів](https://docs.rs/googletest/latest/googletest/prelude/index.html).

source: This just scratches the surface, there are many builtin matchers. Consider going through the first chapter of ["Advanced testing for Rust applications"](https://rust-exercises.com/advanced-testing/), a self-guided Rust course: it provides a guided introduction to the library, with exercises to help you get comfortable with `googletest` macros, its matchers and its overall philosophy.
uk: Це лише поверхневий огляд, є багато вбудованих зрівнювачів. Подумайте про те, щоб прочитати перший розділ ["Поглиблене тестування для прикладних програм на Rust"](https://rust-exercises.com/advanced-testing/), самовчитель з Rust: він надає керований вступ до бібліотеки з вправами, які допоможуть вам освоїтися з макросами `googletest` , його зрівнювачами і його загальною філософією.

source: A particularly nice feature is that mismatches in multi-line strings are shown as a diff:
fa: یک ویژگی خاص خوب این است که عدم تطابق در string‌های چند خطی به صورت یک تفاوت نشان داده می شود:
uk: Особливо приємною особливістю є те, що розбіжності в багаторядкових рядках відображаються у вигляді diff:

source: shows a color-coded diff (colors not shown here):
fa: تفاوت رنگی را نشان می‌دهد (رنگ ها در اینجا نشان‌داده نمی‌شوند):
ja: これにより、差分が色分けされます（ここでは色分けされていません）。
pt_br: mostra uma diferença usando cores (não mostradas aqui):
uk: показує кольорову різницю (кольори тут не показано):

source: The crate is a Rust port of [GoogleTest for C++](https://google.github.io/googletest/).
fa: این crate یک پورت [GoogleTest for C++]‌(https://google.github.io/googletest/) در Rust است.
ja: このクレートは [GoogleTest for C++](https://google.github.io/googletest/) をRustに移植したものです。
pt_br: O _crate_ é uma tradução para Rust do [GoogleTest para C++](https://google.github.io/googletest/).
uk: Цей крейт - Rust-порт [GoogleTest for C++](https://google.github.io/googletest/).

source: For mocking, [Mockall](https://docs.rs/mockall/) is a widely used library. You need to refactor your code to use traits, which you can then quickly mock:
fa: برای mocking از [Mockall](https://docs.rs/mockall/) که یک کتابخانه محبوب بوده استفاده شده است. برای استفاده از traitها، باید کد خود را مجدداً تغییر دهید، سپس می‌توانید به سرعت آنها را mock کنید:
ja: モックには、[Mockall](https://docs.rs/mockall/) というライブラリが広く使用されています。トレイトを使用するようにコードをリファクタリングする必要があります。これにより、すぐにモックできるようになります。
pt_br: Para _mocking_, [Mockall](https://docs.rs/mockall/) é uma biblioteca muito usada. Você precisa refatorar seu código para usar _traits_, que você pode então rapidamente _"mockar"_:
uk: Для імітації широко використовується бібліотека [Mockall](https://docs.rs/mockall/). Вам потрібно рефакторити свій код, щоб використовувати трейти, які потім можна швидко імітувати:

source: Mockall is the recommended mocking library in Android (AOSP). There are other [mocking libraries available on crates.io](https://crates.io/keywords/mock), in particular in the area of mocking HTTP services. The other mocking libraries work in a similar fashion as Mockall, meaning that they make it easy to get a mock implementation of a given trait.
fa: ‏ Mockall کتابخانه mocking توصیه شده در Android (AOSP) است. [کتابخانه‌های mocking دیگری در crates.io](https://crates.io/keywords/mock) در دسترس هستند، به‌ویژه در زمینه سرویس‌های mocking HTTP. سایر کتابخانه‌های mocking به روشی مشابه Mockall کار می‌کنند، به این معنی که اجرای ساختگی یا mock یک ویژگی خاص را آسان می‌کنند.
uk: Mockall - рекомендована бібліотека для створення імітацій в Android (AOSP). На crates.io доступні й інші [бібліотеки для імітації](https://crates.io/keywords/mock), зокрема для імітації HTTP-сервісів. Інші бібліотеки імітацій працюють подібно до Mockall, тобто вони дозволяють легко отримати імітаційну реалізацію заданого трейту.

source: Note that mocking is somewhat _controversial_: mocks allow you to completely isolate a test from its dependencies. The immediate result is faster and more stable test execution. On the other hand, the mocks can be configured wrongly and return output different from what the real dependencies would do.
fa: توجه داشته باشید که mocking تا حدودی _جنجال_برانگیز_ است: mockها به شما این امکان را می‌دهند که آزمون را کاملاً از وابستگی‌های آن جدا کنید. نتیجه فوری آن، اجرای سریع‌تر و پایدارتر تست است. از طرف دیگر، mockها را می توان به اشتباه پیکربندی کرد و خروجی متفاوتی با آنچه وابستگی های واقعی انجام می دادند را برگرداند.
ja: モックを使用する際は少し注意が必要です。モックを使用すると、テストを依存関係から完全に分離できます。その結果、より高速で安定したテスト実行が可能になります。一方、モックが誤って構成され、実際の依存関係の動作とは異なる出力が返される可能性があります。
pt_br: Observe que o _mocking_ é um tanto _controverso_: _mocks_ permitem que você isole completamente um teste de suas dependências. O resultado imediato é uma execução de teste mais rápida e estável. Por outro lado, os _mocks_ podem ser configurados incorretamente e retornar uma saída diferente daquela que as dependências reais fariam.
uk: Зауважте, що імітація дещо _суперечлива_: імітації дозволяють повністю ізолювати тест від його залежностей. Безпосереднім результатом є швидше і стабільніше виконання тесту. З іншого боку, імітатори можуть бути налаштовані неправильно і повертати результат, відмінний від того, який виводили б реальні залежності.

source: If at all possible, it is recommended that you use the real dependencies. As an example, many databases allow you to configure an in-memory backend. This means that you get the correct behavior in your tests, plus they are fast and will automatically clean up after themselves.
ja: 可能な限り、実際の依存関係を使用することをおすすめします。たとえば、多くのデータベースではインメモリ バックエンドを構成できます。つまり、テストで正しい動作が得られ、しかも高速で、テスト後は自動的にクリーンアップされます。
pt_br: Se possível, é recomendável que você use as dependências reais. Como exemplo, muitos bancos de dados permitem que você configure um _backend_ em memória. Isso significa que você obtém o comportamento correto em seus testes, além de serem rápidos e limparem automaticamente após si mesmos.
uk: Якщо це можливо, рекомендується використовувати реальні залежності. Наприклад, багато баз даних дозволяють налаштовувати бекенд в пам'яті. Це означає, що ви отримаєте правильну поведінку у ваших тестах, до того ж вони швидкі і автоматично прибиратимуть за собою.

source: Similarly, many web frameworks allow you to start an in-process server which binds to a random port on `localhost`. Always prefer this over mocking away the framework since it helps you test your code in the real environment.
fa: به‌طور‌ مشابه، بسیاری از frameworkهای وب به شما اجازه می‌دهند یک سرور در یک process دیگر راه‌اندازی کنید که به یک پورت تصادفی در `localhost` متصل می‌شود. همیشه این را به mock کردن framework ترجیح دهید زیرا به شما کمک می‌کند کد خود را در محیط واقعی آزمایش کنید.
ja: 同様に、多くのウェブ フレームワークでは、`localhost` 上のランダムなポートにバインドするプロセス内サーバーを起動できます。このような構成は実際の環境でコードをテストすることを可能にするので、フレームワークをモックすることよりも常に優先して利用しましょう。
pt_br: Da mesma forma, muitos _frameworks_ da web permitem que você inicie um servidor em processo que se vincula a uma porta aleatória em `localhost`. Sempre prefira isso a _mockar_ o _framework_ pois isso ajuda você a testar seu código no ambiente real.
uk: Аналогічно, багато веб-фреймворків дозволяють запускати сервер у процесі роботи, який прив'язується до випадкового порту на `localhost`. Завжди віддавайте перевагу цьому, а не імітаційному фреймворку, оскільки це допоможе вам протестувати ваш код у реальному середовищі.

source: Mockall is not part of the Rust Playground, so you need to run this example in a local environment. Use `cargo add mockall` to quickly add Mockall to an existing Cargo project.
fa: ‏ Mockall بخشی از Rust Playground نیست، بنابراین باید این مثال را در یک محیط local اجرا کنید. از `cargo add mockall` برای اضافه کردن سریع Mockall به پروژه Cargo موجود استفاده کنید.
ja: Mockall は Rust プレイグラウンドの一部ではないため、この例はローカル環境で実行する必要があります。`cargo add mockall` を使用して、Mockall を既存の Cargo プロジェクトにすばやく追加します。
pt_br: Mockall não faz parte do _playground_ do Rust, então você precisa executar este exemplo em um ambiente local. Use `cargo add mockall` para adicionar rapidamente o Mockall a um projeto Cargo existente.
uk: Mockall не є частиною Rust Playground, тому вам потрібно запустити цей приклад у локальному середовищі. Використовуйте `cargo add mockall` для швидкого додавання Mockall до існуючого проекту Cargo.

source: Mockall has a lot more functionality. In particular, you can set up expectations which depend on the arguments passed. Here we use this to mock a cat which becomes hungry 3 hours after the last time it was fed:
fa: ‏ Mockall عملکرد بسیار بیشتری دارد. به ویژه، می‌توانید انتظاراتی را تنظیم کنید که به استدلال های ارائه شده بستگی دارد. در اینجا ما از این برای mock کردن عملکرد cat استفاده می‌کنیم که 3 ساعت پس از آخرین باری که به آن غذا داده شده گرسنه می‌شود:
ja: Mockall にはさらに多くの機能があります。特に、渡される引数に応じて期待値を設定できます。ここでは、最後に餌を与えてらえてから 3 時間後に空腹になる猫をモックするためにこれを使用します。
pt_br: Mockall tem muito mais funcionalidades. Em particular, você pode configurar expectativas que dependem dos argumentos passados. Aqui usamos isso para "_mockar_" um gato que fica com fome 3 horas após a última vez que foi
uk: Mockall має набагато більше функціональних можливостей. Зокрема, ви можете встановлювати очікування, які залежать від переданих аргументів. Тут ми використовуємо це, щоб імітувати кота, який зголоднів через 3 години після того, як його востаннє годували:

source: You can use `.times(n)` to limit the number of times a mock method can be called to `n` --- the mock will automatically panic when dropped if this isn't satisfied.
fa: می‌توانید از `.times(n)` برای محدود‌کردن تعداد دفعاتی که یک mock method می‌تواند به`n` فراخوانی شود استفاده کنید --- در صورت عدم ارضای این روش، زمانی که آن را حذف کنید به‌طور خودکار دچار panic می‌شود.
ja: `.times(n)` を使用すると、モックメソッドが呼び出される回数を`n` に制限できます。これが満たされない場合、モックはドロップ時に自動的にパニックになります。
pt_br: Você pode usar `.times(n)` para limitar o número de vezes que um método _mock_ pode ser chamado para `n` --- o _mock_ automaticamente irá gerar um pânico quando descartado se isso não for satisfeito.
uk: Ви можете використати `.times(n)`, щоб обмежити кількість викликів імітаційного методу до `n` --- імітація автоматично панікує при звільненні, якщо ця умова не виконується.

source: You should use the `log` crate to automatically log to `logcat` (on-device) or `stdout` (on-host):
es: Utiliza el crate `log` para que se registre automáticamente en `logcat` (en el dispositivo) o `stdout` (en el host):
fa: باید از `log` crate برای ورود خودکار به`logcat` (روی دستگاه) یا `stdout` (روی host) استفاده کنید:
ja: `log` クレートを使用して、自動的に （デバイス上では）`logcat` または （ホスト上では）`stdout`にログを記録するようにします。
ko: `log` 크레이트를 사용하면 안드로이드 디바이스 안에서 수행될 때에는 `logcat`으로, 호스트에서 수행될 때에는 `stdout`으로 로그가 자동으로 출력이 되도록 할 수 있습니다:
pt_br: Você deve usar o `crate` `log` para logar automaticamente no `logcat` (no dispositivo) ou `stdout` (no _host_):
uk: Ви повинні використовувати крейт `log` для автоматичної реєстрації в `logcat` (на пристрої) або `stdout` (на хості):

source: //! Rust logging demo.
ja: //! Rust ロギングのデモ。
uk: //! Демонстрація журналу Rust.

source: /// Logs a greeting.
ja: /// 挨拶をログに記録します。
pt_br: /// Registra uma saudação.
uk: /// Реєструє привітання.

source: "Starting program."
fa: "شروع برنامه."
pt_br: "Iniciando programa."
uk: "Запуск програми."

source: "Things are going fine."
fa: "کارها خوب پیش می‌رود."
pt_br: "As coisas estão indo bem."
uk: "Справи йдуть добре."

source: "Something went wrong!"
pt_br: "Algo deu errado!"
uk: "Щось пішло не так!"

source: Build, push, and run the binary on your device:
es: Compila, inserta y ejecuta el binario en tu dispositivo:
fa: ساخت، push و اجرای باینری‌ها روی یک ماشین:
ja: デバイスでバイナリをビルド、push、実行します。
ko: 빌드하고, 가상 디바이스에 넣고, 실행합니다:
pt_br: Compile, envie e execute o binário em seu dispositivo:
uk: Створіть, завантажте і запустіть бінарний файл на своєму пристрої:

source: The logs show up in `adb logcat`:
es: Los registros se muestran en `adb logcat`:
fa: لاگ‌ها در `adb logcat` نشان‌داده می‌شوند:
ja: `adb logcat` でログを表示できます。
ko: `adb logcat`커맨드로 로그를 확인합니다:
pt_br: Os logs aparecem em `adb logcat`:
uk: Журнали відображаються в `adb logcat`:

source: The logger implementation in `liblogger` is only needed in the final binary, if you're logging from a library you only need the `log` facade crate.
uk: Реалізація логгера у `liblogger` потрібна лише у фінальній версії, якщо ви логіруєте з бібліотеки, вам знадобиться лише фасадний крейт`log`.

source: Rust has excellent support for interoperability with other languages. This means that you can:
es: Rust admite sin problemas la interoperabilidad con otros lenguajes. Esto significa que puedes hacer lo siguiente:
fa: ‏‌Rust از قابلیت همکاری با زبان‌های دیگر پشتیبانی می‌کند. این بدان معنی است که شما می‌توانید:
ja: Rust は他の言語との相互運用性に優れているため、次のことが可能です。
ko: 러스트는 다음과 같이 다른 언어와의 상호운용성을 훌륭히 지원합니다:
pt_br: O Rust tem excelente suporte para interoperabilidade com outras linguagens. Isso significa que você pode:
uk: Rust чудово підтримує взаємодію з іншими мовами. Це означає, що ви можете:

source: Call Rust functions from other languages.
es: Llamar a funciones de Rust desde otros lenguajes.
fa: توابع Rust را از زبان های دیگر فراخوانی کنید.
ja: 他の言語から Rust 関数を呼び出す。
ko: 타 언어에서 러스트 함수를 호출합니다.
pt_br: Chamar funções Rust em outras linguagens.
uk: Викликати функції Rust з інших мов.

source: Call functions written in other languages from Rust.
es: Llamar a funciones escritas en otros lenguajes desde Rust.
fa: فراخوانی توابع نوشته شده به زبان های دیگر از Rust.
ja: Rust から他の言語で記述された関数を呼び出す。
ko: 타 언어의 함수를 러스트에서 호출합니다.
pt_br: Chamar funções escritas em outras linguagens no Rust.
uk: Функції виклику, написані іншими мовами з Rust.

source: When you call functions in a foreign language we say that you're using a _foreign function interface_, also known as FFI.
es: Cuando llamas a funciones en otro lenguaje, se dice que estás usando una _interfaz de función externa_, también denominada FFI.
fa: وقتی توابعی را به‌ یک زبان خارجی فراخوانی می‌کنید، می‌گوییم که از یک رابط تابع خارج( _foreign function interface_) که به نام FFI نیز شناخته می‌شود، استفاده می‌کنید.
ja: 他の言語の関数を呼び出す場合は、外部関数インターフェース（FFI: _foreign function interface_）を使用します。
ko: 타 언어의 함수를 호출해서 사용하는 것을 FFI(foreign function interface)라고 합니다.
pt_br: Quando você chama funções em outra linguagem, dizemos que você está usando uma _interface de função externa_, também conhecida como FFI.
uk: Коли ви викликаєте функції з іншої мови, ми говоримо, що ви використовуєте _foreign function interface_, також відомий як FFI.

source: Interoperability with C
es: Interoperabilidad con C
fa: قابلیت همکاری با C
ja: C との相互運用性
ko: C와의 상호운용성
pt_br: Interoperabilidade com C
uk: Взаємодія з C

source: Rust has full support for linking object files with a C calling convention. Similarly, you can export Rust functions and call them from C.
es: Rust admite vincular archivos de objetos con una convención de llamada de C. Del mismo modo, puedes exportar funciones de Rust y llamarlas desde C.
fa: ‏ Rust پشتیبانی کاملی برای link دادن object fileهایی با یک فراخوانی C دارد. به طور مشابه، می توانید توابع Rust را export کرده و آنها را از C فراخوانی کنید.
ja: Rust は、C の呼び出し規則によるオブジェクト ファイルのリンクを完全にサポートしています。同様に、Rust 関数をエクスポートして C から呼び出すことができます。
ko: 러스트는 C 호출규약을 따르는 오브젝트 파일과 링킹할 수 있습니다. 또한, 반대로 러스트 함수를 내보내서 C에서 호출 할 수 도 있습니다.
pt_br: _Rust_ tem suporte completo para vincular arquivos de objeto com uma convenção de chamada C. Da mesma forma, você pode exportar funções Rust e chamá-las em C.
uk: Rust має повну підтримку зв’язування об’єктних файлів за допомогою угоди про виклики C. Так само ви можете експортувати функції Rust і викликати їх із C.

source: You can do it by hand if you want:
es: Si quieres, puedes hacerlo de forma manual:
fa: در صورت تمایل می‌توانید این کار را دستی انجام دهید:
ja: これは手動で行うこともできます。
ko: 원한다면 아래와 같이 수동으로 코딩할 수 있습니다:
pt_br: Você pode fazer isso manualmente se quiser:
uk: Ви можете зробити це вручну, якщо хочете:

source: We already saw this in the [Safe FFI Wrapper exercise](../../unsafe-rust/exercise.md).
fa: ما قبلاً این را در [تمرین Safe FFI Wrapper](../../unsafe-rust/exercise.md) دیدیم.
uk: Ми вже бачили це у [вправі Safe FFI Wrapper](../../unsafe-rust/exercise.md).
