Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: For VMs running under crosvm on aarch64, the [vmbase](https://android.googlesource.com/platform/packages/modules/Virtualization/+/refs/heads/master/vmbase/) library provides a linker script and useful defaults for the build rules, along with an entry point, UART console logging and more.
es: En el caso de las máquinas virtuales que se ejecutan con crosvm en aarch64, la biblioteca [vmbase](https://android.googlesource.com/platform/packages/modules/Virtualization/+/refs/heads/master/vmbase/) proporciona una secuencia de comandos de enlazador y valores predeterminados útiles para las reglas de compilación, además de un punto de entrada, registro de la consola UART y mucho más.
ja: [vmbase](https://android.googlesource.com/platform/packages/modules/Virtualization/+/refs/heads/master/vmbase/)というライブラリは、aarch64上のcrosvm下で実行されるVMに対して、エントリポイント、UARTコンソールロギングなどに加えて、リンカスクリプトと有用なデフォルトビルドルールを提供してくれます。
ko: [vmbase](https://android.googlesource.com/platform/packages/modules/Virtualization/+/refs/heads/master/vmbase/) 라이브러리는, aarch64의 crosvm에서 실행되는 VM을 타겟하여, 진입점, UART 콘솔 로깅, 링커 스크립트, 빌드 룰 등에 대한 기본 구현들을 제공합니다.
pt_br: Para VMs em execução sob crosvm em aarch64, a biblioteca [vmbase](https://android.googlesource.com/platform/packages/modules/Virtualization/+/refs/heads/master/vmbase/) fornece um _linker script_ e padrões úteis para as regras de compilação, juntamente com um ponto de entrada, _logging_ de console UART e muito mais.

source: Threads are all daemon threads, the main thread does not wait for them.
es: Los hilos son todos hilos daemon, y el hilo principal no espera por ellos.
ja: スレッドはすべてデーモンスレッドで、メインスレッドはそれらを待ちません。
ko: 스레드는 모두 데몬 스레드입니다. 따라서 메인 스레드는 이 스레드들이 끝나기를 기다리지 않습니다.
pt_br: _Threads_ são todas "_daemon threads_", a _thread_ principal não espera por elas.

source: These types are thread-safe, but they cannot be moved to another thread:
es: Estos tipos son seguros para los hilos _(thread safe)_, pero no se pueden mover a otro hilo:
ja: このような型はスレッドセーフですが、別のスレッドにムーブすることはできません：
ko: 아래 타입들은 스레드 안전하지만 다른 스레드로 이동될 수 없습니다:
pt_br: Esses tipos são _thread-safe_, mas não podem ser movidos para outro _thread_:

source: `MutexGuard<T: Sync>`: Uses OS level primitives which must be deallocated on the thread which created them.
pt_br: `MutexGuard<T>`: Usa primitivas a nível de sistema operacional que devem ser desalocadas no _thread_ que as criou.

source: "Failed to send cat."
pt_br: "Falha ao enviar gato."

source: "Failed to send dog."
pt_br: "Falha ao enviar cachorro."

source: "Failed to receive winner"
pt_br: "Falha ao receber vencedor"

source: "Winner is {winner:?}"
pt_br: "O vencedor é {winner:?}"

source: In this example, we have a race between a cat and a dog. `first_animal_to_finish_race` listens to both channels and will pick whichever arrives first. Since the dog takes 50ms, it wins against the cat that take 500ms.
es: En este ejemplo, tenemos una carrera entre un gato y un perro. `first_animal_to_finish_race` escucha a ambos canales y elige el que llegue primero. Como el perro tarda 50 ms, gana al gato, que tarda 500 ms.
pt_br: Neste exemplo, temos uma corrida entre um gato e um cachorro. `first_animal_to_finish_race` escuta ambos os canais e escolherá o que chegar primeiro. Como o cachorro leva 50ms, ele vence contra o gato que leva 500ms.

source: You can use `oneshot` channels in this example as the channels are supposed to receive only one `send`.
es: En este ejemplo, puedes usar canales `oneshot`, ya que se supone que solo recibirán un `send`.
ja: この例では`oneshot`チャネルを使うこともできます。なぜなら、チャネルは一回きりの`send`を受け取ることになっているからです。
pt_br: Você pode usar canais `oneshot` neste exemplo, já que os canais devem receber apenas um `send`.

source: Try adding a deadline to the race, demonstrating selecting different sorts of futures.
es: Prueba a añadir un límite a la carrera y demuestra cómo se seleccionan distintos tipos de futuros.
ja: レースに制限時間を追加することによって、違う種類のfutureをselectすることを実演してみてください。
pt_br: Tente adicionar um prazo para a corrida, demonstrando a seleção de diferentes tipos de _futures_.

source: Note that `select!` drops unmatched branches, which cancels their futures. It is easiest to use when every execution of `select!` creates new futures.
es: Ten en cuenta que `select!` elimina las ramas sin coincidencias, cancelando así sus futuros. Es más fácil de usar cuando cada ejecución de `select!` crea futuros.
ja: `select!`はマッチしなかったブランチをドロップすることに注意してください。これは、そうしたブランチのfutureがキャンセルされることにつながります。`select!`を毎回実行する際に新たなfutureが作成されるときに、`select!`を使うのが最も簡単です。
pt_br: Observe que `select!` descarta ramos não correspondidos, o que cancela suas _futures_. É mais fácil de usar quando cada execução de `select!` cria novas _futures_.

source: An alternative is to pass `&mut future` instead of the future itself, but this can lead to issues, further discussed in the pinning slide.
es: También puedes enviar `&mut future` en lugar del futuro en sí, pero esto podría provocar problemas, como se explica más adelante en la diapositiva sobre pines.
ja: Futureそのものでなく、`&mut future`を渡すという代替案もあります。しかし、これは問題につながることもあります。このことはPinに関するスライドで詳細に議論します。
pt_br: Uma alternativa é passar `&mut future` em vez da própria _future_, mas isso pode levar a problemas, discutidos mais adiante no slide de _pinning_.

source: allocate: Dynamic memory allocation on [the heap](memory-management/stack-vs-heap.md).
ja: 割り当て（allocate）: [ヒープ](memory-management/stack-vs-heap.md) での動的メモリ割り当て。
pt_br: alocar: Alocação dinâmica de memória no [_heap_](memory-management/stack-vs-heap.md).

source: block: See [Blocks](control-flow/blocks.md) and _scope_.
ja: ブロック（block）: [ブロック](control-flow/blocks.md) とスコープをご覧ください。
pt_br: bloco: Veja [Blocos](control-flow/blocks.md) e _escopo_.

source: borrow: See [Borrowing](ownership/borrowing.md).
ja: 借用（borrow）: [借用](ownership/borrowing.md) をご覧ください。
pt_br: empréstimo: Veja [Empréstimo](ownership/borrowing.md).

source: Concurrency in Rust: See [Concurrency in Rust](concurrency.md).
ja: Rust での同時実行（Concurrency in Rust）: [Rust での同時実行](concurrency.md) をご覧ください。
pt_br: Concorrência em Rust: Veja [Concorrência em Rust](concurrency.md).

source: unsafe: The subset of Rust which allows you to trigger _undefined behavior_. See [Unsafe Rust](unsafe.html).
ja: 安全でない（unsafe）: 未定義の動作をトリガーできる Rust のサブセット。[安全でない Rust](unsafe.html) をご覧ください。
pt_br: não seguro (_unsafe_): O subconjunto de Rust que permite que você acione _comportamentos indefinidos_. Veja [Rust não seguro](unsafe.html).

source: [Rust for Embedded C Programmers](https://docs.opentitan.org/doc/ug/rust_for_c/): covers Rust from the perspective of developers who write firmware in C.
es: [Rust for Embedded C Programmers](https://docs.opentitan.org/doc/ug/rust_for_c/): explica Rust desde la perspectiva de los desarrolladores que escriben _firmware_ en C.
ja: [Rust for Embedded C Programmers](https://docs.opentitan.org/doc/ug/rust_for_c/): ファームウェアを C で記述するデベロッパーの観点から Rust を解説しています。
ko: [Rust for Embedded C Programmers](https://docs.opentitan.org/doc/ug/rust_for_c/): 임베디드 C개발자(펌웨어 개발자)를 위한 러스트 가이드입니다.
pt_br: [Rust for Embedded C Programmers](https://docs.opentitan.org/doc/ug/rust_for_c/): cobre Rust da perspectiva dos desenvolvedores que escrevem firmware em C.

source: Hello, World
ar: مرحبًا، أيها العالم
fa: سلام, دنیا

source: Android
fa: اندروید
ko: 안드로이드

source: Course schedule:
fa: مباحث دوره:
ja: コースのスケジュール:

source: Day 1 Morning (2 hours and 5 minutes, including breaks)
fa: روز ۱ صبح (۲ ساعت و ۵ دقیقه با احتساب استراحت)

source: Segment
fa: بخش

source: Duration
fa: مدت زمان

source: 5 minutes
fa: ۵ دقیقه

source: 15 minutes
fa: ۱۵ دقیقه

source: 40 minutes
fa: ۴۰ دقیقه

source: Day 1 Afternoon (2 hours and 35 minutes, including breaks)
fa: روز ۱ بعد از ظهر (۲ ساعت و ۳۵ دقیقه،شامل وقت استراحت)

source: 35 minutes
fa: ۳۵ دقیقه

source: 55 minutes
fa: ۵۵ دقیقه

source: 50 minutes
fa: ۵۰ دقیقه

source: Day 2 Morning (2 hours and 10 minutes, including breaks)
fa: روز ۲ صبح (۲ ساعت و ۱۰ دقیقه، شامل وقت استراحت)

source: 3 minutes
fa: ۳ دقیقه

source: 1 hour
fa: ۱ ساعت

source: Day 2 Afternoon (3 hours and 15 minutes, including breaks)
fa: روز ۲ بعد از ظهر (۴ ساعت و ۵ دقیقه، شامل وقت استراحت)

source: 45 minutes
fa: ۴۵ دقیقه

source: 1 hour and 10 minutes
fa: ۱ ساعت و ۱۰ دقیفه

source: Day 3 Morning (2 hours and 20 minutes, including breaks)
fa: روز ۳ صبح (۲ ساعت و ۲۰ دقیقه، شامل وقت استراحت)

source: Day 3 Afternoon (1 hour and 55 minutes, including breaks)
fa: روز ۳ بعدازظهر(۱ ساعت و ۵۵ دقیقه، شامل وقت اسراحت)

source: Day 4 Morning (2 hours and 40 minutes, including breaks)
fa: روز ۴ صبح (۲ ساعت و ۴۰ دقیقه، شامل وقت استراحت)

source: Day 4 Afternoon (2 hours and 15 minutes, including breaks)
fa: روز ۴ بعدازظهر (۲ ساعت و ۱۰ دقیقه، شامل وقت استراحت)

source: 1 hour and 5 minutes
fa: ساعت و ۵ دقیقه

source: Morning (3 hours and 20 minutes, including breaks)
fa: صبح (۳ ساعت و ۲۰ دقیقه، شامل وقت اسراحت)

source: 30 minutes
fa: ۳۰ دقیقه

source: 20 minutes
fa: ۲۰ دقیقه

source: Send and Sync
es: Send y Sync
fa: ارسال و همگام‌سازی
ko: Send와 Sync

source: Afternoon (3 hours and 20 minutes, including breaks)
fa: بعدازظهر (۳ ساعت و ۲۰ دقیقه، شامل وقت استراحت)

source: Including 10 minute breaks, this session should take about 2 hours and 5 minutes. It contains:
fa: با احتساب 10 دقیقه استراحت، این جلسه باید حدود 2 ساعت و 5 دقیقه طول بکشد. آن شامل:

source: This segment should take about 15 minutes. It contains:
fa: این بخش ۱۵ دقیقه زمان می برد. این بخش شامل:

source: Slide
fa: اسلاید

source: 10 minutes
fa: ۱۰ دقیقه

source: 2 minutes
fa: ۲ دقیقه

source: This segment should take about 40 minutes. It contains:
fa: این بخش باید حدود ۴۰ دقیقه طول بکشد. آن شامل:

source: `-10`, `0`, `1_000`, `123_i64`
fa: <span dir=ltr><code class=hljs>-10</code>, <code class=hljs>0</code>, <code class=hljs>1_000</code>, <code class=hljs>123_i64</code></span>

source: `0`, `123`, `10_u16`
fa: <span dir=ltr><code class=hljs>0</code>, <code class=hljs>123</code>, <code class=hljs>10_u16</code></span>

source: `3.14`, `-10.0e20`, `2_f32`
fa: <span dir=ltr><code class=hljs>3.14</code>, <code class=hljs>-10.0e20</code>, <code class=hljs>2_f32</code></span>

source: if Expressions
fa: عبارت if

source: 4 minutes
fa: ۴ دقیقه

source: break and continue
fa: `break` و `continue`

source: `while`
fa: حلقه‌های `while`

source: Including 10 minute breaks, this session should take about 2 hours and 35 minutes. It contains:
fa: با احتساب 10 دقیقه استراحت، این جلسه باید حدود 2 ساعت و 35 دقیقه طول بکشد. آن شامل:

source: This segment should take about 35 minutes. It contains:
fa: این بخش باید حدود 35 دقیقه طول بکشد. این شامل:

source: This segment should take about 55 minutes. It contains:
fa: این بخش باید حدود ۵۵ دقیقه طول بکشد. آن شامل:

source: `&str` is a slice of UTF-8 encoded bytes, similar to `&[u8]`.
fa: `str&` تکه‌ای از بایت‌های رمزگذاری‌شده UTF-8، شبیه به `[u8]&` است.

source: This segment should take about 50 minutes. It contains:
fa: این بخش حدود ۵۰ دقیقه طول خواهد کشید. شامل موارد زیر است:

source: "Peter"
fa: "پیتر"

source: "Avery"
fa: "ایوری"

source: "Jackie"
fa: "جکی"

source: Including 10 minute breaks, this session should take about 2 hours and 10 minutes. It contains:
fa: با احتساب ۱۰ دقیقه استراحت، این جلسه باید حدود ۲ ساعت و ۱۰ دقیقه طول بکشد. این شامل:

source: This segment should take about 1 hour. It contains:
fa: این بخش باید حدود ۱ ساعت طول بکشد. این شامل:

source: "EldurScrollz"
fa: "dog"

source: Including 10 minute breaks, this session should take about 3 hours and 15 minutes. It contains:
fa: با احتساب ۱۰ دقیقه استراحت، این جلسه باید حدود ۳ ساعت و ۱۵ دقیقه طول بکشد. آن شامل:

source: This segment should take about 45 minutes. It contains:
fa: این بخش باید حدود ۴۵ دقیقه طول بکشد. آن شامل:

source: Exercise: Generic min
fa: تمرین: Generic `min`

source: "debuggable: {debuggable:?}"
fa: "قابل دیباگ: {debuggable:?}"

source: Result
fa: نتیجه

source: "Adventures of Huckleberry Finn"
fa: "ماجراهای هاکلبری فین"

source: "Grimms' Fairy Tales"
fa: "قصه‌های گریمز"

source: "Pride and Prejudice"
fa: "غرور و تعصب"

source: "Alice's Adventure in Wonderland"
fa: "ماجراجویی آلیس در سرزمین عجایب"

source: "Harry Potter and the Sorcerer's Stone"
fa: "هری پاتر و سنگ جادو"

source: This segment should take about 1 hour and 10 minutes. It contains:
fa: این بخش باید حدود ۱ ساعت و ۱۰ دقیقه طول بکشد. این بخش شامل موارد زیر است:

source: Default, struct update syntax
fa: به طور پیش‌فرض، ساختار به‌روزرسانی syntax

source: "accumulate"
fa: "تجمیع: {}"

source: Including 10 minute breaks, this session should take about 2 hours and 20 minutes. It contains:
fa: با احتساب استراحت‌های ۱۰ دقیقه‌ای، این جلسه باید حدود ۲ ساعت و ۲۰ دقیقه طول بکشد. این جلسه شامل:

source: "Alice"
fa: "الیس"

source: "b"
fa: "a"

source: "base64"
fa: "base64: {base64:?}"

source: Including 10 minute breaks, this session should take about 1 hour and 55 minutes. It contains:
fa: با احتساب استراحت‌های ۱۰ دقیقه‌ای، این جلسه باید حدود ۱ ساعت و ۵۵ دقیقه طول بکشد. این شامل:

source: Including 10 minute breaks, this session should take about 2 hours and 40 minutes. It contains:
fa: با احتساب ۱۰ دقیقه استراحت، این جلسه باید حدود ۲ ساعت و ۴۰ دقیقه طول بکشد. شامل:

source: Error Trait
fa: ویژگی (Trait) خطا

source: thiserror and anyhow
fa: thiserror و anyhow

source: The [`thiserror`](https://docs.rs/thiserror/) and [`anyhow`](https://docs.rs/anyhow/) crates are widely used to simplify error handling.
fa: این [`thiserror`](https://docs.rs/thiserror/) و [`anyhow`](https://docs.rs/anyhow/) crateها به طور گسترده ای برای ساده کردن رسیدگی به خطا استفاده می‌شوند.
ja: [`thiserror`](https://docs.rs/thiserror/) クレートと [`anyhow`](https://docs.rs/anyhow/) クレートは、エラー処理を簡素化するために広く使用されています。

source: `anyhow` is often used by applications to help with error handling in functions, including adding contextual information to your errors.
fa: اغلب `anyhow` توسط برنامه‌ها برای کمک به مدیریت خطا در توابع، از جمله افزودن اطلاعات متنی به خطاهای شما، استفاده می‌شود.
ja: `anyhow` は、エラーにコンテキスト情報を追加するなど、関数内でのエラー処理のためにアプリでよく使用されます。

source: This segment should take about 1 hour and 5 minutes. It contains:
fa: این بخش باید حدود ۱ ساعت و ۵ دقیقه طول بکشد.و شامل موارد زیر است:

source: "no-such-directory"
fa: "نه مشابه این دایرکتوری"

source: "The Foo Diaries\n"
fa: "این خاطرات Foo است \n"

source: `boolean`
fa: بولین‌ها`boolean`

source: "print_birthday_card"
fa: "چاپ_کارت_تولد"

source: "HelloWorld.java"
fa: سلام دنیا"HelloWorld.java"

source: Including 10 minute breaks, this session should take about 3 hours and 20 minutes. It contains:
fa: با احتساب استراحت‌های ۱۰ دقیقه‌ای، این جلسه باید حدود ۳ ساعت و ۲۰ دقیقه طول بکشد. شامل موارد زیر است:

source: This segment should take about 30 minutes. It contains:
fa: این بخش باید حدود ۳۰ دقیقه طول بکشد و شامل موارد زیر است:

source: This segment should take about 20 minutes. It contains:
fa: این بخش باید حدود ۲۰ دقیقه طول بکشد. این شامل:

source: Send
es: Enviar
fa: ارسال

source: Sync
es: Sincronizar
fa: همگام‌سازی

source: `String`, `Option<T>`, `Vec<T>`, `Box<T>`, ...
es: `String`, `Option<T>`, `Vec<T>`, `Box<T>`, etc.
fa: `(T1, T2)`, `[T; N]`, `&[T]`, `struct { x: T }`, ...
ja: `String`、`Option<T>`、`Vec<T>`、`Box<T>` など

source: Rust on Exercism
fa: ‏ Rust در تمرین‌ها

source: Conditionals
ja: 条件文

source: Trait Objects
es: Objetos Trait
ja: トレイトオブジェクト
ko: 트레잇 객체

source: String References
ja: Stringの参照

source: Mocking
ja: モック

source: AIDL
ja: AIDL（Androidインターフェイス定義言語）

source: Implementation
es: Implementación
ja: 実装
ko: 서비스 구현

source: Futures
es: Future
ja: Future
ko: Future

source: Control Flow
es: Control de Flujo
ja: 制御フロー
ko: 흐름 제어

source: Day 1 Morning (3 hours, including breaks)
ja: 1 日目の午前（休憩を含めて 3 時間）

source: [Welcome](../welcome-day-1.md) (5 minutes)
ja: [ようこそ](../welcome-day-1.md)（5 分）

source: [Hello, World](../hello-world.md) (20 minutes)
ja: [Hello, World](../hello-world.md)（20 分）

source: [Types and Values](../types-and-values.md) (1 hour and 5 minutes)
ja: [型と値](../types-and-values.md)（1 時間 5 分）

source: [Control Flow Basics](../control-flow-basics.md) (1 hour)
ja: [制御フローの基本](../control-flow-basics.md)（1 時間）

source: Day 1 Afternoon (2 hours and 55 minutes, including breaks)
ja: 1 日目の午後（休憩を含めて 2 時間 55 分）

source: [Tuples and Arrays](../tuples-and-arrays.md) (1 hour)
ja: [タプルと配列](../tuples-and-arrays.md)（1 時間）

source: [References](../references.md) (50 minutes)
ja: [参照](../references.md)（50 分）

source: [User-Defined Types](../user-defined-types.md) (50 minutes)
ja: [ユーザー定義型](../user-defined-types.md)（50 分）

source: Day 2 Morning (3 hours and 5 minutes, including breaks)
ja: 2 日目の午前（休憩を含めて 3 時間 5 分）

source: [Welcome](../welcome-day-2.md) (3 minutes)
ja: [ようこそ](../welcome-day-2.md)（3 分）

source: [Pattern Matching](../pattern-matching.md) (50 minutes)
ja: [パターン マッチング](../pattern-matching.md)（50 分）

source: [Methods and Traits](../methods-and-traits.md) (55 minutes)
ja: [メソッドとトレイト](../methods-and-train.md)（55 分）

source: [Generics](../generics.md) (45 minutes)
ja: [ジェネリクス](../generics.md)（45 分）

source: Day 2 Afternoon (3 hours, including breaks)
ja: 2 日目の午後（休憩を含めて 3 時間）

source: [Standard Library Types](../std-types.md) (1 hour and 10 minutes)
ja: [標準ライブラリ型](../std-types.md)（1 時間 10 分）

source: [Standard Library Traits](../std-traits.md) (1 hour and 40 minutes)
ja: [標準ライブラリ トレイト](../std-train.md)（1 時間 40 分）

source: Day 3 Morning (2 hours and 15 minutes, including breaks)
ja: 3 日目の午前（休憩を含めて 2 時間 15 分）

source: [Welcome](../welcome-day-3.md) (3 minutes)
ja: [ようこそ](../welcome-day-3.md)（3 分）

source: [Memory Management](../memory-management.md) (1 hour and 10 minutes)
ja: [メモリ管理](../memory-management.md)（1 時間 10 分）

source: [Smart Pointers](../smart-pointers.md) (45 minutes)
ja: [スマート ポインタ](../smart-pointers.md)（45 分）

source: Day 3 Afternoon (2 hours and 20 minutes, including breaks)
ja: 3 日目の午後（休憩を含めて 2 時間 20 分）

source: [Borrowing](../borrowing.md) (1 hour)
ja: [借用](../borrowing.md)（1 時間）

source: [Slices and Lifetimes](../slices-and-lifetimes.md) (1 hour and 10 minutes)
ja: [スライスとライフタイム](../slices-and-lifetimes.md)（1 時間 10 分）

source: Day 4 Morning (3 hours and 5 minutes, including breaks)
ja: 4 日目の午前（休憩を含めて 3 時間 5 分）

source: [Welcome](../welcome-day-4.md) (3 minutes)
ja: [ようこそ](../welcome-day-4.md)（3 分）

source: [Iterators](../iterators.md) (45 minutes)
ja: [イテレータ](../iterators.md)（45 分）

source: [Modules](../modules.md) (40 minutes)
ja: [モジュール](../modules.md)（40 分）

source: [Testing](../testing.md) (1 hour and 5 minutes)
ja: [テスト](../testing.md)（1 時間 5 分）

source: Day 4 Afternoon (2 hours, including breaks)
ja: 4 日目の午後（休憩を含めて 2 時間）

source: [Error Handling](../error-handling.md) (45 minutes)
ja: [エラー処理](../error-handling.md)（45 分）

source: [Unsafe Rust](../unsafe-rust.md) (1 hour and 5 minutes)
ja: [Unsafe Rust](../unsafe-rust.md)（1 時間 5 分）

source: [Korean](https://google.github.io/comprehensive-rust/ko/) by [@keispace](https://github.com/keispace), [@jiyongp](https://github.com/jiyongp), and [@jooyunghan](https://github.com/jooyunghan).
ja: [韓国語](https://google.github.io/comprehensive-rust/ko/): [@keispace](https://github.com/keispace)、[@jiyongp](https://github.com/jiyongp)、[@jooyunghan](https://github.com/jooyunghan)

source: [French](https://google.github.io/comprehensive-rust/fr/) by [@KookaS](https://github.com/KookaS) and [@vcaen](https://github.com/vcaen).
ja: [フランス語](https://google.github.io/comprehensive-rust/fr/): [@KookaS](https://github.com/KookaS)、[@vcaen](https://github.com/vcaen)
ko: [프랑스어](https://google.github.io/comprehensive-rust/fr/): [@KookaS](https://github.com/KookaS) 및 [@vcaen](https://github.com/vcaen) 제공.

source: [Japanese](https://google.github.io/comprehensive-rust/ja/) by [@CoinEZ-JPN](https://github.com/CoinEZ) and [@momotaro1105](https://github.com/momotaro1105).
ja: [日本語](https://google.github.io/comprehensive-rust/ja/): [@CoinEZ-JPN](https://github.com/CoinEZ)、[@momotaro1105](https://github.com/momotaro1105)
ko: [일본어](https://google.github.io/comprehensive-rust/ja/): [@CoinEZ-JPN](https://github.com/CoinEZ) 및 [@momotaro1105](https://github.com/momotaro1105) 제공.

source: In this session:
ja: このセッションの内容:

source: [Welcome](./welcome-day-1.md) (5 minutes)
ja: [ようこそ](./welcome-day-1.md)（5 分）

source: [Hello, World](./hello-world.md) (20 minutes)
ja: [Hello, World](./hello-world.md)（20 分）

source: [Types and Values](./types-and-values.md) (1 hour and 5 minutes)
ja: [型と値](./types-and-values.md)（1 時間 5 分）

source: [Control Flow Basics](./control-flow-basics.md) (1 hour)
ja: [制御フローの基本](./control-flow-basics.md)（1 時間）

source: Including 10 minute breaks, this session should take about 3 hours
ja: このセッションの所要時間は、10 分間の休憩を入れて約 3 時間です。

source: In this segment:
ja: このセグメントの内容:

source: [What is Rust?](./hello-world/what-is-rust.md) (10 minutes)
ja: [Rust とは](./hello-world/what-is-rust.md)（10 分）

source: [Hello, World](./hello-world/hello-world.md) (5 minutes)
ja: [Hello, World](./hello-world/hello-world.md)（5 分）

source: [Benefits of Rust](./hello-world/benefits.md) (3 minutes)
ja: [Rust のメリット](./hello-world/benefits.md)（3 分）

source: [Playground](./hello-world/playground.md) (2 minutes)
ja: [プレイグラウンド](./hello-world/playground.md)（2 分）

source: This segment should take about 20 minutes
ja: このセグメントの所要時間は約 20 分です

source: Experience with Java, Go, Python, JavaScript...: You get the same memory safety as in those languages, plus a similar high-level language feeling. In addition you get fast and predictable performance like C and C++ (no garbage collector) as well as access to low-level hardware (should you need it)
es: Experiencia con Java, Go, Python, JavaScript, etc.: Consigues la misma seguridad en la memoria que en éstos lenguajes, además de una sensación similar a la de un lenguaje de alto nivel. También consigues un rendimiento rápido y predecible como en C y C++ (sin recolector de memoria residual), así como acceso a hardware de bajo nivel (si lo necesitas).
ja: Java、Go、Python、JavaScriptなどの経験がある場合： これらの言語と同様のメモリ安全性と、高水準言語に近い感覚を得ることができます。また、CやC++のように高速かつ予測可能なパフォーマンス（ガベージコレクタがない）を得ることができ、（必要なら）低水準なハードウェアへのアクセスも可能です
ko: Java, Go, Python, JavaScript: 이 언어들과 동일한 메모리 안정성과 함께, '하이레벨'언어의 느낌을 느낄 수 있습니다. 거기에 더해, 가비지 컬렉터가 없는 C/C++와 유사한 수준의 빠르고 예측 가능한 성능을 기대할 수 있습니다. 그리고 필요한 경우 저수준 하드웨어를 다루는 코드로 작성할 수 있습니다.

source: [Variables](./types-and-values/variables.md) (5 minutes)
ja: [変数](./types-and-values/variables.md)（5 分）

source: [Values](./types-and-values/values.md) (10 minutes)
ja: [値](./types-and-values/values.md)（10 分）

source: [Arithmetic](./types-and-values/arithmetic.md) (5 minutes)
ja: [算術](./types-and-values/arithmetic.md)（5 分）

source: [Strings](./types-and-values/strings.md) (10 minutes)
ja: [文字列](./types-and-values/strings.md)（10 分）

source: [Type Inference](./types-and-values/inference.md) (5 minutes)
ja: [型推論](./types-and-values/inference.md)（5 分）

source: [Exercise: Fibonacci](./types-and-values/exercise.md) (30 minutes)
ja: [演習: フィボナッチ](./types-and-values/exercise.md)（30 分）

source: This segment should take about 1 hour and 5 minutes
ja: このセグメントの所要時間は約 1 時間 5 分です

source: What about integer overflow? In C and C++ overflow of _signed_ integers is actually undefined, and might do different things on different platforms or compilers. In Rust, it's defined.
ja: 整数オーバーフローはどうでしょうか。C と C++ では、 _符号付き_ 整数のオーバーフローは実際には未定義であり、プラットフォームやコンパイラによって動作が異なる場合があります。Rust では、整数オーバーフローが定義されています。

source: Rust has two types to represent strings, both of which will be covered in more depth later. Both _always_ store UTF-8 encoded strings.
ja: Rust には文字列を表す 2 つの型があります。どちらも後ほど詳しく説明します。両方とも、 _常に_ UTF-8 でエンコードされた文字列を格納します。

source: `String` - a modifiable, owned string.
ja: `String` - 変更可能で、所有権をもつ文字列。

source: `&str` - a read-only string. String literals have this type.
ja: `&str` - 読み取り専用の文字列。文字列リテラルはこの型です。
