Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Save the result of `divide_in_two` in the `result` variable and `match` it in a loop. That won't compile because `msg` is consumed when matched. To fix it, match `&result` instead of `result`. That will make `msg` a reference so it won't be consumed. This ["match ergonomics"](https://rust-lang.github.io/rfcs/2005-match-ergonomics.html) appeared in Rust 2018. If you want to support older Rust, replace `msg` with `ref msg` in the pattern.
fa: نتیجه‌ی تابع `divide_in_two` را در متغیر `result` ذخیره کنید و آن را در یک حلقه با استفاده از `match` بررسی کنید. این کد کامپایل نمی‌شود زیرا `msg` هنگام مطابقت مصرف می‌شود. برای رفع این مشکل، به جای `result` از `result&` استفاده کنید. این کار باعث می‌شود `msg` به صورت یک ارجاع باشد و مصرف نشود. این ویژگی که به نام ["match ergonomics"](https://rust-lang.github.io/rfcs/2005-match-ergonomics.html) شناخته می‌شود، در Rust 2018 معرفی شده است. اگر می‌خواهید از نسخه‌های قدیمی‌تر Rust پشتیبانی کنید، به جای `msg` از `ref msg` در الگو استفاده کنید.
ja: `divide_in_two` の結果を `result` 変数に保存し、ループで `match` します。一致した場合は `msg` が使用されるため、コンパイルされません。これを修正するには、`result` ではなく `&result` でマッチします。これにより、`msg` は参照になるため、使用されなくなります。この [「マッチエルゴノミクス」](https://rust-lang.github.io/rfcs/2005-match-ergonomics.html) は、Rust 2018 で登場しました。古いRustをサポートする場合は、パターン内の`msg`を`ref msg` に置き換えてください。
pt_br: Salve o resultado de `divide_in_two` na variável `result` e faça uma correspondência de padrão (`match`) em um loop. Isso não irá compilar porque `msg` é consumido quando correspondido. Para corrigir, faça uma correspondência de padrão em `&result` ao invés de `result`. Isso fará com que `msg` seja uma referência, de forma que não será consumido. Essa ["ergonomia de correspondência"](https://rust-lang.github.io/rfcs/2005-match-ergonomics.html) apareceu no Rust 2018. Se você quiser suportar versões mais antigas do Rust, substitua `msg` por `ref msg` no padrão.

source: [Methods](./methods-and-traits/methods.md) (10 minutes)
ja: [メソッド](./methods-and-train/methods.md)（10 分）
pt_br: [Métodos](./methods-and-traits/methods.md) (10 minutos)

source: [Traits](./methods-and-traits/traits.md) (15 minutes)
pt_br: [Traits](./methods-and-traits/traits.md) (15 minutos)

source: [Deriving](./methods-and-traits/deriving.md) (3 minutes)
pt_br: [Derivação](./methods-and-traits/deriving.md) (3 minutos)

source: [Exercise: Generic Logger](./methods-and-traits/exercise.md) (20 minutes)
ja: [演習: ジェネリックなロガー](./methods-and-train/exercise.md)（20 分）
pt_br: [Exercício: Logger Genérico](./methods-and-traits/exercise.md) (20 minutos)

source: "verbosity={verbosity}: {message}"
fa: "اطلاعات بیشتر={verbosity}: {message}"
pt_br: "verbosidade={verbosity}: {message}"

source: "FYI"
pt_br: "PSC (_FYI_)"

source: "Uhoh"
fa: "اوهو"
pt_br: "oh-oh"

source: [Generics](./generics.md) (45 minutes)
ja: [ジェネリクス](./generics.md)（45 分）
pt_br: [Genéricos](./generics.md) (45 minutos)

source: [Standard Library Types](./std-types.md) (1 hour)
pt_br: [Tipos da Biblioteca Padrão](./std-types.md) (1 hora)

source: [Standard Library Traits](./std-traits.md) (1 hour and 10 minutes)
pt_br: [_Traits_ da Biblioteca Padrão](./std-traits.md) (1 hora e 10 minutos)

source: Including 10 minute breaks, this session should take about 3 hours and 15 minutes
pt_br: Incluindo pausas de 10 minutos, esta sessão deve durar cerca de 3 horas e 15 minutos

source: [Generic Functions](./generics/generic-functions.md) (5 minutes)
ja: [ジェネリック関数](./generics/generic-functions.md)（5 分）
pt_br: [Funções Genéricas](./generics/generic-functions.md) (5 minutos)

source: [Generic Data Types](./generics/generic-data.md) (10 minutes)
pt_br: [Tipos de Dados Genéricos](./generics/generic-data.md) (10 minutos)

source: [Trait Bounds](./generics/trait-bounds.md) (10 minutes)
ja: [トレイト境界](./generics/trait-bounds.md)（10 分）
pt_br: [Limites de _Trait_](./generics/trait-bounds.md) (10 minutos)

source: [impl Trait](./generics/impl-trait.md) (5 minutes)
ja: [impl トレイト](./generics/impl-trait.md)（5 分）
pt_br: [impl Trait](./generics/impl-trait.md) (5 minutos)

source: [dyn Trait](./generics/dyn-trait.md) (5 minutes)
pt_br: [_Trait_ dyn](./generics/dyn-trait.md) (5 minutos)

source: [Exercise: Generic min](./generics/exercise.md) (10 minutes)
ja: [演習: ジェネリックな min](./generics/exercise.md)（10 分）
pt_br: [Exercício: Mínimo Genérico](./generics/exercise.md) (10 minutos)

source: This segment should take about 45 minutes
ja: このセグメントの所要時間は約 45 分です
pt_br: Este segmento deve durar cerca de 45 minutos

source: "picked a tuple: {:?}"
fa: "یک تاپل انتخاب کرد: {:?}"
pt_br: "escolheu uma tupla: {:?}"

source: You can do this with `T: Trait` or `impl Trait`:
es: Puedes hacerlo con `T: Trait` o `impl Trait`:
ja: そうしたことは`T: Trait` や `impl Trait`を用いて行えます：
ko: `T: Trait` 혹은 `impl Trait`를 사용하면 됩니다:
pt_br: Você consegue fazer isso com `T:Trait` ou `impl Trait`:

source: [Standard Library](./std-types/std.md) (3 minutes)
ja: [標準ライブラリ](./std-types/std.md)（3 分）
pt_br: [Biblioteca Padrão](./std-types/std.md) (3 minutos)

source: [Documentation](./std-types/docs.md) (5 minutes)
ja: [ドキュメント](./std-types/docs.md)（5 分）
pt_br: [Documentação](./std-types/docs.md) (5 minutos)

source: [Option](./std-types/option.md) (10 minutes)
ja: [Option](./std-types/option.md)（10 分）
pt_br: [Option](./std-types/option.md) (10 minutos)

source: [Result](./std-types/result.md) (5 minutes)
pt_br: [Result](./std-types/result.md) (5 minutos)

source: [String](./std-types/string.md) (5 minutes)
pt_br: [String](./std-types/string.md) (5 minutos)

source: [Vec](./std-types/vec.md) (5 minutes)
pt_br: [Vec](./std-types/vec.md) (5 minutos)

source: [HashMap](./std-types/hashmap.md) (5 minutes)
pt_br: [HashMap](./std-types/hashmap.md) (5 minutos)

source: [Exercise: Counter](./std-types/exercise.md) (20 minutes)
pt_br: [Exercício: Contador](./std-types/exercise.md) (20 minutos)

source: "s1: len = {}, capacity = {}"
pt_br: "s1: tam = {}, capacidade = {}"

source: "s2: len = {}, capacity = {}"
pt_br: "s2: tam = {}, capacidade = {}"

source: "s3: len = {}, number of chars = {}"
pt_br: "s3: tam = {}, número de caracteres = {}"

source: "v1: len = {}, capacity = {}"
pt_br: "v1: tamanho = {}, capacidade = {}"

source: "v2: len = {}, capacity = {}"
pt_br: "v2: tamanho = {}, capacidade = {}"

source: We are showing `HashMap<String, i32>`, and avoid using `&str` as key to make examples easier. Using references in collections can, of course, be done, but it can lead into complications with the borrow checker.
es: Mostraremos `HashMap<String, i32>` y evitaremos utilizar `&str` para que los ejemplos sean más sencillos. Por supuesto, se pueden usar las referencias en las colecciones, pero pueden dar problemas con el _borrow checker_.
fa: ما `<HashMap<String, i32` را نمایش می‌دهیم و از استفاده از `str&` به‌عنوان کلید اجتناب می‌کنیم تا مثال‌ها ساده‌تر شوند. استفاده از ارجاعات در مجموعه‌ها البته ممکن است، اما می‌تواند به مشکلاتی با borrow checker منجر شود.
ja: ここでは `HashMap<String, i32>` を示していますが、例を簡単にするために `&str` をキーとして使用しないようにしています。もちろん、コレクション内で参照を使用することもできますが、それによって借用チェッカーが複雑になる可能性があります。
ko: 예제 코드에서는 편의상 해시맵의 키로 `&str`를 사용하지 않았습니다. 물론 컬렉션에 참조를 사용할 수도 있습니다. 다만 참조를 사용하게 되면 빌림 검사기 때문에 복잡해 질 수 있습니다.
pt_br: Estamos mostrando `HashMap<String, i32>`, e evite usar `&str` como chave para facilitar os exemplos. É claro que o uso de referências em coleções pode ser feito, mas isto pode levar a complicações com o verificador de empréstimos.

source: Try removing `to_string()` from the example above and see if it still compiles. Where do you think we might run into issues?
es: Prueba a eliminar `to_string()` del ejemplo anterior para ver si aún sigue compilando. ¿Dónde crees que podríamos encontrar problemas?
fa: حذف `()to_string` از مثال بالا را امتحان کنید و ببینید آیا هنوز کامپایل می‌شود یا خیر. فکر می‌کنید ممکن است با چه مشکلاتی مواجه شویم؟
ja: 上記の例から `to_string()` を削除して、まだコンパイルできるかどうかを確認します。どこで問題が発生するでしょうか。
ko: 예제 코드에서 `to_string()`을 없애도 컴파일에 문제가 없는지 확인해보세요. 어떤 문제에 부딪힐까요?
pt_br: Tente remover `to_string()` do exemplo acima e veja se ele ainda compila. Onde você acha que podemos ter problemas?

source: [Comparisons](./std-traits/comparisons.md) (5 minutes)
pt_br: [Comparações](./std-traits/comparisons.md) (5 minutos)

source: [Operators](./std-traits/operators.md) (5 minutes)
pt_br: [Operadores](./std-traits/operators.md) (5 minutos)

source: [From and Into](./std-traits/from-and-into.md) (5 minutes)
pt_br: [From e Into](./std-traits/from-and-into.md) (5 minutos)

source: [Casting](./std-traits/casting.md) (5 minutes)
ja: [キャスト](./std-train/casting.md)（5 分）
pt_br: [Conversões](./std-traits/casting.md) (5 minutos)

source: [Read and Write](./std-traits/read-and-write.md) (5 minutes)
pt_br: [Read e Write](./std-traits/read-and-write.md) (5 minutos)

source: [Default, struct update syntax](./std-traits/default.md) (5 minutes)
ja: [Default、構造体更新記法](./std-lets/default.md)（5 分）
pt_br: [Default, sintaxe de atualização de struct](./std-traits/default.md) (5 minutos)

source: [Closures](./std-traits/closures.md) (10 minutes)
pt_br: [Closures](./std-traits/closures.md) (10 minutos)

source: [Exercise: ROT13](./std-traits/exercise.md) (30 minutes)
ja: [演習: ROT13](./std-train/exercise.md)（30 分）
pt_br: [Exercício: ROT13](./std-traits/exercise.md) (30 minutos)

source: This segment should take about 1 hour and 10 minutes
ja: このセグメントの所要時間は約 1 時間 10 分です
pt_br: Este segmento deve levar cerca de 1 hora e 10 minutos

source: Types implement [`From`](https://doc.rust-lang.org/std/convert/trait.From.html) and [`Into`](https://doc.rust-lang.org/std/convert/trait.Into.html) to facilitate type conversions:
es: Los tipos implementan [`From`](https://doc.rust-lang.org/std/convert/trait.From.html) y [`Into`](https://doc.rust-lang.org/std/convert/trait.Into.html) para facilitar las conversiones de tipos:
ja: 型は、型変換を容易にする [`From`](https://doc.rust-lang.org/std/convert/trait.From.html) と [`Into`](https://doc.rust-lang.org/std/convert/trait.Into.html) を実装しています。
ko: 타입은 용이한 형변환을 위해 [`From`](https://doc.rust-lang.org/std/convert/trait.From.html)과 [`Into`](https://doc.rust-lang.org/std/convert/trait.Into.html)를 구현합니다:
pt_br: Os tipos implementam [`From`](https://doc.rust-lang.org/std/convert/trait.From.html) e [`Into`](https://doc.rust-lang.org/std/convert/trait.Into.html) para facilitar as conversões de tipo:

source: "Calling function on {input}"
pt_br: "Chamando a função com {input}"

source: An `Fn` (e.g. `add_3`) neither consumes nor mutates captured values, or perhaps captures nothing at all. It can be called multiple times concurrently.
es: Un `Fn` (por ejemplo, `add_3`) no consume ni modifica los valores capturados, o quizá no captura nada en absoluto. Se puede llamar varias veces al mismo tiempo.
ja: `Fn`（例: `add_3`）は、キャプチャした値を使用も変更もしないか、または何もキャプチャしない場合があります。これは同時に複数回呼び出すことができます。
ko: `Fn`(예를 들어 `add_3`)은 캡처된 값을 소모도 변경도 하지 않고, 혹은 어떤 것도 캡쳐하지 않았을 수도 있기 때문에 동시에 여러번 호출할 수 있습니다.
pt_br: Um `Fn` (p.ex. `add_3`) não consome nem muda os valores capturados ou talvez não capture nada, podendo então ser chamado várias vezes simultaneamente.

source: An `FnMut` (e.g. `accumulate`) might mutate captured values. You can call it multiple times, but not concurrently.
es: Un `FnMut` (por ejemplo, `accumulate`) puede modificar los valores capturados. Se puede llamar varias veces, pero no de forma simultánea.
ja: `FnMut`（例: `accumulate`）は、キャプチャした値を変更することがあります。複数回呼び出すことはできますが、同時に呼び出すことはできません。
ko: `FnMut`(예를 들어 `accumulate`)는 캡처된 값을 변경할 수 있으므로 여러 번 호출은 가능하지만 동시에 호출 할 수는 없습니다.
pt_br: Um `FnMut` (p.ex. `accumulate`) pode alterar os valores capturados, logo você pode chamá-lo várias vezes, mas não simultaneamente.

source: If you have an `FnOnce` (e.g. `multiply_sum`), you may only call it once. It might consume captured values.
es: Si tienes un `FnOnce` (por ejemplo, `multiply_sum`), solo puedes llamarlo una vez. Puede consumir valores capturados.
ja: `FnOnce`（例: `multiply_sum`）がある場合は、1 回だけ呼び出すことができます。これは、キャプチャした値を使用する場合があります。
ko: `FnOnce` (예를 들어 `multiply_sum`)는 한번만 호출되며 캡처된 값을 소모합니다.
pt_br: Se você tiver um `FnOnce` (p.ex. `multiply_sum`), poderá chamá-lo apenas uma vez. Ele pode consumir os valores capturados.

source: In contrast, when you have a closure, the most flexible you can have is `Fn` (it can be passed everywhere), then `FnMut`, and lastly `FnOnce`.
ja: 一方、クロージャがある場合、最も柔軟性の高い方法は、まず `Fn`（どこでも渡すことができるため）、次に `FnMut`、最後に `FnOnce` を使用することです。
pt_br: Em contraste, quando você tem um _closure_, o mais flexível que você pode ter é `Fn` (ele pode ser passado para qualquer lugar), então `FnMut` e, por último, `FnOnce`.

source: The compiler also infers `Copy` (e.g. for `add_3`) and `Clone` (e.g. `multiply_sum`), depending on what the closure captures.
es: El compilador también infiere `Copy` (por ejemplo, `add_3`) y `Clone` (por ejemplo, `multiply_sum`), dependiendo de lo que capture el cierre.
ja: コンパイラは、クロージャがキャプチャする内容に応じて、`Copy`（例: `add_3`）と `Clone`（例: `multiply_sum`）も推測します。
ko: 컴파일러는 클로저가 무엇을 캡쳐하는지에 따라 `Copy`(예를 들어 `add_3`)과 `Clone`(예를 들어 `multiply_sum`)을 알아서 추론합니다.
pt_br: O compilador também infere `Copy` (p.ex. para `add_3`) e `Clone` (p.ex.

source: By default, closures will capture by reference if they can. The `move` keyword makes them capture by value.
es: De forma predeterminada, los cierres capturan, si pueden, por referencia. La palabra clave `move` hace que capturen por valor.
ja: デフォルトでは、可能であれば、クロージャは参照によってキャプチャします。`move` キーワードを使用すると、クロージャは値によってキャプチャします。
ko: 기본적으로 클로져는, 가능하다면, 참조를 사용하여 캡쳐를 합니다. `move` 키워드를 쓰면 값으로 캡쳐가 됩니다.
pt_br: Por padrão, os _closures_ capturam por referência se puderem. A palavra-chave `move` faz com que eles capturem por valor.

source: Typically implemented with reference counting, garbage collection, or RAII.
ja: 通常、参照カウント、ガベージ コレクション、または RAII を使用して実装されます。
pt_br: Normalmente implementado com contagem de referência, coleta de lixo ou RAII.

source: C++ has tools like smart pointers (`unique_ptr`, `shared_ptr`) that take advantage of language guarantees about calling destructors to ensure memory is freed when a function returns. It is still quite easy to mis-use these tools and create similar bugs to C.
fa: ++C ابزارهایی مانند اشاره‌گرهای هوشمند (`unique_ptr`, `shared_ptr`) دارد که از تضمین‌های زبانی درباره فراخوانی ویرایشگرها (destructor) برای اطمینان از آزاد شدن حافظه هنگام بازگشت از تابع استفاده می‌کنند. با این حال، هنوز هم بسیار آسان است که از این ابزارها به اشتباه استفاده کرده و باگ‌هایی مشابه به C ایجاد کرد.
ja: C++ にはスマート ポインタ（`unique_ptr`、`shared_ptr` など）のツールがあり、デストラクタの呼び出しに関する言語保証を利用して、関数が戻ったときにメモリが解放されるようにします。これらのツールを誤用して C と同様のバグを作成することがよくあります。
pt_br: O C++ possui ferramentas como ponteiros inteligentes (`unique_ptr`, `shared_ptr`) que aproveitam as garantias da linguagem sobre a chamada de destrutores para garantir que a memória seja liberada quando uma função retorna. Ainda é muito fácil usar essas ferramentas de maneira incorreta e criar bugs semelhantes aos do C.

source: "five: {}"
pt_br: "cinco: {}"

source: Recursive data types or data types with dynamic sizes need to use a `Box`:
es: Los tipos de datos recursivos o los tipos de datos con tamaños dinámicos deben utilizar un `Box`:
ja: 再帰データ型、またはサイズが動的なデータ型では、`Box` を使用する必要があります。
ko: 재귀 데이터나 동적크기의 데이터 타입은 `Box`타입을 사용해야 합니다:
pt_br: Tipos de dados recursivos ou tipos de dados com tamanhos dinâmicos precisam usar uma `Box`:

source: have a type whose size that can't be known at compile time, but the Rust compiler wants to know an exact size.
es: Si tienes un tipo cuyo tamaño no se conoce durante la compilación, pero el compilador de Rust quiere saber el tamaño exacto.
fa: یک تایپ دارید که اندازه آن در زمان کامپایل مشخص نیست، اما کامپایلر Rust نیاز به دانستن اندازه دقیق آن دارد.
ja: コンパイル時にサイズを把握できない型があるが、Rust コンパイラがその正確なサイズを知る必要がある場合。
ko: 타입 크기를 컴파일 시점에 알 수 없는 경우.
pt_br: há um tipo cujo tamanho não está disponível em tempo de compilação, mas o compilador Rust precisa saber o tamanho exato.

source: See [`Arc`](../concurrency/shared_state/arc.md) and [`Mutex`](https://doc.rust-lang.org/std/sync/struct.Mutex.html) if you are in a multi-threaded context.
es: Consulta [`Arc`](../concurrency/shared_state/arc.md) y [`Mutex`](https://doc.rust-lang.org/std/sync/struct.Mutex.html) si te encuentras en un contexto multihilo.
ja: マルチスレッドのコンテキストに関しては、[`Arc`](../concurrency/shared_state/arc.md) と [`Mutex`](https://doc.rust-lang.org/std/sync/struct.Mutex.html) をご覧ください。
ko: 멀티스레드 환경에서 작업하는 경우 [`Arc`](../concurrency/shared_state/arc.md)와 [`Mutex`](https://doc.rust-lang.org/std/sync/struct.Mutex.html)를 참조하세요.
pt_br: Veja [`Arc`](../concurrency/shared_state/arc.md) e [`Mutex`](https://doc.rust-lang.org/std/sync/struct.Mutex.html) se você estiver em um contexto multi-thread.

source: "Bye {text}!"
pt_br: "Até logo {text}!"

source: //I64, -- not needed for this exercise /// The Len WireType indicates that the value is a length represented as a /// VARINT followed by exactly that number of bytes.
ja: //I64、 -- この演習では不要 /// Len WireType は、値が VARINT で表され、その後にちょうどそのバイト数が /// 続くものであることを示します。
pt_br: //I64, -- não é necessário para este exercício /// O Len WireType indica que o valor é um comprimento representado como um /// VARINT seguido exatamente por esse número de bytes.

source: /// The I32 WireType indicates that the value is precisely 4 bytes in /// little-endian order containing a 32-bit signed integer.
ja: /// I32 WireType は、値が 32 ビット符号付き整数を含むリトル エンディアンで、 /// 正確に 4 バイトであることを示します。
pt_br: /// O I32 WireType indica que o valor é precisamente 4 bytes em /// ordem little-endian contendo um inteiro de 32 bits com sinal.

source: // Unwrap error because `value` is definitely 4 bytes long.
ja: // `value` の長さは明らかに 4 バイトであるため、エラーをアンラップします。
pt_br: // Unwrap o erro porque `value` definitivamente tem 4 bytes.

source: "some/path.rs"
pt_br: "algum/caminho.rs"

source: // ANCHOR_END: Window-width // Add 4 paddings for borders
ja: // ANCHOR_END: Window-width // 枠線に 4 つのパディングを追加します。
pt_br: // ANCHOR_END: Window-width // Adiciona 4 preenchimentos para as bordas

source: "IO error: {e}"
pt_br: "Erro E/S: {e}"

source: Make sure to implement the `std::error::Error` trait when defining a custom error type so it can be boxed. But if you need to support the `no_std` attribute, keep in mind that the `std::error::Error` trait is currently compatible with `no_std` in [nightly](https://github.com/rust-lang/rust/issues/103765) only.
fa: هنگام تعریف یک نوع خطای سفارشی، مطمئن شوید که ویژگی `std::error::Error` را اجرا کنید تا بتوان آن را در جعبه قرار داد. اما اگر نیاز به پشتیبانی از ویژگی `no_std` دارید، به خاطر داشته باشید که ویژگی `std::error::Error` در حال حاضر با `no_std` در [nightly](https://github.com/rust-lang) سازگار است.
ja: カスタムのエラー型を定義する際は、必ず `std::error::Error` トレイトを実装し、ボックス化できるようにしてください。ただし `no_std` 属性をサポートする必要がある場合は、`std::error::Error` トレイトは現在、[ナイトリー](https://github.com/rust-lang/rust/issues/103765) においてのみ`no_std`と互換性があることに注意してください。
pt_br: Certifique-se de implementar o _trait_ `std::error::Error` ao definir um tipo de erro personalizado para que ele possa ser encaixotado. Mas se você precisa suportar o atributo `no_std`, tenha em mente que o _trait_ `std.error::Error` é atualmente compatível com `no_std` apenas em [nightly](https://github.com/rust-lang/rust/issues/103765).

source: The `std::error::Error` trait is derived automatically.
fa: ویژگی `std::error::Error` به طور خودکار مشتق می‌شود.
ja: `std::error::Error` トレイトは自動的に導出されます。
pt_br: O _trait_ `std::error::Error` é derivado automaticamente.

source: Actual error type inside of it can be extracted for examination if necessary.
es: El tipo de error real que contiene se puede extraer para analizarlo si es necesario.
fa: در صورت لزوم می‌توان نوع خطای واقعی داخل آن را برای بررسی استخراج کرد.
ja: 必要に応じて、内部の実際のエラー型を抽出して調べることができます。
ko: 필요하다면 `anyhow::Error`에 저장된 진짜 에러 타입을 꺼내어 검사할 수도 있습니다.
pt_br: O tipo de erro real dentro dele pode ser extraído para exame, se necessário.

source: Functionality provided by `anyhow::Result<T>` may be familiar to Go developers, as it provides similar usage patterns and ergonomics to `(T, error)` from Go.
es: La funcionalidad proporcionada por `anyhow::Result<T>` puede resultar familiar a los desarrolladores de Go, ya que ofrece patrones de uso y ergonomía similares a `(T, error)` de Go.
fa: عملکرد ارائه شده توسط `anyhow::Result<T>` ممکن است برای توسعه‌دهندگان Go آشنا باشد، زیرا الگوهای استفاده و ارگونومی مشابهی را با `(T, error)` از Go ارائه می‌دهد.
ja: `anyhow::Result<T>` が提供する機能は、Go の `(T, error)` と同様の使用パターンとエルゴノミクスを備えているため、Go デベロッパーにはなじみがあるかもしれません。
ko: `anyhow::Result<T>`가 제공하는 기능들이 Go 언어 개발자들에게는 익숙할 것입니다. Go언어에서 반환 값으로 사용하는 `(T, error)` 패턴과 비슷하기 때문입니다.
pt_br: A funcionalidade fornecida por `anyhow::Result<T>` pode ser familiar para desenvolvedores Go, pois fornece padrões de uso e ergonomia semelhantes a `(T, error)` de Go.

source: "//! Crab\n"
pt_br: "//! Caranguejo (Crab)\n"

source: Soong has many similarities to Bazel, which is the open-source variant of Blaze (used in google3).
ja: Soong には、Blaze（google3 で使用）のオープンソース版である Bazel と多くの類似点があります。
pt_br: Soong tem muitas semelhanças com o Bazel, que é a variante de código aberto do Blaze (usado no google3).

source: There is a plan to transition [Android](https://source.android.com/docs/setup/build/bazel/introduction), [ChromeOS](https://chromium.googlesource.com/chromiumos/bazel/), and [Fuchsia](https://source.android.com/docs/setup/build/bazel/introduction) to Bazel.
ja: [Android](https://source.android.com/docs/setup/build/bazel/introduction)、[ChromeOS](https://chromium.googlesource.com/chromiumos/bazel/)、[Fuchsia](https://source.android.com/docs/setup/build/bazel/introduction) を Bazel に移行する計画があります。
pt_br: Há um plano para transicionar o [Android](https://source.android.com/docs/setup/build/bazel/introduction), [ChromeOS](https://chromium.googlesource.com/chromiumos/bazel/) e [Fuchsia](https://source.android.com/docs/setup/build/bazel/introduction) para o Bazel.

source: Learning Bazel-like build rules is useful for all Rust OS developers.
ja: Bazel のようなビルドルールを学ぶことは、すべての Rust OS デベロッパーに役立ちます。
pt_br: Aprender regras de compilação semelhantes ao Bazel é útil para todos os desenvolvedores Rust de SO.

source: _birthday_service/src/client.rs_:
pt_br: _birthday_server/src/client.rs_:

source: We already saw this in the [Safe FFI Wrapper exercise](../../exercises/day-3/safe-ffi-wrapper.md).
es: Ya lo hemos visto en el ejercicio [Envoltorio de FFI seguro](../../exercises/day-3/safe-ffi-wrapper.md).
ja: これは、[安全な FFI ラッパーの演習](../../exercises/day-3/safe-ffi-wrapper.md)ですでに取り扱いました。
ko: 우리는 이미 [Safe FFI 래퍼 연습문제](../../exercises/day-3/safe-ffi-wrapper.md)에서 이를 다루었습니다.
pt_br: Já vimos isso no exercício [Safe FFI Wrapper ](../../exercises/day-3/safe-ffi-wrapper.md).

source: _interoperability/rust/analyze/main.c_
fa: _interoperability/rust/analyze/Android.bp_
pt_br: _interoperability/rust/analisar/main.c_
