Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: In this exercise, you will build a parser for the [protobuf binary encoding](https://protobuf.dev/programming-guides/encoding/). Don't worry, it's simpler than it seems! This illustrates a common parsing pattern, passing slices of data. The underlying data itself is never copied.
fa: در این تمرین، شما یک تجزیه‌کننده برای [رمزگذاری باینری پروتوباف](https://protobuf.dev/programming-guides/encoding/) خواهید ساخت. نگران نباشید، این کار ساده‌تر از آن است که به نظر می‌رسد! این الگو نشان‌دهنده یک الگوی رایج در تجزیه داده‌ها است که شامل عبور برش‌های داده است. داده‌های اصلی هرگز کپی نمی‌شوند.
ja: この演習では、[protobuf バイナリ エンコード](https://protobuf.dev/programming-guides/encoding/)用のパーサーを作成します。見かけよりも簡単ですので、心配はいりません。これは、データのスライスを渡す一般的な解析パターンを示しています。基になるデータ自体がコピーされることはありません。
pt_br: Neste exercício, você construirá um analisador (_parser_) para a [codificação binária de protobuf](https://protobuf.dev/programming-guides/encoding/). Não se preocupe, é mais simples do que parece! Isso ilustra um padrão de análise comum, passando _slices_ de dados. Os próprios dados subjacentes nunca são copiados.
uk: У цій вправі ви створите синтаксичний аналізатор для [бінарного кодування protobuf](https://protobuf.dev/programming-guides/encoding/). Не хвилюйтеся, це простіше, ніж здається! Це ілюструє загальну схему синтаксичного аналізу, передаючи зрізи даних. Самі дані ніколи не копіюються.

source: Fully parsing a protobuf message requires knowing the types of the fields, indexed by their field numbers. That is typically provided in a `proto` file. In this exercise, we'll encode that information into `match` statements in functions that get called for each field.
fa: تجزیه کامل یک پیام پروتوباف نیاز به دانستن تایپ‌های این فیلدها دارد که بر اساس شماره‌های فیلد ایندکس شده‌اند. این اطلاعات معمولاً در یک فایل `proto` ارائه می‌شود. در این تمرین، ما این اطلاعات را به صورت عبارات `match` در توابعی که برای هر فیلد فراخوانی می‌شوند، کدگذاری خواهیم کرد.
ja: protobuf メッセージを完全に解析するには、フィールド番号でインデックス付けされたフィールドの型を知る必要があります。これは通常、`proto` ファイルで提供されます。この演習では、フィールドごとに呼び出される関数の `match` ステートメントに、その情報をエンコードします。
pt_br: Analisar (_parse_) completamente uma mensagem protobuf requer conhecer os tipos dos campos, indexados por seus números de campo. Isso é normalmente fornecido em um arquivo `proto`. Neste exercício, codificaremos essas informações em declarações `match` em funções que são chamadas para cada campo.
uk: Повноцінний розбір повідомлення protobuf вимагає знання типів полів, проіндексованих за номерами полів. Зазвичай ця інформація міститься у файлі `proto`. У цій вправі ми закодуємо цю інформацію у оператори `match` у функціях, які викликаються для кожного поля.

source: We'll use the following proto:
fa: ما از پروتوباف زیر استفاده خواهیم کرد:
ja: 次の proto を使用します。
pt_br: Usaremos o seguinte proto:
uk: Ми використаємо наступний proto:

source: A proto message is encoded as a series of fields, one after the next. Each is implemented as a "tag" followed by the value. The tag contains a field number (e.g., `2` for the `id` field of a `Person` message) and a wire type defining how the payload should be determined from the byte stream.
fa: یک پیام پروتوباف به عنوان مجموعه‌ای از فیلدها، یکی پس از دیگری، کدگذاری می‌شود. هر فیلد به صورت یک "تگ" به همراه مقدار آن پیاده‌سازی شده است. تگ شامل شماره فیلد (مانند `2` برای فیلد `id` در پیام `Person`) و wire type است که نحوه تعیین بار را از جریان بایت مشخص می‌کند.
ja: proto メッセージは、連続するフィールドとしてエンコードされます。それぞれが後ろに値を伴う「タグ」として実装されます。タグにはフィールド番号（例: `Person` メッセージの `id` フィールドには `2`）と、バイト ストリームからペイロードがどのように決定されるかを定義するワイヤータイプが含まれます。
pt_br: Uma mensagem proto é codificada como uma série de campos, um após o outro. Cada um é implementado como uma "tag" seguida pelo valor. A tag contém um número de campo (por exemplo, `2` para o campo `id` de uma mensagem `Person`) e um tipo de fio (_wire type_) definindo como a carga útil deve ser determinada a partir do fluxo (_stream_) de bytes.
uk: Повідомлення proto кодується як серія полів, що йдуть одне за одним. Кожне з них реалізовано у вигляді "тегу", за яким слідує значення. Тег містить номер поля (наприклад, `2` для поля `id` у повідомленні `Person`) і тип передачі, який визначає спосіб визначення корисного навантаження з потоку байт.

source: Integers, including the tag, are represented with a variable-length encoding called VARINT. Luckily, `parse_varint` is defined for you below. The given code also defines callbacks to handle `Person` and `PhoneNumber` fields, and to parse a message into a series of calls to those callbacks.
fa: اعداد، از جمله تگ، با استفاده از کدگذاری با طول متغیر به نام VARINT نمایندگی می‌شوند. خوشبختانه، تابع `parse_varint` برای شما تعریف شده است. کد داده شده همچنین بازخوانی‌هایی برای مدیریت فیلدهای `Person` و `PhoneNumber` و تجزیه یک پیام به مجموعه‌ای از فراخوانی‌ها به آن بازخوانی‌ها را تعریف می‌کند.
ja: タグを含む整数は、VARINT と呼ばれる可変長エンコードで表されます。幸いにも、`parse_varint` は以下ですでに定義されています。また、このコードでは、`Person` フィールドと `PhoneNumber` フィールドを処理し、メッセージを解析してこれらのコールバックに対する一連の呼び出しに変換するコールバックも定義しています。
pt_br: Números inteiros, incluindo a tag, são representados com uma codificação de comprimento variável chamada VARINT. Felizmente, `parse_varint` é definido para você abaixo. O código fornecido também define _callbacks_ para lidar com campos `Person` e `PhoneNumber`, e para analisar uma mensagem em uma série de chamadas para esses _callbacks_.
uk: Цілі числа, включаючи тег, подаються у кодуванні змінної довжини, яке називається VARINT. На щастя, нижче визначено `parse_varint` для вас. Наведений код також визначає виклики для обробки полів `Person` і `PhoneNumber`, а також для розбору повідомлення на серію викликів цих зворотних викликів.

source: What remains for you is to implement the `parse_field` function and the `ProtoMessage` trait for `Person` and `PhoneNumber`.
fa: برای شما باقی‌مانده است که تابع `parse_field` و ویژگی `ProtoMessage` را برای `Person` و `PhoneNumber` پیاده‌سازی کنید.
ja: 残る作業は、`parse_field` 関数と、`Person` および `PhoneNumber` の `ProtoMessage` トレイトを実装するだけです。
pt_br: O que resta para você é implementar a função `parse_field` e o _trait_ `ProtoMessage` para `Person` e `PhoneNumber`.
uk: Вам залишається реалізувати функцію `parse_field` та трейт `ProtoMessage` для `Person` та `PhoneNumber`.

source: /// A wire type as seen on the wire.
ja: /// ワイヤー上で見えるワイヤータイプ。
pt_br: /// Um wire type como visto no wire.
uk: /// wire type як він приходить по дроту.

source: /// The Varint WireType indicates the value is a single VARINT.
ja: /// Varint WireType は、値が単一の VARINT であることを示します。
pt_br: /// O Varint WireType indica que o valor é um único VARINT.
uk: /// Varint WireType вказує на те, що значення є одним VARINT.

source: /// The I64 WireType indicates that the value is precisely 8 bytes in /// little-endian order containing a 64-bit signed integer or double type. //I64, -- not needed for this exercise /// The Len WireType indicates that the value is a length represented as a /// VARINT followed by exactly that number of bytes.
uk: /// I64 WireType вказує на те, що значення має точно 8 байт у little-endian /// порядку та містить 64-бітне ціле зі знаком або тип з плаваючою комою подвійної точності. //I64, -- не потрібно для цієї вправи /// Len WireType вказує на те, що значення є довжиною, представленою у вигляді /// VARINT за яким слідує рівно стільки байт.

source: // The I32 WireType indicates that the value is precisely 4 bytes in // little-endian order containing a 32-bit signed integer or float type. //I32, -- not needed for this exercise
uk: // Тип WireType I32 вказує на те, що значення - це рівно 4 байти в // little-endian порядку, що містять 32-бітне ціле число зі знаком або тип з плаваючою комою. //I32, -- не потрібно для цієї вправи

source: /// A field's value, typed based on the wire type.
ja: /// ワイヤータイプに基づいて型指定されたフィールドの値。
pt_br: /// O valor de um campo, digitado com base no wire type.
uk: /// Значення поля, введене на основі wire type.

source: //I64(i64), -- not needed for this exercise
ja: //I64（i64）、 -- この演習では不要
pt_br: //I64(i64), -- não é necessário para este exercício
uk: //I64(i64), -- не потрібно для цієї вправи

source: //I32(i32), -- not needed for this exercise
uk: //I32(i32), -- не потрібно для цієї вправи

source: /// A field, containing the field number and its value.
ja: /// フィールド番号とその値を含むフィールド。
pt_br: /// Um campo, contendo o número do campo e seu valor.
uk: /// Поле, що містить номер поля та його значення.

source: //1 => WireType::I64, -- not needed for this exercise
ja: //1 => WireType::I64、 -- この演習では不要
pt_br: //1 => WireType::I64, -- não é necessário para este exercício
uk: //1 => WireType::I64, -- не потрібно для цієї вправи

source: //5 => WireType::I32, -- not needed for this exercise
uk: //5 => WireType::I32, -- не потрібно для цієї вправи

source: "Invalid wire type: {value}"
fa: "نوع سیم نامعتبر: {value}"
uk: "Неправильний wire type: {value}"

source: "Expected string to be a `Len` field"
fa: "انتظار می‌رود که رشته یک فیلد Len باشد"
uk: "Очікуваний рядок має бути полем `Len`"

source: "Invalid string"
fa: "نامعتبر string"
uk: "Неправильний рядок"

source: "Expected bytes to be a `Len` field"
fa: "بایت‌های مورد انتظار یک فیلد `Len` باشند"
uk: "Очікувані байти мають бути полем `Len`"

source: "Expected `u64` to be a `Varint` field"
fa: "انتظار می‌رود `u64` یک فیلد `Varint` باشد"
uk: "Очікувалося, що `u64` буде полем `Varint`"

source: /// Parse a VARINT, returning the parsed value and the remaining bytes.
ja: /// VARINT を解析し、解析した値と残りのバイトを返します。
pt_br: /// Analise (_parse_) um VARINT, retornando o valor analisado e os bytes restantes.
uk: /// Розбір VARINT з поверненням розібраного значення та решти байтів.

source: "Not enough bytes for varint"
fa: "بایت کافی برای varint نیست"
uk: "Недостатньо байт для varint"

source: // This is the last byte of the VARINT, so convert it to // a u64 and return it.
ja: // これは VARINT の最後のバイトであるため、 // u64 に変換して返します。
pt_br: // Este é o último byte do VARINT, então converta-o para // um u64 e retorne-o.
uk: // Це останній байт VARINT, тому перетворюємо його // в u64 і повертаємо.

source: // More than 7 bytes is invalid.
ja: // 7 バイトを超える値は無効です。
pt_br: // Mais de 7 bytes é inválido.
uk: // Більше 7 байт є неприпустимим.

source: "Too many bytes for varint"
fa: "تعداد بایت‌های زیادی برای varint"
uk: "Забагато байт для varint"

source: /// Convert a tag into a field number and a WireType.
ja: /// タグをフィールド番号と WireType に変換します。
pt_br: /// Converta uma tag em um número de campo e um WireType.
uk: /// Перетворити тег у номер поля та WireType.

source: /// Parse a field, returning the remaining bytes
ja: /// フィールドを解析して残りのバイトを返します。
pt_br: /// Analise (_parse_) um campo, retornando os bytes restantes
uk: /// Розбір поля з поверненням залишку байтів

source: "Based on the wire type, build a Field, consuming as many bytes as necessary."
fa: "بر اساس نوع سیم، یک فیلد بسازید، با مصرف هر تعداد بایت که لازم است."
ja: "ワイヤータイプに応じて、フィールドを構築し、必要な量のバイトを消費します。"
pt_br: "Com base no wire type, construa um Field, consumindo quantos bytes forem necessários."
uk: "На основі wire type побудуйте Field, використовуючи стільки байт, скільки потрібно."

source: "Return the field, and any un-consumed bytes."
fa: "فیلد و هر بایت مصرف نشده را برگردانید."
ja: "フィールドと、未消費のバイトを返します。"
pt_br: "Retorne o campo e quaisquer bytes não consumidos."
uk: "Повернути поле та всі невикористані байти."

source: /// Parse a message in the given data, calling `T::add_field` for each field in /// the message. /// /// The entire input is consumed.
ja: /// 指定されたデータ内のメッセージを解析し、メッセージのフィールドごとに /// `T::add_field` を呼び出します。 /// /// 入力全体が消費されます。
pt_br: /// Analise (_parse_) uma mensagem nos dados fornecidos, chamando `T::add_field` para cada campo na /// mensagem. /// /// Todo o input é consumido.
uk: /// Розбір повідомлення за заданими даними, викликаючи `T::add_field` для кожного поля в /// повідомленні. /// /// Споживаються всі вхідні дані.

source: // TODO: Implement ProtoMessage for Person and PhoneNumber.
ja: // TODO: Person と PhoneNumber の ProtoMessage を実装します。
pt_br: // TODO: Implemente ProtoMessage para Person e PhoneNumber.
uk: // TODO: Реалізувати ProtoMessage для Person та PhoneNumber.

source: In this exercise there are various cases where protobuf parsing might fail, e.g. if you try to parse an `i32` when there are fewer than 4 bytes left in the data buffer. In normal Rust code we'd handle this with the `Result` enum, but for simplicity in this exercise we panic if any errors are encountered. On day 4 we'll cover error handling in Rust in more detail.
fa: در این تمرین موارد مختلفی وجود دارد که ممکن است تجزیه protobuf با شکست مواجه شود، مثلاً اگر بخواهید یک `i32` را هنگامی که کمتر از ۴ بایت در بافر داده باقی‌مانده است، تجزیه کنید. در کد Rust معمولاً این را با استفاده از `Result` مدیریت می‌کنیم، اما برای سادگی در این تمرین، اگر با هرگونه خطا مواجه شویم، به جای آن که با `Result` برخورد کنیم، برنامه را متوقف خواهیم کرد. در روز چهارم، به بررسی دقیق‌تر مدیریت خطا در Rust خواهیم پرداخت.
uk: У цій вправі існують різні випадки, коли розбір protobuf може не спрацювати, наприклад, якщо ви спробуєте розібрати `i32`, коли у буфері даних залишилося менше 4 байт. У звичайному Rust-коді ми б впоралися з цим за допомогою переліку `Result`, але для простоти у цій вправі ми панікуємо, якщо виникають помилки. На четвертий день ми розглянемо обробку помилок у Rust більш детально.

source: "len not a valid `usize`"
fa: "استفاده از len در `usize` معتبر نیست"
uk: "len не є допустимим `usize`"

source: "Unexpected EOF"
fa: "EOF غیر منتظره"
pt_br: "EOF inesperado"
uk: "Несподіваний EOF"

source: // skip everything else
ja: // それ以外をすべてスキップ
pt_br: // pule todo o resto
uk: // пропустити все інше

source: "beautiful name"
uk: "красиве ім'я"

source: "Evan"
uk: "Еван"

source: "home"
fa: "خانه"
uk: "дім"

source: Welcome to Day 4
ja: 4 日目のトレーニングにようこそ
pt_br: Bem-vindo ao Dia 4
uk: Ласкаво просимо до Дня 4

source: Today we will cover topics relating to building large-scale software in Rust:
fa: امروز ما موضوعات مربوط به ساخت نرم افزار در مقیاس بزرگ در Rust را پوشش خواهیم داد:
ja: 本日は、Rust での大規模なソフトウェアのビルドに関連するトピックを取り上げます。
pt_br: Hoje abordaremos tópicos relacionados à construção de software em larga escala em Rust:
uk: Сьогодні ми розглянемо теми, що стосуються створення великомасштабного програмного забезпечення на Rust:

source: Iterators: a deep dive on the `Iterator` trait.
fa: Iterators: شیرجه عمیق در ویژگی `Iterator`.
ja: イテレータ: `Iterator` トレイトの詳細。
pt_br: Iteradores: uma análise profunda do _trait_ `Iterator`.
uk: Ітератори: глибоке занурення в трейт `Iterator`.

source: Modules and visibility.
fa: ماژول ها و قابلیت مشاهده.
ja: モジュールと可視性。
pt_br: Módulos e visibilidade.
uk: Модулі та видимість.

source: Testing.
fa: تست‌کردن.
pt_br: Testes.
uk: Тестування

source: Error handling: panics, `Result`, and the try operator `?`.
es: Gestión de errores: _panics_ (pánicos), `Result` y el operador _try_ `?`.
fa: رسیدگی به خطا: panics در `Result` و اپراتور تلاش مجدد `?`.
ja: エラー処理: パニック、`Result`、try 演算子 `?`。
ko: 오류처리(에러 핸들링): 패닉, `Result`, `?` 연산자.
pt_br: Tratamento de erros: pânicos, `Result` e o operador `?`.
uk: Обробка помилок: паніка, `Result` і оператор спроби `?`.

source: Unsafe Rust: the escape hatch when you can't express yourself in safe Rust.
fa: با Unsafe Rust: پنجره فرار مبتنی بر زمان که نمی‌توانید خود را در safe Rust بیان کنید.
ja: アンセーフRust: 安全な Rust では記述できない場合の回避策。
pt_br: Rust inseguro: a saída de emergência quando você não consegue se expressar em Rust seguro.
uk: Небезпечний Rust: рятувальний отвір, коли ви не можете виразити себе в безпечному Rust.

source: The [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html) trait supports iterating over values in a collection. It requires a `next` method and provides lots of methods. Many standard library types implement `Iterator`, and you can implement it yourself, too:
fa: ویژگی ['Iterator'](https://doc.rust-lang.org/std/iter/trait.Iterator.html) از تکرار بیش از مقادیر در یک مجموعه پشتیبانی می‌کند. این به یک متد `next` نیاز دارد و متدهای زیادی را ارائه می‌کند. بسیاری از انواع کتابخانه استاندارد `Iterator` را پیاده‌سازی می‌کنند و شما نیز می‌توانید آن را خودتان پیاده‌سازی کنید:
ja: [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html) トレイトは、コレクション内の一連の要素に対して順番に処理を適用することを可能にします。このトレイトはnextメソッドを必要とし、それにより多くのメソッドを提供します。多くの標準ライブラリ型で `Iterator` が実装されていますが、自分で実装することもできます。
pt_br: O _trait_ [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html) suporta a iteração sobre valores em uma coleção. Ele requer um método `next` e fornece muitos métodos. Muitos tipos da biblioteca padrão implementam `Iterator`, e você também pode implementá-lo:
uk: Трейт [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html) підтримує ітерацію над значеннями у колекції. Він вимагає наявності методу `next` і надає багато методів. Багато стандартних бібліотечних типів реалізують `Iterator`, і ви також можете реалізувати його самостійно:

source: The `Iterator` trait implements many common functional programming operations over collections (e.g. `map`, `filter`, `reduce`, etc). This is the trait where you can find all the documentation about them. In Rust these functions should produce the code as efficient as equivalent imperative implementations.
fa: ویژگی `Iterator` بسیاری از عملیات برنامه‌نویسی تابعی رایج را روی collectionها پیاده‌سازی می‌کند (مانند `map`, `filter`, `reduce`,و غیره). این ویژگی است که در آن می‌توانید تمام اسناد مربوط به آنها را پیدا کنید. در Rust، این توابع باید کد را به اندازه پیاده‌سازی‌های ضروری معادل تولید کنند.
ja: `Iterator` トレイトは、コレクションに対する多くの一般的な関数型プログラミング オペレーション（例: `map`、`filter`、`reduce` など）を実装します。このトレイトのドキュメントにおいて、これらのすべてのオペレーションに関する説明を確認できます。Rust では、これらの関数により、同等の命令型実装と同じくらい効率的なコードが生成されます。
pt_br: O _trait_ `Iterator` implementa muitas operações comuns de programação funcional sobre coleções (por exemplo, `map`, `filter`, `reduce`, etc). Este é o _trait_ onde você pode encontrar toda a documentação sobre eles. Em Rust, essas funções devem produzir o código tão eficiente quanto as implementações imperativas equivalentes.
uk: Трейт `Iterator` реалізує багато поширених функціональних операцій програмування над колекціями (наприклад, `map`, `filter`, `reduce` і т.д.). Це цій трейт, де ви можете знайти всю документацію про них. У Rust ці функції мають створювати код, який є настільки ж ефективним, як і еквівалентні імперативні реалізації.

source: `IntoIterator` is the trait that makes for loops work. It is implemented by collection types such as `Vec<T>` and references to them such as `&Vec<T>` and `&[T]`. Ranges also implement it. This is why you can iterate over a vector with `for i in some_vec { .. }` but `some_vec.next()` doesn't exist.
es: `IntoIterator` es el trait que hace que los bucles funcionen. Se implementa a través de tipos de colecciones, como `Vec<T>`, y de referencias a ellas, como `&Vec<T>` y `&[T]`. Los intervalos también lo implementan. Esta es la razón por la que se puede iterar sobre un vector con `for i in some_vec { .. }`, pero `some_vec.next()` no existe.
fa: `IntoIterator` ویژگی است که باعث می‌شود حلقه‌ها کار کنند. این مجموعه (collection) توسط تایپ‌های مجموعه مانند `Vec<T>` و ارجاعاتی به آنها مانند `&Vec<T>` و `&[T]` پیاده‌سازی می‌شود. Ranges نیز آن ‌هارا اجرا می‌کند. به همین دلیل است که می‌توانید روی یک بردار با `برای i در some_vec { .. }` تکرار کنید، اما درنهایت `some_vec.next()`وجود ندارد.
ja: `IntoIterator` は、forループを実現するためのトレイトです。コレクション型（`Vec<T>` など）と、それらに対する参照（`&Vec<T>`、`&[T]` など）において実装されています。また、範囲を表す型においても実装されています。`for i in some_vec { .. }` を使用してベクターを反復処理できるのに、`some_vec.next()` が存在しないのはこのためです。
ko: `IntoIterator`는 루프를 작동하게 만드는 트레잇입니다. 이는 `Vec<T>`와 같은 컬렉션 유형과 `&Vec<T>` 및 `&[T]`와 같은 이에 대한 참조에 의해 구현됩니다. 범위도 이를 구현합니다. 이런 이유로 `for i in some_vec { .. }`를 사용하여 벡터를 반복할 수 있지만 `some_vec.next()`는 존재하지 않습니다.
pt_br: `IntoIterator` é o _trait_ que faz os laços `for` funcionarem. Ele é implementado por tipos de coleção como `Vec<T>` e referências a eles como `&Vec<T>` e `&[T]`. Intervalos (_ranges_) também o implementam. É por isso que você pode iterar sobre um vetor com `for i in some_vec { .. }`, mas `some_vec.next()` não existe.
uk: `IntoIterator` — це трейт, яка забезпечує роботу циклів for. Він реалізований такими типами колекцій, як `Vec<T>`, і посиланнями на них, наприклад `&Vec<T>` і `&[T]`. Діапазони також реалізують його. Ось чому ви можете перебирати вектор з `for i in some_vec { .. }`, але `some_vec.next()` не існує.

source: The `Iterator` trait tells you how to _iterate_ once you have created an iterator. The related trait [`IntoIterator`](https://doc.rust-lang.org/std/iter/trait.IntoIterator.html) defines how to create an iterator for a type. It is used automatically by the `for` loop.
fa: ویژگی `Iterator` به شما می‌گوید که چگونه پس از ایجاد یک تکرار کننده، _iterate_ کنید. ویژگی مرتبط [`IntoIterator`](https://doc.rust-lang.org/std/iter/trait.IntoIterator.html) نحوه ایجاد یک تکرار کننده برای یک نوع را مشخص می‌کند. به طور خودکار توسط حلقه `for` استفاده می‌شود.
ja: `Iterator` トレイトは、イテレータを作成した後に反復処理を行う方法を示します。関連するトレイト [`IntoIterator`](https://doc.rust-lang.org/std/iter/trait.IntoIterator.html) は、ある型に対するイテレータを作成する方法を定義します。これは `for` ループによって自動的に使用されます。
pt_br: O _trait_ `Iterator` informa como _iterar_ depois de criar um iterador. O _trait_ relacionado [`IntoIterator`](https://doc.rust-lang.org/std/iter/trait.IntoIterator.html) define como criar um iterador para um tipo. Ele é usado automaticamente pelo laço `for`.
uk: Трейт `Iterator` описує, як виконувати _ітерацію_ після того, як ви створили ітератор. Пов'язаний з нею трейт [`IntoIterator`](https://doc.rust-lang.org/std/iter/trait.IntoIterator.html) визначає, як створити ітератор для типу. Він автоматично використовується циклом `for`.

source: "point = {x}, {y}"
uk: "точка = {x}, {y}"

source: Click through to the docs for `IntoIterator`. Every implementation of `IntoIterator` must declare two types:
fa: روی مستندات`IntoIterator` کلیک کنید. هر پیاده‌سازی `IntoIterator` باید دو نوع را اعلام کند:
ja: `IntoIterator`のドキュメントをクリックしてご覧ください。`IntoIterator` のすべての実装で、次の 2 つの型を宣言する必要があります。
pt_br: Clique na documentação para `IntoIterator`. Toda implementação de `IntoIterator` deve declarar dois tipos:
uk: Перейдіть до документації по `IntoIterator`. Кожна реалізація `IntoIterator` повинна декларувати два типи:

source: `Item`: the type to iterate over, such as `i8`,
fa: ء `Item`: نوعی که باید تکرار شود، مانند `i8`،
ja: `Item`: 反復処理する型（`i8` など）。
pt_br: `Item`: o tipo sobre o qual iteramos, como `i8`,
uk: `Item`: тип для ітерації, наприклад, `i8`,

source: `IntoIter`: the `Iterator` type returned by the `into_iter` method.
es: `IntoIter`: el tipo `Iterator` devuelto por el método `into_iter`.
fa: `IntoIter`: یک «Iterator» تایپ است که با متد `into_iter` برگردانده شده است.
ja: `IntoIter`: `into_iter` メソッドによって返される `Iterator` 型。
ko: `IntoIter`: `into_iter` 메서드에서 반환되는 `Iterator`타입.
pt_br: `IntoIter`: o tipo `Iterator` retornado pelo método `into_iter`.
uk: `IntoIter`: тип `Iterator`, що повертається методом `into_iter`.
