Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Multi-threaded link checker: a larger project where you'll use Cargo to download dependencies and then check links in parallel.
es: El comprobador de enlaces multihilo: un proyecto más grande donde utilizarás Cargo para descargar dependencias y luego comprobar los enlaces en paralelo.
ja: マルチスレッド リンク チェッカー: Cargo を使用して依存関係をダウンロードし、リンクを同時にチェックする大規模なプロジェクト。
ko: 멀티 스레드 링크 검사기: 병렬적으로 웹페이지의 링크들을 체크합니다. 카고를 통해 몇 가지 의존성들을 다운도르 받아야 하는 큰 프로젝트 입니다.

source: For this, you will need an HTTP client such as [`reqwest`](https://docs.rs/reqwest/). Create a new Cargo project and `reqwest` it as a dependency with:
es: Para ello, necesitarás un cliente HTTP como [`reqwest`](https://docs.rs/reqwest/). Crea un proyecto de Cargo y aplica `reqwest` como una dependencia con:
ja: そのためには、[`reqwest`](https://docs.rs/reqwest/) などの HTTP クライアントが必要です。次のコマンドで新しい Cargo プロジェクトを作成し、依存関係として `reqwest` を追加します。
ko: 이를 위해서 [`reqwest`](https://docs.rs/reqwest/)와 같은 HTTP 클라이언트가 필요합니다. 새로운 로컬 프로젝트를 만들고 [`reqwest`](https://docs.rs/reqwest/)를 의존성에 추가하십시요:

source: You will also need a way to find links. We can use [`scraper`](https://docs.rs/scraper/) for that:
es: También necesitarás una forma de encontrar enlaces. Podemos usar [`scraper`](https://docs.rs/scraper/) para eso:
ja: また、リンクを見つける方法も必要です。これには [`scraper`](https://docs.rs/scraper/) を使用します。
ko: 링크를 찾기 위해서 [`scraper`](https://docs.rs/scraper/)도 추가합니다:

source: Finally, we'll need some way of handling errors. We use [`thiserror`](https://docs.rs/thiserror/) for that:
es: Por último, necesitaremos algún método para gestionar los errores. Para ello, usaremos [`thiserror`](https://docs.rs/thiserror/):
ja: 最後に、エラーを処理する方法が必要になります。これには [`thiserror`](https://docs.rs/thiserror/) を使用します。
ko: 마지막으로 오류 처리하는 방법으로 [`thiserror`](https://docs.rs/thiserror/)도 추가합니다:

source: Concurrency Morning Exercise
es: Concurrencia: Ejercicios de la Mañana
ja: 並行性に関する午前のエクササイズ

source: ([back to exercise](dining-philosophers.md))
es: ([volver al ejercicio](dining-philosophers.md))
ja: （[演習に戻る](dining-philosophers.md)）

source: ([back to exercise](link-checker.md))
es: ([volver al ejercicio](link-checker.md))
ja: （[演習に戻る](link-checker.md)）

source: Async Rust
es: Async en Rust
ja: Asyncの基礎

source: Overall, the interface is similar to the `sync` channels as seen in the [morning class](concurrency/channels.md).
es: En general, la interfaz es similar a los canales `sync`, tal como se ha visto ver en la [clase de la mañana](concurrency/channels.md).
ja: 一般的に、このインターフェースは、[朝の講座](concurrency/channels.md)で見られたような`sync`チャネルに似ています。
ko: 비동기 채널을 사용하기 위한 인터페이스는 [오전 과정](concurrency/channels.md)에서 배운 `sync` 채널과 비슷합니다.

source: Futures Control Flow
es: Flujo de Control de Futuros
ja: Futureの制御フロー

source: Futures can be combined together to produce concurrent compute flow graphs. We have already seen tasks, that function as independent threads of execution.
es: Los futuros pueden combinarse para producir gráficos de flujo de computación simultáneos. Ya hemos visto tareas que funcionan como hilos de ejecución independientes.
ja: 並行計算フローグラフを生成するために、futureを組み合わせることができます。すでに独立したスレッドとして機能するタスクを見てきました。
ko: Future들을 결합하여 계산 과정을 동시성이 있는 플로우 그래프 형태로 모델링 할 수 있습니다. 앞서 배운, 각 태스크가 독립적으로 수행되도록 하는 것도 Future들을 결합하는 한 방법으로 볼 수 있습니다.

source: [Join](control-flow/join.md)
ja: [結合](control-flow/join.md)

source: [Select](control-flow/select.md)
ja: [選択](control-flow/select.md)

source: Pitfalls of async/await
es: Inconvenientes de async/await
ja: async / await の注意点
ko: async/await에서 주의해야할 함정

source: Async / await provides convenient and efficient abstraction for concurrent asynchronous programming. However, the async/await model in Rust also comes with its share of pitfalls and footguns. We illustrate some of them in this chapter:
es: Async/await ofrece una abstracción práctica y eficiente para la programación asíncrona simultánea. Sin embargo, el modelo async/await de Rust también viene acompañado de errores y footguns. En este capítulo veremos algunos de ellos:
ja: async / await は、同時実行非同期プログラミングのための便利で効率的な抽象化を提供します。しかし、Rust の async / await モデルには、注意点や誤用されやすい機能もいくつかあるため、この章ではその点について説明します。
ko: Async와 await는 동시 비동기 프로그래밍을 위한 편리하고 효율적인 추상화를 제공합니다. 하지만 Rust의 async/await 모델에도 문제는 있습니다. 이 장에서 몇 가지 예를 살펴보겠습니다.

source: [Blocking the Executor](pitfalls/blocking-executor.md)
es: [Bloqueo del ejecutor](pitfalls/blocking-executor.md)
ja: [エグゼキュータのブロック](pitfalls/blocking-executor.md)

source: [Async Traits](pitfalls/async-traits.md)
es: [Traits asíncronos](pitfalls/async-traits.md)
ja: [Async トレイト](pitfalls/async-traits.md)

source: [Cancellation](pitfalls/cancellation.md)
es: [Cancelación](pitfalls/cancellation.md)
ja: [キャンセル](pitfalls/cancellation.md)

source: This compiles, but once the timeout expires it is `Poll::Ready` on every iteration (a fused future would help with this). Update to reset `timeout_fut` every time it expires.
es: Se puede compilar, pero una vez que vence el tiempo de espera, aparece `Poll::Ready` en cada iteración (un futuro fusionado podría resultar útil). Actualiza para restablecer `timeout_fut` cada vez que expire.
ja: これはコンパイルされますが、タイムアウトになると、すべての反復処理で `Poll::Ready` になります（融合された Future がこれに役立ちます）。期限が切れるたびに `timeout_fut` をリセットするように更新します。
ko: 이는 컴파일은 되지만 타임 아웃이 되면 매번 반복할 때 마다 `Poll::Ready`가 됩니다(융합된 future가 도움이 될 수 있음). 타임 아웃 될 때마다 `timeout_fut`를 리셋하도록 수정하세요.

source: Async methods in traits are not yet supported in the stable channel ([An experimental feature exists in nightly and should be stabilized in the mid term.](https://blog.rust-lang.org/inside-rust/2022/11/17/async-fn-in-trait-nightly.html))
es: Los métodos asíncronos en traits todavía no son compatibles con el canal estable. ([Existe una característica experimental en nightly que debería estabilizarse a medio plazo.](https://blog.rust-lang.org/inside-rust/2022/11/17/async-fn-in-trait-nightly.html))
ja: トレイトの非同期メソッドは、Stable チャンネルではまだサポートされていません（[試験運用版の機能はナイトリーに存在するため、中期的には安定するはずです。](https://blog.rust-lang.org/inside-rust/2022/11/17/async-fn-in-trait-nightly.html)）
ko: 트레잇에 async 메소드를 추가하는 것은 아직 안정화 버전 채널에서 지원되지 않습니다([실험용 기능은 nightly에 존재하며 조만간 안정화 될 것입니다](https://blog.rust-lang.org/inside-rust/2022/11/17/async-fn-in-trait-nightly.html)).

source: The crate [async_trait](https://docs.rs/async-trait/latest/async_trait/) provides a workaround through a macro:
es: El crate [async_trait](https://docs.rs/async-trait/latest/async_trait/) proporciona una solución mediante una macro:
ja: クレート [async_trait](https://docs.rs/async-trait/latest/async_trait/) は、マクロによる回避策を提供します。
ko: 크레이트 [async_trait](https://docs.rs/async-trait/latest/async_trait/)은 매크로를 통한 해결 방법을 제공합니다.

source: To practice your Async Rust skills, we have again two exercises for you:
es: Para practicar tus habilidades con async de Rust, tenemos otros dos nuevos ejercicios:
ja: 非同期 Rust のスキルを磨くため、ここでも 2 つの演習を行います。

source: Dining philosophers: we already saw this problem in the morning. This time you are going to implement it with Async Rust.
es: La cena de los filósofos: ya hemos visto este problema por la mañana. Esta vez vas a implementarlo con async de Rust.
ja: 食事する哲学者: この問題は午前の部ですでに取り上げましたが、今回は非同期 Rust を使用してこれを実装します。

source: A Broadcast Chat Application: this is a larger project that allows you experiment with more advanced Async Rust features.
es: Una aplicación de chat de difusión: se trata de un proyecto más grande que te permite experimentar con características más avanzadas de async de Rust.
ja: ブロードキャスト チャット アプリ: より高度な非同期 Rust 機能をテストできる大規模なプロジェクトです。

source: See [dining philosophers](dining-philosophers.md) for a description of the problem.
es: Consulta la descripción del problema en la sección sobre [la cena de filósofos](dining-philosophers.md).
ja: この問題の詳細については、[食事する哲学者](dining-philosophers.md) をご覧ください。

source: Concurrency Afternoon Exercise
es: Concurrencia: Ejercicios de la Tarde
ja: 午後の同時実行のエクササイズ

source: ([back to exercise](dining-philosophers-async.md))
es: ([volver al ejercicio](dining-philosophers-async.md))
ja: （[演習に戻る](dining-philosophers-async.md)）

source: // Add a delay before picking the second fork to allow the execution // to transfer to another task
ja: // 実行を別のタスクに転送できるよう、2 番目のフォークを選択する前に // 遅延を追加します。

source: // To avoid a deadlock, we have to break the symmetry // somewhere. This will swap the forks without deinitializing // either of them.
ja: // デッドロックを避けるために、どこかで対称性を // 崩す必要があります。これにより、いずれのフォークも初期化解除することなく、フォークが // スワップされます。

source: ([back to exercise](chat-app.md))
es: ([volver al ejercicio](chat-app.md))
ja: （[演習に戻る](chat-app.md)）

source: Rust Fundamentals: Days 1 to 3 of this course.
ja: Rust の基礎（Rust Fundamentals）: このコースの 1～3 日目。

source: string: A data type storing textual data. See [`String` vs `str`](basic-syntax/string-slices.html) for more.
ja: 文字列（string）: テキストデータを格納するデータ型。詳しくは、[`String` と `str`](basic-syntax/string-slices.html) をご覧ください。

source: Hello World!
es: ¡Hola, mundo!

source: Small Example
es: Pequeño ejemplo
ko: 작은 예제

source: Why Rust?
es: ¿Por qué Rust?
ko: 러스트를 써야하는 이유

source: Compile Time Guarantees
es: Garantías en Tiempo de Compilación
ko: 컴파일 시 보장되는 것들

source: Runtime Guarantees
es: Garantías en Runtime (Tiempo de Ejecución)
ko: 런타임 시 보장되는 것들

source: Modern Features
es: Funcionalidades Modernas
ko: 현대적인 특징

source: Basic Syntax
es: Sintaxis básica
ko: 기본 문법

source: Scalar Types
es: Tipos escalares
ko: 스칼라 타입

source: Compound Types
es: Tipos compuestos
ko: 복합 타입

source: Dangling References
es: Referencias colgantes
ko: 허상(dangling) 참조

source: String vs str
es: String o str
ko: String과 str

source: Overloading
es: Sobrecarga
ko: 오버로딩

source: Implicit Conversions
es: Conversiones Implícitas
ko: 묵시적 형변환

source: Arrays and for Loops
es: Arrays y Loops for
ko: 배열과 for 반복문

source: if expressions
es: expresiones if
ko: if 표현식

source: for expressions
es: expresiones for
ko: for 표현식

source: while expressions
es: expresiones while
ko: while 표현식

source: break & continue
es: break y continue
ko: break와 continue

source: loop expressions
es: Expresiones loop
ko: loop 표현식

source: static & const
es: static y const
ko: 정적변수(static)와 상수(const)

source: Variant Payloads
es: Payloads Variantes
ko: 데이터를 포함하는 열거형(Variant Payloads)

source: Enum Sizes
es: Tamaños de Enum
ko: 열거형의 크기

source: if let expressions
es: expresiones if let
ko: if let 표현식

source: while let expressions
es: expresiones while let
ko: while let 표현식

source: match expressions
es: expresiones match
ko: match 표현식

source: Destructuring Arrays
es: Desestructurando Arrays
ko: 배열 분해(역구조화)

source: Match Guards
es: Guardas de Match
ko: 매치 가드

source: Stack Memory
es: Memoria de la Pila (_Stack_)
ko: 스택 메모리

source: Manual Memory Management
es: Manejo Manual de Memoria
ko: 수동 메모리 관리

source: Scope-Based Memory Management
es: Manejo de Memoria basado en Scope (ámbitos)
ko: 범위기반 메모리 관리

source: Garbage Collection
es: Recolección de memoria residual
ko: 가비지 컬렉션

source: Rust Memory Management
es: Manejo de la Memoria en Rust
ko: 러스트의 메모리 관리

source: Moved Strings in Rust
es: Cadenas movidas en Rust
ko: 러스트에서의 문자열 이동

source: Double Frees in Modern C++
es: Double free en código C++ moderno
ko: Modern C++에서 이중해제 문제

source: Moves in Function Calls
es: Movimientos en llamadas de función
ko: 함수 호출에서의 이동(Move)

source: Copying and Cloning
es: Copiar y clonar
ko: 복사와 복제

source: Shared and Unique Borrows
es: Préstamos compartidos y únicos
ko: 공유와 고유 빌림

source: Field Shorthand Syntax
es: Sintaxis abreviada de campos
ko: 필드 할당 단축 문법

source: Method Receiver
es: Receptor de método
ko: 메서드 리시버(Receiver)

source: Storing Books
es: Almacenar libros
ko: 책 저장하기

source: Health Statistics
es: Estadísticas de salud
ko: 건강상태 모니터링 시스템

source: Option and Result
es: Option y Result
ko: Option과 Result

source: Recursive Data Types
es: Tipos de datos recursivos
ko: 재귀적 자료구조

source: Iterators and Ownership
es: Iteradores y Ownership (Propiedad)
ko: 반복자와 소유권

source: Strings and Iterators
es: Cadenas e Iteradores
ko: 문자열과 반복자

source: Generic Methods
es: Métodos Genéricos
ko: 제네릭 메서드

source: Monomorphization
es: Monomorfización
ko: 단형화

source: Deriving Traits
es: Derivación de Traits
ko: 트레잇 상속하기

source: Default Methods
es: Métodos por Default
ko: 기본 메서드

source: Important Traits
es: Traits Importantes
ko: 중요한 트레잇

source: Iterator
es: Iteradores

source: From and Into
es: From e Into
ko: From과 Into

source: Read and Write
es: Read y Write
ko: Read와 Write

source: Operators: Add, Mul, ...
es: Operadores: Add, Mul, ….
ko: 연산자: Add, Mul, ...

source: A Simple GUI Library
es: Una Biblioteca GUI sencilla
ko: 간단한 GUI 라이브러리

source: Points and Polygons
es: Puntos y Polígonos
ko: 점과 다각형

source: Structured Error Handling
es: Manejo de Errores Estructurado
ko: 구조화된 오류처리

source: Propagating Errors with ?
es: Propagación de Errores con ?
ko: '?'를 이용한 오류 전파

source: Converting Error Types
es: Conversión de Tipos de Errores
ko: 오류타입 변환

source: Deriving Error Enums
es: Derivación de Enums de Error
ko: 또다른 오류 열거형

source: Adding Context to Errors
es: Añadir Contexto a los Errores
ko: 오류에 상황정보 추가

source: Extern Functions
es: Funciones Externas
ko: 외부(다른언어) 함수들

source: spin
es: girar
ko: 회전

source: Arc
es: Arco

source: Join
es: Unirme

source: Select
es: Seleccionar

source: Pin
es: Fijar

source: Day 1 Morning
es: Día 1: mañana
ko: 1일차 오전

source: Day 1 Afternoon
es: Día 1: tarde
ko: 1일차 오후

source: Day 2 Morning
es: Día 2: mañana
ko: 2일차 오전

source: Day 2 Afternoon
es: Día 2: tarde
ko: 2일차 오후

source: Day 3 Morning
es: Día 3: mañana
ko: 3일차 오전

source: Day 3 Afternoon
es: Día 3: tarde
ko: 3일차 오후

source: Bare Metal Rust Morning
es: Rust Bare Metal: mañana
ko: Bare Metal 오전

source: Concurrency Morning
es: Concurrencia: mañana
ko: 동시성 오전

source: Concurrency Afternoon
es: Concurrencia: tarde
ko: 동시성 오후

source: We call the first three course days Rust Fundamentals.
es: Llamamos a los tres primeros días del curso Fundamentos de Rust.
ko: 강의의 첫 3일 동안에는 Rust의 기초를 다집니다.

source: We typically run classes from 10:00 am to 4:00 pm, with a 1 hour lunch break in the middle. This leaves 2.5 hours for the morning class and 2.5 hours for the afternoon class. Note that this is just a recommendation: you can also spend 3 hour on the morning session to give people more time for exercises. The downside of longer session is that people can become very tired after 6 full hours of class in the afternoon.
es: Normalmente, impartimos las clases de 10:00 a 16:00, con una pausa para comer de una hora. Esto deja 2,5 horas para la clase de la mañana y 2,5 horas para la clase de la tarde. Ten en cuenta que esta es solo una recomendación: también puedes dedicar 3 horas a la sesión de la mañana para dar a la gente más tiempo para los ejercicios. El inconveniente de las sesiones más largas es que la gente puede cansarse mucho después de 6 horas completas de clase por la tarde.

source: Decide on the dates. Since the course takes at least three full days, we recommend that you schedule the days over two weeks. Course participants have said that they find it helpful to have a gap in the course since it helps them process all the information we give them.
es: Decide bien las fechas. Dado que el curso dura al menos tres días completos, te recomendamos que repartas los días a lo largo de dos semanas. Los participantes del curso han dicho que les resulta útil hacer pausas durante el curso, ya que les ayuda a procesar toda la información que les proporcionamos.
ko: 강의 날짜를 정합니다. 최소 3일에 걸쳐서 진행이 되기 때문에, 두 주에 걸쳐서 스케줄을 잡는 것을 권합니다. 기존 강의 수강생들의 피드백에 따르면, 연달아서 강의를 진행하는 것 보다, 강의를 띄엄띄엄 하는 것이 강의 내용을 소화하는데 더 도움이 되었다고 합니다.

source: The first three days make up [Rust Fundaments](../welcome-day-1.md). The days are fast paced and we cover a lot of ground:
es: Los primeros tres días forman los [Fundamentos de Rust](../welcome-day-1.md). Los días son muy intensos y cubrimos mucho terreno:

source: Day 1: Basic Rust, syntax, control flow, creating and consuming values.
es: Día 1: Rust Básico, sintaxis, control de flujo, creación y consumo de valores.

source: Day 2: Memory management, ownership, compound data types, and the standard library.
es: Día 2: Gestión de memoria, _ownership_ (propiedad), tipos de datos compuestos y la biblioteca estándar.

source: Day 3: Generics, traits, error handling, testing, and unsafe Rust.
es: Día 3: Genéricos, _traits_, gestión de errores, pruebas y _unsafe_ (inseguro) Rust.

source: In addition to the 3-day class on Rust Fundamentals, we cover some more specialized topics:
es: Además de la clase de 3 días sobre los fundamentos de Rust, abordamos algunos temas más especializados:
ko: Rust 기초에 관한 3일 과정 이후에는, 다음과 같은 전문 주제를 다룹니다:

source: Ctrl + Enter
es: Ctrl + Intro

source: This will give you the Cargo build tool (`cargo`) and the Rust compiler (`rustc`). You will also get `rustup`, a command line utility that you can use to install/switch toolchains, setup cross compilation, etc.
es: De este modo, obtendrás la herramienta de compilación de Cargo (`cargo`) y el compilador de Rust (`rustc`). También obtendrás `rustup`, una utilidad de línea de comandos que puedes utilizar para instalar o cambiar cadenas de herramientas, configurar la compilación cruzada, etc.
ko: 위 설치 방법을 따르면, 빌드 시스템인 카고(`cargo`)와 러스트 컴파일러(`rustc`)가 설치됩니다. 이와 함께, `rustup`도 설치되는데 이 툴은 툴체인을 설치하고, 다른 툴체인으로 전환하고, 크로스 컴파일 설정을 하는 일을 담당하는 커맨드 라인 유틸리티 입니다.

source: Some folks also like to use the [JetBrains](https://www.jetbrains.com/clion/) family of IDEs, which do their own analysis but have their own tradeoffs. If you prefer them, you can install the [Rust Plugin](https://www.jetbrains.com/rust/). Please take note that as of January 2023 debugging only works on the CLion version of the JetBrains IDEA suite.
es: A algunos compañeros también les gusta usar la familia [JetBrains](https://www.jetbrains.com/clion/) de IDEs, que hacen sus propios análisis, pero también tienen inconvenientes. Si lo prefieres, puedes instalar el [Rust Plugin](https://www.jetbrains.com/rust/). Ten en cuenta que, a partir de enero del 2023, la depuración solo funciona en la versión CLion del paquete de JetBrains IDEA.
ko: 어떤 사람들은 [JetBrains](https://www.jetbrains.com/clion/) 제품군을 선호하기도 합니다. 이 제품들은 rust-analyzer 를 활용하지 않고 IDE 자체적으로 구문분석을 합니다. 만약 이 IDE를 설치하셨다면 [Rust Plugin](https://www.jetbrains.com/rust/)를 설치하시기 바랍니다. 다만 2023년 1월 기준, 디버깅은 JetBrains IDEA suite의 CLion 버전에서만 작동한다는 점에 유의하시기 바랍니다.

source: `rustup`: the Rust toolchain installer and updater. This tool is used to install and update `rustc` and `cargo` when new versions of Rust is released. In addition, `rustup` can also download documentation for the standard library. You can have multiple versions of Rust installed at once and `rustup` will let you switch between them as needed.
es: `rustup`: el instalador y actualizador de cadenas de herramientas de Rust. Esta herramienta se utiliza para instalar y actualizar `rustc` y `cargo` cuando se lanzan nuevas versiones de Rust. Además, `rustup` también puede descargar documentación de la biblioteca estándar. Puedes tener varias versiones de Rust instaladas a la vez y `rustup` te permitirá cambiar de una a otra según lo necesites.
ko: `rustup`: 러스트 툴체인 설치 프로그램이자 업데이트 프로그램 입니다. 이 도구는 새 버전의 러스트가 출시될 때 `rustc` 및 `cargo` 설치하고 업데이트하는 데 사용됩니다. 또한 `rustup`은 표준 라이브러리에 대한 문서를 다운로드할 수도 있습니다. 한 번에 여러 버전의 러스트를 설치할 수 있으며 `rustup`을 이용해서 실제로 사용할 버전을 변경할 수 있습니다.

source: It might be worth alluding that Cargo itself is an extremely powerful and comprehensive tool. It is capable of many advanced features including but not limited to:
es: Vale la pena mencionar que Cargo en sí es una herramienta extremadamente poderosa e integral. Es capaz de hacer muchas cosas avanzadas y no limitadas a:
ko: 카고 자체가 매우 강력하고 포괄적인 도구임을 적극적으로 알리세요. 카고는 다음과 같은 다양한 고급 기능을 제공합니다:

source: ```shell $ cd exercise $ cargo run Compiling exercise v0.1.0 (/home/mgeisler/tmp/exercise) Finished dev [unoptimized + debuginfo] target(s) in 0.75s Running `target/debug/exercise` Hello, world! ```
es: ```shell $ cd exercise $ cargo run Compiling exercise v0.1.0 (/home/mgeisler/tmp/exercise) Finished dev [unoptimized + debuginfo] target(s) in 0.75s Running `target/debug/exercise` Hola Mundo! ```

source: ```shell $ cargo run Compiling exercise v0.1.0 (/home/mgeisler/tmp/exercise) Finished dev [unoptimized + debuginfo] target(s) in 0.24s Running `target/debug/exercise` Edit me! ```
es: ```shell $ cargo run Compiling exercise v0.1.0 (/home/mgeisler/tmp/exercise) Finished dev [unoptimized + debuginfo] target(s) in 0.24s Running `target/debug/ejercicio` Modifícame! ```

source: Control flow constructs: `if`, `if let`, `while`, `while let`, `break`, and `continue`.
es: Control de flujo: `if`, `if let`, `while`, `while let`, `break`, y `continue`.
ko: 흐름 제어: `if`, `if let`, `while`, `while let`, `break`, 그리고 `continue`.

source: As an instructor, you should try to keep the discussions relevant, i.e., keep the discussions related to how Rust does things vs some other language. It can be hard to find the right balance, but err on the side of allowing discussions since they engage people much more than one-way communication.
es: Como instructor, debes intentar llevar discusiones relevantes, por ejemplo, mantener relación de cómo Rust hace las cosas vs otros lenguajes. Puede costar encontrar un balance adecuado, pero permite llevar un debate que atraiga la atención de la gente por sobre un discurso unidireccional.
ko: 강사로서 토론이 옆길로 새지 않게 주의하세요. 예를 들어 러스트와 다른 언어들을 비교한다든지 하는 것은 좋습니다. 적절한 균형을 찾기 애매한 경우라면 토론을 허용하는 쪽이 일방적인 강의보다는 더 많은 사람들의 참여를 이끌어 낼 수 있습니다.

source: The idea for the first day is to show _just enough_ of Rust to be able to speak about the famous borrow checker. The way Rust handles memory is a major feature and we should show students this right away.
es: La idea del primer día es mostrar _lo suficiente_ de Rustcomo para poder hablar del famoso _borrow checker_. La forma en que Rust gestiona la memoria es una característica importante y debemos mostrarla a los estudiantes desde el principio.
ko: 첫 날 강의의 목표는, 러스트에서 그 유명한 빌림 확인에 대해서 이야기 할 수 있을 정도 까지만 러스트를 소개하는 것입니다. 러스트의 가장 독특한 특징이 메모리를 다루는 방식이기 때문에, 학생들에게 이 부분 을 우선적으로 보여주려 합니다.

source: If you're teaching this in a classroom, this is a good place to go over the schedule. We suggest splitting the day into two parts (following the slides):
es: Si estás impartiendo el curso en un aula, este es un buen lugar para repasar el calendario. Te recomendamos que dividas el día en dos partes (siguiendo las diapositivas):
ko: 만약 당신이 강의실에서 가르치고 있다면, 이 슬라이드는 일정을 검토하기에 적합한 곳입니다. 하루치 강의를 아래처럼 오전 오후로 나누어 진행하는 것을 추천합니다. (슬라이드가 그런식으로 나뉘어 있습니다.)

source: Morning: 9:00 to 12:00,
es: Mañana: 9:00 to 12:00,
ko: 오전: 9:00 ~ 12:00,

source: Afternoon: 13:00 to 16:00.
es: Tarde: de 13:00 a 16:00.
ko: 오후: 13:00 ~ 16:00.

source: You can of course adjust this as necessary. Please make sure to include breaks, we recommend a break every hour!
es: Por supuesto, puedes ajustar las horas según lo necesites. No olvides incluir pausas, recomendamos hacer un descanso cada hora.
ko: 물론 필요에 따라 조절할 수 있습니다. 강의 중간에 쉬는시간을 넣는 것을 잊지 마세요. 매 시간 휴식을 갖는걸 추천합니다!

source: ```rust,editable fn main() { println!("Hello 🌍!"); } ```
es: ```rust,editable fn main() { println!("Hola 🌍!"); } ```

source: This slide tries to make the students comfortable with Rust code. They will see a ton of it over the next three days so we start small with something familiar.
es: Con esta diapositiva se intenta que los alumnos se sientan cómodos con el código de Rust. En los próximos tres días lo verán mucho, así que empezaremos con algo que ya conocemos.
ko: 이 슬라이드는 학생들이 러스트 코드에 익숙해지기 위해 작성되었습니다. 앞으로 3일 동안 많은 코드를 접할 것이기 때문에 우선 친숙한 코드부터 시작합니다.
