Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: We will talk more about borrowing when we get to ownership.
es: Más adelante hablaremos de los préstamos cuando lleguemos a la parte de propiedad.
fa: هنگامی که به مالکیت در زبان راست رسیدیم، بیشتر در مورد «قرض دادن» صحبت خواهیم کرد.
ja: 借用については所有権のところで詳しく説明します。
ko: 소유권에 대한 주제를 다룰 때 이 빌림에 대해 더 자세히 이야기 하겠습니다.
pt_br: Falaremos mais sobre empréstimos quando chegarmos à _ownership_.
uk: Про запозичення ми поговоримо більше, коли дійдемо до володіння.

source: Exclusive references, also known as mutable references, allow changing the value they refer to. They have type `&mut T`.
fa: مراجع انحصاری، همچنین به عنوان مراجع قابل تغییر شناخته می شوند، اجازه می دهند مقداری را که به آن ارجاع می دهند تغییر دهند. آنها نوع `mut &T` دارند.
ja: 排他参照は可変参照とも呼ばれ、参照先の値を変更できます。型は `&mut T` です。
pt_br: Referências exclusivas, também conhecidas como referências mutáveis, permitem alterar o valor a que se referem. Eles têm tipo `&mut T`.
uk: Ексклюзивні посилання, також відомі як мутабельні посилання, дозволяють змінювати значення, на яке вони посилаються. Вони мають тип `&mut T`.

source: "Exclusive" means that only this reference can be used to access the value. No other references (shared or exclusive) can exist at the same time, and the referenced value cannot be accessed while the exclusive reference exists. Try making an `&point.0` or changing `point.0` while `x_coord` is alive.
fa: "انحصاری" به این معنی است که فقط از این مرجع می توان برای دسترسی به مقدار استفاده کرد. هیچ مرجع دیگری (اشتراک‌گذاری شده یا انحصاری) نمی‌تواند همزمان وجود داشته باشد، و تا زمانی که مرجع انحصاری وجود دارد، نمی‌توان به مقدار ارجاع‌شده دسترسی داشت. زمانی که `x_coord` زنده است، `&point.0` بسازید یا `point.0` را تغییر دهید.
ja: 「排他」とは、この参照のみを使用して値にアクセスできることを意味します。他の参照（共有または排他）が同時に存在することはできず、排他参照が存在する間は参照先の値にアクセスできません。`x_coord` が有効な状態で `&point.0` を作成するか、`point.0` を変更してみてください。
pt_br: "Exclusivo" significa que apenas esta referência pode ser usada para acessar o valor. Nenhuma outra referência (compartilhada ou exclusiva) pode existir ao mesmo tempo, e o valor referenciado não pode ser acessado enquanto a referência exclusiva existir. Tente fazer um `&point.0` ou alterar `point.0` enquanto `x_coord` estiver ativo.
uk: "Ексклюзивне" означає, що тільки це посилання може бути використане для доступу до значення. Жодні інші посилання (спільні або ексклюзивні) не можуть існувати одночасно, і до значення, на яке посилаються, не можна отримати доступ, поки існує ексклюзивне посилання. Спробуйте створити `&point.0` або змінити `point.0`, поки існує `x_coord`.

source: Be sure to note the difference between `let mut x_coord: &i32` and `let x_coord: &mut i32`. The first one represents a shared reference which can be bound to different values, while the second represents an exclusive reference to a mutable value.
fa: حتماً تفاوت بین «let mut x_coord: &i32» و «let x_coord: &mut i32» را یادداشت کنید. مورد اول یک مرجع مشترک را نشان می دهد که می تواند به مقادیر مختلف متصل شود، در حالی که دومی نشان دهنده یک مرجع انحصاری به یک مقدار قابل تغییر است.
ja: `let mut x_coord: &i32` と `let x_coord: &mut i32` の違いに注意してください。前者は異なる値にバインドできる共有参照を表すのに対し、後者は可変の値への排他参照を表します。
pt_br: Certifique-se de observar a diferença entre `let mut x_coord: &i32` e `let rx_coord: &mut i32`. O primeiro representa uma referência mutável que pode ser ligada a diferentes valores, enquanto o segundo representa uma referência exclusiva a um valor mutável.
uk: Обов’язково зверніть увагу на різницю між `let mut x_coord: &i32` і `let x_coord: &mut i32`. Перший представляє спільне посилання, яке можна прив'язати до різних значень, тоді як другий представляє ексклюзивне посилання на значення, що змінюється.

source: A slice gives you a view into a larger collection:
es: Un _slice_ ofrece una visión de una colección más amplia:
fa: یک برش به شما امکان می‌دهد نما (view) از یک مجموعه بزرگتر داشته باشید:
ja: スライスは、より大きなコレクションに対するビューを提供します。
ko: 슬라이스는 큰 컬랙션의 일부(혹은 전체)를 보여주는 뷰(view)입니다:
pt_br: Uma _slice_ (fatia) oferece uma visão de uma coleção maior:
uk: Зріз дає змогу поглянути на більшу колекцію:

source: Slices borrow data from the sliced type.
es: Los slices toman prestados datos del tipo slice.
fa: برش‌ها داده‌ها را از نوع برش‌شده قرض می‌گیرند.
ja: スライスは、スライスされた型からデータを借用します。
ko: 슬라이스는 다른(슬라이스 된) 타입으로부터 데이터를 '빌려'옵니다.
pt_br: Slices pegam dados emprestados (_borrow) do tipo original.
uk: Зрізи запозичують дані зі зрізаного типу.

source: We create a slice by borrowing `a` and specifying the starting and ending indexes in brackets.
es: Creamos un slice tomando prestado `a` y especificando entre paréntesis los índices de inicio y de fin.
fa: ما با قرض گرفتن <span dir=ltr>`a`</span> و مشخص کردن شاخص‌های شروع و پایان در براکت‌ها، برش (slice) ایجاد می‌کنیم.
ja: スライスを作成するには、`a` を借用し、開始インデックスと終了インデックスを角かっこで囲んで指定します。
ko: 슬라이스는 우선 `a`를 빌린다음, 시작과 끝 인덱스를 브래킷(`[]`)안에 지정해서 만듭니다.
pt_br: Nós criamos uma _slice_ _borrowing_ (emprestando) `a` e especificando os índices de início e fim entre colchetes.
uk: Ми створюємо зріз, запозичуючи `a` та вказуючи початковий і кінцевий індекси в дужках.

source: If the slice starts at index 0, Rust’s range syntax allows us to drop the starting index, meaning that `&a[0..a.len()]` and `&a[..a.len()]` are identical.
es: Si el slice comienza en el índice 0, la sintaxis de intervalo de Rust nos permite eliminar el índice inicial, lo que significa que `&a[0..a.len()]` y `&a[..a.len()]` son idénticos.
fa: اگر برش از شاخص ۰ شروع شود، سینتکس راست به ما اجازه می‌دهد شاخص شروع را حذف کنیم (یعنی عدد صفر را ننویسیم)، به این معنی که <span dir=ltr>`&a[0..a.len()]`</span> و <span dir=ltr>`&a[..a.len()]`</span> یکسان هستند.
ja: スライスがインデックス 0 から始まる場合、Rust の範囲構文により開始インデックスを省略できます。つまり、`&a[0..a.len()]` と `&a[..a.len()]` は同じです。
ko: 슬라이스가 인덱스 0부터 시작한다면 시작 인덱스는 생략 가능합니다. 즉 `&a[0..a.len()]`와 `&a[..a.len()]` 는 동일합니다.
pt_br: Se a _slice_ começa no índice 0, a sintaxe de _range_ (faixa) nos permite omitir o índice inicial, o que significa que `&a[0..a.len()]` e `&a[..a.len()]` são idênticos.
uk: Якщо зріз починається з індексу 0, синтаксис діапазону Rust дозволяє нам відкинути початковий індекс, тобто `&a[0..a.len()]` і `&a[..a.len()]` ідентичні.

source: The same is true for the last index, so `&a[2..a.len()]` and `&a[2..]` are identical.
es: Lo mismo ocurre con el último índice, por lo que `&a[2..a.len()]` y `&a[2..]` son idénticos.
fa: در مورد شاخص آخر نیز همینطور است، بنابراین <span dir=ltr>`&a[2..a.len()]`</span> و <span dir=ltr>`&a[2..]`</span> یکسان هستند.
ja: 最後のインデックスについても同じことが言えるので、`&a[2..a.len()]` と `&a[2..]` は同じです。
ko: 마지막 인덱스도 생략 가능합니다. 그래서 `&a[2..a.len()]` 와 `&a[2..]`는 동일합니다.
pt_br: O mesmo vale para o último índice, logo `&a[2..a.len()]` e `&a[2..]` são idênticos.
uk: Теж саме стосується останнього індексу, тому `&a[2..a.len()]` і `&a[2..]` ідентичні.

source: To easily create a slice of the full array, we can therefore use `&a[..]`.
es: Para crear fácilmente un slice del array completo, podemos usar `&a[..]`.
fa: یک روش ساده برای برش کل آرایه، این است که از <span dir=ltr>`&a[..]`</span> استفاده کنیم.
ja: 配列全体のスライスを簡単に作成するには、`&a[..]` と書くことが出来ます。
ko: 따라서 전체 배열에 대한 슬라이스는 `&a[..]`가 됩니다.
pt_br: Para criar facilmente uma _slice_ de uma matriz completa, podemos utilizar`&a[..]`.
uk: Щоб легко створити повний зріз масиву, ми можемо використовувати `&a[..]`.

source: `s` is a reference to a slice of `i32`s. Notice that the type of `s` (`&[i32]`) no longer mentions the array length. This allows us to perform computation on slices of different sizes.
es: `s` es una referencia a un slice de `i32`s. Ten en cuenta que el tipo de `s` (`&[i32]`) ya no menciona la longitud del array. Esto nos permite realizar cálculos en slices de diferentes tamaños.
fa: <span dir=ltr>`s`</span> یک مرجع به برش i32 است. توجه داشته باشید که نوع <span dir=ltr>`s`</span> (<span dir=ltr>`&[i32]`</span>) دیگر طول آرایه را ذکر نمی‌شود. این به ما امکان می‌دهد محاسباتی را روی برش‌هایی با اندازه‌های مختلف انجام دهیم.
ja: `s` は i32 のスライスへの参照です。`s` の型（`&[i32]`）に配列の長さが含まれなくなったことに注目してください。これにより、さまざまなサイズのスライスに対して計算を実行できます。
ko: `s`는 `i32`들로 이루어진 슬라이스에 대한 참조입니다. `s`의 타입(`&[i32]`)에 배열의 크기가 빠져있음에 주목하시기 바랍니다. 즉, 슬라이스를 이용하면 다양한 길이의 데이터를 다룰 수 있습니다.
pt_br: `s` é uma referência a uma _slice_ de `i32`. Observe que o tipo de `s` (`&[i32]`) não menciona mais o tamanho da matriz. Isso nos permite realizar cálculos em _slices_ de tamanhos diferentes.
uk: `s` є посиланням на зріз `i32`. Зверніть увагу, що тип `s` (`&[i32]`) більше не згадує довжину масиву. Це дозволяє нам виконувати обчислення на зрізах різного розміру.

source: Slices always borrow from another object. In this example, `a` has to remain 'alive' (in scope) for at least as long as our slice.
fa: برش‌ها همیشه از یک شیء دیگر قرض می‌گیرند. در این مثال، <span dir=ltr>`a`</span> باید حداقل به اندازه طول‌عمر برش ما، زنده (در محدوده) باقی بماند.
ja: スライスは常に別のオブジェクトから借用します。この例では、`a` は少なくともスライスが存在する間は「存続」 している（スコープ内にある)必要があります。
pt_br: As _slices_ sempre pegam emprestado (borrow) de outro objeto. Neste exemplo, `a` deve permanecer 'vivo' (em escopo) por pelo menos tanto tempo quanto nossa _slice_.
uk: Зрізи завжди запозичуються з іншого об'єкта. У цьому прикладі `a` має залишатися 'живим' (в області застосування) принаймні стільки ж, скільки і наш зріз.

source: We can now understand the two string types in Rust:
es: Ahora podemos entender los dos tipos de cadenas de Rust:
fa: حالا می‌توانیم دو نوع رشته‌ای را در راست درک کنیم:
ko: 이제 러스트의 두 가지 문자열 타입에 대해서 이해해 보겠습니다:
pt_br: Agora podemos entender os dois tipos de strings em Rust:
uk: Тепер ми можемо зрозуміти два типи рядків у Rust:

source: "World"
fa: "دنیا"
pt_br: "Mundo"
uk: "Світ"

source: "Hello "
fa: "سلام"
pt_br: "Olá "
uk: "Привіт "

source: `&str` introduces a string slice, which is an immutable reference to UTF-8 encoded string data stored in a block of memory. String literals (`"Hello"`), are stored in the program’s binary.
fa: <span dir=ltr>`&str`</span> یک برش رشته‌ای را معرفی می‌کند، که یک مرجع غیرقابل تغییر به داده‌های رشته‌ای رمزشده UTF-8 است که در یک بلوک حافظه ذخیره شده است. لیترال های رشته‌ای <span dir=ltr>`String`</span> (`”Hello”`) در باینری برنامه ذخیره می‌شوند.
uk: `&str` представляє зріз рядка, який є незмінним посиланням на дані рядка в кодуванні UTF-8, що зберігаються в блоці пам’яті. Рядкові літерали (`"Hello"`) зберігаються у бінарному файлі програми.

source: Rust's `String` type is a wrapper around a vector of bytes. As with a `Vec<T>`, it is owned.
fa: در راست نوع ‍<span dir=ltr>`String`</span> یک wrapper بر روی یک بردار از بایت‌هاست. مانند <span dir=ltr>`Vec<T>`</span>، یک نوع Owned است.
uk: Тип `String` в Rust — це оболонка навколо вектора байтів. Як і у випадку з `Vec<T>`, він знаходиться у володінні.

source: As with many other types `String::from()` creates a string from a string literal; `String::new()` creates a new empty string, to which string data can be added using the `push()` and `push_str()` methods.
fa: مانند بسیاری از انواع دیگر، <span dir=ltr>`String::from()`</span> یک رشته از یک لیترال رشته ایجاد می‌کند. <span dir=ltr>`String::new()`</span> که رشته خالی جدید ایجاد می‌کند که داده های رشته‌ای می‌توانند با استفاده از متدهای <span dir=ltr>`push()`</span> و <span dir=ltr>`push_str()`</span> به آن اضافه شوند.
ja: 他の多くの型と同様に、`String::from()` は文字列リテラルから文字列を作成します。`String::new()` は新しい空の文字列を作成します。`push()` メソッドと `push_str()` メソッドを使用して、そこに文字列データを追加できます。
pt_br: Da mesma forma que outros tipos, `String::from()` cria uma string a partir de um literal; `String::new()` cria uma nova string vazia, na qual dados de string podem ser adicionados com os métodos `push()` e `push_str()`.
uk: Як і у багатьох інших типів, `String::from()` створює рядок із рядкового літералу; `String::new()` створює новий порожній рядок, до якого дані рядка можна додати за допомогою методів `push()` і `push_str()`.

source: The `format!()` macro is a convenient way to generate an owned string from dynamic values. It accepts the same format specification as `println!()`.
fa: ماکرو <span dir=ltr>`format!()`</span> یک راه راحت برای ایجاد یک رشته Owned از مقادیر پویا است. مثل فرمت قابل پذیرش توسط ماکرو <span dir=ltr>`println!()`</span> است.
ja: `format!()` マクロを使用すると、動的な値から所有文字列を簡単に生成できます。これは println!() と同じ形式指定を受け入れます。
pt_br: A macro `format!()` é uma maneira conveniente de gerar uma string _owned_ a partir de valores dinâmicos. Ela aceita os mesmos formatadores que `println!()`.
uk: Макрос `format!()` є зручним способом створення рядка, яким володіють, з динамічних значень. Він приймає таку саму специфікацію формату, як і `println!()`.

source: You can borrow `&str` slices from `String` via `&` and optionally range selection. If you select a byte range that is not aligned to character boundaries, the expression will panic. The `chars` iterator iterates over characters and is preferred over trying to get character boundaries right.
fa: می‌توانید برش‌های `&str` را از `String` از طریق `&` و انتخابی محدوده انتخاب کنید. اگر محدوده بایتی را انتخاب کنید که با مرزهای نویسه تراز نباشد، عبارت وحشت می کند. تکرار کننده `chars` روی کاراکترها تکرار می شود و بر تلاش برای درست کردن مرزهای کاراکتر ترجیح داده می شود.
ja: `&` を使用して `String` から `&str` スライスを借用し、必要に応じて範囲を選択できます。文字境界に揃えられていないバイト範囲を選択すると、その式でパニックを起こします。`chars` イテレータは文字単位で処理するため、正しい文字境界を取得しようとすることよりも、このイテレータを使用するほうが望ましいです。
pt_br: Você pode pegar emprestado (borrow) _slices_ `&str` de `String` via `&` e opcionalmente seleção de intervalo. Se você selecionar um intervalo de byte que não está alinhado com os limites dos caracteres, a expressão irá retornar um pânico. O iterador `chars` itera sobre caracteres e é preferível tentar obter os limites dos caracteres corretos.
uk: Ви можете запозичувати зрізки `&str` з `String` за допомогою `&` і, за бажанням, вибору діапазону. Якщо ви виберете діапазон байт, який не вирівняно за межами символів, вираз запанікує. Ітератор `chars` перебирає символи, і йому надається перевага перед спробами вирівняти межі символів.

source: For C++ programmers: think of `&str` as `std::string_view` from C++, but the one that always points to a valid string in memory. Rust `String` is a rough equivalent of `std::string` from C++ (main difference: it can only contain UTF-8 encoded bytes and will never use a small-string optimization).
fa: برای برنامه‌نویسان <span dir=ltr>`C++`</span>: <span dir=ltr>`&str`</span>را به عنوان <span dir=ltr>`const char*`</span> در <span dir=ltr>`C++`</span> درنظر بگیرید، اما یک فرق مهم این است که در راست که همیشه به یک رشته معتبر در حافظه اشاره می کند. راست نوع <span dir=ltr>`String`</span>معادل تقریبی <span dir=ltr>`std::string`</span> در <span dir=ltr>`C++`</span> است (با این تفاوت که فقط می‌تواند حاوی بایت‌های رمزشده UTF-8 باشد و هرگز از بهینه‌سازی Small-String استفاده نمی کند).
ja: C++ プログラマー向けの説明：`&str` は常にメモリ上の有効な文字列を指しているようなC++ の std::string_view と考えられます。Rust の `String` は、C++ の `std::string` とおおむね同等です（主な違いは、UTF-8 でエンコードされたバイトのみを含めることができ、短い文字列に対する最適化が行われないことです）。
pt_br: Para programadores C++: pense em `&str` como `const char*` de C++, mas que sempre aponta para uma string válida na memória. Em Rust, `String` é um equivalente aproximado de `std::string` de C++ (principal diferença: ele só pode conter bytes codificados em UTF-8 e nunca usará uma otimização de string pequena).
uk: Для програмістів на C++: думайте про `&str` як про `std::string_view` з C++, але такий, що завжди вказує на дійсний рядок у пам'яті. Rust `String` є приблизним еквівалентом `std::string` з C++ (головна відмінність: він може містити лише байти у кодуванні UTF-8 і ніколи не використовує оптимізацію малих рядків)..

source: Byte strings literals allow you to create a `&[u8]` value directly:
fa: رشته‌های بایت به شما امکان می‌دهند مستقیماً یک مقدار <span dir=ltr>`&[u8]`</span> ایجاد کنید:
ja: バイト文字列リテラルを使用すると、`&[u8]` 値を直接作成できます。
pt_br: Strings de byte permitem que você crie um valor `&[u8]` diretamente:
uk: Літерали байтових рядків дозволяють створювати значення `&[u8]` безпосередньо:

source: Raw strings allow you to create a `&str` value with escapes disabled: `r"\n" == "\\n"`. You can embed double-quotes by using an equal amount of `#` on either side of the quotes:
es: Las cadenas sin formato te permiten crear un valor `&str` con los escapes inhabilitados: `r"\n" == "\\n"`. Puedes insertar comillas dobles con la misma cantidad de `#` a cada lado de ellas:
fa: رشته‌های خام به شما امکان می دهند یک مقدار <span dir=ltr><code class=hljs>&str</code></span> با غیرفعال کردن فرارها ایجاد کنید: `r"\n" == "\\n"`.شما می‌توانید با استفاده از تعداد برابر `#` در دو طرف دابل‌کوت دابل‌کوت‌ها، دابل‌کوت‌ها را جاسازی کنید:
ja: 未加工の文字列を使用すると、エスケープを無効にして `&str` 値を作成できます（`r"\n" == "\\n"`）。二重引用符を埋め込むには、引用符の両側に同量の `#` を使用します。
pt_br: Strings brutas permitem que você crie um valor `&str` com caracteres de escape desabilitados: `r"\n" == "\\n"`. Você pode embutir aspas duplas utilizando uma quantidade igual de `#` em ambos os lados das aspas:
uk: Необроблені рядки дозволяють створювати значення `&str` з відключеним екрануванням: `r"\n" == "\\n"`. Ви можете вставити подвійні лапки, використовуючи однакову кількість `#` з обох боків лапок:

source: We will create a few utility functions for 3-dimensional geometry, representing a point as `[f64;3]`. It is up to you to determine the function signatures.
fa: ما چند توابع کاربردی برای هندسه سه بعدی ایجاد خواهیم کرد که نقطه ای را به عنوان `[f64;3]` نشان می دهد. تعیین امضاهای عملکرد به عهده شماست.
ja: ここでは、点を `[f64;3]` として表現する 3 次元ジオメトリのユーティリティ関数をいくつか作成します。関数シグネチャは任意で指定してください。
pt_br: Vamos criar algumas funções de utilidade para geometria tridimensional, representando um ponto como `[f64;3]`. Cabe a você determinar as assinaturas das funções.
uk: Ми створимо декілька утиліт для тривимірної геометрії, що представляють точку у вигляді `[f64;3]`. Ви самі визначаєте сигнатури функцій.

source: // Calculate the magnitude of a vector by summing the squares of its coordinates // and taking the square root. Use the `sqrt()` method to calculate the square // root, like `v.sqrt()`.
fa: // اندازه یک بردار را با جمع مربعات مختصات آن محاسبه کنید // و سپس جذر آن را بگیرید. از متد `sqrt()` برای محاسبه جذر استفاده کنید، مثل `v.sqrt()`.
ja: // 座標の二乗を合計して平方根を取り、 // ベクターの大きさを計算します。`sqrt()` メソッドを使用して、`v.sqrt()` と同様に // 平方根を計算します。
pt_br: // Calcule a magnitude de um vetor somando os quadrados de suas coordenadas // e tirando a raiz quadrada. Use o método `sqrt()` para calcular a raiz quadrada, // como `v.sqrt()`.
uk: // Обчисліть величину вектора шляхом додавання квадратів його координат // і вилучення квадратного кореня. Використовуйте метод `qrt()` для для обчислення квадратного // кореня, наприклад `v.sqrt()`.

source: // Normalize a vector by calculating its magnitude and dividing all of its // coordinates by that magnitude.
fa: // یک بردار را با محاسبه اندازه‌ی آن و تقسیم تمام مختصات آن // بر آن اندازه، نرمال‌سازی کنید.
ja: // 大きさを計算し、すべての座標をその大きさで割ることで // ベクターを正規化します。
pt_br: // Normalize um vetor calculando sua magnitude e dividindo todas as suas // coordenadas por essa magnitude.
uk: // Нормалізуйте вектор, обчисливши його величину і поділивши всі його // координати на цю величину.

source: // Use the following `main` to test your work.
fa: // از `main` زیر برای تست کار خود استفاده کنید.
ja: // 次の `main` を使用して処理をテストします。
pt_br: // Use o seguinte `main` para testar seu trabalho.
uk: Використовуйте наступний `main` для тестування вашої роботи.

source: "Magnitude of a unit vector: {}"
fa: "اندازه‌ی یک بردار واحد: {}"
pt_br: "Magnitude de um vetor unitário: {}"
uk: "Величина одиничного вектора: {}"

source: "Magnitude of {v:?}: {}"
fa: "اندازه‌ی {v:?}: {}"
pt_br: "Magnitude de {v:?}: {}"
uk: "Величина {v:?}: {}"

source: "Magnitude of {v:?} after normalization: {}"
fa: "اندازه‌ی {v:?} پس از نرمال‌سازی: {}"
pt_br: "Magnitude de {v:?} após normalização: {}"
uk: "Величина {v:?} після нормалізації: {}"

source: /// Calculate the magnitude of the given vector.
fa: /// اندازه‌ی بردار داده شده را محاسبه کنید.
ja: /// 指定されたベクターの大きさを計算します。
pt_br: /// Calcule a magnitude do vetor dado.
uk: /// Обчисліть величину заданого вектора.

source: /// Change the magnitude of the vector to 1.0 without changing its direction.
fa: /// اندازه‌ی بردار را به 1.0 تغییر دهید بدون اینکه جهت آن تغییر کند.
ja: /// 向きを変えずにベクターの大きさを 1.0 に変更します。
pt_br: /// Altere a magnitude do vetor para 1.0 sem alterar sua direção.
uk: /// Змініть величину вектора на 1.0, не змінюючи його напрямок.

source: Like C and C++, Rust has support for custom structs:
es: Al igual que C y C++, Rust admite estructuras (struct) personalizadas:
fa: ‏مانند C و C++، زبان Rust از ساختارهای سفارشی پشتیبانی می‌کند:
ja: C や C++ と同様に、Rust はカスタム構造体をサポートしています。
ko: C/C++ 와 마찬가지로 러스트는 커스텀 구조체를 지원합니다:
pt_br: Como C e C++, Rust tem suporte para `structs` personalizadas:
uk: Подібно до C і C++, Rust підтримує користувальницькі структури:

source: "{} is {} years old"
fa: ‏"{} {} ساله است"
pt_br: "{} tem {} anos."
uk: "{} віком {} років"

source: Key Points:
es: Puntos Clave:
fa: نکات کلیدی:
ja: キーポイント:
ko: 키 포인트:
pt_br: Pontos Chave:
uk: Ключові моменти:

source: Structs work like in C or C++.
es: Las estructuras funcionan como en C o en C++.
fa: ‏ساختارها (Structs) در Rust مانند C یا C++ عمل می‌کنند.
ja: 構造体は、C や C++ においてと同じように機能します。
ko: 구조체는 C/C++ 와 유사합니다.
pt_br: Structs funcionam como em C ou C++.
uk: Структури працюють як у C або C++.

source: Like in C++, and unlike in C, no typedef is needed to define a type.
es: Al igual que en C++, y a diferencia de C, no se necesita typedef para definir un tipo.
fa: ‏مانند C++ و برخلاف C، برای تعریف یک نوع نیازی به `typedef` نیست.
ja: C++ と同様に、また C とは異なり、型を定義するのに typedef は必要ありません。
ko: C++ 와 같지만 C와는 달리 타입을 정의하기 위해 'typedef'가 필요하지 않습니다.
pt_br: Como em C++, e ao contrário de C, nenhum _`typedef`_ é necessário para definir um tipo.
uk: Як і в C++, і на відміну від C, для визначення типу не потрібен typedef.

source: Unlike in C++, there is no inheritance between structs.
es: A diferencia de C++, no existe ninguna herencia entre las estructuras.
fa: ‏برخلاف C++، در Rust بین ساختارها ارث‌بری وجود ندارد.
ja: C++ とは異なり、構造体間に継承はありません。
ko: C++ 와 달리 구조체 간 상속은 없습니다.
pt_br: Ao contrário do C++, não há herança entre _structs_.
uk: На відміну від C++, між структурами немає успадкування.

source: This may be a good time to let people know there are different types of structs.
fa: این زمان مناسبی است تا به مردمان اطلاع دهیم که انواع مختلفی از ساختارها وجود دارد.
ja: ここで、構造体にはさまざまな型があることを説明しましょう。
pt_br: Este pode ser um bom momento para que as pessoas saibam que existem diferentes tipos de _structs_.
uk: Це може бути вдалий час, щоб повідомити людям, що існують різні типи структур.

source: Zero-sized structs (e.g. `struct Foo;`) might be used when implementing a trait on some type but don’t have any data that you want to store in the value itself.
fa: ساختارهای بدون اندازه (مانند `struct Foo;`) ممکن است زمانی استفاده شوند که می‌خواهید یک صفت (trait) را بر روی یک نوع پیاده‌سازی کنید، اما داده‌ای ندارید که بخواهید در خود مقدار ذخیره کنید.
ja: サイズがゼロの構造体（例: `struct Foo;`）は、ある型にトレイトを実装しているものの、値自体に格納するデータがない場合に使用できます。
pt_br: _Structs_ de tamanho zero (por exemplo, `struct Foo;`) podem ser usadas ao implementar um _trait_ em algum tipo, mas não possuem nenhum dado que você deseja armazenar nelas.
uk: Структури нульового розміру (наприклад, `struct Foo;`) можуть бути використані при реалізації трейту на якомусь типі, але не мають даних, які ви хочете зберігати у самому значенні.
