Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: //! Greeting library.
ja: //! 挨拶ライブラリ。
uk: //! Бібліотека привітання.

source: /// Greet `name`.
ja: /// `name` に挨拶します。
pt_br: /// Saudação `nome`.
uk: /// Привітати `name`.

source: "Hello {name}, it is very nice to meet you!"
fa: "سلام {name}، از آشنایی با شما بسیار خوشحالم!"
pt_br: "Olá {nome}, prazer em conhecê-lo!"
uk: "Привіт, {name}, дуже приємно познайомитися з вами!"

source: You build, push, and run the binary like before:
es: Puedes compilar, insertar y ejecutar el binario como antes:
fa: باینری را مانند قبل می سازید، push و اجرا می‌کنید:
ja: 前と同じようにバイナリをビルド、push、実行します。
ko: 이전처럼, 빌드하고, 가상 디바이스로 넣고, 실행합니다:
pt_br: Você constrói, envia e executa o binário como antes:
uk: Ви створюєте, завантажуєте та запускаєте бінарний файл, як і раніше:

source: The [Android Interface Definition Language (AIDL)](https://developer.android.com/guide/components/aidl) is supported in Rust:
es: El [lenguaje de definición de la interfaz de Android (AIDL)](https://developer.android.com/guide/components/aidl) es compatible con Rust:
fa: ‏[Android Interface Definition Language (AIDL)](https://developer.android.com/guide/components/aidl) در Rust پشتیبانی می‌شود:
ja: Rust では [Android インターフェース定義言語（AIDL）](https://developer.android.com/guide/components/aidl) がサポートされています。
ko: 러스트는 [안드로이드 인터페이스 정의 언어(AIDL)](https://developer.android.com/guide/components/aidl)를 지원합니다:
pt_br: A [Linguagem de Definição de Interface Android (AIDL)](https://developer.android.com/guide/components/aidl) é compatível com Rust:
uk: [Android Interface Definition Language (AIDL)](https://developer.android.com/guide/components/aidl) підтримується в Rust:

source: Rust code can call existing AIDL servers,
es: El código de Rust puede llamar a servidores AIDL que ya se hayan creado.
fa: کد Rust می تواند سرورهای AIDL موجود را فراخوانی کند,
ja: Rust コードは既存の AIDL サーバーを呼び出すことができます。
ko: 러스트 코드에서 기존 AIDL 서버를 호출 할 수 있습니다.
pt_br: O código Rust pode chamar servidores AIDL existentes,
uk: Код Rust може викликати існуючі сервери AIDL,

source: You can create new AIDL servers in Rust.
es: Puedes crear servidores de AIDL en Rust.
fa: می‌توانید سرورهای جدید AIDL را در Rust ایجاد کنید.
ja: Rust では新しい AIDL サーバーを作成できます。
ko: 러스트에서 새로운 AIDL 서버를 생성할 수 있습니다.
pt_br: Você pode criar novos servidores AIDL em Rust.
uk: Ви можете створювати нові сервери AIDL у Rust.

source: To illustrate how to use Rust with Binder, we're going to walk through the process of creating a Binder interface. We're then going to both implement the described service and write client code that talks to that service.
fa: برای نشان‌دادن نحوه استفاده از Rust با Binder، ما می‌خواهیم روند ایجاد رابط Binder را بررسی کنیم. سپس هم سرویس توصیف‌شده را پیاده‌سازی می‌کنیم و هم کد کلاینت را می‌نویسیم که با آن سرویس صحبت می‌کند.
uk: Щоб проілюструвати, як використовувати Rust з Binder, ми розглянемо процес створення інтерфейсу Binder. Потім ми реалізуємо описаний сервіс і напишемо клієнтський код, який взаємодіє з цим сервісом.

source: AIDL Interfaces
es: Interfaces de AIDL
ja: AIDL インターフェース
ko: AIDL 인터페이스
pt_br: Interfaces AIDL
uk: Інтерфейси AIDL

source: You declare the API of your service using an AIDL interface:
es: La API de tu servicio se declara mediante una interfaz de AIDL:
fa: شما API سرویس خود را با استفاده از یک AIDL interface اعلام می‌کنید:
ja: サービスの API を宣言するには、AIDL インターフェースを使用します。
ko: AIDL 인터페이스를 이용해서 서비스의 API를 선언합니다:
pt_br: Você declara a API do seu serviço usando uma interface AIDL:
uk: Ви оголошуєте API свого сервісу за допомогою інтерфейсу AIDL:

source: /** Birthday service interface. */
ja: /** 誕生日サービスのインターフェース。*/
pt_br: /** Interface de serviço de aniversário. */
uk: /** Інтерфейс сервісу Birthday. */

source: /** Generate a Happy Birthday message. */
ja: /** 「お誕生日おめでとう」というメッセージを生成します。*/
pt_br: /** Gera uma mensagem de feliz aniversário. */
uk: /** Генерує привітання з днем народження. */

source: // Rust is not enabled by default
ja: // Rust はデフォルトでは無効です。
pt_br: // Rust não está ativado por padrão
uk: // Rust не увімкнено за замовчуванням

source: Note that the directory structure under the `aidl/` directory needs to match the package name used in the AIDL file, i.e. the package is `com.example.birthdayservice` and the file is at `aidl/com/example/IBirthdayService.aidl`.
fa: توجه داشته باشید که ساختار دایرکتوری زیر دایرکتوری `aidl/` باید با نام package استفاده شده در فایل AIDL مطابقت داشته باشد، به‌عنوان‌مثال بسته `com.example.birthdayservice` بوده و این فایل در `aidl/com/example/IBirthdayService.aidl` است.
uk: Зверніть увагу, що структура каталогів у каталозі `aidl/` має відповідати назві пакета, що використовується у файлі AIDL, тобто пакетом є `com.example.birthdayservice`, а файл знаходиться за адресою `aidl/com/example/IBirthdayService.aidl`.

source: Generated Service API
uk: Згенерований API сервісу

source: Binder generates a trait corresponding to the interface definition. trait to talk to the service.
fa: Binder یک trait مطابق با تعریف interface تولید می‌کند. trait برای صحبت کردن با سرویس است.
uk: Binder генерує трейт, що відповідає визначенню інтерфейсу. Трейт для зв'язку з сервісом.

source: _Generated trait_:
uk: _Згенерований трейт_:

source: Your service will need to implement this trait, and your client will use this trait to talk to the service.
fa: سرویس شما باید این trait را پیاده‌سازی کند و کلاینت شما از این ویژگی برای صحبت با سرویس‌ها استفاده خواهد کرد.
uk: Ваш сервіс повинен реалізувати цей трейт, а ваш клієнт використовуватиме цей трейт для спілкування зі сервісом.

source: The generated bindings can be found at `out/soong/.intermediates/<path to module>/`.
fa: پیوندهای تولید شده را می توان در `out/soong/.intermediates/<path to module>/` یافت.
uk: Згенеровані прив'язки можна знайти за адресою `out/soong/.intermediates/<path to module>/`.

source: Point out how the generated function signature, specifically the argument and return types, correspond the interface definition.
fa: اشاره کنید که چگونه function signature تولید شده، به ویژه typeهای آرگومان و بازگشتی، با تعریف interface مطابقت دارد.
uk: Вкажіть, як сигнатура згенерованої функції, зокрема, типи аргументів та повернення, відповідають визначенню інтерфейсу.

source: `String` for an argument results in a different Rust type than `String` as a return type.
fa: ‏ `String` برای آرگومان منجر به type متفاوتی Rust نسبت به `String` به عنوان type برگشتی می‌شود.
uk: `String` як аргумент призводить до іншого типу Rust, ніж `String` як тип повернення.

source: Service Implementation
es: Implementación del servicio
fa: پیاده‌سازی سرویس‌ها
ja: サービスの実装
ko: 서비스 구현
pt_br: Implementação do Serviço
uk: Реалізація сервісу

source: We can now implement the AIDL service:
es: Ahora podemos implementar el servicio de AIDL:
fa: اکنون می‌توانیم سرویس AIDL را پیاده‌سازی کنیم:
ja: 次に、AIDL サービスを実装します。
ko: 이제 AIDL서비스를 구현할 수 있습니다:
pt_br: Agora podemos implementar o serviço AIDL:
uk: Тепер ми можемо реалізувати сервіс AIDL:

source: /// The `IBirthdayService` implementation.
ja: /// `IBirthdayService` の実装。
pt_br: /// A implementação de `IBirthdayService`.
uk: /// Реалізація `IBirthdayService`.

source: "Happy Birthday {name}, congratulations with the {years} years!"
pt_br: "Feliz aniversário {name}, parabéns pelos seus {years} anos!"
uk: "З днем народження {name}, вітаємо з {years} роками!"

source: Point out the path to the generated `IBirthdayService` trait, and explain why each of the segments is necessary.
fa: به مسیر ایجاد `IBirthdayService` trait اشاره کنید و توضیح‌دهید که چرا هر یک از بخش‌ها ضروری است.
uk: Вкажіть шлях до створеного трейту `IBirthdayService` і поясніть, навіщо потрібен кожен з сегментів.

source: TODO: What does the `binder::Interface` trait do? Are there methods to override? Where source?
fa: ‏ TODO: trait وویژگی `binder::Interface` چه کاری انجام می‌دهد؟ آیا متد‌هایی برای override وجود دارد؟ source کجاست؟
uk: TODO: Що робить трейт `binder::Interface`? Чи є методи для перевизначення? Де знаходиться вхідний код?

source: AIDL Server
es: Servidor de AIDL
ja: AIDL サーバー
ko: AIDL 서버
pt_br: Servidor AIDL
uk: Сервер AIDL

source: Finally, we can create a server which exposes the service:
es: Por último, podemos crear un servidor que exponga el servicio:
fa: در نهایت، می توانیم سروری ایجاد کنیم که سرویس را expose می‌کند:
ja: 次に、サービスを公開するサーバーを作成します。
ko: 마지막으로 서비스를 제공하는 서버를 만들 수 있습니다:
pt_br: Finalmente, podemos criar um servidor que expõe o serviço:
uk: Нарешті, ми можемо створити сервер, який надаватиме сервіс:

source: //! Birthday service.
ja: //! 誕生日サービス。
uk: //! Сервіс привітання з днем народження.

source: /// Entry point for birthday service.
ja: /// 誕生日サービスのエントリ ポイント。
pt_br: /// Ponto de entrada para serviço de aniversário.
uk: /// Точка входу для сервісу дня народження.

source: "Failed to register service"
pt_br: "Falha ao registrar o serviço"
uk: "Не вдалося зареєструвати сервіс"

source: // To avoid dynamic link error.
ja: // ダイナミック リンク エラーを回避するためです。
uk: // Щоб уникнути помилки динамічного лінкування.

source: The process for taking a user-defined service implementation (in this case the `BirthdayService` type, which implements the `IBirthdayService`) and starting it as a Binder service has multiple steps, and may appear more complicated than students are used to if they've used Binder from C++ or another language. Explain to students why each step is necessary.
fa: فرآیند اجرای یک سرویس تعریف‌شده توسط کاربر (در این مورد نوع `BirthdayService` که `IBirthdayService` را پیاده‌سازی می‌کند) و شروع آن به‌عنوان یک سرویس Binder چند مرحله دارد و ممکن است پیچیده‌تر از آنچه دانش‌آموزان به آن عادت کرده‌اند به نظر برسد. اگر آن‌ها از Binder برای C++ یا زبان دیگری استفاده کردند. به دانش‌آموزان توضیح دهید که چرا هر مرحله لازم است.
uk: Процес створення користувацької реалізації сервісу (у цьому випадку типу `BirthdayService`, який реалізує `IBirthdayService`) і запуску його як сервісу Binder складається з кількох кроків і може здатися складнішим, ніж ті, хто звик до Binder з C++ або іншої мови. Поясніть учням, чому кожен крок є необхідним.

source: Create an instance of your service type (`BirthdayService`).
fa: نمونه‌ای از نوع سرویس خود (`BirthdayService`) ایجاد کنید.
uk: Створіть екземпляр вашого типу сервісу (`BirthdayService`).

source: Wrap the service object in corresponding `Bn*` type (`BnBirthdayService` in this case). This type is generated by Binder and provides the common Binder functionality that would be provided by the `BnBinder` base class in C++. We don't have inheritance in Rust, so instead we use composition, putting our `BirthdayService` within the generated `BnBinderService`.
fa: این service object را در `Bn*` type مربوطه قرار دهید (در این مورد،`BnBirthdayService`). این نوع توسط Binder تولید می‌شود و عملکرد رایج Binder را ارائه می‌کند که توسط کلاس پایه `BnBinder` در C++ ارائه می‌شود. ما در Rust ارث‌بری یا inheritance نداریم، بنابراین در عوض از ترکیب composition می‌کنیم و `BirthdayService` خود را در `BnBinderService` تولید شده قرار می‌دهیم.
uk: Оберніть об'єкт сервісу у відповідний тип `Bn*` (у цьому випадку `BnBirthdayService`). Цей тип генерується Binder і надає загальну функціональність Binder, яку надавав би базовий клас `BnBinder` у C++. У Rust немає успадкування, тому замість нього ми використаємо композицію, помістивши наш `BirthdayService` всередину згенерованого `BnBinderService`.

source: Call `add_service`, giving it a service identifier and your service object (the `BnBirthdayService` object in the example).
fa: ‏ `add_service` را فراخوانی کنید و به آن یک شناسه سرویس و شی‏ سرویس خود بدهید (شی‏ «BnBirthdayService» در مثال).
uk: Викликаемо `add_service`, передавши йому ідентифікатор сервісу і ваш об'єкт сервісу (у прикладі - об'єкт `BnBirthdayService`).

source: Call `join_thread_pool` to add the current thread to Binder's thread pool and start listening for connections.
fa: ‏ `join_thread_pool` را فراخوانی کنید تا thread فعلی را به Binder thread اضافه کنید و شروع به گوش دادن برای connectionها کنید.
uk: Викликаемо `join_thread_pool` щоб додати поточний потік до пулу потоків Binder'а і починаємо чекати на з'єднання.

source: We can now build, push, and start the service:
es: Ahora podemos crear, insertar e iniciar el servicio:
fa: اکنون می‌توانیم سرویس را بسازیم، push کنیم و شروع کنیم:
ja: 次に、サービスをビルド、push、開始します。
ko: 서비스를 빌드하고, 가상 디바이스에 넣고, 시작 할 수 있습니다:
pt_br: Agora podemos compilar, enviar e iniciar o serviço:
uk: Тепер ми можемо створювати, надсилати та запускати службу:

source: In another terminal, check that the service runs:
es: Comprueba que el servicio funciona en otra terminal:
fa: در ترمینال دیگر، بررسی کنید که آیا سرویسی اجرا شود:
ja: 別のターミナルで、サービスが実行されていることを確認します。
ko: 다른 터미널을 띄워서 서비스가 잘 수행되고 있는지 확인합니다:
pt_br: Em outro terminal, verifique se o serviço está sendo executado:
uk: В іншому терміналі перевірте, чи працює сервіс:

source: You can also call the service with `service call`:
es: También puedes llamar al servicio con `service call`:
fa: همچنین می‌توانید با `service call` با سرویس تماس بگیرید:
ja: `service call` を使用してサービスを呼び出すこともできます。
ko: `service call`명렁어로 서비스를 호출할 수도 있습니다:
pt_br: Você também pode chamar o serviço com `service call`:
uk: Ви також можете викликати сервіс за допомогою `service call`:

source: AIDL Client
es: Cliente de AIDL
ja: AIDL クライアント
ko: AIDL 클라이언트
pt_br: Cliente AIDL
uk: Клієнт AIDL

source: Finally, we can create a Rust client for our new service.
es: Por último, podemos crear un cliente de Rust para nuestro nuevo servicio.
fa: در‌نهایت، ما می‌توانیم یک Rust client برای سرویس جدید خود ایجاد کنیم.
ja: ようやくここで、新しいサービス用の Rust クライアントを作成します。
ko: 마지막으로, 아까 추가한 서비스에 대한 클라이언트를 러스트로 만들겠습니다.
pt_br: Por fim, podemos criar um cliente Rust para nosso novo serviço.
uk: Нарешті ми можемо створити клієнт Rust для нашого нового сервісу.

source: /// Call the birthday service.
ja: /// 誕生日サービスを呼び出します。
pt_br: /// Chama o serviço de aniversário.
uk: /// Виклик сервісу привітання з днем народження.

source: "Failed to connect to BirthdayService"
pt_br: "Falha ao conectar-se a BirthdayService"
uk: "Не вдалося підключитися до BirthdayService"

source: // Call the service.
uk: // Викликаемо сервіс.

source: Notice that the client does not depend on `libbirthdayservice`.
es: Ten en cuenta que el cliente no depende de `libbirthdayservice`.
fa: توجه داشته باشید که client به `libbirthdayservice` وابسته نیست.
ja: クライアントが `libbirthdayservice` に依存していないことに注目してください。
ko: 클라이언트는 `libbirthdayservice`에 의존하지 않음에 주목하세요.
pt_br: Observe que o cliente não depende de `libbirthdayservice`.
uk: Зауважте, що клієнт не залежить від `libbirthdayservice`.

source: Build, push, and run the client on your device:
es: Compila, inserta y ejecuta el cliente en tu dispositivo:
fa: کلاینت را در دستگاه خود بسازید، push کرده و اجرا کنید:
ja: デバイスでクライアントをビルド、push、実行します。
ko: 빌드하고, 가상 디바이스로 넣고, 실행합니다:
pt_br: Compile, envie e execute o cliente em seu dispositivo:
uk: Створіть, завантажте та запустіть клієнт на своєму пристрої:

source: `Strong<dyn IBirthdayService>` is the trait object representing the service that the client has connected to.
fa: ‏`Strong<dyn IBirthdayService>` یک trait object است که نشان‌دهنده سرویسی است که کلاینت به آن متصل شده است.
uk: `Strong<dyn IBirthdayService>` - це об'єкт трейту, що представляє сервіс, до якого підключився клієнт.

source: `Strong` is a custom smart pointer type for Binder. It handles both an in-process ref count for the service trait object, and the global Binder ref count that tracks how many processes have a reference to the object.
fa: ‏ `Strong` یک نوع اشاره‌گر هوشمند سفارشی برای Binder است. هم تعداد ref های درون فرآیندی (in-process) را برای سرویس trait object مدیریت می‌کند و هم شمارنده global Binder را که تعداد فرآیندهایی را که به object ارجاع دارند را ردیابی می‌کند.
uk: `Strong` - це спеціальний тип розумного вказівника для Binder. Він обробляє як внутрішньопроцесний лічильник посилань на об'єкт сервісного трейту, так і глобальний лічильник посилань Binder, який відстежує, скільки процесів мають посилання на об'єкт.

source: Note that the trait object that the client uses to talk to the service uses the exact same trait that the server implements. For a given Binder interface, there is a single Rust trait generated that both client and server use.
fa: توجه داشته باشید که trait object که کلاینت برای صحبت با سرویس استفاده می‌کند، دقیقاً از همان ویژگی استفاده می‌کند که سرور پیاده‌سازی می‌کند. برای یک Binder interface معین، یک trait یا ویژگی Rust ایجاد شده است که هم کلاینت و هم سرور از آن استفاده می‌کنند.
uk: Зверніть увагу, що об'єкт трейта, який клієнт використовує для спілкування з сервісом, використовує той самий трейт, що реалізований на сервері. Для певного інтерфейсу Binder генерується єдиний трейт Rust, який використовується як клієнтом, так і сервером.

source: Use the same service identifier used when registering the service. This should ideally be defined in a common crate that both the client and server can depend on.
fa: از همان شناسه سرویس استفاده شده در هنگام ثبت سرویس استفاده کنید. این به طور ایده‌آل باید در یک crate مشترک تعریف شود که هم کلاینت و هم سرور می توانند به آن وابسته باشند.
uk: Використовуйте той самий ідентифікатор сервісу, який використовувався при реєстрації сервісу. В ідеалі він має бути визначений у спільному крейті, на який можуть покладатися як клієнт, так і сервер.

source: Let us extend the API with more functionality: we want to let clients specify a list of lines for the birthday card:
es: Ampliemos la API con más funciones. Queremos que los clientes puedan indicar una lista de líneas para la tarjeta de cumpleaños:
fa: اجازه دهید API را با عملکرد بیشتری گسترش دهیم: می‌خواهیم به مشتریان اجازه دهیم لیستی از خطوط را برای کارت تولد مشخص کنند:
ja: APIを拡張して、クライアントが誕生日カードに追加する複数行のメッセージを指定できるようにします。
ko: API를 확장하여 더 많은 기능을 제공해 봅시다. 클라이언트가 생일 카드에 담길 내용을 지정할 수 있도록 하겠습니다:
pt_br: Vamos estender a API com mais funcionalidades: queremos permitir que os clientes especifiquem uma lista de frases para o cartão de aniversário:
uk: Давайте розширимо API, додавши більше функціональних можливостей: ми хочемо дозволити клієнтам вказувати список рядків для листівки з днем ​​народження:

source: This results in an updated trait definition for `IBirthdayService`:
fa: این منجر به یک تعریف ویژگی به روز شده برای `IBirthdayService` می‌شود:
uk: У результаті буде оновлено визначення трейту для `IBirthdayService`:

source: Note how the `String[]` in the AIDL definition is translated as a `&[String]` in Rust, i.e. that idiomatic Rust types are used in the generated bindings wherever possible:
fa: توجه داشته باشید که چگونه `String[]`در تعریف AIDL به عنوان `&[String]` در Rust ترجمه می‌شود، به‌عنوان مثال از idiomatic Rust type در bindingهای تولید شده تا جایی که ممکن است استفاده می‌شود:
uk: Зверніть увагу, що `String[]` у визначенні AIDL перекладається як `&[String]` у Rust, тобто ідіоматичні типи Rust використовуються у згенерованих зв'язках скрізь, де це можливо:

source: `in` array arguments are translated to slices.
fa: آرگومان های آرایه `in` به sliceها ترجمه می‌شوند.
uk: Аргументи масиву `in` переводяться у зрізи.

source: `out` and `inout` args are translated to `&mut Vec<T>`.
fa: آرگومان‌های`out` و `inout` به `&mut Vec<T>` ترجمه می‌شوند.
uk: Аргументи `out` та `inout` транслюються у `&mut Vec<T>`.

source: Return values are translated to returning a `Vec<T>`.
fa: مقادیر بازگشتی به بازگرداندن `Vec<T>` ترجمه می‌شوند.
uk: Значення, що повертаються, перетворюються на `Vec<T>`.

source: Updating Client and Service
fa: به‌روزرسانی کلاینت و سرویس‌ها
uk: Оновлення клієнта та сервісу

source: Update the client and server code to account for the new API.
fa: کد سرویس کلاینت و سرور را برای حساب کردن API جدید به‌روز کنید.
uk: Оновіть клієнтський та серверний код, щоб врахувати новий API.

source: "And also: many more"
uk: "А також: багато іншого"

source: TODO: Move code snippets into project files where they'll actually be built?
uk: TODO: Перемістити фрагменти коду у файли проекту, де вони будуть зібрані?

source: Working With AIDL Types
fa: کار با انواع AIDL
uk: Робота з типами AIDL

source: AIDL types translate into the appropriate idiomatic Rust type:
fa: انواع AIDL به نوع اصطلاحی Rust مناسب ترجمه می‌شوند:
uk: Типи AIDL транслюються у відповідний ідіоматичний тип Rust:

source: Primitive types map (mostly) to idiomatic Rust types.
fa: انواع اولیه یا Primitive types (بیشتر) به idiomatic Rust type نگاشت می‌شوند.
uk: Примітивні типи здебільшого відображаються на ідіоматичні типи Rust.

source: Collection types like slices, `Vec`s and string types are supported.
fa: انواع Collectionها مانند sliceها،`Vec` و string typeها پشتیبانی می‌شوند.
uk: Підтримуються такі типи колекцій, як зрізи, `Vec` та рядкові типи.

source: References to AIDL objects and file handles can be sent between clients and services.
fa: ارجاع به AIDL objects و دسته فایل‌ها را می‌توان بین clientها و سرویس‌ها ارسال کرد.
uk: Посилання на об'єкти AIDL та дескриптори файлів можуть передаватися між клієнтами та сервісами.

source: File handles and parcelables are fully supported.
fa: دسته‌های فایل و بسته‌بندی‌ها به طور کامل پشتیبانی می‌شوند.
uk: Повністю підтримуються дескриптори файлів та посилкові дані.

source: Primitive types map (mostly) idiomatically:
fa: انواع ابتدایی یا Primitive type (معمولاً) به صورت idiomatically نگاشت می‌شوند:
uk: Примітивні типи відображаються (здебільшого) ідіоматично:

source: AIDL Type
uk: Тип AIDL

source: Rust Type
ja: Rust 型
pt_br: Tipo em Rust
uk: Тип Rust

source: Note
fa: نکته
uk: Примітка

source: Note that bytes are signed.
fa: توجه داشته باشید که بایت‌ها امضا شده‌اند.
uk: Зверніть увагу, що байти є знаковими.

source: Note the usage of `u16`, NOT `u32`.
fa: به استفاده از `u16` توجه کنید، نه `u32`.
uk: Зверніть увагу на використання `u16`, а не `u32`.

source: The array types (`T[]`, `byte[]`, and `List<T>`) get translated to the appropriate Rust array type depending on how they are used in the function signature:
fa: انواع آرایه (`T[]`, `byte[]`, و `List<T>`) بسته به نحوه استفاده از آنها در function signature، به Rust array type مناسب ترجمه می‌شوند:
uk: Типи масивів (`T[]`, `byte[]` та `List<T>`) буде переведено до відповідного типу масиву Rust залежно від того, як вони використовуються у сигнатурі функції:

source: Position
fa: موقعیت
uk: Позиція

source: `in` argument
uk: `in` аргумент

source: `out`/`inout` argument
uk: `out`/`inout` аргумент

source: Return
uk: Повернення

source: In Android 13 or higher, fixed-size arrays are supported, i.e. `T[N]` becomes `[T; N]`. Fixed-size arrays can have multiple dimensions (e.g. `int[3][4]`). In the Java backend, fixed-size arrays are represented as array types.
fa: در اندروید ۱۳ یا بالاتر، آرایه‌های با اندازه ثابت پشتیبانی می‌شوند، یعنی `T[N]` به `[T; N]`. آرایه‌های با اندازه ثابت می‌توانند چندین بعد داشته باشند (مانند ‌`int[3][4]`. در Java backend، آرایه‌های با اندازه ثابت به عنوان array type نمایش داده می‌شوند.
uk: В Android 13 і вище підтримуються масиви фіксованого розміру, тобто `T[N]` стає `[T; N]`. Масиви фіксованого розміру можуть мати декілька вимірів (наприклад, `int[3][4]`). У бекенді Java масиви фіксованого розміру представлені як типи масивів.

source: Arrays in parcelable fields always get translated to `Vec<T>`.
fa: آرایه‌های موجود در فیلدهای parcelable همیشه به `Vec<T>` ترجمه می‌شوند.
uk: Масиви у посилкових полях завжди перетворюються на `Vec<T>`.

source: AIDL objects can be sent either as a concrete AIDL type or as the type-erased `IBinder` interface:
fa: ‏ AIDL objects را می‌توان به‌عنوان یک نوع AIDL مشخص یا به عنوان `IBinder` interface پاک‌شده ارسال کرد:
uk: AIDL-об'єкти можна надсилати або як конкретний тип AIDL, або як інтерфейс `IBinder` зі стертим типом:

source: /** The same thing, but using a binder object. */
uk: /** Те саме, але з використанням об'єкта-зв'язки. */

source: /** The same thing, but using `IBinder`. */
uk: /** Те саме, але з використанням `IBinder`. */
