Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: /// Sets or clears the interrupt mask. /// /// When the mask is true the interrupt is enabled; when it is false the /// interrupt is disabled.
pt_br: /// Define ou limpa a máscara de interrupção. /// /// Quando a máscara é verdadeira, a interrupção é habilitada; quando é falsa /// a interrupção é desabilitada.
uk: /// Встановлює або очищує маску переривання. /// /// Якщо маска дорівнює істині, переривання увімкнено; якщо ні - /// переривання вимкнено.

source: /// Clears a pending interrupt, if any.
pt_br: /// Limpa uma interrupção pendente, se houver.
uk: /// Очищає очікуване переривання, якщо таке є.

source: // SAFETY: `Rtc` just contains a pointer to device memory, which can be // accessed from any context.
uk: // БЕЗПЕКА: `Rtc` просто містить вказівник на пам'ять пристрою, до якого // можна отримати доступ з будь-якого контексту.

source: Welcome to Concurrency in Rust
es: Te Damos la Bienvenida a Concurrencia en Rust
fa: به مبحث Concurrency در Rust خوش‌آمدید
ja: Rustでの並行性へようこそ
pt_br: Bem-vindo à Concorrência em Rust
uk: Ласкаво просимо до одночасних обчислень у Rust

source: Rust has full support for concurrency using OS threads with mutexes and channels.
es: Rust es totalmente compatible con la concurrencia mediante hilos del SO con exclusiones mutuas y canales.
fa: زبان Rust به طور کامل از concurrency در سطح thread های سیستم‌عامل با استفاده از mutex ها و channel ها پشتیبانی می‌کند.
ja: Rustはミューテックスとチャネルを用いてOSスレッドを扱う並行性を十分にサポートしています。
ko: 러스트는 동시성 지원이 막강합니다. 운영체제 레벨의 스레드를 사용하며, 뮤택스와 채널도 지원합니다.
pt_br: Rust tem suporte completo para concorrência usando _threads_ do SO com _mutexes_ e _channels_ (canais).
uk: Rust має повну підтримку паралелізму та одночасних обчислень за допомогою потоків ОС із м’ютексами та каналами.

source: The Rust type system plays an important role in making many concurrency bugs compile time bugs. This is often referred to as _fearless concurrency_ since you can rely on the compiler to ensure correctness at runtime.
es: El sistema de tipos de Rust desempeña un papel importante al hacer que muchos errores de concurrencia sean errores en tiempo de compilación. A menudo, esto se conoce como _concurrencia sin miedo_, ya que puedes confiar en el compilador para asegurar la corrección en el tiempo de ejecución.
fa: سیستم Rust راست نقش مهمی در تبدیل بسیاری از باگ‌های concurrency به باگ‌های زمان کامپایل ایفا می‌کند. این مورد اغلب به‌عنوان هم‌زمانی بی‌پروا ( _fearless concurrency_) شناخته می‌شود زیرا می‌توانید به کامپایلر برای اطمینان از صحت در زمان اجرا (runtime) اعتماد کنید.
ja: Rustの型システムは多くの並行性にまつわるバグをコンパイル時のバグにとどめるという点で、重要な役割を果たします。これは時に _fearless concurrency_ （「怖くない並行性」） と呼ばれます。なぜなら、コンパイラに実行時での正しさを保証することをまかせてよいためです。
ko: 러스트의 타입 시스템은 프로그램에 동시성 버그가 있을 경우, 컴파일 시에 에러가 발생하도록 해 줍니다. 컴파일러를 이용해서 프로그램이 수행시에 정확히 동작함을 미리 보장해 주기 때문에, 사람들은 이를 종종 _겁없는 동시성_ 이라고 합니다.
pt_br: O sistema de tipos do Rust desempenha um papel importante, convertendo muitos erros de concorrência em erros em tempo de compilação. Isso geralmente é chamado de _concorrência sem medo_, pois você pode confiar no compilador para garantir a exatidão em tempo de execução.
uk: Система типів у Rust відіграє важливу роль у тому, що дозволяє зробити багато помилок з одночасним виконанням помилками часу компіляції. Це часто називають _безстрашним одночасним виконанням_, оскільки ви можете покластися на компілятор для забезпечення коректності під час виконання.

source: Rust lets us access OS concurrency toolkit: threads, sync. primitives, etc.
fa: ‏ Rust به ما اجازه می‌دهد تا به ابزارهای همزمانی سیستم عامل دسترسی داشته باشیم: thread‌ها، سازوکارهای همگام‌سازی و غیره.
uk: Rust дозволяє нам отримати доступ до інструментарію одночасності виконнання ОС: потоків, примітивів синхронізації тощо.

source: The type system gives us safety for concurrency without any special features.
fa: این سیستم تایپ به ما ایمنی لازم برای concurrency بدون هیچ ویژگی خاصی می‌دهد.
uk: Система типів дає нам безпеку для одночасного виконання без будь-яких спеціальних функцій.

source: The same tools that help with "concurrent" access in a single thread (e.g., a called function that might mutate an argument or save references to it to read later) save us from multi-threading issues.
fa: همان ابزارهایی که به ما در دسترسی concurrent در یک thread واحد کمک می‌کنند (مانند یک تابع فراخوانی شده که ممکن است یک آرگومان را تغییر دهد یا مراجعی به آن را برای خواندن بعد ذخیره کند) ما را از مشکلات multi-threading نجات می‌دهند.
uk: Ті самі інструменти, які допомагають з "одночасним" доступом в одному потоці (наприклад, викликана функція, яка може змінювати аргумент або зберігати посилання на нього, щоб прочитати пізніше), позбавляють нас від проблем багатопотоковості.

source: Rust threads work similarly to threads in other languages:
es: Los hilos de Rust funcionan de forma similar a los de otros lenguajes:
fa: threadهای Rust مانند threadها در زبان‌های دیگر کار می‌کنند:
ja: Rustのスレッドは他の言語のスレッドと似た挙動をします:
ko: 러스트의 스레드는 다른 언어의 스레드와 유사하게 동작합니다:
pt_br: _Threads_ em Rust funcionam de maneira semelhante às _threads_ em outras linguagens:
uk: Потоки Rust працюють так само, як і в інших мовах:

source: "Count in thread: {i}!"
fa: "شمارنده thread: {i}!"
pt_br: "Contagem na _thread_: {i}!"
uk: "Підрахунок в потоці: {i}!"

source: "Main thread: {i}"
pt_br: "_Thread_ principal: {i}"
uk: "Головний потік: {i}"

source: Spawning new threads does not automatically delay program termination at the end of `main`.
fa: ایجاد threadهای جدید به طور خودکار خاتمه برنامه را تا پایان `main` به تاخیر نمی‌اندازد.
uk: Породження нових потоків не призводить до автоматичної затримки завершення програми в кінці `main`.

source: Thread panics are independent of each other.
es: Los pánicos de los hilos son independientes entre sí.
fa: Thread panicها مستقل از یکدیگر هستند.
ja: スレッドパニックは互いに独立です。
ko: 한 스레드에서 발생한 패닉은 다른 스레드에게 영향을 끼치지 않습니다.
pt_br: "_Panics_" em _threads_ são independentes uns dos outros.
uk: Паніка потоків не залежить одна від одної.

source: Panics can carry a payload, which can be unpacked with `downcast_ref`.
es: Los pánicos pueden transportar una carga útil, que se puede desempaquetar con `downcast_ref`.
fa: ‏Panicها می‌تواند payloadای را حمل کند که می‌توان آن را با «downcast_ref» باز کرد.
ja: パニックはペイロードを保持していることがあり、それは`downcast_ref`で展開可能です。
ko: 패닉은 추가정보(페이로드)를 포함할 수 있으며, 이는 `downcast_ref`로 풀어볼 수 있습니다.
pt_br: "_Panics_" podem carregar um _payload_ (carga útil), que pode ser descompactado com `downcast_ref`.
uk: Паніки можуть нести корисне навантаження, яке можна розпакувати за допомогою `downcast_ref`.

source: Rust thread APIs look not too different from e.g. C++ ones.
fa: ‏Rust thread API ها خیلی متفاوت از موارد دیگر به نظر نمی‌رسند. که C++ یکی از آن‌ها است.
uk: API потоків Rust зовні не надто відрізняються від API, наприклад, C++.

source: Run the example.
fa: مثال را اجرا کنید.
uk: Запустіть приклад.

source: 5ms timing is loose enough that main and spawned threads stay mostly in lockstep.
fa: زمان‌بندی 5 میلی‌ثانیه به اندازه‌ای سست هستند که thread اصلی و spawned threadها عمدتاً همگام می‌مانند.
uk: Таймінг 5 мс є достатньо вільним, щоб головний і породжений потоки залишалися переважно в одному ритмі.

source: Notice that the program ends before the spawned thread reaches 10!
fa: توجه داشته باشید که برنامه قبل از اینکه thread spawned به مقدار ۱۰ برسد به پایان می‌رسد!
uk: Зверніть увагу, що програма завершується до того, як породжений потік досягне 10!

source: This is because main ends the program and spawned threads do not make it persist.
fa: این به خاطر است که انتهای main برنامه است و spawned threadها ایجاد شده باعث تداوم آن نمی‌شوند.
uk: Це тому, що main завершує програму, а породжені потоки не змушують її продовжувати.

source: Compare to pthreads/C++ std::thread/boost::thread if desired.
fa: در مقابسه با pthreads/C++ std::thread/boost::thread اگر مطلوب باشد.
uk: За бажанням можна порівняти з pthreads/C++ std::thread/boost::thread.

source: How do we wait around for the spawned thread to complete?
fa: چقدر باید صبر کنیم تا یک spawned thread تکمیل شود؟
uk: Як нам дочекатися завершення породженого потоку?

source: [`thread::spawn`](https://doc.rust-lang.org/std/thread/fn.spawn.html) returns a `JoinHandle`. Look at the docs.
fa: [`thread::spawn`](https://doc.rust-lang.org/std/thread/fn.spawn.html) returns a `JoinHandle`. به سند نگاه کنید.
uk: [`thread::spawn`](https://doc.rust-lang.org/std/thread/fn.spawn.html) повертає `JoinHandle`. Перегляньте документацію.

source: `JoinHandle` has a [`.join()`](https://doc.rust-lang.org/std/thread/struct.JoinHandle.html#method.join) method that blocks.
fa: `JoinHandle` دارد [`.join()`](https://doc.rust-lang.org/std/thread/struct.JoinHandle.html#method.join) متد آن بلاک‌ها.
uk: У `JoinHandle` є метод [`.join()`](https://doc.rust-lang.org/std/thread/struct.JoinHandle.html#method.join), який блокує.

source: Use `let handle = thread::spawn(...)` and later `handle.join()` to wait for the thread to finish and have the program count all the way to 10.
fa: از «let handle = thread::spawn(...)» و بعد از «handle.join()» استفاده کنید تا منتظر بمانید تا thread تمام شود و شمارنده برنامه برابر با مقدار ۱۰ باشد.
uk: Використовуйте `let handle = thread::spawn(...)`, а потім `handle.join()`, щоб дочекатися завершення потоку і змусити програму дорахувати до 10..

source: Now what if we want to return a value?
fa: حالا اگر بخواهیم مقداری را برگردانیم چه؟
uk: А що, якщо ми хочемо повернути значення?

source: Look at docs again:
fa: دوباره به اسناد نگاه کنید:
uk: Перегляньте документацію ще раз:

source: [`thread::spawn`](https://doc.rust-lang.org/std/thread/fn.spawn.html)'s closure returns `T`
uk: Закриття [`thread::spawn`](https://doc.rust-lang.org/std/thread/fn.spawn.html) повертає `T`.

source: `JoinHandle` [`.join()`](https://doc.rust-lang.org/std/thread/struct.JoinHandle.html#method.join) returns `thread::Result<T>`
uk: `JoinHandle` [`.join()`](https://doc.rust-lang.org/std/thread/struct.JoinHandle.html#method.join) повертає `thread::Result<T>`

source: Use the `Result` return value from `handle.join()` to get access to the returned value.
fa: به کمک`Result` از «handle.join()» برای دسترسی به مقدار برگشتی استفاده کنید.
uk: Використовуйте значення `Result`, що повертається з `handle.join()`, щоб отримати доступ до значення, що повертається.

source: Ok, what about the other case?
fa: خوب، مورد دیگر چطور؟
uk: Гаразд, а як щодо іншого випадку?

source: Trigger a panic in the thread. Note that this doesn't panic `main`.
fa: فعال‌سازی یک panic در یک thread. توجه شود که این مورد panic `main` نیست.
uk: Викликає паніку в потоці. Зауважте, що це не впливає на `main`.

source: Access the panic payload. This is a good time to talk about [`Any`](https://doc.rust-lang.org/std/any/index.html).
fa: دسترسی به این panic payload. بهترین زمان برای پرداخت به این موضوع است [`Any`](https://doc.rust-lang.org/std/any/index.html).
uk: Дає доступ до корисного навантаження паніки. Це гарний час, щоб поговорити про [`Any`](https://doc.rust-lang.org/std/any/index.html).

source: Now we can return values from threads! What about taking inputs?
fa: اکنون می‌توانیم مقادیر را از رشته‌ها برگردانیم! در مورد گرفتن ورودی‌ها چطور؟
uk: Тепер ми можемо повертати значення з потоків! А як щодо отримання вхідних даних?

source: Capture something by reference in the thread closure.
fa: چیزی را از طریق reference در بسته‌بندی thread ثبت کنید.
uk: Захоплюємо щось за посиланням у закритті потоку.

source: An error message indicates we must move it.
fa: یک پیغام خطا نشان می‌دهد که باید آن را جابجا کنیم.
uk: Повідомлення про помилку вказує на те, що ми повинні його перемістити.

source: Move it in, see we can compute and then return a derived value.
fa: آن را به داخل منتقل کنید، درنتیجه ما می توانیم محاسبه کنیم و سپس یک مقدار مشتق شده را برگردانیم.
uk: Переміщуємо його, бачимо, що можемо обчислити, а потім повертаємо похідне значення.

source: If we want to borrow?
fa: اگر بخواهیم قرض (borrow) بگیریم چطور؟
uk: Якщо ми хочемо позичити?

source: Main kills child threads when it returns, but another function would just return and leave them running.
fa: تابع ‏Main در هنگام بازگشت threadهای فرزند را از بین می‌برد، اما تابع دیگری return می‌شود و آنها را در حال اجرا می‌گذارد.
uk: Main вбиває дочірні потоки, коли повертається, але інша функція просто повернеться і залишить їх працювати.

source: That would be stack use-after-return, which violates memory safety!
fa: این کار می‌تواند منجر به stack استفاده پس از return شود که memory safety را نقض می‌کند!
uk: Це буде використання стеку після повернення, що порушує безпеку пам'яті!

source: How do we avoid this? see next slide.
fa: چگونه از آن جلوگیری کنیم؟ صفحه بعدی را ببینید.
uk: Як цього уникнути? Дивіться наступний слайд.

source: minutes: 13
uk: хвилин: 13

source: Normal threads cannot borrow from their environment:
es: Los hilos normales no pueden tomar nada prestado de su entorno:
fa: ‏thread‌های معمولی نمی‌توانند از محیط خود قرض (borrow) بگیرند:
ja: 通常のスレッドはそれらの環境から借用することはできません:
ko: 보통, 스레드는 스레드 밖에서 데이터를 빌릴 수 없습니다:
pt_br: _Threads_ normais não podem emprestar de seu ambiente:
uk: Звичайні потоки не можуть запозичувати зі свого середовища:

source: However, you can use a [scoped thread](https://doc.rust-lang.org/std/thread/fn.scope.html) for this:
es: Sin embargo, puedes usar un [hilo con ámbito](https://doc.rust-lang.org/std/thread/fn.scope.html) para lo siguiente:
fa: به‌هرحال, می‌توانید برای این مورد [scoped thread](https://doc.rust-lang.org/std/thread/fn.scope.html) ببینید:
ja: しかし、そのために[スコープ付きスレッド](https://doc.rust-lang.org/std/thread/fn.scope.html)を使うことができます:
ko: 하지만, [scoped thread](https://doc.rust-lang.org/std/thread/fn.scope.html)에서는 가능합니다:
pt_br: No entanto, você pode usar uma [_thread_ com escopo](https://doc.rust-lang.org/std/thread/fn.scope.html) para isso:
uk: Однак для цього можна використовувати [потік із обмеженою областю](https://doc.rust-lang.org/std/thread/fn.scope.html):

source: The reason for that is that when the `thread::scope` function completes, all the threads are guaranteed to be joined, so they can return borrowed data.
es: La razón es que, cuando se completa la función `thread::scope`, se asegura que todos los hilos están unidos, por lo que pueden devolver datos prestados.
fa: دلیل آن این است که وقتی تابع «thread::scope» کامل می‌شود، اتصال همه thread‌ها تضمین می‌شود، بنابراین می‌توانند داده‌های قرضی را برگردانند.
ja: この理由は、関数`thread::scope`が完了するとき、全てのスレッドはjoinされることが保証されているので、スレッドが借用したデータを返すことができるためです。
ko: `thread::scope` 함수가 완료되면 그 안에서 생성된 모든 스레드들이 종료했음이 보장되기 때문에, 그 때 빌렸던 데이터들을 다시 반환할 수 있기 때문입니다.
pt_br: A razão para isso é que, quando a função `thread::scope` for concluída, todas as _threads_ serão unidas, para que possam retornar dados emprestados.
uk: Причина цього полягає в тому, що коли функція `thread::scope` завершується, усі потоки гарантовано об’єднуються, тому вони можуть повертати запозичені дані.

source: Normal Rust borrowing rules apply: you can either borrow mutably by one thread, or immutably by any number of threads.
es: Se aplican las reglas normales de préstamo de Rust: un hilo puede tomar datos prestados de manera mutable o cualquier número de hilos puede tomar datos prestados de manera inmutable.
fa: قوانین عادی قرض‌گیری Rust اعمال می‌شود: شما می‌توانید به‌صورت تغییرپذیر(mutable) با یک thread یا غیرقابل تغییر (immutable) با هر تعداد thread قرض (borrow) بگیرید.
ja: 通常のRustの借用のルールが適用されます: 一つのスレッドがミュータブルで借用すること、または任意の数のスレッドからイミュータブルで借用すること。
ko: 일반적인 러스트의 빌림 규칙이 적용됩니다: 한 스레드에 의한 가변 빌림 또는 여러 스레드에 대한 불변 빌림중 하나만 가능합니다.
pt_br: As regras normais de empréstimo do Rust se aplicam: você pode emprestar mutavelmente por uma _thread_, ou imutavelmente por qualquer número de _threads_.
uk: Застосовуються звичайні правила запозичення Rust: ви можете запозичувати або мутабельно одним потоком, або іммутабельно будь-якою кількістю потоків.

source: minutes: 9
uk: хвилин: 9

source: Rust channels have two parts: a `Sender<T>` and a `Receiver<T>`. The two parts are connected via the channel, but you only see the end-points.
es: Los canales de Rust tienen dos partes: `Sender<T>` y `Receiver<T>`. Las dos partes están conectadas a través del canal, pero solo se ven los puntos finales.
fa: کانال‌های Rust دارای دو بخش هستند: `Sender<T>` و `Receiver<T>`. این دو بخش از طریق channel به هم متصل می‌شوند، اما شما فقط نقاط پایانی (end-points) را می‌بینید.
ja: Rustのチャネルには二つの部品があります： `Sender<T>` と`Receiver<T>`です。この２つの部品はチャネルによって繋がっていますが、見ることができるのはエンドポイントだけです。
ko: 러스트의 채널은 `Sender<T>` 와 `Receiver<T>` 두 부분으로 구성됩니다. 이 둘은 채널을 통해 서로 연결되어 있지만, 우리는 채널을 볼 수는 없고 이 양 끝단만을 사용하게 됩니다.
pt_br: Os _channels_ (canais) em Rust têm duas partes: um `Sender<T>` e um `Receiver<T>`. As duas partes estão conectadas através do _channel_, mas você só vê os _end-points_.
uk: Канали Rust мають дві частини: `Sender<T>` і `Receiver<T>`. Дві частини з’єднані через канал, але ви бачите лише кінцеві точки.

source: "Received: {:?}"
fa: "دریافت شد: {:?}"
pt_br: "Recebido: {:?}"
uk: "Прийнято: {:?}"

source: `mpsc` stands for Multi-Producer, Single-Consumer. `Sender` and `SyncSender` implement `Clone` (so you can make multiple producers) but `Receiver` does not.
es: `mpsc` son las siglas de Multi-Producer, Single-Consumer (multiproductor, consumidor único.) `Sender` y `SyncSender` implementan `Clone` (es decir, puedes crear varios productores), pero `Receiver` no.
ja: `mpsc` は Multi-Producer, Single-Consumerの略称です。 `Sender`と`SyncSender`は`Clone`を実装している（よって複数のproducerが作成可能）のですが、`Receiver`についてはそうではありません。
ko: `mpsc`는 “Multi-Produce, Single-Consumer”를 의미합니다. `Sender`와 `SyncSender`는 `Clone`을 구현하지만 (즉, 여러개의 producer를 만들수 있습니다) `Receiver`는 `Clone`을 구현하지 않습니다.
pt_br: `mpsc` significa Multi-Produtor, Único-Consumidor. `Sender` e `SyncSender` implementam `Clone` (então você pode criar vários produtores), mas `Receiver` (consumidores) não.
uk: `mpsc` означає багато виробників, один споживач (Multi-Producer, Single-Consumer). `Sender` і `SyncSender` реалізують `Clone` (тобто ви можете створити кілька виробників), а `Receiver` — ні.

source: `send()` and `recv()` return `Result`. If they return `Err`, it means the counterpart `Sender` or `Receiver` is dropped and the channel is closed.
es: `send()` y `recv()` devuelven `Result`. Si devuelven `Err`, significa que el homólogo `Sender` o `Receiver` se ha eliminado y el canal se ha cerrado.
ja: `send()`と`recv()`は`Result`を返します。もし`Err`が返された場合、これは、対応する`Sender`か`Receiver`のいずれかがドロップされ、チャンネルが閉じられたことを意味します。
ko: `send()`와 `recv()`는 `Result`를 반환합니다. 만일 `Err`가 반환된다면, 상대방의 `Sender`또는 `Receiver`가 삭제되었고 채널이 닫혔다는 뜻입니다.
pt_br: `send()` e `recv()` retornam `Result`. Se retornarem `Err`, significa que a contraparte `Sender` ou `Receiver` é descartada e o canal é fechado.
uk: `send()` і `recv()` повертають `Result`. Якщо вони повертають `Err`, це означає, що відповідний `Sender` або `Receiver` видалено, а канал закрито.

source: You get an unbounded and asynchronous channel with `mpsc::channel()`:
es: Se obtiene un canal asíncrono y sin límites con `mpsc::channel()`:
fa: شما یک کانال نامحدود و ناهمزمان با `mpsc::channel()` دریافت می کنید:
ja: Unboundedで非同期的なチャネルは`mpsc::channel()`によって得られます：
ko: `mpsc::channel()` 함수는 경계가 없는 비동기 채널을 생성합니다:
pt_br: Você obtém um canal ilimitado e assíncrono com `mpsc::channel()`:
uk: Ви отримуєте необмежений і асинхронний канал за допомогою `mpsc::channel()`:

source: "Message {i}"
pt_br: "Mensagem {i}"
uk: "Повідомлення {i}"

source: "{thread_id:?}: sent Message {i}"
pt_br: "{thread_id:?}: Mensagem {i} enviada"
uk: "{thread_id:?}: надіслано Повідомлення {i}"

source: "{thread_id:?}: done"
fa: "{thread_id:?}: انجام شد"
pt_br: "{thread_id:?}: terminado"
uk: "{thread_id:?}: виконано"

source: "Main: got {msg}"
pt_br: "Main: obteve {msg}"
uk: "Головний: отримав {msg}"

source: With bounded (synchronous) channels, `send` can block the current thread:
es: Con canales limitados (síncronos), `send` puede bloquear el hilo:
fa: با کانال‌های bounded (synchronous)، فرآیند `send` می‌تواند thread فعلی را مسدود کند:
ja: Bounded（かつ同期的）なチャネルを用いたとき、`send`は現在のスレッドをブロックすることがあります：
pt_br: Com canais limitados e síncronos, `send` pode bloquear a _thread_ atual:
uk: З обмеженими (синхронними) каналами `send` може блокувати поточний потік:

source: Calling `send` will block the current thread until there is space in the channel for the new message. The thread can be blocked indefinitely if there is nobody who reads from the channel.
es: Al llamar a `send`, se bloqueará el hilo hasta que haya espacio suficiente en el canal para el mensaje nuevo. El hilo se puede bloquear de forma indefinida si no hay nadie que lea el canal.
fa: فراخوانی `send` تا زمانی که فضای کافی در کانال برای پیام جدید وجود داشته باشد، thread کنونی را مسدود می‌کند. اگر کسی از کانال چیزی نخواند آنگاه thread را می‌توان به طور نامحدود مسدود کرد.
ja: `send`を呼んだときにチャネルに空きがなければ、現在のスレッドはブロックされます。もし誰もチャネルから値を読み取らない場合は、このスレッドは無期限にブロックされることがあります。
pt_br: Chamar `send` bloqueará a _thread_ atual até que haja espaço no canal para a nova mensagem. A _thread_ pode ser bloqueada indefinidamente se não houver ninguém que leia do canal.
uk: Виклик `send` заблокує поточний потік, доки в каналі не залишиться місця для нового повідомлення. Потік може бути заблокований на невизначений термін, якщо ніхто не читає з каналу.

source: A call to `send` will abort with an error (that is why it returns `Result`) if the channel is closed. A channel is closed when the receiver is dropped.
es: Si se cierra el canal, se anulará la llamada a `send` y se producirá un error (por eso devuelve `Result`). Un canal se cierra cuando se elimina el receptor.
fa: اگر کانال بسته شود، تماس برای `send` با یک error قطع می‌شود (به همین دلیل`Result` را برمی‌گرداند. هنگامی که گیرنده از بین می رود یک کانال بسته می‌شود.
ja: もしもチャネルが閉じられた場合、`send`の呼び出しはエラーとともに中断します。（`send`が`Result`を返すのはこのためです。）受け取り側がドロップされたときに、チャネルは閉じられます。
pt_br: Uma chamada para `send` será abortada com um erro (é por isso que retorna `Result`) se o canal estiver fechado. Um canal é fechado quando o receptor é descartado.
uk: Виклик `send` буде перервано з помилкою (ось чому він повертає `Result`), якщо канал закрито. Канал закривається, коли отримувача видалено.

source: A bounded channel with a size of zero is called a "rendezvous channel". Every send will block the current thread until another thread calls `recv`.
fa: یک کانال محدود ( bounded channel) با اندازه صفر را "کانال ملاقات" یا "rendezvous channel" می‌‌نامند. هر ارسال، thread فعلی را مسدود می‌کند تا زمانی که رشته دیگری `recv` را فراخواند.
uk: Обмежений канал з нульовим розміром називається "каналом зустрічі". Кожне надсилання блокуватиме поточний потік, доки інший потік не викличе `recv`.

source: How does Rust know to forbid shared access across threads? The answer is in two traits:
fa: ‏ Rust چگونه می‌داند که دسترسی مشترک در سراسر threadها را ممنوع می‌کند؟ پاسخ در دو trait است:
pt_br: Como o Rust sabe proibir o acesso compartilhado entre threads? A resposta está em dois _traits_:
uk: Як Rust знає, що потрібно заборонити спільний доступ до потоків? Відповідь полягає у двох трейтах:
