Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: `_x0`–`_x3` are the values of registers `x0`–`x3`, which are conventionally used by the bootloader to pass things like a pointer to the device tree. According to the standard aarch64 calling convention (which is what `extern "C"` specifies to use), registers `x0`–`x7` are used for the first 8 arguments passed to a function, so `entry.S` doesn't need to do anything special except make sure it doesn't change these registers.
es: `_x0`–`_x3` son los valores de los registros `x0`–`x3`, que el bootloader utiliza habitualmente para pasar elementos al árbol de dispositivos, como un puntero. De acuerdo con la convención de llamadas estándar de aarch64 (que es lo que `extern "C"` usa), los registros `x0`–`x7` se utilizan para los primeros ocho argumentos que se pasan a una función, de modo que `entry.S` no tiene que hacer nada especial, salvo asegurarse de que no cambia estos registros.
fa: ‏ `_x0`–`_x3` مقادیر رجیسترهای `x0`–`x3` هستند که به طور معمول توسط bootloader برای ارسال چیزهایی مانند اشاره‌گر به device tree استفاده می‌شود. طبق قرارداد فراخوانی استاندارد aarch64 (که همان چیزی است که `extern "C"` برای استفاده مشخص می‌کند)، رجیسترهای `x0`–`x7` برای ۸ آرگومان اول ارسال شده به یک تابع استفاده می‌شوند، بنابراین `entry.S` این کار را انجام نمی‌دهد. لازم نیست کار خاصی انجام دهید، جز اینکه مطمئن شوید که این مورد رجیسترها را تغییر نمی‌دهد.
ja: `_x0`–`_x3`はレジスタ`x0`–`x3`の値であり、慣習的にブートロードがデバイスツリーなどへのポインタを渡すのに利用されています。（`extern "C"`により指定された）aarch64 の関数コール規約ではレジスタ`x0`–`x7`は最初の８個の引数を関数に渡すのに利用されることになっているため、`entry.S` はこれらの値を変更しないようにする以外の特別なことをする必要はありません。
ko: `_x0`–`_x3`는 `x0`에서 `x3` 레지스터들의 값입니다. 이 레지스터들은 일반적으로 부트로더에서 디바이스 트리에 대한 포인터 등을 전달할 때 사용됩니다. 표준 aarch64 호출 규약(`extern "C"`에서 사용하도록 지정)에 따라 레지스터 `x0`에서 `x7`이 함수에 전달된 처음 8개 인수에 사용되므로 `entry.S`는 이러한 레지스터를 변경하지 않는지 확인하는 것 외에는 특별히 할 작업이 없습니다.
pt_br: `_x0`–`_x3` são os valores dos registradores `x0`–`x3`, que são convencionalmente usados ​​pelo carregador de inicialização para passar coisas como um ponteiro para a árvore de dispositivos. De acordo com a convenção de chamada aarch64 padrão (que é o que `extern "C"` especifica para usar), os registradores `x0`–`x7` são usados ​​para os primeiros 8 argumentos passados ​​para uma função, portanto, `entry.S` não precisa fazer nada especial, exceto garantir que não altere esses registradores.
uk: `_x0`–`_x3` – це значення регістрів `x0`–`x3`, які традиційно використовуються завантажувачем для передачі таких речей, як покажчик на дерево пристроїв. Відповідно до стандартної угоди про виклики aarch64 (це те, що вказує `extern "C"`), регістри `x0`–`x7` використовуються для перших 8 аргументів, що передаються до функції, тому `entry.S` не потрібно робити нічого особливого, окрім як переконатися, що він не змінює ці регістри.

source: Run the example in QEMU with `make qemu_psci` under `src/bare-metal/aps/examples`.
es: Ejecuta el ejemplo en QEMU con `make qemu_psci` en `src/bare-metal/aps/examples`.
fa: مثال را در QEMU با `make qemu_psci` در زیر `src/bare-metal/aps/examples` اجرا کنید.
ja: この例を`src/bare-metal/aps/examples`において`make qemu_psci`とすることでQEMUにより実行してみましょう。
ko: `src/bare-metal/aps/examples`에서 `make qemu_psci`를 사용하여 QEMU에서 예시를 실행합니다.
pt_br: Execute o exemplo no QEMU com `make qemu_psci` em `src/bare-metal/aps/examples`.
uk: Запустіть приклад у QEMU за допомогою `make qemu_psci` в `src/bare-metal/aps/examples`.

source: Volatile memory access for MMIO
es: Acceso a la memoria volátil para MMIO
fa: دسترسی به حافظه فرار برای MMIO
ja: MMIOに対するvolatileアクセス
ko: MMIO를 위한 휘발성(volatile) 메모리 액세스
pt_br: Acesso volátil à memória para MMIO
uk: Здійснення непостійного доступу до пам'яті для MMIO

source: Use `pointer::read_volatile` and `pointer::write_volatile`.
es: Se puede usar `pointer::read_volatile` y `pointer::write_volatile`.
fa: از `pointer::read_volatile` و `pointer::write_volatile` استفاده کنید.
ja: `pointer::read_volatile`と`pointer::write_volatile`を使います。
ko: `pointer::read_volatile` 및 `pointer::write_volatile`을 사용하세요.
pt_br: Use `pointer::read_volatile` e `pointer::write_volatile`.
uk: Використовуйте `pointer::read_volatile` і `pointer::write_volatile`.

source: Never hold a reference.
es: Nunca retengas una referencia.
fa: هرگز reference‌ای را نگه ندارید.
ja: 絶対に参照を保持してはいけません。
ko: 참조를 유지하지 마세요.
pt_br: Nunca segure uma referência.
uk: Ніколи не тримайте посилання.

source: `addr_of!` lets you get fields of structs without creating an intermediate reference.
es: `addr_of!` permite obtener campos de estructuras sin crear una referencia intermedia.
fa: ‏ `addr_of!` به شما امکان می‌دهد بدون ایجاد یک مرجع میانی، فیلدهایی از ساختارها را دریافت کنید.
ja: `addr_of!`を用いると、中間的な参照を作らずに構造体のフィールドにアクセスすることができます。
ko: `addr_of!`를 사용하면 임시 용도의 참조를 만들지 않고도 구조체 필드를 가져올 수 있습니다.
pt_br: `addr_of!` permite obter campos de estruturas sem criar uma referência intermediária.
uk: `addr_of!` дозволяє отримувати поля структур без створення проміжного посилання.

source: Volatile access: read or write operations may have side-effects, so prevent the compiler or hardware from reordering, duplicating or eliding them.
es: Acceso volátil: las operaciones de lectura o escritura pueden tener efectos secundarios, por lo que se debe evitar que el compilador o el hardware las reordene, duplique u omita.
fa: دسترسی فرار (Volatile access): عملیات خواندن یا نوشتن ممکن است عوارض جانبی داشته باشد، بنابراین از کامپایلر یا سخت‌افزار از مرتب‌سازی مجدد، کپی‌کردن یا حذف آنها جلوگیری کنید.
ja: Volatileアクセス：MMIO領域に対するreadやwriteは副作用があることがあるので、コンパイラやハードウェアが実行順序を変更したり、複製したり、省略したりできないようにするためのものです。
ko: 휘발성(volatile) 액세스: 읽기 또는 쓰기 작업이 부수 효과(side effect)를 동반할 수 있기 때문에 컴파일러나 하드웨어가 임의로 이를 읽기 쓰기 작업의 순서를 바꾸거나, 중복해서 수행하거나 또는 제거하지 못하게 합니다.
pt_br: Acesso volátil: operações de leitura ou gravação podem ter efeitos colaterais, portanto, impedem que o compilador ou o hardware os reordenem, duplicem ou omitam.
uk: Непостійний доступ: операції читання або запису можуть мати побічні ефекти, тому не дозволяйте компілятору чи апаратному забезпеченню їх перевпорядковувати, дублювати чи видаляти.

source: Usually if you write and then read, e.g. via a mutable reference, the compiler may assume that the value read is the same as the value just written, and not bother actually reading memory.
es: Normalmente, si escribes y luego lees (por ejemplo, a través de una referencia mutable), el compilador puede suponer que el valor leído es el mismo que el que se acaba de escribir, sin molestarse si quiera en leer realmente la memoria.
fa: معمولاً اگر بنویسید و سپس بخوانید، به عنوان مثال. از طریق یک reference، کامپایلر ممکن است فرض کند که مقدار خوانده شده همان مقداری است که نوشته شده است و در واقع خواندن memory را سخت‌تر نکند.
ja: 通常は、例えばある可変参照に対してライトしリードすると、コンパイラはライトしたのと同じ値がリードで読み出されると想定し、実際にメモリをリードする必要はないと判断します。
ko: 일반적으로 쓰고 난 후 읽으면(예: 변경 가능한 참조를 통해) 컴파일러는 읽은 값이 방금 쓴 값과 동일하다고 가정하고 실제로 메모리를 읽지 않을 수 있습니다.
pt_br: Normalmente, se você gravar e depois ler, por exemplo, por meio de uma referência mutável, o compilador pode assumir que o valor lido é o mesmo que o valor acabou de ser gravado e não se preocupar em ler a memória.
uk: Зазвичай, якщо ви пишете, а потім читаєте, напр. через змінне посилання, компілятор може припустити, що прочитане значення є таким самим, як щойно записане значення, і не турбуватися про фактичне читання пам’яті.

source: Some existing crates for volatile access to hardware do hold references, but this is unsound. Whenever a reference exist, the compiler may choose to dereference it.
es: Algunos crates para el acceso volátil al hardware sí mantienen referencias, aunque no es seguro. Siempre que exista una referencia, el compilador puede desreferenciarla.
fa: برخی از crateهای موجود برای دسترسی فَرار(volatile access) به سخت‌افزار دارای referenceهایی هستند، اما این همیشه درست نیست. هر زمان که یک reference وجود داشته باشد، کامپایلر ممکن است انتخاب کند که reference آن را لغو کند.
ja: ハードウェアへのvolatileアクセスを行うための既存のクレートには参照を保持するものがありますが、これは健全ではありません。参照が存在する間はいつでもコンパイラがその参照を外して（MMIO領域にアクセスして）しまう可能性があります。
ko: 하드웨어에 대한 휘발성 액세스를 위한 일부 기존 크레이트는 참조를 유지하지만 이는 올바른 것이 아닙니다. 참조가 있을 때마다 컴파일러는 이를 역참조하도록 선택할 수 있습니다.
pt_br: Algumas _crates_ existentes para acesso volátil ao hardware mantêm referências, mas isso é incorreto. Sempre que uma referência existir, o compilador poderá optar por desreferenciá-la.
uk: Деякі існуючі крейти для непостійного доступу до апаратного забезпечення містять посилання, але це нерозумно. Кожного разу, коли існує посилання, компілятор може вирішити розіменувати його.

source: Use the `addr_of!` macro to get struct field pointers from a pointer to the struct.
es: Utiliza la macro `addr_of!` para obtener punteros de campos de estructuras a partir de un puntero en la estructura.
fa: از ماکرو `addr_of!` برای دریافت اشاره‌گرهای struct field از یک اشاره‌گر به ساختار استفاده کنید.
ja: 構造体のポインタからそのフィールドへのポインタを得るには`addr_of!` マクロを使ってください。
ko: `addr_of!` 매크로를 사용하여 구조체 포인터에서 구조체 필드 포인터를 가져옵니다.
pt_br: Use a macro `addr_of!` para obter ponteiros de campo de um struct de um ponteiro para o struct.
uk: Використовуйте макрос `addr_of!`, щоб отримати покажчики полів структури від покажчика на структуру.

source: Let's write a UART driver
es: Vamos a escribir un controlador de UART
fa: بیایید یک درایور UART بنویسیم
ja: UARTドライバを書いてみましょう
ko: UART 드라이버 작성
pt_br: Vamos escrever um driver UART
uk: Давайте напишемо драйвер UART

source: The QEMU 'virt' machine has a [PL011](https://developer.arm.com/documentation/ddi0183/g) UART, so let's write a driver for that.
es: La máquina "virt" de QEMU tiene una UART [PL011]https://developer.arm.com/documentation/ddi0183/g), así que vamos a escribir un controlador para ella.
fa: این ماشین QEMU 'virt' یک [PL011](https://developer.arm.com/documentation/ddi0183/g) به‌عنوان UART دارد، پس بیایید یک درایور برای آن بنویسیم.
ja: QEMUの'virt' マシンには[PL011](https://developer.arm.com/documentation/ddi0183/g)というUARTがあるので、それに対するドライバを書いてみましょう。
ko: QEMU의 'virt' 보드에는 [PL011](https://developer.arm.com/documentation/ddi0183/g) UART가 있으므로 이를 위한 드라이버를 작성해 보겠습니다.
pt_br: A máquina 'virt' do QEMU possui um UART [PL011](https://developer.arm.com/documentation/ddi0183/g), então vamos escrever um driver para isso.
uk: Машина QEMU 'virt' має [PL011](https://developer.arm.com/documentation/ddi0183/g) UART, тож давайте напишемо для нього драйвер.

source: /// Minimal driver for a PL011 UART.
pt_br: /// Driver mínimo para um UART PL011.
uk: /// Мінімальний драйвер для PL011 UART.

source: /// Constructs a new instance of the UART driver for a PL011 device at the /// given base address. /// /// # Safety /// /// The given base address must point to the 8 MMIO control registers of a /// PL011 device, which must be mapped into the address space of the process /// as device memory and not have any other aliases.
pt_br: /// Constrói uma nova instância do driver UART para um dispositivo PL011 no endereço /// base fornecido. /// /// # Segurança /// /// O endereço base fornecido deve apontar para os 8 registradores de controle MMIO de um /// dispositivo PL011, que deve ser mapeado no espaço de endereços do processo /// como memória de dispositivo e não ter nenhum outro alias.
uk: /// Створює новий екземпляр драйвера UART для пристрою PL011 /// за заданою базовою адресою. /// /// # Безпека /// /// Задана базова адреса повинна вказувати на 8 керуючих регістрів MMIO пристрою /// PL011, які повинні бути відображені в адресному просторі процесу /// як пам'ять пристрою і не мати ніяких інших псевдонімів.

source: /// Writes a single byte to the UART.
pt_br: /// Grava um único byte no UART.
uk: /// Записує один байт до UART.

source: // Wait until there is room in the TX buffer.
pt_br: // Aguarde até que haja espaço no buffer TX.
uk: // Чекаємо, поки не звільниться місце в буфері TX.

source: // SAFETY: We know that the base address points to the control // registers of a PL011 device which is appropriately mapped.
uk: // БЕЗПЕКА: ми знаємо, що базова адреса вказує на регістри // керування пристрою PL011, які відповідним чином відображені.

source: // Write to the TX buffer.
pt_br: // Escreva no buffer TX.
uk: // Записуємо в буфер TX.

source: // Wait until the UART is no longer busy.
pt_br: // Aguarde até que o UART não esteja mais ocupado.
uk: // Чекаємо, поки UART більше не буде зайнято.

source: Note that `Uart::new` is unsafe while the other methods are safe. This is because as long as the caller of `Uart::new` guarantees that its safety requirements are met (i.e. that there is only ever one instance of the driver for a given UART, and nothing else aliasing its address space), then it is always safe to call `write_byte` later because we can assume the necessary preconditions.
es: Ten en cuenta que `Uart::new` no es seguro, mientras que los otros métodos sí lo son. Esto se debe a que mientras que el llamador de `Uart::new` asegure que se cumplan sus requisitos de seguridad (es decir, que solo haya una instancia del controlador para una UART determinada y que nada más asigne alias a su espacio de direcciones), siempre es más seguro llamar a `write_byte` más adelante, ya que podemos asumir\ las condiciones previas necesarias.
fa: توجه داشته باشید که `Uart::new` ناامن یا unsafe است در حالی که متد‌های دیگر ایمن هستند. این به‌خاطر این است که تا زمانی که تماس گیرنده `Uart::new` تضمین کند که الزامات ایمنی آن برآورده شده است (یعنی فقط یک نمونه از درایور برای یک UART مشخص وجود دارد و هیچ چیز دیگری نام مستعار فضای آدرس آن را ندارد)، پس همیشه می‌توان `write_byte` را بعداً فراخوانی کرد زیرا می‌توانیم پیش‌شرط‌های لازم را فرض کنیم.
ja: `Uart::new`がアンセーフでその他のメソッドがセーフであるということに注目してください。これは、`Uart::new`の安全性要求が満たされている（すなわち特定のUARTに対して一つしかドライバのインスタンスが存在せず、そのアドレス空間に対してエイリアスが全く存在しない）ことをその呼び出し元が保証する限り、それ以降は必要な事前条件が満たされていると想定することができ`write_byte`を常に安全に呼び出すことができるようになることが理由です。
ko: `Uart::new`는 안전하지 않지만(usafe), 그 외 다른 메서드들은 안전한(safe) 점에 주목하세요.다른 메서드들이 안전할 수 있는 이유는, `Uart::new`의 안전 요구사항(즉, 지정된 UART의 드라이버 인스턴스가 하나만 있으며 주소 공간에 별칭을 지정하는 다른 항목이 없음) 이 만족되기만 하면 `write_byte`와 같은 함수를 안전하게 호출하는데 있어서 필요한 모든 전제조건이 만족되기 때문입니다.
pt_br: Observe que `Uart::new` não é seguro, enquanto os outros métodos são seguros. Isso ocorre porque, desde que o chamador de `Uart::new` garanta que seus requisitos de segurança sejam atendidos (ou seja, que haja apenas uma instância do driver para um determinado UART e nada mais que faça alias do seu espaço de endereço), então é sempre seguro chamar `write_byte` mais tarde porque podemos assumir as precondições necessárias.
uk: Зауважте, що `Uart::new` є небезпечним, тоді як інші методи є безпечними. Це пов'язано з тим, що доки викликач `Uart::new` гарантує, що його вимоги безпеки дотримано (тобто, що існує лише один екземпляр драйвера для даного UART, і ніщо інше не змінює його адресний простір), доти безпечно викликати `write_byte` пізніше, оскільки ми можемо припустити, що виконано необхідні передумови.

source: We could have done it the other way around (making `new` safe but `write_byte` unsafe), but that would be much less convenient to use as every place that calls `write_byte` would need to reason about the safety
es: Podríamos haberlo hecho al revés (haciendo que `new` fuese seguro y `write_byte` no seguro), pero\sería mucho menos cómodo de usar, ya que cada lugar que llamase a `write_byte` tendría que pensar en la seguridad
fa: ما می‌توانستیم این کار را به صورت دیگری انجام دهیم ( ساخت `new` را ایمن کنیم، اما `write_byte` را ناامن کنیم)، اما استفاده از آن بسیار راحت‌تر خواهد بود، زیرا هر مکانی که `write_byte` را صدا می‌زند باید در مورد ایمنی یا safety استدلال کند.
ja: 逆に（`new`をセーフにして、`write_byte` をアンセーフに）することもできましたが、そうすると`write_byte`の全呼び出し箇所において安全性を考慮しなければならなくなり、利便性が低下します
ko: 반대 방법으로도 실행할 수 있지만(`new`를 안전하게 만들고 `write_byte`를 안전하지 않게 만듦) 이는 `write_byte`를 호출하는 모든 위치에서 안전성에 관해 추론해야 하므로 사용 편의성이 훨씬 떨어집니다.
pt_br: Poderíamos ter feito o contrário (tornando `new` seguro, mas `write_byte` inseguro), mas isso seria muito menos conveniente de usar, pois todos os lugares que chamam `write_byte` precisariam raciocinar sobre a segurança
uk: Ми могли б зробити це навпаки (зробити `new` безпечним, але `write_byte` небезпечним), але це було б набагато менш зручно використовувати, оскільки кожне місце, яке викликає `write_byte`, мало б міркувати про безпеку

source: This is a common pattern for writing safe wrappers of unsafe code: moving the burden of proof for soundness from a large number of places to a smaller number of places.
es: Este es un patrón común para escribir envoltorios seguros de código inseguro: mover la carga de la prueba de seguridad de un gran número de lugares a otro más pequeño.
ja: これはアンセーフなコードに対してセーフなラッパーを構築する場合の共通パターンです：健全性に関する証明に関する労力を多数の場所から少数の場所に集約します。
ko: 이는 안전하지 않은 코드의 안전한 래퍼를 작성하는 일반적인 패턴입니다. 안전에 관한 증명 부담을 여러 많은 위치에서 소수의 위치로 옮기는 것입니다.
pt_br: Este é um padrão comum para escrever invólucros seguros de código inseguro: transferir o ônus da prova de correção de um grande número de lugares para um número menor de lugares.
uk: Це загальний шаблон для написання безпечних оболонок небезпечного коду: перенесення тягаря доведення правильності з великої кількості місць на меншу кількість місць.

source: More traits
es: Más traits
fa: ‏ traitهای بیشتر
ja: 他のトレイト
pt_br: Mais _traits_
uk: Більше трейтів

source: We derived the `Debug` trait. It would be useful to implement a few more traits too.
es: Hemos derivado el trait `Debug`. También sería útil implementar algunos traits más.
fa: ما ویژگی `Debug` را استخراج کردیم. اجرای چند ویژگی دیگر نیز مفید خواهد بود.
ja: ここでは`Debug`トレイトを導出しました。この他にもいくつかのトレイトを実装すると良いでしょう。
pt_br: Derivamos o _trait_ `Debug`. Seria útil implementar alguns _traits_ a mais também.
uk: Ми вивели трейт `Debug`. Також було б корисно реалізувати ще кілька трейтів.

source: // SAFETY: `Uart` just contains a pointer to device memory, which can be // accessed from any context.
uk: // БЕЗПЕКА: `Uart` містить лише покажчик на пам'ять пристрою, до якого // можна отримати доступ з будь-якого контексту.

source: Implementing `Write` lets us use the `write!` and `writeln!` macros with our `Uart` type.
es: Implementar `Write` nos permite utilizar las macros `write!` y `writeln!` con nuestro tipo `Uart`.
fa: پیاده‌سازی `Write`به ما امکان می‌دهد از ماکروهای `write!` و `writeln!` با تایپ `Uart` خود استفاده کنیم.
ja: `Write`を実装すると、`Uart` タイプに対して `write!`と`writeln!`マクロが利用できるようになります。
pt_br: A implementação de `Write` nos permite usar os macros `write!` e `writeln!` com nosso tipo `Uart`.
uk: Реалізація `Write` дозволяє використовувати макроси `write!` і `writeln!` з нашим типом `Uart`.

source: Run the example in QEMU with `make qemu_minimal` under `src/bare-metal/aps/examples`.
es: Ejecuta el ejemplo en QEMU con `make qemu_minimal` en `src/bare-metal/aps/examples`.
fa: مثال را در QEMU با `make qemu_minimal` در زیر `src/bare-metal/aps/examples` اجرا کنید.
ja: この例を`src/bare-metal/aps/examples`において`make qemu_minimal`とすることで、QEMUにより実行してみましょう。
pt_br: Execute o exemplo no QEMU com `make qemu_minimal` em `src/bare-metal/aps/examples`.
uk: Запустіть приклад у QEMU за допомогою `make qemu_minimal` у `src/bare-metal/aps/examples`.

source: A better UART driver
es: Un controlador UART mejor
fa: یک درایور UART بهتر
ja: UARTドライバの改善
ko: 더 나은 UART 드라이버
pt_br: Um driver UART melhor
uk: Кращий драйвер UART

source: The PL011 actually has [a bunch more registers](https://developer.arm.com/documentation/ddi0183/g/programmers-model/summary-of-registers), and adding offsets to construct pointers to access them is error-prone and hard to read. Plus, some of them are bit fields which would be nice to access in a structured way.
es: En realidad, PL011 tiene [muchos registros más](https://developer.arm.com/documentation/ddi0183/g/programmers-model/summary-of-registers), por lo que añadir desplazamientos para crear punteros que les permita acceder a ellos da lugar a errores y dificulta la lectura. Además, algunos de ellos son campos de bits a los que estaría bien acceder de forma estructurada.
ja: 実際のところPL011には[もっと多くのレジスタ](https://developer.arm.com/documentation/ddi0183/g/programmers-model/summary-of-registers)があり、それらにアクセスするためにオフセットを足してポインタを得ることは間違えになりやすく、可読性を低下させます。さらに、いくつかはビットフィールドなので、構造化された方法でアクセスできたほうが良いでしょう。
ko: PL011에는 실제로 [훨씬 더 많은 레지스터](https://developer.arm.com/documentation/ddi0183/g/programmers-model/summary-of-registers)가 있으며, 이에 액세스할 포인터를 구성하기 위해 오프셋을 추가하면 오류가 발생하기 쉽고 읽기 어렵습니다. 또한 그중 일부는 구조화된 방식으로 액세스할 수 있는 비트 필드입니다.
pt_br: O PL011 na verdade tem [um monte de outros registradores](https://developer.arm.com/documentation/ddi0183/g/programmers-model/summary-of-registers), e adicionar deslocamentos para construir ponteiros para acessá-los é propenso a erros e difícil de ler. Além disso, alguns deles são campos de bits que seria bom acessar de forma estruturada.
uk: PL011 насправді має [набагато більше регістрів](https://developer.arm.com/documentation/ddi0183/g/programmers-model/summary-of-registers), і додавання зміщень до вказівників для конструювання доступу до них може призвести до помилок, і читається важко. Крім того, деякі з них є бітовими полями, до яких було б добре мати структурований доступ.

source: Offset
es: Desplazamiento
fa: افست
ja: オフセット
ko: 오프셋
pt_br: Deslocamento (_offset_)
uk: Зміщення

source: Register name
es: Nombre de registro
fa: نام رجیستر
ja: レジスタ名
ko: 레지스터 이름
pt_br: Nome do registrador
uk: Ім'я регістру

source: Width
es: Ancho
fa: عرض
ja: 幅
ko: 너비
pt_br: Largura
uk: Ширина

source: There are also some ID registers which have been omitted for brevity.
es: También hay algunos registros de ID que se han omitido para abreviar.
fa: همچنین برخی از ID register هایی وجود دارد که برای اختصار حذف شده‌اند.
ja: いくつかのIDレジスタは簡単化のための省略しています。
ko: 간결성을 위해 일부 ID 레지스터는 생략되었습니다.
pt_br: Também existem alguns registradores de ID que foram omitidos por brevidade.
uk: Є також деякі ID регістри, які були пропущені для стислості.

source: The [`bitflags`](https://crates.io/crates/bitflags) crate is useful for working with bitflags.
es: El crate [`bitflags`](https://crates.io/crates/bitflags) resulta útil para trabajar con bitflags.
fa: این crate برای [`bitflags`](https://crates.io/crates/bitflags) جهت کار با bitflags مفید است.
ja: [`bitflags`](https://crates.io/crates/bitflags) クレートはビットフラグを扱うのに便利です。
pt_br: O _crate_ [`bitflags`](https://crates.io/crates/bitflags) é útil para trabalhar com _bitflags_.
uk: Крейт [`bitflags`](https://crates.io/crates/bitflags) корисний для роботи з бітовими флагами.

source: /// Flags from the UART flag register.
pt_br: /// _Flags_ do registrador de _flags_ do UART.
uk: /// Прапорці з регістру прапорів UART.

source: /// Clear to send.
pt_br: /// Limpar para enviar.
uk: /// Очистити для відправки.

source: /// Data set ready.
pt_br: /// Dados prontos para envio.
uk: /// Набір даних готовий.

source: /// Data carrier detect.
pt_br: /// Dados detectados pelo receptor.
uk: /// Визначення носія даних.

source: /// UART busy transmitting data.
pt_br: /// UART ocupado transmitindo dados.
uk: /// UART зайнятий передачею даних.

source: /// Receive FIFO is empty.
pt_br: /// O FIFO de recebimento está vazio.
uk: /// FIFO отримання порожній.

source: /// Transmit FIFO is full.
pt_br: /// O FIFO de transmissão está cheio.
uk: /// FIFO передачі заповнено.

source: /// Receive FIFO is full.
pt_br: /// O FIFO de recebimento está cheio.
uk: /// FIFO отримання заповнено.

source: /// Transmit FIFO is empty.
pt_br: /// O FIFO de transmissão está vazio.
uk: /// FIFO передачі порожній.

source: /// Ring indicator.
pt_br: /// Indicador de anel.
uk: /// Індикатор кільця.
