Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Microcontrollers
es: Microcontroladores
fa: میکروکنترلرها
ja: マイクロコントローラ
ko: 마이크로컨트롤러
pt_br: Microcontroladores
uk: Мікроконтролери

source: Raw MMIO
es: MMIO sin procesar
fa: MMIO خام
ja: 生MMIO（メモリマップドI/O）
ko: 원시 MMIO
pt_br: MMIO Bruto
uk: Сирий ввід вивід з відображеної пам'яті (MMIO)

source: PACs
es: PAC
ko: PAC
uk: Крейти доступу до периферійних пристроїв (PACs)

source: HAL Crates
es: Crates HAL
ja: HALクレート
ko: HAL 크레이트
pt_br: _Crates_ HAL
uk: Крейти абстракції обладнання (HAL)

source: Board Support Crates
es: Crates de Soporte de Placa
ja: ボードサポートクレート
ko: 보드 지원 크레이트
pt_br: _Crates_ de Suporte à Placa
uk: Крейти підтримки плат

source: The Type State Pattern
es: El Patrón de Tipo de Estado
fa: انواع State Pattern
ja: タイプステートパターン
ko: Type State 패턴
pt_br: O Padrão de Estado de Tipo
uk: Шаблон стану типу

source: `probe-rs` and `cargo-embed`
pt_br: `probe-rs` e `cargo-embed`
uk: `probe-rs` та `cargo-embed`

source: Debugging
es: Depuración
fa: اشکال یابی (Debugging)
ja: デバッグ
ko: 디버깅
pt_br: Depuração
uk: Налагодження

source: Other Projects
es: Otros proyectos
fa: باقی پروژه‌ها
ja: 他のプロジェクト
ko: 다른 프로젝트
pt_br: Outros Projetos
uk: Інші проєкти

source: Compass
es: Brújula
fa: قطب‌نما
ja: コンパス
ko: 나침반
pt_br: Bússola
uk: Компас

source: Solutions
es: Soluciones
fa: راه حل‌ها
ja: 解答
ko: 해답
pt_br: Soluções
uk: Рішення

source: Bare Metal: Afternoon
es: Bare Metal: tarde
fa: با Bare Metal: عصر
ja: ベアメタル： PM
ko: Bare Metal 오후
pt_br: Bare Metal: Tarde
uk: Залізо: Полудень

source: Application Processors
es: Procesadores de aplicaciones
fa: پردازنده‌های برنامه
ja: アプリケーションプロセッサ
ko: 애플리케이션 프로세서
pt_br: Processadores de Aplicação
uk: Прикладні процесори

source: Getting Ready to Rust
es: Iniciación a Rust
fa: آماده شدن برای Rust
ja: Rust の準備
ko: Rust 수행 준비
pt_br: Preparando-se para o Rust
uk: Підготовка до Rust

source: Inline Assembly
es: Ensamblador en línea
fa: اسمبلی درونی
ja: インラインアセンブリ
ko: 인라인 어셈블리
pt_br: Assembly In-line
uk: Вбудована збірка

source: MMIO
uk: Ввід вивід з відображеної пам'яті (MMIO)

source: Let's Write a UART Driver
es: Escribir un controlador UART
fa: بریم یک درایور UART بنویسیم
ja: UARTドライバを書いてみよう
ko: UART 드라이버 작성
pt_br: Vamos Escrever um Driver UART
uk: Давайте напишемо драйвер UART

source: More Traits
es: Más traits
fa: صفت‌های بیشتر
ja: 他のトレイト
ko: 더 많은 트레잇
pt_br: Mais _Traits_
uk: Більше трейтів

source: A Better UART Driver
es: Un controlador UART mejor
fa: یک درایور بهتر UART
ja: UARTドライバの改善
ko: 더 나은 UART 드라이버
pt_br: Um Driver UART Melhor
uk: Кращий драйвер UART

source: Bitflags
fa: پرچم‌های بیتی (Bitflags)
ja: ビットフラッグ
ko: 비트플래그
uk: Бітові прапорці (крейт bitflags)

source: Multiple Registers
es: Varios registros
fa: رجیستر‌های چندگانه
ja: 複数のレジスタ
ko: 더 많은 레지스터
pt_br: Registradores Múltiplos
uk: Кілька регістрів

source: Driver
es: Conductor
fa: درایور
ja: ドライバ
ko: 드라이버
uk: Драйвер

source: Using It
es: Cómo usarlo
fa: استفاده از آن
ja: 使用例
ko: 사용해 보기
pt_br: Usando-o
uk: Використання

source: Exceptions
es: Excepciones
fa: استثناها
ja: 例外
ko: 예외
pt_br: Exceções
uk: Виключення

source: Useful Crates
es: Crates útiles
fa: جعبه‌های (Crates) کاربردی
ja: 便利クレート
ko: 유용한 크레이트
pt_br: _Crates_ Úteis
uk: Корисні крейти

source: RTC Driver
es: Controlador RTC
fa: درایور RTC
ja: RTC（リアルタイムクロック）ドライバ
ko: RTC 드라이버
pt_br: Driver RTC
uk: Драйвер годинника реального часу (RTC)

source: Concurrency: Morning
es: Concurrencia: mañana
fa: همزمانی: صبح
ja: 並行性： AM
ko: 동시성 오전
pt_br: Concorrência: Manhã
uk: Одночасність виконання: Ранок

source: Threads
es: Hilos
fa: تردها
ja: スレッド
ko: 스레드
uk: Потоки

source: Plain Threads
fa: تردهای ساده
uk: Звичайні потоки

source: Scoped Threads
es: Hilos con ámbito
fa: محدوده تردها
ja: スコープ付きスレッド
ko: 범위 스레드(Scoped Threads)
pt_br: Threads com Escopo
uk: Потоки з областю видимості

source: Channels
es: Canales
fa: کانال‌ها
ja: チャネル
ko: 채널
pt_br: Canais (_Channels_)
uk: Канали

source: Senders and Receivers
fa: Senders و Receivers
uk: Відправники та отримувачі

source: Unbounded Channels
es: Canales sin límites
fa: کانال‌های نامحدود
ja: Unboundedチャネル
ko: 무경계 채널
pt_br: Canais Ilimitados
uk: Незав'язані канали

source: Bounded Channels
es: Canales delimitados
fa: کانال‌های محدود
ja: Boundedチャネル
ko: 경계 채널
pt_br: Canais Delimitados
uk: Зав'язані канали

source: `Send` and `Sync`
es: `Send` y `Sync`
fa: `Send` و `Sync`
ja: `Send`と`Sync`
ko: `Send`와 `Sync`
pt_br: `Send` e `Sync`
uk: `Send` та `Sync`

source: Marker Traits
fa: ویژگی‌های نشانگر
uk: Маркерні трейти

source: Examples
es: Ejemplos
fa: مثال‌ها
ja: 例
ko: 예제
pt_br: Exemplos
uk: Приклади

source: Shared State
es: Estado compartido
fa: ناحیه‌های مشترک
ja: 状態共有
ko: 상태 공유
pt_br: Estado Compartilhado
uk: Спільний стан

source: Example
es: Ejemplo
fa: مثال
ja: 例
ko: 예제
pt_br: Exemplo
uk: Приклад

source: Dining Philosophers
es: La cena de los filósofos
fa: فلسفه Dining
ja: 食事する哲学者
ko: 식사하는 철학자들
pt_br: Jantar dos Filósofos
uk: Вечеря філософів

source: Multi-threaded Link Checker
es: Comprobador de enlaces multihilo
fa: جستجوگر پیوند چند تِردی
ja: マルチスレッド・リンクチェッカー
ko: 멀티스레드 링크 검사기
pt_br: Verificador de Links Multi-Threads
uk: Перевірка багатопоточних посилань

source: Concurrency: Afternoon
es: Concurrencia: tarde
fa: همزمانی: عصر
ja: 並行性： PM
ko: 동시성 오후
pt_br: Concorrência: Tarde
uk: Одночасність виконання: Полудень

source: Async Basics
es: Conceptos básicos de Async
fa: مبانی Async
ja: Asyncの基礎
ko: 비동기 관련 기본사항
pt_br: Fundamentos de _Async_ (Assincronicidade)
uk: Основи асинхронізації

source: Runtimes
es: Runtimes (Tiempos de Ejecución)
ja: ランタイム
ko: 비동기 런타임들
pt_br: Tempos de Execução
uk: Середовища виконання

source: Tokio
uk: Токіо

source: Tasks
fa: Task
ja: タスク
ko: 태스크
pt_br: Tarefas
uk: Завдання

source: Channels and Control Flow
fa: کانال‌ها و Control Flow
uk: Канали та потік управління

source: Async Channels
es: Canales asíncronos
fa: کانال‌های Async
ja: Asyncチャネル
ko: 비동기 채널
pt_br: Canais Assíncronos
uk: Асинхронні канали

source: Pitfalls
es: Inconvenientes
fa: Pitfallها
ja: 落とし穴
ko: 함정
pt_br: Armadilhas
uk: Підводні камені

source: Blocking the Executor
es: Bloqueo del ejecutor
fa: مسدود کردن Executor
ja: エグゼキュータのブロッキング
ko: Executor 블로킹 하기
pt_br: Bloqueando o Executor
uk: Блокування Виконавця

source: Async Traits
es: Traits asíncronos
fa: صفات Async
ja: Asyncトレイト
ko: 비동기 트레잇
pt_br: Traits Assíncronos
uk: Асинхронні трейти

source: Cancellation
es: Cancelación
fa: لغو
ko: 취소
pt_br: Cancelamento
uk: Скасування

source: Broadcast Chat Application
es: Aplicación de chat de difusión
fa: پخش برنامه چت
ja: ブロードキャスト・チャットアプリ
ko: 채팅 애플리케이션
pt_br: Apliação de Chat de Transmissão
uk: Програма широкомовного чату

source: Final Words
es: Conclusiones
fa: کلمات آخر
ja: 最後に
ko: 끝으로...
pt_br: Palavras Finais
uk: Заключні слова

source: Thanks!
es: Gracias.
fa: سپاس!
ja: ありがとうございました！
ko: 감사인사
pt_br: Obrigado!
uk: Дякую!

source: Glossary
fa: واژه‌نامه
ja: 用語集
pt_br: Glossário
uk: Глосарій

source: Other Resources
es: Otros recursos
fa: منابع دیگر
ja: 参考資料
ko: 러스트 참고 자료
pt_br: Outros recursos
uk: Інші ресурси

source: Credits
es: Créditos
fa: اعتبارها
ja: クレジット
ko: 도와주신 분들
pt_br: Créditos
uk: Кредити

source: [![Build workflow](https://img.shields.io/github/actions/workflow/status/google/comprehensive-rust/build.yml?style=flat-square)](https://github.com/google/comprehensive-rust/actions/workflows/build.yml?query=branch%3Amain) [![GitHub contributors](https://img.shields.io/github/contributors/google/comprehensive-rust?style=flat-square)](https://github.com/google/comprehensive-rust/graphs/contributors) [![GitHub stars](https://img.shields.io/github/stars/google/comprehensive-rust?style=flat-square)](https://github.com/google/comprehensive-rust/stargazers)
pt_br: [![Workflow do GitHub](https://img.shields.io/github/actions/workflow/status/google/comprehensive-rust/build.yml?style=flat-square)](https://github.com/google/comprehensive-rust/actions/workflows/build.yml?query=branch%3Amain) [![Contribuições no GitHub](https://img.shields.io/github/contributors/google/comprehensive-rust?style=flat-square)](https://github.com/google/comprehensive-rust/graphs/contributors) [![Estrelas no GitHub](https://img.shields.io/github/stars/google/comprehensive-rust?style=flat-square)](https://github.com/google/comprehensive-rust/stargazers)
uk: [![Робочий процес створення](https://img.shields.io/github/actions/workflow/status/google/comprehensive-rust/build.yml?style=flat-square)](https://github.com/google/comprehensive-rust/actions/workflows/build.yml?query=branch%3Amain) [![Учасники GitHub](https://img.shields.io/github/contributors/google/comprehensive-rust?style=flat-square)](https://github.com/google/comprehensive-rust/graphs/contributors) [![зірки GitHub](https://img.shields.io/github/stars/google/comprehensive-rust?style=flat-square)](https://github.com/google/comprehensive-rust/stargazers)

source: This is a free Rust course developed by the Android team at Google. The course covers the full spectrum of Rust, from basic syntax to advanced topics like generics and error handling.
es: Este es un curso de Rust de tres días que ha desarrollado el equipo de Android de Google. El curso abarca todo lo relacionado con Rust, desde la sintaxis básica hasta temas avanzados como los genéricos y la gestión de errores. También incluye contenidos específicos de Android el último día.
fa: این یک دوره رایگان Rust است که توسط تیم اندروید در گوگل توسعه یافته است. این این دوره طیف کامل‌ای از Rust را پوشش میدهد, از مباحث پایه تا مباحث پیشرفته مانند جنریک و مدیریت خطاها.
ko: 이 강의는 무료이며, Google의 Android 팀이 만들었습니다. 기본 문법부터 제네릭, 에러 핸들링과 같은 고급주제까지 러스트의 모든 것을 포함합니다.
pt_br: Este é um curso gratuito de Rust desenvolvido pela equipe do Android no Google. O curso abrange o espectro completo da linguagem, desde sintaxe básica até tópicos avançados como 'generics' e tratamento de erros.
uk: Це безкоштовний курс Rust, розроблений командою Android у Google. Курс охоплює весь спектр Rust, від базового синтаксиса до складних тем, таких як узагальнення (generics) и обробка помилок.

source: The latest version of the course can be found at <https://google.github.io/comprehensive-rust/>. If you are reading somewhere else, please check there for updates.
es: La última versión del curso se puede encontrar en <https://google.github.io/comprehensive-rust/>. Si lo estás leyendo en otro lugar, consulta allí para obtener actualizaciones.
fa: آخرین نسخه از دوره را میتوان در <https://google.github.io/comprehensive-rust/> پیدا کنید. اگر از جای دیگری میخوانید, لطفا برای بروز رسانی‌ها منبع اصلی را نیز بررسی کنید.
ja: コースの最新バージョンは <https://google.github.io/comprehensive-rust/> にあります。他の場所でお読みの場合は、そちらで最新情報をご確認ください。
pt_br: A versão mais recente do curso pode ser encontrada em <https://google.github.io/comprehensive-rust/>. Se você estiver lendo em outro lugar, por favor verifique lá por atualizações.
uk: Останню версію курсу можна знайти за адресою <https://google.github.io/comprehensive-rust/>. Якщо ви читаєте десь в іншому місці, перевіряйте там на оновлення.

source: The course is available in other languages. Select your preferred language in the top right corner of the page or check the [Translations](running-the-course/translations.md) page for a list of all available translations.
fa: این دوره به زبان های دیگر موجود است. زبان مورد نظر خود را در گوشه سمت راست بالای صفحه انتخاب کنید یا صفحه [ترجمه‌ها](running-the-course/translations.md) را برای فهرستی از تمام ترجمه‌های موجود را بررسی کنید.
uk: Курс доступний на інших мовах. Виберіть потрібну мову у верхньому правому куті сторінки або перегляньте сторінку [Переклади](running-the-course/translations.md), щоб ознайомитися зі списком усіх доступних перекладів.

source: The course is also available [as a PDF](comprehensive-rust.pdf).
fa: این دوره نیز [به عنوان یک PDF](comprehensive-rust.pdf) در دسترس است.
uk: Курс також доступний [у форматі PDF](comprehensive-rust.pdf).

source: The goal of the course is to teach you Rust. We assume you don't know anything about Rust and hope to:
es: El objetivo del curso es enseñarte Rust. Suponemos que no sabes nada sobre Rust y esperamos lograr lo siguiente:
fa: هدف از این دوره آموزش Rust به شماست. ما فرض می کنیم شما چیزی از درباره Rust نمی دانید :
ja: 本講座の目的は、Rustを教える事です。Rustに関する前提知識は不要としており、次の目標を設定しています：
ko: 강의는 당신이 러스트에 대해서 아무것도 모른다고 가정하고 아래의 목표를 가지고 있습니다:
pt_br: O objetivo do curso é ensinar Rust a você. Nós assumimos que você não saiba nada sobre Rust e esperamos:
uk: Ціль курсу навчити вас мові Rust. Ми припускаємо, що ви нічого не знаєте про Rust та сподіваємося:

source: Give you a comprehensive understanding of the Rust syntax and language.
es: Darte un entendimiento comprensivo de la sintaxis y lenguaje Rust.
fa: درک جامعی از syntax و زبان Rust به شما می دهد.
ja: Rustの基本構文と言語についての理解を深める。
ko: 러스트 구문과 언어에 대한 포괄적인 이해를 제공합니다.
pt_br: Dar a você uma compreensão abrangente da linguagem e da sintaxe de Rust.
uk: Дати вам повне уявлення про синтаксис та семантику мови Rust.

source: Enable you to modify existing programs and write new programs in Rust.
es: Permitirte modificar programas de Rust y escribir otros nuevos.
fa: شما را قادر می سازد تا برنامه های موجود را تغییر دهید و برنامه های جدید را در Rust بنویسید.
ja: 既存のプログラムを修正したり、新規プログラムをRustで書けるようにする。
ko: 기존 프로그램을 수정하고 러스트에서 새 프로그램을 작성할 수 있습니다.
pt_br: Permitir que você modifique programas existentes e escreva novos programas em Rust.
uk: Навчити працювати з існуючим кодом та писати нові програми на Rust.

source: Show you common Rust idioms.
es: Brindarte idiomática propia de Rust.
fa: اصطلاحات رایج Rust را به شما یاد می دهد.
ja: 一般的なRustのイディオムを紹介する。
ko: 일반적인 러스트 관용구를 보여줍니다.
pt_br: Demonstrar expressões idiomáticas comuns de Rust.
uk: Показати розповсюджені ідіоми мови Rust.

source: We call the first four course days Rust Fundamentals.
fa: ما چهار روز اول دوره را اصول Rust می نامیم.
ja: コースの最初の4日間を「Rust の基礎」と呼びます。
pt_br: Nós chamamos os quatro primeiros dias do curso de Fundamentos do Rust.
uk: Перші чотири дні курсу ми називаємо Rust Fundamentals.

source: Building on this, you're invited to dive into one or more specialized topics:
es: Basándonos en esto, te invitamos a profundizar en uno o más temas especializados:
fa: با تکیه بر این، از شما دعوت می شود تا به یک یا چند موضوع تخصصی بپردازید:
ko: 그 후에는, 아래와 같은 개별 주제를 심화해서 공부할 수 있습니다:
pt_br: Em seguida, você está convidado(a) a mergulhar a fundo em um ou mais tópicos especializados:
uk: Спираючись на це, вам пропонується зануритися в одну або кілька спеціалізованих тем:

source: [Android](android.md): a half-day course on using Rust for Android platform development (AOSP). This includes interoperability with C, C++, and Java.
es: [Android](android.md): un curso de medio día sobre el uso de Rust en el desarrollo de la plataforma Android (AOSP). En él se incluye la interoperabilidad con C, C++ y Java.
fa: [Android](android.md): یک دوره نیم روزه استفاده از Rust برای توسعه پلت فرم اندروید (AOSP). این شامل قابلیت همکاری با C، C ++و Java است.
ko: [Android](android.md): Android 플랫폼 개발(AOSP) 시 Rust 사용에 관한 반나절 과정입니다. 여기에는 C, C++, Java와의 상호 운용성이 포함됩니다.
pt_br: [Android](android.md): um curso de meio dia sobre a utilização de Rust no desenvolvimento para a plataforma Android (AOSP). Isto inclui interoperabilidade com C, C++ e Java.
uk: [Android](android.md): розрахований на половину дня курс з використання Rust для розробки на платформі Android (AOSP). Сюди входить взаємодія з C, C++ та Java.

source: [Chromium](chromium.md): a half-day course on using Rust within Chromium based browsers. This includes interoperability with C++ and how to include third-party crates in Chromium.
fa: [Chromium](chromium.md): یک دوره نیم روزه در مورد استفاده از Rust در مرورگرهای مبتنی بر Chromium. این شامل قابلیت همکاری با C ++ و نحوه قرار دادن جعبه های(crates) شخص ثالث در کروم است.
pt_br: [Chromium](chromium.md): um curso de meio dia sobre a utilização de Rust em navegadores baseados em Chromium. Isto inclui interoperabilidade com C++ e como incluir _crates_ de terceiros no Chromium.
uk: [Chromium](chromium.md): розрахований на половину дня курс курс із використання Rust у браузерах на основі Chromium. Сюди входить взаємодія з C++ та як включити крейти сторонніх розробників у Chromium.

source: [Bare-metal](bare-metal.md): a whole-day class on using Rust for bare-metal (embedded) development. Both microcontrollers and application processors are covered.
es: [Bare Metal](bare-metal.md): una clase de un día sobre el uso de Rust para el desarrollo bare-metal (insertado). Se tratarán tanto los microcontroladores como los procesadores de aplicaciones.
fa: [Bare-metal](bare-metal.md): یک کلاس تمام روز در مورد استفاده از Rust برای توسعهbare-metal (تعریف شده). هم میکروکنترلرها و هم پردازنده های برنامه پوشش داده شده اند.
ko: [Bare-metal](bare-metal.md): bare-metal(임베디드) 개발 시 Rust 사용에 관한 종일 과정입니다. 마이크로컨트롤러와 애플리케이션 프로세서를 모두 다룹니다.
pt_br: [Bare-metal](bare-metal.md): uma aula de um dia sobre a utilização de Rust para o desenvolvimento "bare metal" (sistema embarcado). Tanto micro-controladores quanto processadores de aplicação são cobertos.
uk: [Голе залізо](bare-metal.md): одноденне заняття з використання Rust для низькорівневої (embedded) розробки, що охоплює як мікроконтролери, так і звичайні процесори.

source: [Concurrency](concurrency/welcome.md): a whole-day class on concurrency in Rust. We cover both classical concurrency (preemptively scheduling using threads and mutexes) and async/await concurrency (cooperative multitasking using futures).
fa: [همروندی](concurrency/welcome.md): یک کلاس یک روزه در مورد concurrency در زبان Rust است. ما هر دو مورد concurrency کلاسیک (زمانبندی preemptively با استفاده از threadها و mutexها ) و async/await concurrency (multitasking مشارکتی) با استفاده از futures را پوشش خواهیم داد.
uk: [Concurrency](concurrency/welcome.md): повний день занять з вивчення конкурентності у Rust. Ми розглянемо як класичну конкурентність (витіснююча багатозадачність з використанням потоків і м'ютексів), так і async/await конкурентність (кооперативна багатозадачність з використанням futures).

source: Non-Goals
es: Objetivos que no trataremos
fa: اهداف خارج از این دوره
ja: 本講座の対象外
ko: 제외사항
pt_br: Fora do escopo
uk: За рамками курсу

source: Rust is a large language and we won't be able to cover all of it in a few days. Some non-goals of this course are:
es: Rust es un lenguaje muy amplio y no podremos abarcarlo todo en unos pocos días. Algunos de los objetivos que no se plantean en este curso son los siguientes:
fa: زبان Rust, یک زبان بزرگ است و ما نمی‌توانیم طی چند روز همه موارد را پوشش دهیم.چندتا از اهداف خارج از این دوره عبارتند از:
ja: Rustは非常に汎用性の高い言語であり、数日で全てを網羅する事はできません。本講座の目標として設定されていないものには、以下のようなものがあります：
ko: 러스트는 며칠만에 모든 것을 다루기에는 너무 큰 언어입니다. 그래서 아래와 같은것을 목표로 하지 않습니다:
pt_br: Rust é uma linguagem extensa e não conseguiremos cobrir tudo em poucos dias. Alguns assuntos que não são objetivos deste curso são:
uk: Rust це об'ємна мова, і ми не зможемо охопити її за кілька днів. Теми, що виходять за межі курсу:

source: Learning how to develop macros: please see [Chapter 19.5 in the Rust Book](https://doc.rust-lang.org/book/ch19-06-macros.html) and [Rust by Example](https://doc.rust-lang.org/rust-by-example/macros.html) instead.
es: Aprender a desarrollar macros: consulta el [capítulo 19.5 del Libro de Rust ](https://doc.rust-lang.org/book/ch19-06-macros.html) y [Rust by Example](https://doc.rust-lang.org/rust-by-example/macros.html).
fa: برای آموزش چگونه‌گی توسعه Macro ها: لطفا [Chapter 19.5 in the Rust Book](https://doc.rust-lang.org/book/ch19-06-macros.html) و [Rust by Example](https://doc.rust-lang.org/rust-by-example/macros.html) را برسی کنید.
ko: 매크로 만들기: 매크로와 관련한 자세한 내용은 [러스트 프로그래밍 언어, 19.1절](https://doc.rust-lang.org/book/ch19-01-unsafe-rust.html)과 [Rustonomicon](https://doc.rust-lang.org/nomicon/)를 참조하세요.
pt_br: Aprender a criar macros: por favor confira [Capítulo 19.5 em Rust Book](https://doc.rust-lang.org/book/ch19-06-macros.html) e [Rust by Example](https://doc.rust-lang.org/rust-by-example/macros.html) para esse fim.
uk: Написання макросів, будь ласка подивіться [Розділ 19.5 у The Rust Book](https://doc.rust-lang.org/book/ch19-06-macros.html) та [Rust by Example](https://doc.rust-lang.org/rust-by-example/macros.html).

source: Assumptions
es: Suposiciones
fa: فرض می‌شود
ja: 前提知識
ko: 독자 수준에 대한 가정
pt_br: Premissas
uk: Припущення

source: The course assumes that you already know how to program. Rust is a statically-typed language and we will sometimes make comparisons with C and C++ to better explain or contrast the Rust approach.
es: El curso presupone que ya sabes programar. Rust es un lenguaje estáticamente tipado y, a veces, haremos comparaciones con C y C++ para explicarlo mejor o contrastar nuestro enfoque.
fa: این دوره فرض می‌کند که شما دانش برنامه‌نویسی دارید. Rust یک زبان استاتیک تایپ است و ما گاهی اوقات زبان Rust را با C و <span dir=ltr>C++</span> مقایسه می کنیم تا رویکرد‌های Rust را بهتر توضیح دهیم.
ko: 본 강의는 여러분이 프로그래밍 자체에 대해서는 알고 있다고 가정합니다. 러스트는 정적타입 언어이며, 강좌에서는 C/C++ 와의 비교, 대조를 통해 러스트를 설명할 것입니다.
pt_br: O curso pressupõe que você já saiba programar. Rust é uma linguagem de tipagem estática e ocasionalmente faremos comparações com C e C++ para melhor explicar ou contrastar a abordagem do Rust.
uk: Передбачається, що ви вже можете програмувати. Rust це статично типізована мова, і іноді ми порівнюватимемо і зіставлятимемо її з C та C++, щоб краще пояснити чи підкреслити різницю у підходах до написання коду на Rust.

source: If you know how to program in a dynamically-typed language such as Python or JavaScript, then you will be able to follow along just fine too.
es: Si sabes programar en un lenguaje dinámicamente tipado, como Python o JavaScript, podrás seguir el ritmo sin problema.
fa: اگر می‌دانید چگونه به زبانی با دینامیک تایپ مانند پایتون یا جاوا اسکریپت برنامه‌نویسی کنید می‌توانید به خوبی این روش را دنبال کنید.
ko: C/C++을 모르더라도 동적 타입 언어(Python이나 JavaScript 등) 프로그래밍 경험이 있다면 따라오는데 큰 문제는 없을 것입니다.
pt_br: Se você sabe programar em uma linguagem de tipagem dinâmica, como Python ou JavaScript, então você também será capaz de acompanhar.
uk: Якщо ви знаєте, як програмувати мовою з динамічною типізацією, наприклад Python або JavaScript, ви зможете також успішно пройти цей курс.

source: This is an example of a _speaker note_. We will use these to add additional information to the slides. This could be key points which the instructor should cover as well as answers to typical questions which come up in class.
es: Este es un ejemplo de una _nota del orador_. Las utilizaremos para añadir información adicional a las diapositivas. Puede tratarse de puntos clave que el instructor debería tratar, así como de respuestas a preguntas frecuentes que surgen en clase.
fa: این یک نمونه از _speaker note_ هست. ما از این‌ها استفاده خواهیم کرد تا تا اطلاعات بیشتری را ارائه دهیم.. این مورد می‌تواند شامل نکات کلیدی باشد که مدرس باید آن را پوشش دهد و همچنین پاسخ به سوالات رایجی که در کلاس مطرح می شود.
ja: これはスピーカーノートの一例です。これを使用してスライドを捕捉します。講師がカバーすべき要点や、授業でよく出る質問への回答などが含まれます。
ko: 이것은 "발표자 노트"의 예제입니다. 이 부분을 이용해서 추가 정보를 제공합니다. 주로 강의실에서 제기되는 일반적인 질문에 대한 답변과 강사가 다루어야 할 키 포인트일 수 있습니다.
pt_br: Este é um exemplo de uma _nota do instrutor_. Nós as usaremos para adicionar informações complementares aos slides. Elas podem ser tanto pontos-chave que o instrutor deve cobrir quanto respostas a perguntas típicas que surgem em sala de aula.
uk: Це приклад _нотаток для викладача_. Ми будемо використовувати їх для додавання додаткової інформації до слайдів. Це можуть бути ключові моменти, які викладач повинен висвітлити, а також відповіді на типові питання, що виникають під час проходження курсу.

source: This page is for the course instructor.
es: Esta página está dirigida al instructor del curso.
fa: این صفحه برای مدرس دوره است.
ja: このページは講師用です。
ko: 강사를 위한 안내 페이지입니다.
pt_br: Esta página é para o instrutor do curso.
uk: Ця сторінка призначена для викладача курсу.
