Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: In addition, the type itself would not enforce that the child slices are of the same length, so such variable could contain an invalid matrix.
es: Además, el propio tipo no requeriría que los slices secundarios fueran de la misma longitud, por lo que dicha variable podría contener una matriz no válida.
ko: 또한, 슬라이스 타입은 길이를 포함하지 않기 때문에 한 단계 아래의 슬라이스들이 같은 길이임을 보장할 수 없습니다. 때문에 슬라이스 타입의 변수에는 잘못된 행렬이 전달될 수 있습니다.

source: Day 1 Afternoon Exercises
es: Día 1: Ejercicios de la Tarde
ko: 1일차 오후 연습문제

source: ([back to exercise](luhn.md))
es: ([volver al ejercicio](luhn.md))

source: Pattern matching
es: Correspondencia de Patrones

source: Day 2 Morning Exercises
es: Día 2: Ejercicios de la Mañana
ko: 2일차 오전 연습문제

source: Designing a Library
es: Diseñando una Librería
ko: 도서관 설계

source: ([back to exercise](book-library.md))
es: ([volver al ejercicio](book-library.md))

source: Day 2 Afternoon Exercises
es: Día 2: Ejercicios de la tarde
ko: 2일차 오후 연습문제

source: ([back to exercise](strings-iterators.md))
es: ([volver al ejercicio](strings-iterators.md))

source: Day 3 Morning Exercise
es: Día 3: Ejercicios de la mañana
ko: 3일차 오전 연습문제

source: ([back to exercise](simple-gui.md))
es: ([volver al ejercicio](simple-gui.md))

source: Day 3 Afternoon Exercises
es: Día 3: Ejercicios de la Tarde
ko: 3일차 오후 연습문제

source: ([back to exercise](safe-ffi-wrapper.md))
es: ([volver al ejercicio](safe-ffi-wrapper.md))

source: Stack vs Heap
ko: 스택(Stack)과 힙(Heap)

source: Comparison
ko: 비교

source: Cell/RefCell
ko: Cell과 RefCell

source: impl Trait
ko: 트레잇 구현하기

source: Closures: Fn, FnMut, FnOnce
ko: 클로저: Fn, FnMut, FnOnce

source: Catching Stack Unwinding
ko: 스택 되감기

source: probe-rs, cargo-embed
ko: progo-rs, cargo-embed

source: Build workflow
ko: 빌드 워크플로

source: GitHub contributors
ko: GitHub 참여자

source: The course is fast paced and covers a lot of ground:
ko: 강의는 빠른 속도로 진행되며, 아래 내용들을 다룹니다:

source: Day 1: Basic Rust, ownership and the borrow checker.
ko: 1일차: 러스트 기본, 소유권(ownership)과 빌림(borrow) 체크.

source: Day 2: Compound data types, pattern matching, the standard library.
ko: 2일차: 복합 데이터 유형, 패턴 매칭, 표준 라이브러리.

source: Day 3: Traits and generics, error handling, testing, unsafe Rust.
ko: 3일차: 트레잇(trait)와 제네릭(generic), 오류 처리, 테스트, 안전하지 않은 러스트.

source: The [Android Deep Dive](../android.md) is a half-day course on using Rust for Android platform development. This includes interoperability with C, C++, and Java.
ko: [Android 심화 학습](../android.md)는 Android 플랫폼 개발 시 Rust 사용에 관한 반나절 과정입니다. 여기에는 C, C++, Java와의 상호 운용성이 포함됩니다.

source: The [Bare-Metal Deep Dive](../bare-metal.md): a full day class on using Rust for bare-metal (embedded) development. Both microcontrollers and application processors are covered.
ko: [Bare-Metal 심화 학습](../bare-metal.md): bare-metal(임베디드) 개발 시 Rust 사용에 관한 종일 과정입니다. 마이크로컨트롤러와 애플리케이션 프로세서를 모두 다룹니다.

source: Concurrency
ko: 동시성

source: The [Concurrency Deep Dive](../concurrency.md) is a full day class on classical as well as `async`/`await` concurrency.
ko: [동시성 심화학습](../concurrency.md)은 고전적인 동시성 및 `async`/`await` 동시성을 다루는 종일 과정입니다.

source: [Brazilian Portuguese](https://google.github.io/comprehensive-rust/pt-BR/) by [@rastringer](https://github.com/rastringer), [@hugojacob](https://github.com/hugojacob), [@joaovicmendes](https://github.com/joaovicmendes) and [@henrif75](https://github.com/henrif75).
ko: [브라질 포르투갈어](https://google.github.io/comprehensive-rust/pt-BR/): [@rastringer](https://github.com/rastringer), [@hugojacob](https://github.com/hugojacob), [@joaovicmendes](https://github.com/joaovicmendes) 그리고 [@henrif75](https://github.com/henrif75)가 제공.

source: [Korean](https://google.github.io/comprehensive-rust/ko/) by [@keispace](https://github.com/keispace), [@jiyongp](https://github.com/jiyongp) and [@jooyunghan](https://github.com/jooyunghan).
ko: [한국어](https://google.github.io/comprehensive-rust/ko/): [@keispace](https://github.com/keispace), [@jiyongp](https://github.com/jiyongp) 그리고 [@jooyunghan](https://github.com/jooyunghan)가 제공.

source: We suggest using [VS Code](https://code.visualstudio.com/) to edit the code (but any LSP compatible editor works with rust-analyzer[3](https://rust-analyzer.github.io/)).
ko: 우리는 코드 에디터로 [VS Code](https://code.visualstudio.com/)를 추천합니다. 그러나 LSP를 지원하는 (그래서 rust-analyzer[3](https://rust-analyzer.github.io/)와 연동이 가능한) 에디터라면 어떤 것이라도 괜찮습니다.

source: ```rust,editable fn main() { let mut a: [i32; 6] = [10, 20, 30, 40, 50, 60]; println!("a: {a:?}"); let s: &[i32] = &a[2..4]; println!("s: {s:?}"); } ```
ko: ```rust,editable fn main() { let a: [i32; 6] = [10, 20, 30, 40, 50, 60]; println!("a: {a:?}"); let s: &[i32] = &a[2..4]; println!("s: {s:?}"); } ```

source: ```rust,editable /// Determine whether the first argument is divisible by the second argument. /// /// If the second argument is zero, the result is false. fn is_divisible_by(lhs: u32, rhs: u32) -> bool { if rhs == 0 { return false; // Corner case, early return } lhs % rhs == 0 // The last expression in a block is the return value } ```
ko: ```rust,editable /// 첫 번째 인수가 두 번째 인수로 나눠질 수 있는지 결정합니다. /// /// 두 번째 인수가 0이면 결과는 false입니다. fn is_divisible_by(lhs: u32, rhs: u32) -> bool { if rhs == 0 { return false; // Corner case, early return } lhs % rhs == 0 // 블록 안의 마지막 표현식은 반환값입니다 } ```

source: After looking at the exercises, you can look at the \[solutions\] provided.
ko: 연습문제를 살펴 본 후, 제공된 \[해답\]\[solutions\]을 살펴볼 수 있습니다.

source: ```rust,should_panic // TODO: remove this when you're done with your implementation. #![allow(unused_variables, dead_code)] fn transpose(matrix: [[i32; 3]; 3]) -> [[i32; 3]; 3] { unimplemented!() } fn pretty_print(matrix: &[[i32; 3]; 3]) { unimplemented!() } fn main() { let matrix = [ [101, 102, 103], // <-- the comment makes rustfmt add a newline [201, 202, 203], [301, 302, 303], ]; println!("matrix:"); pretty_print(&matrix); let transposed = transpose(matrix); println!("transposed:"); pretty_print(&transposed); } ```
ko: ```rust,should_panic // TODO: 구현이 완료되면 아래 줄은 삭제합니다. #![allow(unused_variables, dead_code)] fn transpose(matrix: [[i32; 3]; 3]) -> [[i32; 3]; 3] { unimplemented!() } fn pretty_print(matrix: &[[i32; 3]; 3]) { unimplemented!() } fn main() { let matrix = [ [101, 102, 103], // <-- the comment makes rustfmt add a newline [201, 202, 203], [301, 302, 303], ]; println!("matrix:"); pretty_print(&matrix); let transposed = transpose(matrix); println!("transposed:"); pretty_print(&transposed); } ```

source: `const`
ko: 상수(`const`)

source: `static`
ko: 정적변수(`static`)

source: Depending on which abstraction (or combination of abstractions) you choose, can be a single unique pointer, reference counted, or atomically reference counted.
ko: 다양한 추상화를 제공합니다: 단일 포인터, 참조 카운트, 아토믹(atomic) 참조 카운트.

source: Here is a rough comparison of the memory management techniques.
ko: 메모리 관리 기술의 대략적인 비교입니다.

source: Pros of Different Memory Management Techniques
ko: 메모리 관리 방법 별 장점

source: Manual like C:
ko: C와 같은 수동 관리:

source: No runtime overhead.
ko: 런타임 오버헤드가 없음.

source: Automatic like Java:
ko: JAVA와 같은 자동화 관리:

source: Fully automatic.
ko: 완전한 자동화.

source: Safe and correct.
ko: 안전하고 정확함.

source: Scope-based like C++:
ko: C++ 와 같은 범위 기반 관리:

source: Partially automatic.
ko: 부분 자동화.

source: Compiler-enforced scope-based like Rust:
ko: 러스트와 같은 컴파일러 수행 범위 기반 관리:

source: Enforced by compiler.
ko: 컴파일러에 의해 수행됩니다.

source: Cons of Different Memory Management Techniques
ko: 메모리 관리 방법 별 단점

source: Use-after-free.
ko: 사용 후 해제 문제.

source: Double-frees.
ko: 이중 해제 문제.

source: Memory leaks.
ko: 메모리 누출 문제.

source: Garbage collection pauses.
ko: GC동작으로 인한 멈춤.

source: Destructor delays.
ko: 소멸자 지연 (_역주_: 특정 메모리를 더이상 사용하지 않더라도 곧바로 해제 되지 않고 GC가 동작할 때 까지 기다려야 한다는 점)

source: Complex, opt-in by programmer (on C++).
ko: 복잡하며, 개발자의 선택사항임.

source: Circular references can lead to memory leaks
ko: 순환 참조가 발생하면 메모리 누수가 발생함

source: Potential runtime overhead
ko: 런타임 오버헤드 있을 수 있음

source: Compiler-enforced and scope-based like Rust:
ko: 러스트와 같은 컴파일러가 강제하는 수행 범위 기반 관리:

source: Some upfront complexity.
ko: 처음에 배울 때 어려움.

source: Can reject valid programs.
ko: 올바른 프로그램이더라도 컴파일러가 거부할 수 있음.

source: Extra Work in Modern C++
ko: Modern C++에서 이중해제 문제

source: A small book library,
ko: 작은 도서관,

source: Iterators and ownership (hard).
ko: 반복자와 소유권 (어려움)

source: Structs, enums, methods.
ko: 구조체, 열거형, 메서드.

source: ```rust,editable enum WebEvent { PageLoad, // Variant without payload KeyPress(char), // Tuple struct variant Click { x: i64, y: i64 }, // Full struct variant } #[rustfmt::skip] fn inspect(event: WebEvent) { match event { WebEvent::PageLoad => println!("page loaded"), WebEvent::KeyPress(c) => println!("pressed '{c}'"), WebEvent::Click { x, y } => println!("clicked at x={x}, y={y}"), } } fn main() { let load = WebEvent::PageLoad; let press = WebEvent::KeyPress('x'); let click = WebEvent::Click { x: 20, y: 80 }; inspect(load); inspect(press); inspect(click); } ```
ko: ```rust,editable enum WebEvent { PageLoad, // 페이로드가 없는 유형 KeyPress(char), // 튜플 구조체 유형 Click { x: i64, y: i64 }, // 완전한 구조체 유형 } #[rustfmt::skip] fn inspect(event: WebEvent) { match event { WebEvent::PageLoad => println!("page loaded"), WebEvent::KeyPress(c) => println!("pressed '{c}'"), WebEvent::Click { x, y } => println!("clicked at x={x}, y={y}"), } } fn main() { let load = WebEvent::PageLoad; let press = WebEvent::KeyPress('x'); let click = WebEvent::Click { x: 20, y: 80 }; inspect(load); inspect(press); inspect(click); } ```

source: Simple struct which tracks health statistics.
ko: 건강 상태 통계를 추적하는 프로그램의 간단한 구조체.

source: Multiple structs and enums for a drawing library.
ko: 드로잉 라이브러리를 위한 구조체 및 열거헝.

source: `for` loops
ko: `for` 반복문

source: ```rust,editable fn main() { let mut v1 = Vec::new(); v1.push(42); println!("v1: len = {}, capacity = {}", v1.len(), v1.capacity()); let mut v2 = Vec::with_capacity(v1.len() + 1); v2.extend(v1.iter()); v2.push(9999); println!("v2: len = {}, capacity = {}", v2.len(), v2.capacity()); // Canonical macro to initialize a vector with elements. let mut v3 = vec![0, 0, 1, 2, 3, 4]; // Retain only the even elements. v3.retain(|x| x % 2 == 0); println!("{v3:?}"); // Remove consecutive duplicates. v3.dedup(); println!("{v3:?}"); } ```
ko: ```rust,editable fn main() { let mut v1 = Vec::new(); v1.push(42); println!("v1: len = {}, capacity = {}", v1.len(), v1.capacity()); let mut v2 = Vec::with_capacity(v1.len() + 1); v2.extend(v1.iter()); v2.push(9999); println!("v2: len = {}, capacity = {}", v2.len(), v2.capacity()); // 요소로 벡터를 초기화하는 표준 매크로입니다. let mut v3 = vec![0, 0, 1, 2, 3, 4]; // 짝수 요소만 유지합니다. v3.retain(|x| x % 2 == 0); println!("{v3:?}"); // 연속 중복을 삭제합니다. v3.dedup(); println!("{v3:?}"); } ```

source: ```rust,editable use std::collections::HashMap; fn main() { let mut page_counts = HashMap::new(); page_counts.insert("Adventures of Huckleberry Finn".to_string(), 207); page_counts.insert("Grimms' Fairy Tales".to_string(), 751); page_counts.insert("Pride and Prejudice".to_string(), 303); if !page_counts.contains_key("Les Misérables") { println!("We know about {} books, but not Les Misérables.", page_counts.len()); } for book in ["Pride and Prejudice", "Alice's Adventure in Wonderland"] { match page_counts.get(book) { Some(count) => println!("{book}: {count} pages"), None => println!("{book} is unknown.") } } // Use the .entry() method to insert a value if nothing is found. for book in ["Pride and Prejudice", "Alice's Adventure in Wonderland"] { let page_count: &mut i32 = page_counts.entry(book.to_string()).or_insert(0); *page_count += 1; } println!("{page_counts:#?}"); } ```
ko: ```rust,editable use std::collections::HashMap; fn main() { let mut page_counts = HashMap::new(); page_counts.insert("Adventures of Huckleberry Finn".to_string(), 207); page_counts.insert("Grimms' Fairy Tales".to_string(), 751); page_counts.insert("Pride and Prejudice".to_string(), 303); if !page_counts.contains_key("Les Misérables") { println!("We know about {} books, but not Les Misérables.", page_counts.len()); } for book in ["Pride and Prejudice", "Alice's Adventure in Wonderland"] { match page_counts.get(book) { Some(count) => println!("{book}: {count} pages"), None => println!("{book} is unknown.") } } // 아무것도 찾을 수 없는 경우 .entry() 메서드를 사용하여 값을 삽입합니다. for book in ["Pride and Prejudice", "Alice's Adventure in Wonderland"] { let page_count: &mut i32 = page_counts.entry(book.to_string()).or_insert(0); *page_count += 1; } println!("{page_counts:#?}"); } ```

source: ```bob Stack Heap .- - - - - - -. .- - - - - - -. : : : : : five : : : : +-----+ : : +-----+ : : | o---|---+-----+-->| 5 | : : +-----+ : : +-----+ : : : : : : : : : `- - - - - - -' `- - - - - - -' ```
ko: ```bob 스택 힙 .- - - - - - -. .- - - - - - -. : : : : : five : : : : +-----+ : : +-----+ : : | o---|---+-----+-->| 5 | : : +-----+ : : +-----+ : : : : : : : : : `- - - - - - -' `- - - - - - -' ```

source: ```bob Stack Heap .- - - - - - - - - - - - -. .- - - - - - - - - - - - - - - - - - - - - - - -. : : : : : list : : : : +------+----+----+ : : +------+----+----+ +------+----+----+ : : | Cons | 1 | o--+----+-----+--->| Cons | 2 | o--+--->| Nil | // | // | : : +------+----+----+ : : +------+----+----+ +------+----+----+ : : : : : : : : : '- - - - - - - - - - - - -' '- - - - - - - - - - - - - - - - - - - - - - - -' ```
ko: ```bob 스택 힙 .- - - - - - - - - - - - -. .- - - - - - - - - - - - - - - - - - - - - - - -. : : : : : list : : : : +------+----+----+ : : +------+----+----+ +------+----+----+ : : | Cons | 1 | o--+----+-----+--->| Cons | 2 | o--+--->| Nil | // | // | : : +------+----+----+ : : +------+----+----+ +------+----+----+ : : : : : : : : : '- - - - - - - - - - - - -' '- - - - - - - - - - - - - - - - - - - - - - - -' ```

source: ```bob Stack Heap .- - - - - - - - - - - - -. .- - - - - - - - - - - - - - - - - - - - - - -. : : : : : list : : : : +----+----+ : : +----+----+ +----+------+ : : | 1 | o--+-----------+-----+--->| 2 | o--+--->| // | null | : : +----+----+ : : +----+----+ +----+------+ : : : : : : : : : `- - - - - - - - - - - - -' '- - - - - - - - - - - - - - - - - - - - - - -' ```
ko: ```bob 스택 힙 .- - - - - - - - - - - - -. .- - - - - - - - - - - - - - - - - - - - - - -. : : : : : list : : : : +----+----+ : : +----+----+ +----+------+ : : | 1 | o--+-----------+-----+--->| 2 | o--+--->| // | null | : : +----+----+ : : +----+----+ +----+------+ : : : : : : : : : `- - - - - - - - - - - - -' '- - - - - - - - - - - - - - - - - - - - - - -' ```

source: \[`Cell`\]\[https://doc.rust-lang.org/std/cell/struct.Cell.html\] and [`RefCell`](https://doc.rust-lang.org/std/cell/struct.RefCell.html) implement what Rust calls _interior mutability:_ mutation of values in an immutable context.
ko: [`Cell`](https://doc.rust-lang.org/std/cell/struct.Cell.html 과 [`RefCell`](https://doc.rust-lang.org/std/cell/struct.RefCell.html)은 러스트에서 _내적 가변성(interior mutability)_이라고 부르는 것을 구현합니다. 이를 이용하면 불변인 객체의 값을 수정할 수 있습니다.

source: ```rust,editable,compile_fail //! This module implements the garden, including a highly performant germination //! implementation. // Re-export types from this module. pub use seeds::SeedPacket; pub use garden::Garden; /// Sow the given seed packets. pub fn sow(seeds: Vec<SeedPacket>) { todo!() } /// Harvest the produce in the garden that is ready. pub fn harvest(garden: &mut Garden) { todo!() } ```
ko: ```rust,editable,compile_fail //! 이 모듈은 높은 성능의 발아 구현을 비롯하여 정원을 //! 구현합니다. // 이 모듈에 정의된 타입을 밖으로 공개합니다. pub use seeds::SeedPacket; pub use garden::Garden; /// 지정된 씨앗 패킷을 뿌립니다. pub fn sow(seeds: Vec<SeedPacket>) { todo!() } /// 정원에서 준비된 농산물을 수확합니다. pub fn harvest(garden: &mut Garden) { todo!() } ```

source: After doubling a digit, sum the digits. So doubling `7` becomes `14` which becomes `5`.
ko: 두배로 만든 숫자가 2자리라면 각 자리 숫자를 더합니다. 예를 들어, `7`은 두배로 만들면 `14`이므로 `5`가 됩니다.

source: ```bob Stack Heap .- - - - - - - - - - - - - -. .- - - - - - - - - - - - - - - - - - - - - - -. : : : : : pets : : : : +-----------+-------+ : : +-----+-----+ : : | ptr | o---+---+-----+-->| o o | o o | : : | len | 2 | : : +-|-|-+-|-|-+ : : | capacity | 2 | : : | | | | +---------------+ : : +-----------+-------+ : : | | | '-->| name: "Fido" | : : : : | | | +---------------+ : `- - - - - - - - - - - - - -' : | | | : : | | | +----------------------+ : : | | '---->| "<Dog as Pet>::name" | : : | | +----------------------+ : : | | : : | | +-+ : : | '-->|\| : : | +-+ : : | : : | +----------------------+ : : '---->| "<Cat as Pet>::name" | : : +----------------------+ : : : '- - - - - - - - - - - - - - - - - - - - - - -' ```
ko: ```bob 스택 힙 .- - - - - - - - - - - - - -. .- - - - - - - - - - - - - - - - - - - - - - -. : : : : : pets : : : : +-----------+-------+ : : +-----+-----+ : : | ptr | o---+---+-----+-->| o o | o o | : : | len | 2 | : : +-|-|-+-|-|-+ : : | capacity | 2 | : : | | | | +---------------+ : : +-----------+-------+ : : | | | '-->| name: "Fido" | : : : : | | | +---------------+ : `- - - - - - - - - - - - - -' : | | | : : | | | +----------------------+ : : | | '---->| "<Dog as Pet>::name" | : : | | +----------------------+ : : | | : : | | +-+ : : | '-->|\| : : | +-+ : : | : : | +----------------------+ : : '---->| "<Cat as Pet>::name" | : : +----------------------+ : : : '- - - - - - - - - - - - - - - - - - - - - - -' ```

source: ```rust,editable fn duplicate<T: Clone>(a: T) -> (T, T) { (a.clone(), a.clone()) } // Syntactic sugar for: // fn add_42_millions<T: Into<i32>>(x: T) -> i32 { fn add_42_millions(x: impl Into<i32>) -> i32 { x.into() + 42_000_000 } // struct NotClonable; fn main() { let foo = String::from("foo"); let pair = duplicate(foo); println!("{pair:?}"); let many = add_42_millions(42_i8); println!("{many}"); let many_more = add_42_millions(10_000_000); println!("{many_more}"); } ```
ko: ```rust,editable fn duplicate<T: Clone>(a: T) -> (T, T) { (a.clone(), a.clone()) } // 다음에 대한 문법 슈가: // fn add_42_millions<T: Into<i32>>(x: T) -> i32 { fn add_42_millions(x: impl Into<i32>) -> i32 { x.into() + 42_000_000 } // struct NotClonable; fn main() { let foo = String::from("foo"); let pair = duplicate(foo); println!("{pair:?}"); let many = add_42_millions(42_i8); println!("{many}"); let many_more = add_42_millions(10_000_000); println!("{many_more}"); } ```

source: We will design a classical GUI library traits and trait objects.
ko: 이번 연습문제에서는 트레잇와 트레잇 객체를 통해 고전적인 GUI 라이브러리를 설계할 것입니다.

source: ```rust,editable static mut COUNTER: u32 = 0; fn add_to_counter(inc: u32) { unsafe { COUNTER += inc; } // Potential data race! } fn main() { add_to_counter(42); unsafe { println!("COUNTER: {COUNTER}"); } // Potential data race! } ```
ko: ```rust,editable static mut COUNTER: u32 = 0; fn add_to_counter(inc: u32) { unsafe { COUNTER += inc; } // 잠재적 데이터 경합! } fn main() { add_to_counter(42); unsafe { println!("COUNTER: {COUNTER}"); } // 잠재적 데이터 경합! } ```

source: ```rust //! Rust demo. /// Prints a greeting to standard output. fn main() { println!("Hello from Rust!"); } ```
ko: ```rust //! Rust 데모입니다. /// 인사말을 표준 출력으로 인쇄합니다. fn main() { println!("Hello from Rust!"); } ```

source: ```java package com.example.birthdayservice; /** Birthday service interface. */ interface IBirthdayService { /** Generate a Happy Birthday message. */ String wishHappyBirthday(String name, int years); } ```
ko: ```java package com.example.birthdayservice; /** 생일 서비스 인터페이스입니다. */ interface IBirthdayService { /** Generate a Happy Birthday message. */ String wishHappyBirthday(String name, int years); } ```

source: ```rust,ignore //! Implementation of the `IBirthdayService` AIDL interface. use com_example_birthdayservice::aidl::com::example::birthdayservice::IBirthdayService::IBirthdayService; use com_example_birthdayservice::binder; /// The `IBirthdayService` implementation. pub struct BirthdayService; impl binder::Interface for BirthdayService {} impl IBirthdayService for BirthdayService { fn wishHappyBirthday(&self, name: &str, years: i32) -> binder::Result<String> { Ok(format!( "Happy Birthday {name}, congratulations with the {years} years!" )) } } ```
ko: ```rust,ignore //! `IBirthdayService` AIDL 인터페이스의 구현입니다. use com_example_birthdayservice::aidl::com::example::birthdayservice::IBirthdayService::IBirthdayService; use com_example_birthdayservice::binder; /// `IBirthdayService` 구현입니다. pub struct BirthdayService; impl binder::Interface for BirthdayService {} impl IBirthdayService for BirthdayService { fn wishHappyBirthday(&self, name: &str, years: i32) -> binder::Result<String> { Ok(format!( "Happy Birthday {name}, congratulations with the {years} years!" )) } } ```

source: ```rust,ignore //! Birthday service. use birthdayservice::BirthdayService; use com_example_birthdayservice::aidl::com::example::birthdayservice::IBirthdayService::BnBirthdayService; use com_example_birthdayservice::binder; const SERVICE_IDENTIFIER: &str = "birthdayservice"; /// Entry point for birthday service. fn main() { let birthday_service = BirthdayService; let birthday_service_binder = BnBirthdayService::new_binder( birthday_service, binder::BinderFeatures::default(), ); binder::add_service(SERVICE_IDENTIFIER, birthday_service_binder.as_binder()) .expect("Failed to register service"); binder::ProcessState::join_thread_pool() } ```
ko: ```rust,ignore //! 생일 서비스입니다. use birthdayservice::BirthdayService; use com_example_birthdayservice::aidl::com::example::birthdayservice::IBirthdayService::BnBirthdayService; use com_example_birthdayservice::binder; const SERVICE_IDENTIFIER: &str = "birthdayservice"; /// 생일 서비스의 진입점입니다. fn main() { let birthday_service = BirthdayService; let birthday_service_binder = BnBirthdayService::new_binder( birthday_service, binder::BinderFeatures::default(), ); binder::add_service(SERVICE_IDENTIFIER, birthday_service_binder.as_binder()) .expect("Failed to register service"); binder::ProcessState::join_thread_pool() } ```

source: ```rust,ignore //! Birthday service. use com_example_birthdayservice::aidl::com::example::birthdayservice::IBirthdayService::IBirthdayService; use com_example_birthdayservice::binder; const SERVICE_IDENTIFIER: &str = "birthdayservice"; /// Connect to the BirthdayService. pub fn connect() -> Result<binder::Strong<dyn IBirthdayService>, binder::StatusCode> { binder::get_interface(SERVICE_IDENTIFIER) } /// Call the birthday service. fn main() -> Result<(), binder::Status> { let name = std::env::args() .nth(1) .unwrap_or_else(|| String::from("Bob")); let years = std::env::args() .nth(2) .and_then(|arg| arg.parse::<i32>().ok()) .unwrap_or(42); binder::ProcessState::start_thread_pool(); let service = connect().expect("Failed to connect to BirthdayService"); let msg = service.wishHappyBirthday(&name, years)?; println!("{msg}"); Ok(()) } ```
ko: ```rust,ignore //! 생일 서비스입니다. use com_example_birthdayservice::aidl::com::example::birthdayservice::IBirthdayService::IBirthdayService; use com_example_birthdayservice::binder; const SERVICE_IDENTIFIER: &str = "birthdayservice"; /// BirthdayService에 연결합니다. pub fn connect() -> Result<binder::Strong<dyn IBirthdayService>, binder::StatusCode> { binder::get_interface(SERVICE_IDENTIFIER) } /// 생일 서비스를 호출합니다. fn main() -> Result<(), binder::Status> { let name = std::env::args() .nth(1) .unwrap_or_else(|| String::from("Bob")); let years = std::env::args() .nth(2) .and_then(|arg| arg.parse::<i32>().ok()) .unwrap_or(42); binder::ProcessState::start_thread_pool(); let service = connect().expect("Failed to connect to BirthdayService"); let msg = service.wishHappyBirthday(&name, years)?; println!("{msg}"); Ok(()) } ```
