Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Closures or lambda expressions have types which cannot be named. However, they implement special [`Fn`](https://doc.rust-lang.org/std/ops/trait.Fn.html), [`FnMut`](https://doc.rust-lang.org/std/ops/trait.FnMut.html), and [`FnOnce`](https://doc.rust-lang.org/std/ops/trait.FnOnce.html) traits:
es: Los cierres o expresiones lambda tienen tipos que no pueden nombrarse. Sin embargo, implementan _traits_ especiales [`Fn`](https://doc.rust-lang.org/std/ops/trait.Fn.html), [`FnMut`](https://doc.rust-lang.org/std/ops/trait.FnMut.html) y [`FnOnce`](https://doc.rust-lang.org/std/ops/trait.FnOnce.html):
fa: بسته‌ها یا عبارات لامبدا تایپ‌هایی دارند که نمی‌توان نام‌گذاری کرد. با این حال، آن‌ها پیاده‌سازی‌های ویژه از traits [`Fn`](https://doc.rust-lang.org/std/ops/trait.Fn.html)، [`FnMut`](https://doc.rust-lang.org/std/ops/trait.FnMut.html) و [`FnOnce`](https://doc.rust-lang.org/std/ops/trait.FnOnce.html) هستند:
ja: クロージャやラムダ式には、名前を付けることができない型があります。ただし、これらは特別な [`Fn`](https://doc.rust-lang.org/std/ops/trait.Fn.html)、[`FnMut`](https://doc.rust-lang.org/std/ops/trait.FnMut.html)、[`FnOnce`](https://doc.rust-lang.org/std/ops/trait.FnOnce.html) トレイトを備えています。
ko: 클로저 혹은 람다표현식은 익명타입입니다. 이들은 [`Fn`](https://doc.rust-lang.org/std/ops/trait.Fn.html),[`FnMut`](https://doc.rust-lang.org/std/ops/trait.FnMut.html), [`FnOnce`](https://doc.rust-lang.org/std/ops/trait.FnOnce.html) 라는 특별한 트레잇을 구현합니다:
pt_br: Closures ou expressões _lambda_ têm tipos que não podem ser nomeados. No entanto, eles implementam os _traits_ especiais [`Fn`](https://doc.rust-lang.org/std/ops/trait.Fn.html), [`FnMut`](https://doc.rust-lang.org/std/ops/trait.FnMut.html) e [`FnOnce`](https://doc.rust-lang.org/std/ops/trait.FnOnce.html):
uk: Замикання або лямбда-вирази мають типи, які не можна назвати. Однак вони реалізують спеціальні [`Fn`](https://doc.rust-lang.org/std/ops/trait.Fn.html), [`FnMut`](https://doc.rust-lang.org/std/ops/trait.FnMut.html) і [`FnOnce`](https://doc.rust-lang.org/std/ops/trait.FnOnce.html) трейти:

source: "Calling {func_name}({input}): {}"
fa: "فراخوانی {func_name}({input}): {}"
uk: "Викликаємо {func_name}({input}): {}"

source: An `Fn` (e.g. `add_3`) neither consumes nor mutates captured values. It can be called needing only a shared reference to the closure, which means the closure can be executed repeatedly and even concurrently.
uk: `Fn` (наприклад, `add_3`) не споживає і не змінює захоплені значення. Вона може бути викликана, потребуючи лише спільного посилання на закриття, що означає, що замикання може бути виконано багаторазово і навіть одночасно.

source: An `FnMut` (e.g. `accumulate`) might mutate captured values. The closure object is accessed via exclusive reference, so it can be called repeatedly but not concurrently.
uk: `FnMut` (наприклад, `accumulate`) може змінити захоплені значення. Доступ до об'єкта замикання здійснюється за ексклюзивним посиланням, тому його можна викликати багаторазово, але не одночасно.

source: If you have an `FnOnce` (e.g. `multiply_sum`), you may only call it once. Doing so consumes the closure and any values captured by move.
uk: Якщо у вас є `FnOnce` (наприклад, `multiply_sum`), ви можете викликати ії лише один раз. У такому випадку замикання поглинається разом з усіма значеннями, захопленими під час переміщення.

source: `FnMut` is a subtype of `FnOnce`. `Fn` is a subtype of `FnMut` and `FnOnce`. I.e. you can use an `FnMut` wherever an `FnOnce` is called for, and you can use an `Fn` wherever an `FnMut` or `FnOnce` is called for.
es: `FnMut` es un subtipo de `FnOnce`, mientras que `Fn` es un subtipo de `FnMut` y `FnOnce`. Es decir, puedes utilizar un `FnMut` siempre que se llame a un `FnOnce`, y puedes usar un `Fn` siempre que se llame a un `FnMut` o a un `FnOnce`.
fa: `FnMut` یک زیرتایپ از `FnOnce` است. `Fn` نیز یک زیرتایپ از `FnMut` و `FnOnce` است. به عبارت دیگر، می‌توانید از `FnMut` در جایی که `FnOnce` نیاز است استفاده کنید و از `Fn` در جایی که `FnMut` یا `FnOnce` نیاز است استفاده کنید.
ja: `FnMut` は `FnOnce` のサブタイプで、`Fn` は `FnMut` と `FnOnce` のサブタイプです。つまり、`FnOnce` が呼び出される場合は常に `FnMut` を使用でき、`FnMut` または `FnOnce` が呼び出される場合は常に `Fn` を使用できます。
ko: `FnMut` 는 `FnOnce`의 하위타입입니다. `Fn`은 `FnMut`과 `FnOnce`의 하위 타입입니다. 즉, `FnMut`는 `FnOnce`가 호출되는 곳이면 어디서나 사용 할 수 있고 `Fn`은 `FnMut`와 `FnOnce`가 호출되는 곳이면 어디든 사용할 수 있습니다.
pt_br: `FnMut` é um subtipo de `FnOnce`. `Fn` é um subtipo de `FnMut` e `FnOnce`. Ou seja, você pode usar um `FnMut` sempre que um `FnOnce` é chamado e você pode usar um `Fn` sempre que um `FnMut` ou um `FnOnce` é chamado.
uk: `FnMut` є підтипом `FnOnce`. `Fn` є підтипом `FnMut` і `FnOnce`. Тобто ви можете використовувати `FnMut` усюди, де викликається `FnOnce`, і ви можете використовувати `Fn` усюди, де викликається `FnMut` або `FnOnce`.

source: When you define a function that takes a closure, you should take `FnOnce` if you can (i.e. you call it once), or `FnMut` else, and last `Fn`. This allows the most flexibility for the caller.
fa: زمانی که تابعی تعریف می‌کنید که یک closure را می‌گیرد، باید از `FnOnce` استفاده کنید اگر فقط یک بار آن را فراخوانی می‌کنید (یعنی یک بار استفاده می‌شود)، یا از `FnMut` در غیر این صورت، و در نهایت از `Fn`. این کار بیشترین انعطاف‌پذیری را برای فراخوانی‌کننده فراهم می‌کند.
ja: クロージャを受け取る関数を定義する場合、可能であれば（1 回だけ呼び出す）`FnOnce` を使用し、次に `FnMut`、最後に `Fn` を使用するようにします。これにより、呼び出し元に最も柔軟に対応できます。
pt_br: Quando você define uma função que recebe um _closure_, você deve usar `FnOnce` se puder (ou seja, você o chama uma vez) ou `FnMut` caso contrário, e por último `Fn`. Isso permite a maior flexibilidade para o chamador.
uk: Коли ви визначаєте функцію, яка приймає закриття, вам слід використовувати `FnOnce`, якщо це можливо (тобто ви викликаєте її один раз), або `FnMut` в іншому випадку, і в останню чергу `Fn`. Це забезпечує найбільшу гнучкість для того, хто викликає функцію.

source: In contrast, when you have a closure, the most flexible you can have is `Fn` (which can be passed to a consumer of any of the 3 closure traits), then `FnMut`, and lastly `FnOnce`.
fa: در مقابل، زمانی که یک closure دارید، بیشترین انعطاف‌پذیری که می‌توانید داشته باشید `Fn` است (که می‌تواند در هر جایی استفاده شود)، سپس `FnMut` و در نهایت `FnOnce`.
uk: На противагу цьому, коли у вас є закриття, найбільш гнучким є `Fn` (яка може бути передана споживачеві будь-якої з 3 трейтів замикання), потім `FnMut` і, нарешті, `FnOnce`.

source: The compiler also infers `Copy` (e.g. for `add_3`) and `Clone` (e.g. `multiply_sum`), depending on what the closure captures. Function pointers (references to `fn` items) implement `Copy` and `Fn`.
uk: Компілятор також виводить `Copy` (наприклад, для `add_3`) і `Clone` (наприклад `multiply_sum`), залежно від того, що захоплює замикання. Покажчики функцій (посилання на елементи `fn`) реалізують `Copy` та `Fn`.

source: By default, closures will capture each variable from an outer scope by the least demanding form of access they can (by shared reference if possible, then exclusive reference, then by move). The `move` keyword forces capture by value.
fa: به صورت پیش‌فرض، بسته‌بندی‌ها (closures) هر متغیر از یک دامنه بیرونی را با کمترین سطح دسترسی ممکن (با ارجاع مشترک اگر ممکن باشد، سپس ارجاع انحصاری، سپس با انتقال) capture می‌کنند. کلیدواژه `move` یا انتقال، capture را به صورت value اجباری می‌کند.
uk: За замовчуванням замикання захоплюють кожну змінну із зовнішньої області видимості найменш вибагливою формою доступу (за спільним посиланням, якщо це можливо, потім за ексклюзивним посиланням, потім за переміщенням). Ключове слово `move` змушує захоплювати за значенням.

source: "Hi"
pt_br: "Olá"
uk: "Привіт"

source: "Greg"
uk: " Грег"

source: In this example, you will implement the classic ["ROT13" cipher](https://en.wikipedia.org/wiki/ROT13). Copy this code to the playground, and implement the missing bits. Only rotate ASCII alphabetic characters, to ensure the result is still valid UTF-8.
fa: در این مثال، شما الگوریتم کلاسیک [رمزگذاری "ROT13"](https://en.wikipedia.org/wiki/ROT13) را پیاده‌سازی خواهید کرد. این کد را به محیط Playground کپی کرده و بخش‌های ناقص آن را پیاده‌سازی کنید. تنها حروف الفبای ASCII را بچرخانید تا نتیجه همچنان UTF-8 معتبر باقی بماند.
ja: この例では、古典的な [「ROT13」暗号](https://en.wikipedia.org/wiki/ROT13)を実装します。このコードをプレイグラウンドにコピーし、欠落しているビットを実装してください。結果が有効な UTF-8 のままになるように、ASCII アルファベット文字のみをローテーションします。
pt_br: Neste exemplo, você implementará o clássico [cifra "ROT13"](https://pt.wikipedia.org/wiki/ROT13). Copie este código para o playground e implemente as partes que faltam. Apenas rotacione caracteres alfabéticos ASCII para garantir que o resultado ainda seja UTF-8 válido.
uk: У цьому прикладі ви будете реалізовувати класичний ["ROT13" шифр](https://en.wikipedia.org/wiki/ROT13). Скопіюйте цей код на ігровий майданчик і додайте біти, яких бракує. Перевертайте лише символи ASCII, щоб результат залишався дійсним UTF-8.

source: // Implement the `Read` trait for `RotDecoder`.
ja: // `RotDecoder` の `Read` トレイトを実装します。
pt_br: // Implemente o trait `Read` para `RotDecoder`.
uk: // Реалізуйте трейт `Read` для `RotDecoder`.

source: What happens if you chain two `RotDecoder` instances together, each rotating by 13 characters?
fa: چه اتفاقی می‌افتد اگر دو نمونه از `RotDecoder` را به‌هم متصل کنید که هر کدام ۱۳ کاراکتر را بچرخانند؟
ja: それぞれが 13 文字ずつローテーションされる 2 つの `RotDecoder` インスタンスを連結するとどうなるでしょうか。
pt_br: O que acontece se você encadear duas instâncias de `RotDecoder`, cada uma rotacionando 13 caracteres?
uk: Що станеться, якщо зімкнути два екземпляри `RotDecoder'а разом, кожен з яких буде обертатися на 13 символів?

source: Welcome to Day 3
es: Te damos la Bienvenida al Día 3
fa: به روز ۳ خوش آمدید
ja: 3 日目のトレーニングにようこそ
ko: 3일차 개요
pt_br: Bem-vindo ao Dia 3
uk: Ласкаво просимо до дня 3

source: Today, we will cover:
fa: امروز، ما به بررسی خواهیم پرداخت:
ja: 本日の内容:
pt_br: Hoje, vamos cobrir:
uk: Сьогодні ми розглянемо:

source: Memory management, lifetimes, and the borrow checker: how Rust ensures memory safety.
fa: مدیریت حافظه، طول عمرها و بررسی‌کننده قرض‌گیری (borrow checker): چگونه زبان Rust از ایمنی حافظه اطمینان حاصل می‌کند.
ja: メモリ管理、ライフタイム、借用チェッカー: Rust がメモリの安全性を確保する仕組み。
pt_br: Gerenciamento de memória, tempos de vida (_lifetimes_) e o verificador de empréstimo (_borrow checker_): como o Rust garante a segurança da memória.
uk: Керування пам'яттю, час існування та перевірка запозичень: як Rust гарантує безпеку пам'яті.

source: Smart pointers: standard library pointer types.
fa: اشاره‌گر هوشمند: تایپ‌های اشاره‌گر در کتابخانه استاندارد.
ja: スマートポインタ: 標準ライブラリのポインタ型。
pt_br: Ponteiros inteligentes (_smart pointers_): tipos de ponteiros da biblioteca padrão.
uk: Розумні вказівники: стандартні бібліотечні типи вказівників.

source: Programs allocate memory in two ways:
fa: برنامه‌ها حافظه را به دو روش تخصیص می‌دهند:
ja: プログラムは、次の 2 つの方法でメモリを割り当てます。
pt_br: Os programas alocam memória de duas maneiras:
uk: Програми виділяють пам'ять двома способами:

source: Stack: Continuous area of memory for local variables.
es: _Stack_: Zona de memoria continua para las variables locales.
fa: Stack: بلوک پیوسته‌ای از حافظه که برای متغیرهای محلی (داخل یک تابع) استفاده می‌شود.
ja: スタック: ローカル変数用の連続したメモリ領域。
ko: 스택: 로컬 변수를 위한 연속적인 메모리 영역.
pt_br: Pilha: Área contínua de memória para variáveis locais.
uk: Стек: безперервна область пам'яті для локальних змінних.

source: Values have fixed sizes known at compile time.
es: Los valores tienen tamaños fijos conocidos en tiempo de compilación.
fa: مقادیر دارای اندازه‌های ثابتی هستند که در زمان کامپایل شناخته می‌شوند.
ja: 値のサイズは固定されており、コンパイル時に判明しています。
ko: 여기 저장되는 값은 컴파일 시 결정되는 고정 크기를 갖습니다.
pt_br: Os valores têm tamanhos fixos conhecidos em tempo de compilação.
uk: Значення мають фіксовані розміри, відомі під час компіляції.

source: Extremely fast: just move a stack pointer.
es: Muy rápida: mueve el _stack pointer_.
fa: بسیار سریع: فقط یک اشاره‌گر stack را جابجا کنید.
ja: 非常に高速: スタック ポインタを移動するだけです。
ko: 매우 빠름: 메모리 할당/반환이 단지 스택 포인터의 이동만으로 구현됩니다.
pt_br: Extremamente rápida: basta mover um ponteiro de pilha.
uk: Надзвичайно швидко: просто перемістіть вказівник стека.

source: Easy to manage: follows function calls.
es: Fácil de gestionar: sigue las llamadas de funciones.
fa: مدیریت آسان: پیرو فراخوانی‌های تابع است.
ja: 関数呼び出しによって行われるため、管理が容易です。
ko: 관리가 쉬움: 함수가 호출되면 할당되고, 리턴하면 반환됩니다.
pt_br: Fácil de gerenciar: segue chamadas de função.
uk: Легко керувати: слідує за викликами функцій.

source: Great memory locality.
es: Excelente localidad de memoria.
fa: بهره‌وری عالی از حافظه.
ja: メモリ局所性に優れています。
ko: 스택에 있는 값들은 매우 높은 메모리 인접성을 가집니다.
pt_br: Ótima localidade de memória.
uk: Чудова локальність пам'яті.

source: Heap: Storage of values outside of function calls.
es: _Heap_: almacenamiento de valores fuera de las llamadas de funciones.
fa: Heap: ذخیره‌سازی مقادیر خارج از فراخوانی‌های تابع.
ja: ヒープ: 関数呼び出しに依存しない値の保持領域。
ko: 힙: 함수 호출/리턴과 상관 없이 유지되는 값이 저장되는 곳.
pt_br: Heap: Armazenamento de valores fora das chamadas de função.
uk: Купа: Зберігання значень поза викликами функцій.

source: Values have dynamic sizes determined at runtime.
es: Los valores tienen tamaños dinámicos determinados en _runtime_.
fa: مقادیر دارای اندازه‌های پویا هستند که در زمان اجرا تعیین می‌شوند.
ja: 値のサイズは動的で、実行時に決定されます。
ko: 여기 저장되는 값은 프로그램 수행시 그 크기가 결정됩니다.
pt_br: Valores possuem tamanhos dinâmicos determinados em tempo de execução.
uk: Значення мають динамічні розміри, визначені під час виконання.

source: Slightly slower than the stack: some book-keeping needed.
es: Ligeramente más lento que el _stack_: requiere cierta trazabilidad.
fa: کمی کندتر از stack: نیاز به برخی از عملیات‌های مدیریتی دارد.
ja: スタックよりやや低速で、何らかののブックキーピングが必要です。
ko: 스택 보다는 느림: 메모리 할당/반환시 해야 할 일이 좀 더 있습니다.
pt_br: Ligeiramente mais devagar que a pilha: é necessário um pouco de gerenciamento.
uk: Трохи повільніше, ніж стек: потрібн певний облік.

source: No guarantee of memory locality.
es: No se puede asegurar la localidad de la memoria.
fa: هیچ تضمینی برای بهره‌وری بالا از حافظه ندارد.
ja: メモリの局所性が保証されません。
ko: 메모리 인접성을 보장하지 않습니다.
pt_br: Sem garantias de localidade de memória.
uk: Немає гарантії локальності пам'яті.

source: Creating a `String` puts fixed-sized metadata on the stack and dynamically sized data, the actual string, on the heap:
es: Al crear un `String`, los metadatos de tamaño fijo se colocan en la _stack_ y los datos de tamaño dinámico (la cadena real) en el _heap_:
fa: ساختن یک `String` metadata با اندازه ثابت را روی stack و داده با اندازه پویا، یعنی رشته واقعی، را روی heap قرار می‌دهد:
ja: `String` を作成すると、スタックには固定サイズのメタデータが配置され、ヒープにはサイズが動的に決定されるデータ（実際の文字列）が配置されます。
ko: `String`을 하나 만들게 되면, 스택에는 고정된 크기의 메타 데이터가 생성되고, 힙에는 가변 크기의 데이터, 즉, 실제 문자열, 이 생성됩니다:
pt_br: A criação de uma `String` coloca metadados de tamanho fixo na pilha e dados dinamicamente dimensionados - a string propriamente dita - no _heap_:
uk: Створення `String` поміщає метадані фіксованого розміру в стек, а дані динамічного розміру, фактичний рядок, у купу:

source: Mention that a `String` is backed by a `Vec`, so it has a capacity and length and can grow if mutable via reallocation on the heap.
es: Menciona que un `String` está respaldado por un `Vec`, por lo que tiene capacidad y longitud y, si es mutable, puede crecer mediante reasignación en el _heap_.
fa: ذکر کنید که یک `String` توسط یک `Vec` پشتیبانی می‌شود، بنابراین دارای ظرفیت و طول است و در صورت تغییرپذیری، می‌تواند از طریق اختصاص مجدد حافظه روی heap رشد کند.
ja: `String` は `Vec` により実現されているため、容量と長さがあり、可変であればヒープ上の再割り当てによって拡張できることを説明します。
ko: 문자열(`String`)은 실제로는 `Vec`입니다. 크기(capacity)와 현재 길이(length) 정보를 가지며, 더 큰 크기가 필요할 경우 힙에서 재 할당을 합니다.
pt_br: Mencione que uma `String` é suportada por um `Vec`, portanto ela tem um tamanho e capacidade e pode crescer se for mutável por meio de realocação no heap.
uk: Нагадайте, що тип `String` підтримується `Vec`, тому має ємність і довжину та може зростати, якщо мутабельна, через перерозподіл у купі.

source: If students ask about it, you can mention that the underlying memory is heap allocated using the [System Allocator](https://doc.rust-lang.org/std/alloc/struct.System.html) and custom allocators can be implemented using the [Allocator API](https://doc.rust-lang.org/std/alloc/index.html)
es: Si los alumnos lo preguntan, puedes mencionar que la memoria subyacente recibe una asignación de _heap_ mediante el [Asignador del Sistema](https://doc.rust-lang.org/std/alloc/struct.System.html) y que se pueden implementar asignadores personalizados mediante el [_Allocator API_](https://doc.rust-lang.org/std/alloc/index.html).
fa: اگر دانش‌آموزان درباره آن سوال کنند، می‌توانید اشاره کنید که حافظه زیرین با استفاده از [System Allocator](https://doc.rust-lang.org/std/alloc/struct.System.html) بر روی heap اختصاص داده شده و تخصیص‌دهنده‌های سفارشی می‌توانند با استفاده از [Allocator API](https://doc.rust-lang.org/std/alloc/index.html) پیاده‌سازی شوند
ja: 受講者から尋ねられた場合は、[システム アロケータ](https://doc.rust-lang.org/std/alloc/struct.System.html)を使用してメモリ領域がヒープから割り当てられること、[Allocator API](https://doc.rust-lang.org/std/alloc/index.html) を使用してカスタム アロケータを実装できることを説明してください。
ko: 힙은 기본적으로 [System Allocator](https://doc.rust-lang.org/std/alloc/struct.System.html)를 통해 할당됩니다. 그리고 [Allocator API](https://doc.rust-lang.org/std/alloc/index.html)를 이용해서 커스텀 메모리 할당자를 만들 수도 있습니다.
pt_br: Se os alunos perguntarem sobre isso, você pode mencionar que a memória subjacente é alocada no heap usando o _[System Allocator](https://doc.rust-lang.org/std/alloc/struct.System.html)_ e os alocadores personalizados podem ser implementados usando a _[API Allocator](https://doc.rust-lang.org/std/alloc/index.html)_.
uk: Якщо студенти запитають про це, ви можете нагадати, що основна пам’ять розподіляється за допомогою [System Allocator](https://doc.rust-lang.org/std/alloc/struct.System.html) і користувальницькі розподільники можуть бути реалізовано за допомогою [Allocator API](https://doc.rust-lang.org/std/alloc/index.html)

source: We can inspect the memory layout with `unsafe` Rust. However, you should point out that this is rightfully unsafe!
fa: می‌توانیم با استفاده از Rust ناامن (unsafe) نحوه چیدمان حافظه را بررسی کنیم. با این حال، باید اشاره کنید که این کار به درستی ناامن است!
ja: `unsafe` Rust を使用してメモリ レイアウトを調べることが出来ます。ただし、これは当然ながら安全でないことを指摘する必要があります。
pt_br: Podemos inspecionar o layout da memória com Rust inseguro (`unsafe`). No entanto, você deve apontar que isso é legitimamente inseguro!
uk: Ми можемо перевірити розташування пам’яті за допомогою `unsafe` Rust. Однак ви повинні зазначити, що це по праву небезпечно!

source: "world"
fa: "دنیا"
pt_br: "mundo"
uk: "світ"

source: // DON'T DO THIS AT HOME! For educational purposes only. // String provides no guarantees about its layout, so this could lead to // undefined behavior.
ja: // 自宅では行わないでください。これは説明のみを目的としています。 // String はそのレイアウトを保証しないため、未定義の動作が // 発生する可能性があります。
pt_br: // NÃO FAÇA ISSO EM CASA! Somente com propósito educacional. // String não fornece nenhuma garantia sobre o seu layout, então isso pode causar // um comportamento indefinido.
uk: // НЕ РОБІТЬ ЦЬОГО ВДОМА! Тільки в навчальних цілях. // String не надає жодних гарантій щодо своєї розмітки, тому це може призвести до // невизначеної поведінки.

source: Traditionally, languages have fallen into two broad categories:
es: Tradicionalmente, los lenguajes se dividen en dos grandes categorías:
fa: به طور سنتی، زبان‌ها به دو دسته گسترده تقسیم شده‌اند:
ja: 伝統的に、言語は大きく 2 つのカテゴリに分類されます。
ko: 전통적으로, 두 종류의 프로그래밍 언어가 있습니다:
pt_br: Tradicionalmente, as linguagens se dividem em duas grandes categorias:
uk: Традиційно мови поділяються на дві великі категорії:

source: Full control via manual memory management: C, C++, Pascal, ...
es: Control total a través de la gestión manual de la memoria: C, C++, Pascal, etc.
fa: کنترل کامل از طریق مدیریت دستی حافظه: C++، C، پاسکال، ...
ja: 手動でのメモリ管理による完全な制御: C、C++、Pascal など
ko: 메모리 관리가 프로그래머의 완전한 통제하에 있지만 수동(그래서 안전하지 않을 수 있는)인 언어: C, C++, Pascal, ...
pt_br: Controle total através do gerenciamento manual de memória: C, C++, Pascal, ...
uk: Повний контроль через ручне управління пам'яттю: C, C++, Pascal, ...

source: Programmer decides when to allocate or free heap memory.
fa: برنامه‌نویس تصمیم می‌گیرد که چه زمانی حافظه heap را تخصیص یا آزاد کند.
ja: プログラマーがヒープメモリを割り当てまたは解放するタイミングを決定します。
pt_br: Programador decide quando alocar ou liberar memória do heap.
uk: Програміст вирішує, коли виділяти або звільняти пам'ять купи.

source: Programmer must determine whether a pointer still points to valid memory.
fa: برنامه‌نویس باید تعیین کند که آیا یک اشاره‌گر هنوز به حافظه معتبر اشاره می‌کند یا نه.
ja: プログラマーは、ポインタがまだ有効なメモリを指しているかどうかを判断する必要があります。
pt_br: Programador deve determinar se um ponteiro ainda aponta para uma memória válida.
uk: Програміст повинен визначити, чи вказівник все ще вказує на дійсну пам'ять.

source: Studies show, programmers make mistakes.
fa: مطالعات نشان می‌دهد که برنامه‌نویسان اشتباهاتی مرتکب می‌شوند.
ja: 調査によると、プログラマーは判断を誤ることがあります。
pt_br: Estudos mostram que os programadores cometem erros.
uk: Дослідження показують, що програмісти роблять помилки.

source: Full safety via automatic memory management at runtime: Java, Python, Go, Haskell, ...
es: Seguridad total mediante la gestión automática de la memoria en _runtime_: Java, Python, Go, Haskell, etc.
fa: ایمنی کامل از طریق مدیریت خودکار حافظه در زمان اجرا: جاوا، پایتون، گو، هسکل، ...
ja: 実行時の自動メモリ管理による完全な安全性: Java、Python、Go、Haskell など
ko: 메모리 관리가 런타임에 의해 되므로 안전하지만 자동(그래서 프로그래머가 개입할 여지가 적거나 없는)인 언어: Java, Python, Go, Haskell, ...
pt_br: Segurança total através do gerenciamento automático de memória em tempo de execução: Java, Python, Go, Haskell, ...
uk: Повна безпека завдяки автоматичному управлінню пам’яттю під час виконання: Java, Python, Go, Haskell, ...

source: A runtime system ensures that memory is not freed until it can no longer be referenced.
fa: یک سیستم زمان اجرا اطمینان می‌یابد که حافظه تا زمانی که دیگر نتواند به آن ارجاع داده شود، آزاد نمی‌شود.
ja: ランタイム システムにより、メモリは参照できなくなるまで解放されません。
pt_br: Um sistema em tempo de execução garante que a memória não seja liberada até que não possa mais ser referenciada.
uk: Система виконання гарантує, що пам'ять не звільняється доти, доки до неї не можна буде звертатися.

source: Typically implemented with reference counting or garbage collection.
uk: Зазвичай реалізується за допомогою підрахунку посилань або збору сміття.

source: Rust offers a new mix:
es: Rust ofrece una mezcla de ambas:
fa: Rust یک ترکیب جدید ارائه می‌دهد:
ja: Rust ではこの 2 つを融合することで、新たに以下の特徴を提供します。
ko: 러스트는 이 둘을 혼합한 새로운 형태의 메모리 관리 기법을 제공합니다:
pt_br: Rust oferece uma nova combinação:
uk: Rust пропонує нову суміш:

source: Full control _and_ safety via compile time enforcement of correct memory management.
es: Control _y_ seguridad completa gracias a que el compilador se encarga del correcto manejo de la memoria
fa: کنترل کامل و ایمنی از طریق اجرای صحیح مدیریت حافظه در زمان کامپایل.
ja: コンパイル時の適切なメモリ管理の適用による、完全な制御と安全性。
ko: 컴파일 시 올바른 메모리 관리를 강제함으로써 완전한 통제와 안전성 _모두_ 제공.
pt_br: Controle total _e_ segurança por imposição do correto gerenciamento de memória em tempo de compilação.
uk: Повний контроль _та_ безпека завдяки забезпеченню правильного керування пам'яттю під час компіляції.

source: It does this with an explicit ownership concept.
es: Para ello, se utiliza un concepto de _ownership_ (propiedad) explícito.
fa: این کار را با استفاده از مفهوم مالکیت صریح انجام می‌دهد.
ja: これは、明示的な所有権の概念によって実現されます。
ko: 이를 가능하게 하는 러스트의 컨셉은 명시적인 소유권입니다.
pt_br: Ele faz isso com um conceito de _ownership_ (posse) explícito.
uk: Це робиться за допомогою чіткої концепції володіння.
