Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: For the microcontroller part of the course we will use the [BBC micro:bit](https://microbit.org/) v2 as an example. It's a [development board](https://tech.microbit.org/hardware/) based on the Nordic nRF52833 microcontroller with some LEDs and buttons, an I2C-connected accelerometer and compass, and an on-board SWD debugger.
fa: برای بخش میکروکنترلر دوره ما از [BBC micro:bit](https://microbit.org/) v2 به عنوان مثال استفاده خواهیم کرد. این یک [برد توسعه](https://tech.microbit.org/hardware/) مبتنی بر میکروکنترلر Nordic nRF52833 با چند LED و دکمه، شتاب‌سنج و قطب‌نما متصل به I2C و یک دیباگر SWD روی برد است.
uk: Для частини курсу, присвяченої мікроконтролеру, ми використаємо [BBC micro:bit](https://microbit.org/) v2 як приклад. Це [плата розробки](https://tech.microbit.org/hardware/) на основі мікроконтролера Nordic nRF52833 із деякими світлодіодами та кнопками, акселерометром і компасом, підключеними до I2C, і вбудованим налагоджувачем SWD.

source: To get started, install some tools we'll need later. On gLinux or Debian:
es: Para empezar, instala algunas de las herramientas que necesitarás más adelante. En gLinux o Debian:
fa: برای شروع، ابزارهایی را که بعداً به آنها نیاز خواهیم داشت نصب کنید. در لینوکس یا دبیان:
ja: まずはじめに、後ほど必要となるいくつかのツールをインストールします。gLinuxまたはDebianの場合は以下のようになります:
ko: 시작하기전에, 앞으로 사용할 도구를 설치해야 합니다. gLinux 또는 Debian를 사용하고 있다면 아래와 같이 하세요.
pt_br: Para começar, instale algumas ferramentas que precisaremos mais tarde. No gLinux ou Debian:
uk: Для початку встановіть деякі інструменти, які нам знадобляться пізніше. У gLinux або Debian:

source: And give users in the `plugdev` group access to the micro:bit programmer:
es: Permite a los usuarios del grupo `plugdev` acceder al programador micro:bit:
fa: و به کاربران گروه `plugdev` اجازه دسترسی به برنامه‌نویس micro:bit را بدهید:
ja: さらに、`plugdev`グループにmicro:bitプログラム用デバイスへのアクセスを付与します:
ko: `plugdev` 그룹의 사용자에게 micro:bit 프로그래머 장치에 대한 액세스 권한을 부여합니다.
pt_br: E dê aos usuários do grupo `plugdev` acesso ao programador micro:bit:
uk: І надайте користувачам у групі `plugdev` доступ до програматора micro:bit:

source: On MacOS:
es: En MacOS:
fa: در MacOS:
ja: MacOSの場合は以下のようになります:
ko: MacOS에서:
pt_br: No MacOS:
uk: У MacOS:

source: Slices, `&str`, `CStr`
uk: Зрізи, `&str`, `CStr`

source: `NonNull` and all the usual pointer-related functions
es: `NonNull` y todas las funciones relacionadas con punteros habituales
ko: `NonNull` 및 모든 일반적인 포인터 관련 함수
pt_br: `NonNull` e todas as funções relacionadas a ponteiros usuais
uk: `NonNull` і всі звичайні функції, пов’язані з покажчиками

source: `Future` and `async`/`await`
fa: `Future` و `async`/`await`
pt_br: `Future` e `async`/`await`
uk: `Future` та `async`/`await`

source: `File` and the rest of `fs`
es: `File` y el resto de `fs`
ko: `File` 및 나머지 `fs`
pt_br: `File` e o resto de `fs`
uk: `File` та решта `fs`

source: `println!`, `Read`, `Write`, `Stdin`, `Stdout` and the rest of `io`
es: `println!`, `Read`, `Write`, `Stdin`, `Stdout` y el resto de `io`
ko: `println!`, `Read`, `Write`, `Stdin`, `Stdout` 및 나머지 `io`
pt_br: `println!`, `Read`, `Write`, `Stdin`, `Stdout` e o resto de `io`
uk: `println!`, `Read`, `Write`, `Stdin`, `Stdout` та решта `io`

source: `spawn`, `sleep` and the rest of `thread`
es: `spawn`, `sleep` y el resto de `thread`
ko: `spawn`, `sleep` 및 나머지 `thread`
pt_br: `spawn`, `sleep` e o resto de `thread`
uk: `spawn`, `sleep` та решта `thread`

source: `HashMap` depends on RNG.
es: `HashMap` depende de RNG.
fa: یک `HashMap` به RNG وابسته است.
ja: `HashMap`はRNGに依存します。
ko: `HashMap`은 RNG에 의존합니다.
pt_br: `HashMap` depende de RNG.
uk: `HashMap` залежить від RNG.

source: `std` re-exports the contents of both `core` and `alloc`.
es: `std` vuelve a exportar el contenido de `core` y `alloc`.
ja: `std`は`core`と`alloc`の両方を再エクスポートします。
ko: `std`는 `core` 및 `alloc`를 포함합니다.
pt_br: `std` reexporta o conteúdo de `core` e `alloc`.
uk: `std` повторно експортує вміст як `core`, так і `alloc`.

source: A minimal `no_std` program
es: Un programa `no_std` mínimo
fa: یک برنامه حداقلی از`no_std`
ja: 最小限の`no_std`プログラム
ko: 최소한의 `no_std` 프로그램
pt_br: Um programa `no_std` mínimo
uk: Мінімальна програма `no_std`

source: This will compile to an empty binary.
es: Se compilará en un binario vacío.
fa: این به یک باینری خالی کامپایل می‌شود.
ja: このコードは空のバイナリにコンパイルされます。
ko: 이 코드는 빈 바이너리로 컴파일됩니다.
pt_br: Isso irá compilar em um binário vazio.
uk: Це буде скомпільовано в порожній бінарний файл.

source: `std` provides a panic handler; without it we must provide our own.
es: `std` proporciona un controlador de _panic_; sin no hay, debemos proporcionar uno nuestro.
ja: パニックハンドラは`std`が提供するので、それを使わない場合は自分で提供する必要があります。
ko: `std`는 패닉 핸들러를 제공하지만, 우리는 자체적으로 핸들러를 만들어야합니다.
pt_br: `std` fornece um manipulador de pânico; sem ele, devemos fornecer o nosso.
uk: `std` надає обробник паніки; без нього ми повинні створити свій власний.

source: It can also be provided by another crate, such as `panic-halt`.
es: También puede proporcionarlo otro crate, como `panic-halt`.
fa: همچنین می‌توان آن را توسط crate دیگری مانند `panic-halt` تهیه کرد.
ja: あるいは、`panic-halt`のような別のクレートが提供するパニックハンドラを利用することもできます。
ko: 패닉 핸들러는 `panic-halt`와 같은 크레이트를 통해서 만들수도 있습니다.
pt_br: Também pode ser fornecido por outro _crate_, como `panic-halt`.
uk: Це також може бути забезпечено іншим крейтом, таким як `panic-halt`.

source: Depending on the target, you may need to compile with `panic = "abort"` to avoid an error about `eh_personality`.
es: Dependiendo del objetivo, es posible que tengas que compilar con `panic = "abort"` para evitar un error sobre `eh_personality`.
fa: بسته به هدف، ممکن است لازم باشد برای جلوگیری از خطای `eh_personality` را `panic = "abort"` کامپایل کنید.
ja: ターゲットによっては、`eh_personality`に関するエラーを回避するために`panic = "abort"`を指定してコンパイルする必要があります。
ko: 타겟에 따라 `panic = "abort"`로 컴파일해야 할 수 있습니다. 이는 `eh_personality`에 관한 오류를 방지하기 위함입니다.
pt_br: Dependendo do destino, você pode precisar compilar com `panic = "abort"` para evitar um erro sobre `eh_personality`.
uk: Залежно від цілі, вам може знадобитися скомпілювати за допомогою `panic = "abort"`, щоб уникнути помилки щодо `eh_personality`.

source: Note that there is no `main` or any other entry point; it's up to you to define your own entry point. This will typically involve a linker script and some assembly code to set things up ready for Rust code to run.
es: Ten en cuenta que no hay `main` ni ningún otro punto de entrada; depende de ti definir un punto de entrada propio. Esto suele implicar una secuencia de comandos de enlazador y algún código de ensamblado de forma que todo esté preparado para que se ejecute el código de Rust.
fa: توجه داشته باشید که `main` یا هیچ نقطه ورودی دیگری وجود ندارد. این به شما بستگی دارد که نقطه ورود خود را تعریف کنید. این معمولاً شامل یک اسکریپت linker و مقداری کد اسمبلی برای تنظیم موارد آماده برای اجرای کد Rust است.
ja: なお、`main`のようなプログラムの規定エントリポイントはないので、自分でエントリポイントを定義する必要があります。通常、Rustコードを実行できるようにするためには、リンカスクリプトとある程度のアセンブリコードを必要とします。
ko: `main` 과 같은 프로그램 진입점이 없습니다. 개발자가 자체적으로 진입점을 정의해야 합니다. 진입점을 정의하는 작업은, 일반적으로 링커 스크립트와 어셈블리 코드를 필요로 합니다.
pt_br: Observe que não há `main` ou qualquer outro ponto de entrada; cabe a você definir seu próprio ponto de entrada. Isso normalmente envolverá um script de _linker_ (ligação) e algum código assembly para deixar as coisas prontas para que o código Rust seja executado.
uk: Зверніть увагу, що не існує `main` або будь-якої іншої точки входу; ви самі визначаєте свою точку входу. Зазвичай це може бути скрипт компонувальника та деякий код збірки, щоб підготувати все до запуску коду Rust.

source: To use `alloc` you must implement a [global (heap) allocator](https://doc.rust-lang.org/stable/std/alloc/trait.GlobalAlloc.html).
es: Para utilizar `alloc`, debes implementar un [asignador global (de _heap_)](https://doc.rust-lang.org/stable/std/alloc/trait.GlobalAlloc.html).
fa: برای استفاده از `alloc` باید یک [global (heap) allocator](https://doc.rust-lang.org/stable/std/alloc/trait.GlobalAlloc.html) را پیاده‌سازی کنید.
ja: `alloc`を使うためには、[グローバル（ヒープ）アロケータ](https://doc.rust-lang.org/stable/std/alloc/trait.GlobalAlloc.html)を実装しなければなりません。
ko: `alloc`을 사용하려면 [전역 (힙) 할당자](https://doc.rust-lang.org/stable/std/alloc/trait.GlobalAlloc.html)를 구현해야 합니다.
pt_br: Para usar `alloc`, você deve implementar um [alocador global (heap)](https://doc.rust-lang.org/stable/std/alloc/trait.GlobalAlloc.html).
uk: Щоб використовувати `alloc`, ви повинні реалізувати [глобальний розподільник (кучі)](https://doc.rust-lang.org/stable/std/alloc/trait.GlobalAlloc.html).

source: // SAFETY: `HEAP` is only used here and `entry` is only called once.
uk: // БЕЗПЕКА: `HEAP` використовується тільки тут і `entry` викликається тільки один раз.

source: // Give the allocator some memory to allocate.
pt_br: // Dê ao alocador alguma memória para alocar.
uk: // Дати розподільнику трохи пам'яті для виділення.

source: // Now we can do things that require heap allocation.
pt_br: // Agora podemos fazer coisas que exigem alocação de heap.
uk: // Тепер ми можемо робити речі, які вимагають виділення кучі.

source: "A string"
pt_br: "Uma string"
uk: "Рядок"

source: `buddy_system_allocator` is a third-party crate implementing a basic buddy system allocator. Other crates are available, or you can write your own or hook into your existing allocator.
es: `buddy_system_allocator` es un crate de terceros que implementa un _buddy system allocator_ (una técnica de asignación de memoria) básico. Hay otros crates disponibles, pero también puedes escribir el tuyo propio o conectarte a tu asignador.
fa: `buddy_system_allocator`یک third-party crate است که یک تخصیص‌دهنده buddy system را پیاده‌سازی می‌کند. crateهای دیگر در دسترس هستند یا می‌توانید نسخه مربوط به خود را بنویسید یا به تخصیص دهنده موجود خود متصل کنید.
ja: `buddy_system_allocator`はサードパーティのクレートで、単純なバディシステムアロケータです。その他にも利用できるクレートはありますし、自前で実装したり、別のアロケータに自分のコードをフックすることも可能です。
ko: `buddy_system_allocator`는 간단한 버디 시스템 할당자를 구현하는 서드 파티 크레이트입니다. 이 외에도, 다른 크레이트를 사용하거나, 직접 할당자를 만들거나, 이미 존재하는 다른 할당자에 후킹할 수 있습니다.
pt_br: `buddy_system_allocator` é um _crate_ de terceiros que implementa um alocador básico de sistema de _buddy_. Outros _crates_ estão disponíveis, ou você pode escrever o seu próprio ou conectar-se ao seu alocador existente.
uk: `buddy_system_allocator` — це сторонній крейт, який реалізує базовий системний розподільник між друзями. Доступні інші крейти, або ви можете написати свій власний або підключити до наявного розподільника.

source: The const parameter of `LockedHeap` is the max order of the allocator; i.e. in this case it can allocate regions of up to 2\*\*32 bytes.
es: El parámetro const de `LockedHeap` es el orden máximo del asignador. Es decir, en este caso, puede asignar regiones de hasta 2\*\*32 bytes.
fa: پارامتر const `LockedHeap` حداکثر ترتیب تخصیص‌دهنده (allocator) است. یعنی در این مورد می‌تواند مناطقی تا 2\*\*32 بایت را اختصاص دهد.
ja: パラメータ定数`LockedHeap`はアロケータの最大オーダを示します。この場合、2\*\*32バイトの領域を確保することが可能です。
ko: `LockHeap` 타입의 const 매개변수는 할당자의 최대 크기를 2진수로 표현했을 때의 자릿수입니다. 즉, 이 경우처럼 32인 경우 최대 2\*\*32바이트 크기의 영역을 다룰 수 있습니다.
pt_br: O parâmetro const de `LockedHeap` é a ordem máxima do alocador; ou seja, neste caso, ele pode alocar regiões de até 2\*\*32 bytes.
uk: Параметр const у `LockedHeap` - це максимальний порядок розподільника, тобто у цьому випадку він може виділяти області розміром до 2\*\*32 байт.

source: If any crate in your dependency tree depends on `alloc` then you must have exactly one global allocator defined in your binary. Usually this is done in the top-level binary crate.
es: Si algún crate del árbol de dependencias depende de `alloc`, debes tener exactamente un asignador global definido en el binario. Esto se suele hacer en el crate binario de nivel superior.
fa: اگر هر crate ای در درخت وابستگی شما به `alloc` بستگی دارد، باید دقیقاً یک تخصیص‌دهنده سراسری در باینری خود تعریف کنید. معمولاً این کار در binary crate سطح بالا انجام می‌شود.
ja: もし依存関係にあるクレートが`alloc`に依存する場合、必ずバイナリファイルあたり一つだけのグローバルなアロケータが存在するようにしなければなりません。通常、これはトップレベルのバイナリを生成するクレートにより制御されます。
ko: 한 바이너리에서 `alloc`에 의존하는 크레이트가 하나라도 있다면 바이너리 전체에서 전역 할당자가 반드시 하나 존재해야 합니다. 일반적으로 전역 할당자를 선언하는 작업은 최상위 바이너리 크레이트에서 이루어집니다.
pt_br: Se algum _crate_ na sua árvore de dependências depender de `alloc`, você deve ter exatamente um alocador global definido no seu binário. Normalmente, isso é feito no _crate_ binário de mais alto nível.
uk: Якщо будь-який крейт у вашому дереві залежностей залежить від `alloc`, тоді ви повинні мати точно один глобальний розподільник, визначений у вашому бінарному файлі. Зазвичай це робиться у бінарному крейті верхнього рівня.

source: `extern crate panic_halt as _` is necessary to ensure that the `panic_halt` crate is linked in so we get its panic handler.
es: `extern crate panic_halt as _` es necesario para asegurar que el crate `panic_halt` esté vinculado y así podamos obtener su controlador de _panic_.
fa: برای اطمینان از اینکه `panic_halt` crate لینک شده است، استفاده `extern crate panic_halt as _` ضروری است، بنابراین panic handler آن را دریافت می‌کنیم.
ja: `extern crate panic_halt as _` という部分は、`panic_halt`クレートを確実にリンクし、パニックハンドラを利用可能にするために必要です。
ko: `panic_halt` 크레이트가 연결되어 패닉 핸들러를 가져오도록 하려면 `extern crate panic_halt as _`가 필요합니다.
pt_br: `extern crate panic_halt as _` é necessário para garantir que o _crate_ `panic_halt` seja vinculado para que obtenhamos seu _panic handler_.
uk: `extern crate panic_halt as _` необхідний для того, щоб переконатися, що буде зв'язано крейт `panic_halt` і ми отримаємо його обробник паніки.

source: This example will build but not run, as it doesn't have an entry point.
es: Este ejemplo se compilará pero no se ejecutará, ya que no cuenta con un punto de entrada.
fa: این مثال ساخته می شود اما اجرا نمی‌شود، زیرا entry point ندارد.
ja: この例で示したコードはビルドできますが、エントリポイントがないので実行することはできません。
ko: 이 예시 코드는 빌드는 되지만, 진입점이 없기 때문에 실행되지는 않습니다.
pt_br: Este exemplo irá compilar, mas não executará, pois não possui um ponto de entrada.
uk: Цей приклад збиратиметься, але не запускатиметься, оскільки він не має точки входу.

source: The `cortex_m_rt` crate provides (among other things) a reset handler for Cortex M microcontrollers.
es: El crate `cortex_m_rt` proporciona (entre otras cosas) un controlador de reinicio para microcontroladores Cortex M.
fa: یک `cortex_m_rt` crate (در میان چیزهای دیگر) یکreset handler برای میکروکنترلرهای Cortex M فراهم می‌کند.
ja: `cortex_m_rt`クレートはCortex Mマイクロコントローラ向けのリセットハンドラ（とその他もろもろ）を提供します。
ko: 'cortex_m_rt' 크레이트는 Cortex M 마이크로컨트롤러를 초기화 하는 핸들러를 제공합니다.
pt_br: O _crate_ `cortex_m_rt` fornece (entre outras coisas) um _reset handler_ para microcontroladores Cortex M.
uk: Крейт `cortex_m_rt` містить (серед іншого) обробник скидання для мікроконтролерів Cortex M.

source: Next we'll look at how to access peripherals, with increasing levels of abstraction.
es: A continuación, veremos cómo se accede a los periféricos con niveles de abstracción cada vez mayores.
fa: در ادامه نحوه دسترسی به لوازم جانبی (peripherals) را با افزایش سطح انتزاع بررسی خواهیم کرد.
ja: 次は、抽象度の低いレベルから順に周辺I/Oにアクセスする方法について見ていきます。
ko: 이제, 주변장치에 액세스하는 방법을 알아보겠습니다. 가장 기계에 가까운 낮은 단계에서 시작해서 점점 추상화 수준을 올리겠습니다.
pt_br: Em seguida, veremos como acessar periféricos, com níveis crescentes de abstração.
uk: Далі ми розглянемо, як отримати доступ до периферійних пристроїв із підвищенням рівня абстракції.

source: The `cortex_m_rt::entry` macro requires that the function have type `fn() -> !`, because returning to the reset handler doesn't make sense.
es: La macro `cortex_m_rt::entry` requiere que la función tenga el tipo `fn() -> !`, ya que no tiene sentido devolver resultados al controlador de reinicio.
fa: ماکرو `cortex_m_rt::entry` مستلزم این است که تابع دارای نوع `cortex_m_rt::entry` باشد، زیرا بازگشت به reset handler منطقی نیست.
ja: リセットハンドラはリターンしないので、`cortex_m_rt::entry`マクロは対象関数が`fn() -> !`という型であることを要求します。
ko: `cortex_m_rt::entry` 매크로는 진입점으로 사용되는 함수가`fn() -> !` 타입(즉, 리턴하지 않는)임을 요구합니다. 만약, 리턴하게 되면, 프로그램 수행 후 리셋 핸들러로 돌아가게 되는 것인데 이는 말이 되지 않기 때문입니다.
pt_br: A macro `cortex_m_rt::entry` requer que a função tenha o tipo `fn() -> !`, porque retornar para o _reset handler_ não faz sentido.
uk: Макрос `cortex_m_rt::entry` вимагає, щоб функція мала тип `fn() -> !`, оскільки повернення до обробника скидання не має сенсу.

source: Run the example with `cargo embed --bin minimal`
es: Ejecuta el ejemplo con `cargo embed --bin minimal`.
fa: مثال را با `cargo embed --bin minimal` اجرا کنید
ja: この例は`cargo embed --bin minimal`により実行します
ko: `cargo embed --bin minimal`을 사용하여 예시를 실행합니다.
pt_br: Execute o exemplo com `cargo embed --bin minimal`
uk: Запустіть приклад із `cargo embed --bin minimal`

source: Most microcontrollers access peripherals via memory-mapped IO. Let's try turning on an LED on our micro:bit:
es: La mayoría de los microcontroladores acceden a los periféricos a través de E/S asignada a la memoria. Vamos a probar a encender un LED en nuestro micro:bit:
fa: اکثر میکروکنترلرها از طریق IO دارای memory-map به تجهیزات جانبی (peripherals) دسترسی دارند. بیایید سعی کنیم یک LED را در micro:bit خود روشن کنیم:
ja: 大半のマイクロコントローラはメモリマップドRIO空間を通して周辺I/Oにアクセスします。micro:bitのLEDを光らせてみましょう:
ko: 대부분의 마이크로컨트롤러는 메모리 매핑 IO를 통해 주변기기에 액세스합니다. micro:bit에서 LED를 켜보겠습니다.
pt_br: A maioria dos microcontroladores acessa periféricos via E/S mapeado em memória. Vamos tentar ligar um LED no nosso micro:bit:
uk: Більшість мікроконтролерів отримують доступ до периферійних пристроїв через відображений в пам’ять IO. Давайте спробуємо включити світлодіод на нашому micro:bit:

source: /// GPIO port 0 peripheral address
pt_br: /// Endereço do periférico da porta 0 GPIO
uk: /// Периферійна адреса порту GPIO 0

source: // GPIO peripheral offsets
pt_br: // _Offsets_ do periférico GPIO
uk: // Зміщення периферії GPIO

source: // PIN_CNF fields
pt_br: // Campos PIN_CNF
uk: // Поля PIN_CNF

source: // Configure GPIO 0 pins 21 and 28 as push-pull outputs.
pt_br: // Configure os pinos 21 e 28 do GPIO 0 como saídas _push-pull_.
uk: // Налаштуйте виводи GPIO 0 21 та 28 як push-pull виводи.

source: // SAFETY: The pointers are to valid peripheral control registers, and no // aliases exist.
uk: // БЕЗПЕКА: вказівники вказують на дійсні периферійні регістри // керування, і ніяких псевдонімів не існує.

source: // Set pin 28 low and pin 21 high to turn the LED on.
pt_br: // Configure o pino 28 baixo e o pino 21 alto para ligar o LED.
uk: // Встановіть низький рівень на виводі 28 і високий на виводі 21, щоб увімкнути світлодіод.

source: GPIO 0 pin 21 is connected to the first column of the LED matrix, and pin 28 to the first row.
es: El pin 21 de GPIO 0 está conectado a la primera columna de la matriz de LED y el pin 28 a la primera fila.
fa: در GPIO 0 پایه ۲۱ به ستون اول ماتریس LED و پایه ۲۸ به ردیف اول متصل است.
ja: GPIO 0のピン21はマトリクスLEDの一番目の列に、ピン28は最初の行に接続されています。
ko: GPIO 0 핀 21은 LED 매트릭스의 첫 번째 열에 연결되고 핀 28은 첫 번째 행에 연결됩니다.
pt_br: O pino 21 do GPIO 0 está conectado à primeira coluna da matriz de LED e o pino 28 à primeira linha.
uk: Вивід 21 GPIO 0 підключений до першого стовпчика світлодіодної матриці, а вивід 28 – до першого рядка.

source: Run the example with:
es: Ejecuta el ejemplo con:
fa: مثال را با:
ja: 例の実行方法:
ko: 아래 명령어로 예제 코드를 실행하세요.
pt_br: Execute o exemplo com:
uk: Запустіть приклад за допомогою:

source: Peripheral Access Crates
es: Crates de Acceso Periférico
fa: Crateهای دسترسی جانبی
ja: 周辺I/Oへアクセスするためのクレート（PACs）
ko: 주변기기 액세스 크레이트
pt_br: _Crates_ de Acesso a Periféricos
uk: Крейти периферійного доступу

source: [`svd2rust`](https://crates.io/crates/svd2rust) generates mostly-safe Rust wrappers for memory-mapped peripherals from [CMSIS-SVD](https://www.keil.com/pack/doc/CMSIS/SVD/html/index.html) files.
es: [`svd2rust`](https://crates.io/crates/svd2rust) genera, en su gran mayoría, envoltorios seguros de Rust para periféricos asignados a la memoria a partir de archivos [CMSIS-SVD](https://www.keil.com/pack/doc/CMSIS/SVD/html/index.html).
fa: گزینه [`svd2rust`](https://crates.io/crates/svd2rust) که wrapperهای Rust عمدتاً ایمن را برای تجهیزات جانبی دارای memory-map از فایل‌های[CMSIS-SVD](https://www.keil.com/pack/doc/CMSIS/SVD/html/index.html) تولید می‌کند.
ja: [`svd2rust`](https://crates.io/crates/svd2rust) は[CMSIS-SVD](https://www.keil.com/pack/doc/CMSIS/SVD/html/index.html) ファイルから、メモリマップされた周辺I/Oに対するほぼ安全（mostly-safe）なRustラッパーを生成します。
ko: [`svd2rust`](https://crates.io/crates/svd2rust) 크레이트를 이용하면 메모리 매핑된 주변장치를 기술하는 [CMSIS-SVD](https://www.keil.com/pack/doc/CMSIS/SVD/html/index.html) 파일로부터 Rust 래퍼를 생성할 수 있습니다.
pt_br: [`svd2rust`](https://crates.io/crates/svd2rust) gera _wrappers_ Rust normalmente seguros para periféricos mapeados em memória de [arquivos CMSIS-SVD](https://www.keil.com/pack/doc/CMSIS/SVD/html/index.html).
uk: [`svd2rust`](https://crates.io/crates/svd2rust) створює здебільшого безпечні оболонки Rust для периферійних пристроїв із відображенням пам’яті з [CMSIS-SVD](https://www.keil.com/pack/doc/CMSIS/SVD/html/index.html) файлів.

source: SVD (System View Description) files are XML files typically provided by silicon vendors which describe the memory map of the device.
es: Los archivos SVD (System View Description) son archivos XML que suelen proporcionar los proveedores de silicio y que describen el mapa de memoria del dispositivo.
fa: فایل‌های SVD (System View Description) در واقع فایل‌های XML هستند که معمولاً توسط فروشندگان تجهیزات ریزپردازنده ارائه می‌شوند که memory map دستگاه را توصیف می‌کنند.
ja: SVD (System View Description)ファイルはXMLファイルでデバイスのメモリマップを記述したものであり、通常シリコンベンダにより提供されます。
ko: SVD(System View Description) 파일은 일반적으로 실리콘 공급업체에서 제공하는 XML 파일로, 기기의 메모리 맵을 기술합니다.
pt_br: Os arquivos SVD (System View Description) são arquivos XML normalmente providos por fornecedores de silício que descrevem o mapa de memória do dispositivo.
uk: Файли SVD (System View Description) — це XML-файли, які зазвичай надають постачальники кремнію, які описують карту пам’яті пристрою.

source: They are organised by peripheral, register, field and value, with names, descriptions, addresses and so on.
es: Se organizan por periférico, registro, campo y valor, con nombres, descripciones y direcciones, etc.
fa: آنها بر اساس peripheral، register، field و value، با نام، توضیحات، آدرس و غیره سازماندهی می‌شوند.
ja: 周辺I/Oごとに、レジスタ、フィールドと値、名前、説明、アドレスなどにより構成されています。
ko: 주변기기, 레지스터, 필드, 값으로 구성되며 이름, 설명, 주소 등이 포함됩니다.
pt_br: Eles são organizados por periférico, registrador, campo e valor, com nomes, descrições, endereços e assim por diante.
uk: Вони організовані за периферією, регістром, полем і значенням, з назвами, описами, адресами тощо.

source: SVD files are often buggy and incomplete, so there are various projects which patch the mistakes, add missing details, and publish the generated crates.
es: Los archivos SVD suelen tener errores y estar incompletos, por lo que existen varios proyectos que aplican parches a los errores, añaden detalles que faltan y publican los crates generados.
fa: فایل‌های SVD اغلب دارای باگ و ناقص هستند، بنابراین پروژه‌های مختلفی وجود دارد که اشتباهات را اصلاح می‌کنند، جزئیات گمشده را اضافه می‌کنند و crateهای تولید شده را منتشر می‌کنند.
ja: SVDファイルにはよく誤りがあり、また情報が不足していることも多いので、様々なプロジェクトがそれを修正・追加し、クレートとして公開しています。
ko: SVD 파일에는 버그가 있을 수 있고 불완전하기 때문에, 이러한 문제들을 패치하는 다양한 프로젝트들이 있습니다.
pt_br: Os arquivos SVD geralmente tem erros e são incompletos, portanto, existem vários projetos que corrigem os erros, adicionam detalhes ausentes e publicam os _crates_ gerados.
uk: Файли SVD часто є помилковими та неповними, тому існують різні проекти, які виправляють помилки, додають відсутні деталі та публікують згенеровані крейти.
