Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: For this training, we will mostly explore the Rust language through examples which can be executed through your browser. This makes the setup much easier and ensures a consistent experience for everyone.
es: En esta formación, aprenderemos el lenguaje Rust principalmente con ejemplos que podrás ejecutar con tu navegador. De este modo, la configuración es mucho más sencilla y se asegura una experiencia homogénea para todos.
fa: برای این آموزش، بیشتر زبان Rust را از طریق مثال هایی که می توان از طریق مرورگر شما اجرا کرد، بررسی می کنیم. این کار راه اندازی را بسیار ساده تر می کند و تجربه ای ثابت را برای همه تضمین می کند.
ja: 本講座は、主にブラウザ内で実行可能な例を使います。こうする事で、セットアップが容易になり、一貫した開発環境の提供が可能となります。
ko: 이 강의자료에 있는 모든 예제는 브라우저에서 바로 수행 가능합니다. 이렇게 한 이유는, 준비 과정을 단순화 시키고, 모두가 같은 환경에서 작업할 수 있도록 하기 위함입니다.
pt_br: Para este treinamento, exploraremos principalmente a linguagem Rust por meio de exemplos que podem ser executados através do seu navegador. Isso torna a instalação muito mais fácil e garante uma experiência consistente para todos.
uk: У цьому курсі ми в основному вивчатимемо мову Rust на прикладах, які можуть бути виконані у вашому браузері. Це значно спрощує налаштування та забезпечує однаковий досвід для всіх.

source: Installing Cargo is still encouraged: it will make it easier for you to do the exercises. On the last day, we will do a larger exercise which shows you how to work with dependencies and for that you need Cargo.
es: Se recomienda instalar Cargo, ya que facilitará la realización de los ejercicios. El último día realizaremos un ejercicio más largo en el que se mostrará cómo trabajar con dependencias, y para eso se necesita Cargo.
fa: نصب Cargo همچنان پیشنهاد می شود: چونکه انجام تمرینات را برای شما آسان تر می کند. در روز آخر، تمرین بزرگتری را انجام خواهیم داد که به شما نشان می دهد چگونه با وابستگی ها کار کنید و برای این کار شما به Cargo نیاز دارید.
ja: ただし、できればCargoをインストールしてください： 練習問題で使えると便利です。また最終日に依存関係を扱う課題を扱いますが、そこではCargoが必要になります。
ko: 그럼에도 불구하고, 카고(cargo)를 직접 설치하는 것을 강력 권장합니다. 이게 과제 작성에 더 도움이 될겁니다. 또한, 마지막 날에는 의존성이 있는 예제를 작업하게 될 텐데, 그 때에는 어차피 카고가 필요합니다.
pt_br: A instalação do Cargo ainda assim é incentivada: será mais fácil para você fazer os exercícios. No último dia, faremos um exercício maior que mostra como trabalhar com dependências e para isso você precisará do Cargo.
uk: Встановлення Cargo, як і раніше, рекомендується: це полегшить виконання вправ. В останній день ми виконаємо більш масштабну вправу, яка покаже вам як працювати із залежностями, і для цього вам знадобиться Cargo.

source: The code blocks in this course are fully interactive:
es: Los bloques de código de este curso son totalmente interactivos:
fa: بلوک های کد در این دوره کاملاً تعاملی(interactive) هستند:
ja: 講座のコードブロックはインタラクティブです：
ko: 이 강의 자료의 코드 블록들은 전부 인터엑티브 합니다:
pt_br: Os blocos de código neste curso são totalmente interativos:
uk: Блоки коду в цьому курсі є повністю інтерактивними:

source: "Edit me!"
pt_br: "Edite-me!"
uk: "Відредагуте мене!"

source: You can use <kbd>Ctrl + Enter</kbd> to execute the code when focus is in the text box.
uk: Ви можете використовувати <kbd>Ctrl + Enter</kbd> для виконання коду, коли фокус введення знаходиться в текстовому полі.

source: Most code samples are editable like shown above. A few code samples are not editable for various reasons:
es: La mayoría de los códigos de ejemplo se pueden editar, como se muestra arriba, pero hay algunos que no se pueden editar por varios motivos:
fa: اکثر نمونه های کد مانند نشان داده شده در بالا قابل ویرایش هستند. چند نمونه کد به دلایل مختلف قابل ویرایش نیستند:
ja: ほとんどのサンプルコードは上記のように編集可能ですが、一部だけ以下のような理由から編集不可となっています：
ko: 강의에서 대부분의 코드 샘플은 위와 같이 수정할수 있지만 일부 코드는 다음과 같은 이유로 수정할 수 없습니다:
pt_br: A maioria dos exemplos de código são editáveis, como mostrado acima. Alguns exemplos de código não são editáveis por vários motivos:
uk: Більшість прикладів коду доступні для редагування, як показано вище. Кілька прикладів коду недоступні для редагування з різних причин:

source: The embedded playgrounds cannot execute unit tests. Copy-paste the code and open it in the real Playground to demonstrate unit tests.
es: Los playgrounds insertados no pueden ejecutar pruebas unitarias. Copia y pega el código y ábrelo en la página del playground para mostrar pruebas unitarias.
fa: همینطورembedded playground نمی توانند unit tests را اجرا کنند. کد را کپی کنید و آن را در Playground واقعی باز کنید تا unit tests د را نشان دهید.
ja: 講座のページ内に埋め込まれたプレイグラウンドでユニットテストは実行できません。コードを実際のプレイグラウンドで開き、デモンストレーションを行う必要があります。
ko: 유닛 테스트는 내장 플레이그라운드에서 실행이 안됩니다. 외부 플레이그라운드 사이트에 붙여넣어 테스트를 실행하시기 바랍니다.
pt_br: Os _playgrounds_ embutidos não conseguem executar testes unitários. Copie o código e cole no _Playground_ real para demonstrar os testes unitários.
uk: Вбудований у сторінку редактор коду не може запускати модульні тести. Скопіюйте код і відкрийте його в справжньому Playground, щоб продемонструвати модульні тести.

source: The embedded playgrounds lose their state the moment you navigate away from the page! This is the reason that the students should solve the exercises using a local Rust installation or via the Playground.
es: Los playgrounds insertados pierden su estado en cuanto sales e de la página. Por este motivo, los alumnos deben resolver los ejercicios con una versión local de Rust o a través del playground.
fa: در واقع embedded playgrounds در لحظه ای که از صفحه دور می شوید حالت پایدار خود را از دست می دهند! به همین دلیل است که دانش آموزان باید تمرینات را با استفاده از local Rust installation یا از طریق Playground حل کنند.
ja: 講座のページ内に埋め込まれたプレイグラウンドでは、ページ移動すると状態が失われます！故に、受講生はローカル環境や実際のプレイグラウンドを使用して問題を解く必要があります。
ko: 내장된 플레이그라운드에서는 페이지 이동시 작성된 모든 내용이 사라집니다. 따라서 로컬 환경이나 외부 플레이그라운드 사이트에서 연습문제를 해결하는 것이 좋습니다.
pt_br: Os _playgrounds_ embutidos perdem seu estado no momento em que você navega para outra página! Esta é a razão pela qual os alunos devem resolver os exercícios usando uma instalação do Rust local ou via Playground real.
uk: Вбудовані в сторінку редактори коду втрачають свій стан у той момент, коли ви йдете зі сторінки! Саме з цієї причини учні повинні виконувати вправи, використовуючи локальну установку Rust або Rust Playground.

source: Running Code Locally with Cargo
es: Ejecutar código de forma local con Cargo
fa: اجرای کد به صورت لوکال با Cargo
ja: Cargoを使ってローカルで実行
ko: 로컬 환경의 카고
pt_br: Executando Código Localmente com o Cargo
uk: Запуск коду локально за допомогою Cargo

source: If you want to experiment with the code on your own system, then you will need to first install Rust. Do this by following the [instructions in the Rust Book](https://doc.rust-lang.org/book/ch01-01-installation.html). This should give you a working `rustc` and `cargo`. At the time of writing, the latest stable Rust release has these version numbers:
fa: اگر می خواهید کد را روی سیستم خود آزمایش کنید، ابتدا باید Rust را نصب کنید. این کار را با دنبال کردن [instructions in the Rust Book](https://doc.rust-lang.org/book/ch01-01-installation.html) انجام دهید. این باید به شما یک `rustc` و `cargo` کاربردی بدهد. در زمان نگارش، آخرین نسخه پایدار Rust دارای این version numberها است:
ja: コードをローカルで試したい場合、[Rust Bookの手順](https://doc.rust-lang.org/book/ch01-01-installation.html)に従ってRustをインストールしてください。正常にインストールされたら、`rustc`と`cargo`が使えるようになります。最新のstableリリースのバージョンは以下の通りです：
ko: 만약 개인용 컴퓨터에서 코드를 실행해보려면 먼저 러스트를 설치해야 합니다. [Rust Book](https://doc.rust-lang.org/book/ch01-01-installation.html)의 지침에 따라 `rustc`와 `cargo`를 함께 설치 하시기 바랍니다. 설치 후 아래 커맨드를 통해 각 툴의 버전을 확인 할 수 있습니다:
pt_br: Se você quiser experimentar o código em seu próprio sistema, precisará primeiro instalar o Rust. Faça isso seguindo as [instruções no Livro do Rust](https://doc.rust-lang.org/book/ch01-01-installation.html). Isso deve fornecer o `rustc` e o `cargo` funcionando. Quando este curso foi escrito, as últimas versões estáveis do Rust são:
uk: Якщо ви хочете поекспериментувати з кодом на своїй системі, то вам потрібно буде спочатку встановити Rust. Зробіть це, дотримуючись [інструкцій у The Rust Book](https://doc.rust-lang.org/book/ch01-01-installation.html). У вашій системі з'являться інструменти `rustc` та `cargo`. На момент написання статті останній стабільний випуск Rust має такі версії:

source: You can use any later version too since Rust maintains backwards compatibility.
fa: شما همچنین می توانید از هر نسخه بعدی استفاده کنید، زیرا Rust سازگاری با نسخه های قبلی را حفظ می‌کند.
ja: Rust は下位互換性を維持しているため、新しいバージョンを使用することもできます。
ko: 이 버전보다 더 최신의 버전이어도 상관 없습니다. 러스트는 하위 호환성을 지원합니다.
pt_br: Você também pode usar qualquer versão posterior, pois o Rust mantém compatibilidade com versões anteriores.
uk: Ви також можете використовувати будь-яку пізнішу версію, оскільки Rust підтримує зворотну сумісність.

source: With this in place, follow these steps to build a Rust binary from one of the examples in this training:
es: Una vez hecho lo anterior, sigue estos pasos para compilar un binario de Rust a partir de uno de los ejemplos de la formación:
fa: با این کار، این مراحل را دنبال کنید تا از یکی از مثال‌های این آموزش، یک باینری Rust بسازید:
ko: 정상적으로 설치가 되었으면, 강의 예제중 하나를 러스트 바이너리로 빌드해 봅시다:
pt_br: Com isso finalizado, siga estas etapas para criar um binário Rust a partir de um dos exemplos deste treinamento:
uk: Після цього виконайте такі кроки, щоб зібрати виконуваний файл на основі одного з прикладів у цьому курсі:

source: Click the "Copy to clipboard" button on the example you want to copy.
es: Haz clic en el botón "Copiar en el portapapeles" del ejemplo que quieras copiar.
fa: روی دکمه "کپی در کلیپ بورد" در نمونه ای که می خواهید کپی کنید؛ کلیک کنید.
ja: 「Copy to clipboard」でコードをコピー。
ko: 예시 블록에 있는 "Copy to clipboard" 버튼을 클릭해서 복사합니다.
pt_br: Clique no botão _"Copy to clipboard"_ ("Copiar para a área de transferência") no exemplo que deseja copiar.
uk: Натисніть кнопку "Copy to clipboard" на прикладі коду, який потрібно скопіювати.

source: Use `cargo new exercise` to create a new `exercise/` directory for your code:
es: Usa `cargo new exercise` para crear un directorio `exercise/` para tu código:
fa: از `cargo new exercise` برای ایجاد دایرکتوری `excerise/` جدید برای کد خود استفاده کنید:
ja: `cargo new exercise`で`exercise/`ディレクトリを作成：
ko: 터미널에서 `cargo new exercise`를 입력해서 새로운 `exercise/` 폴더를 만듭니다:
pt_br: Use `cargo new exercise` para criar um novo diretório `exercise/` para o seu código:
uk: Використовуйте `cargo new exercise`, щоб створити нову директорію `exercise/` для вашого коду:

source: Navigate into `exercise/` and use `cargo run` to build and run your binary:
es: Ve a `exercise/` y usa `cargo run` para compilar y ejecutar tu binario:
fa: به `exercise/` بروید و از `cargo run` برای ساخت و اجرای باینری خود استفاده کنید:
ja: `exercise/`ディレクトリに移動し、`cargo run`でバイナリをビルドして実行：
ko: `exercise/` 폴더로 이동한 후, `cargo run` 커맨드로 코드를 실행합니다:
pt_br: Navegue até `exercise/` e use `cargo run` para compilar e executar seu binário:
uk: Перейдіть в директорію `exercise/` і виконайте `cargo run` для побудови та запуску виконуваного файлу:

source: Replace the boiler-plate code in `src/main.rs` with your own code. For example, using the example on the previous page, make `src/main.rs` look like
es: Sustituye el código de plantilla en `src/main.rs` con tu propio código. Por ejemplo, si usamos el ejemplo de la página anterior, podemos hacer que `src/main.rs` tenga el siguiente aspecto:
fa: کد صفحه دیگر را در `src/main.rs` با کد خود جایگزین کنید. برای مثال، با استفاده از مثال در صفحه قبل، `src/main.rs` را شبیه به آن کنید.
ja: `src/main.rs`のボイラープレートコードを、コピーしたコードで置き換えてください。例えば、前のページの例を使った場合、`src/main.rs`は以下のようになります。
ko: `src/main.rs`에 코드를 작성합니다. 예를 들어 이전 페이지의 소스를 아래와 같이 `src/main.rs`에 작성합니다
pt_br: Substitua o código gerado em `src/main.rs` pelo seu próprio código. Por exemplo, usando o exemplo da página anterior, faça `src/main.rs` parecer como
uk: Замініть шаблонний код у `src/main.rs` на свій код. Наприклад, використовуючи приклад коду з попередньої сторінки, зробіть `src/main.rs` схожим на

source: Use `cargo run` to build and run your updated binary:
es: Usa `cargo run` para hacer build y ejecutar tu binario actualizado:
fa: برای ساختن و اجرای باینری به روز شده خود از `cargo run` استفاده کنید:
ja: `cargo run`で更新されたバイナリをビルドして実行：
ko: `cargo run`커맨드로 소스를 빌드하고 실행합니다:
pt_br: Use `cargo run` para compilar e executar seu binário atualizado:
uk: Використовуйте `cargo run` для побудови та запуску оновленого виконуваного файлу:

source: Use `cargo check` to quickly check your project for errors, use `cargo build` to compile it without running it. You will find the output in `target/debug/` for a normal debug build. Use `cargo build --release` to produce an optimized release build in `target/release/`.
es: Comprueba que no haya errores en el proyecto con `cargo check`. Compílalo sin ejecutarlo con `cargo build`. Encontrarás la salida en `target/debug/` para una versión de depuración normal. Usa `cargo build --release` para generar una compilación de lanzamiento optimizada en `target/release/`.
fa: از `cargo check` برای بررسی سریع پروژه خود برای خطاها استفاده کنید، از `cargo build` برای کامپایل، بدون اجرای آن استفاده کنید. خروجی را در `target/debug/` برای ساخت اشکال زدایی معمولی خواهید یافت. برای تولید نسخه بهینه سازی شده در `target/release/` از `cargo build --release` استفاده کنید.
ja: `cargo check`でプロジェクトのエラーチェックを行い、`cargo build`でコンパイルだけ（実行はせず）を行います。通常のデバッグビルドでは、生成されたファイルは`target/debug/`に格納されます。最適化されたリリースビルドには`cargo build —release`を使い、ファイルは`target/release/`に格納されます。
ko: `cargo check`커맨드는 빠르게 에러를 확인할 수 있습니다. `cargo build`는 실행없이 컴파일만 합니다. 이 경우에 `target/debug/`폴더에서 output을 확인 할 수 있습니다. `cargo build --release`커맨드는 릴리즈 버전용 최적화를 켜서 컴파일하며 `target/release/`폴더에서 확인 할 수 있습니다.
pt_br: Use `cargo check` para verificar rapidamente se há erros em seu projeto, use `cargo build` para compilá-lo sem executá-lo. Você encontrará a saída em `target/debug/` para uma compilação de depuração normal. Use `cargo build --release` para produzir um binário otimizado em `target/release/`.
uk: Використовуйте `cargo check` для швидкої перевірки проекту на наявність помилок і `cargo build` для компіляції проекту без його запуску. Ви знайдете результат у директорії `target/debug/` для налагоджувальної збірки. Використовуйте `cargo build --release` для створення оптимізованої фінальної збірки в `target/release/`.

source: You can add dependencies for your project by editing `Cargo.toml`. When you run `cargo` commands, it will automatically download and compile missing dependencies for you.
es: Edita `Cargo.toml` para añadir dependencias a tu proyecto. Cuando ejecutes comandos `cargo`, se descargarán y compilarán automáticamente las dependencias que falten.
fa: با ویرایش `Cargo.toml` می‌توانید وابستگی‌هایی برای پروژه خود اضافه کنید. هنگامی که دستورات `cargo` را اجرا می کنید، به طور خودکار وابستگی های مورد نیاز را برای شما دانلود و کامپایل می‌کند.
ja: プロジェクトに依存関係を追加するには、`Cargo.toml`を編集します。その後、`cargo`コマンドを実行すると、自動的に不足している依存関係がダウンロードされてコンパイルされます。
ko: `Cargo.toml`파일에는 의존성 패키지를 추가할 수 있습니다. `cargo`커맨드를 실행하면 자동으로 의존성 패키지를 다운로드하고 컴파일 까지 해 줍니다.
pt_br: Você pode adicionar dependências para seu projeto editando `Cargo.toml`. Quando você execute os comandos `cargo`, ele irá baixar e compilar automaticamente dependências para você.
uk: Ви можете додати залежності для вашого проекту, відредагувавши файл `Cargo.toml`. Коли ви запустите команду `cargo`, вона автоматично завантажить і скомпілює відсутні залежності для вас.

source: Try to encourage the class participants to install Cargo and use a local editor. It will make their life easier since they will have a normal development environment.
es: Anima a los participantes de la clase a instalar Cargo y utilizar un editor local. Les facilitará mucho las cosas, ya que dispondrán de un entorno de desarrollo normal.
fa: سعی کنید شرکت کنندگان کلاس را تشویق کنید تا Cargo را نصب کنند و از یک ویرایشگر محلی استفاده کنند. این زندگی آنها را آسان تر می کند زیرا آنها یک محیط توسعه عادی خواهند داشت.
ja: 受講者にCargoのインストールとローカルエディタの使用を勧めてください。通常の開発環境を持つ事で、作業がスムーズになります。
ko: 수강생들이 카고를 설치하고 로컬 편집기를 이용하도록 독려하세요. 조금 귀찮을 수도 있지만, 이렇게 해야만 좀 더 실제와 가까운 개발환경을 갖추게 되는 것입니다.
pt_br: Tente encorajar os participantes do curso a instalar o Cargo e usar um editor local. Isso facilitará a vida deles, pois eles terão um ambiente normal de desenvolvimento.
uk: Запропонуйте учасникам заняття встановити Cargo та використовувати локальний редактор. Це полегшить їм життя, тому що у них буде відповідне середовище розробки.

source: Welcome to Day 1
es: Te damos la bienvenida al Día 1
fa: به روز اول خوش آمدید
ja: Day 1へようこそ
ko: 1일차 개요
pt_br: Bem-vindo ao Dia 1
uk: Ласкаво просимо до Дня 1

source: This is the first day of Rust Fundamentals. We will cover a lot of ground today:
fa: این اولین روز از مبانی Rust است. ما امروز بخش‌های فابل توجه‌ای را پوشش خواهیم داد:
ko: 강의 첫 날입니다. 오늘 배울 것이 참 많습니다:
pt_br: Este é o primeiro dia de Fundamentos do Rust. Nós iremos cobrir muitos pontos hoje:
uk: Це перший день Rust Fundamentals. Сьогодні ми розглянемо багато питань:

source: Basic Rust syntax: variables, scalar and compound types, enums, structs, references, functions, and methods.
es: Sintaxis básica Rust: variables, scalar y tipos compuestos, enums, structs, references, funciones, y métodos.
fa: سینتکس‌های مقدماتی: متغیرها, تایپ‌های عددی و تایپ‌های مرکب, enums, structs, مراجع, توابع, و متدها.
ja: Rustの基本的な構文： 変数、スカラー型と複合型、列挙型、構造体、参照、関数、メソッド。
ko: 러스트 기본 문법: 변수, 스칼라 / 복합 타입, 열거형, 구조체, 참조형, 함수와 메서드.
pt_br: Sintaxe Rust básica: variáveis, tipos escalares e compostos, enums, structs, referências, funções e métodos.
uk: Базовий синтаксис Rust: змінні, скалярні та складені типи, переліки, структури, посилання, функції та методи.

source: Types and type inference.
pt_br: Tipos e Inferência de Tipo
uk: Типи та виведення типів.

source: Control flow constructs: loops, conditionals, and so on.
fa: ساختارهای جریان کنترل: حلقه ها، شرط ها و غیره.
ja: 制御フローの構造: ループ、条件など。
pt_br: Construções de fluxo de controle: loops, condicionais, e assim por diante.
uk: Конструкції потоку управління: цикли, умовні переходи і так далі.

source: User-defined types: structs and enums.
fa: تایپ های تعریف شده توسط کاربر: ساختارها و enums.
ja: ユーザー定義型: 構造体と列挙型。
pt_br: Tipos definidos pelo usuário: structs e enums.
uk: Типи, визначені користувачем: структури та переліки.

source: Pattern matching: destructuring enums, structs, and arrays.
fa: تطابق الگو: تجزیه و تحلیل enums, structs و آرایه‌ها.
ja: パターン マッチング: 列挙型、構造体、配列の分解。
ko: 패턴 매칭: 열거형, 구조체 그리고 배열 분해.
pt_br: Correspondência de padrões: desestruturando enums, structs, e matrizes.
uk: Зіставлення шаблонів: деструктуризація переліків, структур і масивів.

source: Schedule
fa: برنامه زمانی
ja: スケジュール
pt_br: Agenda
uk: Розклад

source: Please remind the students that:
es: Recuerda a los alumnos lo siguiente:
fa: لطفا به دانشجویان یادآوری کنید:
ja: 受講生に伝えてください：
ko: 학생들에게 다음을 상기시켜 주시기 바랍니다:
pt_br: Lembre aos alunos que:
uk: Будь ласка, нагадайте учням, що:

source: They should ask questions when they get them, don't save them to the end.
es: Deben hacer las preguntas cuando surgen, no las guarden hasta el final.
fa: آنها باید سؤالاتی را که به دست آوردند بپرسند، آنها را تا انتها ذخیره نکنید.
ko: 궁금한 점이 있으면 주저하지 말고 질문 해야 합니다.
pt_br: Eles devem fazer perguntas na hora, não as guarde para o fim.
uk: Вони повинні задавати питання, коли вони їх мають, а не зберігати їх до кінця.

source: The class is meant to be interactive and discussions are very much encouraged!
es: El curso está pensado para ser muy interactivo, por lo que te recomendamos que dejes que las preguntas guíen el aprendizaje de Rust.
fa: کلاس قرار است تعاملی باشد و بحث‌ها بسیار مورد تشویق قرار می گیرند!
ko: 이 수업은 상호작용이 요합니다. 토론을 망설이지 마세요!
pt_br: A aula é para ser interativa e as discussões são muito encorajadas!
uk: Клас має на меті бути інтерактивним, тому дискусії дуже заохочуються!

source: As an instructor, you should try to keep the discussions relevant, i.e., keep the discussions related to how Rust does things vs some other language. It can be hard to find the right balance, but err on the side of allowing discussions since they engage people much more than one-way communication.
fa: به‌عنوان یک مربی، باید سعی کنید بحث‌ها را مرتبط نگه دارید، به عنوان مثال، بحث‌های مرتبط با نحوه انجام کارها توسط Rust در مقابل برخی زبان‌های دیگر را حفظ کنید. پیدا کردن تعادل مناسب می تواند سخت باشد، اما در مورد اجازه دادن به بحث اشتباه کنید، زیرا آنها بیشتر از ارتباط یک طرفه افراد را درگیر می کنند.
pt_br: Como instrutor, você deve tentar manter as discussões relevantes, ou seja, mantenha as discussões relacionadas a como o Rust faz as coisas versus alguma outra linguagem. Pode ser difícil encontrar o equilíbrio certo, mas procure permitir mais discussões, uma vez que elas engajam as pessoas muito mais do que uma comunicação unidirecional.
uk: Як інструктор, ви повинні намагатися підтримувати обговорення актуальними, тобто підтримувати обговорення, пов’язані з тим, як Rust щось робить на відміну від іншої мови. Буває важко знайти правильний баланс, але краще дозволити дискусії, оскільки вони залучають людей набагато більше, ніж одностороннє спілкування.

source: The questions will likely mean that we talk about things ahead of the slides.
es: Las preguntas deberían ser sobre cosas acerca del contenido de los slides.
fa: احتمالاً سؤالات به این معنی است که ما در مورد چیزهایی قبل از اسلاید صحبت می کنیم.
ko: 질문이 슬라이드보다 앞서가도 괜찮습니다.
pt_br: As perguntas provavelmente farão com que falemos sobre coisas antes dos slides.
uk: Запитання, швидше за все, означатимуть, що ми обговорюємо речі, які випереджають слайди.

source: This is perfectly okay! Repetition is an important part of learning. Remember that the slides are just a support and you are free to skip them as you like.
es: Esto está perfecto! Repetir es una parte importante del aprendizaje. Recuerda que los slides son solo un soporte y tienes libertad de saltearlos cuando quieras.
fa: این اصلاً اشکالی ندارد! تکرار بخش مهمی از یادگیری است. به یاد داشته باشید که اسلایدها فقط یک پشتیبان هستند و شما می توانید هر طور که دوست دارید از آنها صرف نظر کنید.
ko: 학습에 있어서 반복은 매우 중요합니다. 슬라이드는 그저 도움을 줄 뿐, 원하는 대로 건너띄어도 됩니다.
pt_br: Isso está perfeitamente OK! A repetição é uma parte importante do aprendizado. Lembre-se que os slides são apenas um suporte e você está livre para ignorá-los quando quiser.
uk: Це цілком нормально! Повторення є важливою частиною навчання. Пам’ятайте, що слайди є лише підтримкою, і ви можете пропускати їх, якщо забажаєте.

source: The idea for the first day is to show the "basic" things in Rust that should have immediate parallels in other languages. The more advanced parts of Rust come on the subsequent days.
fa: ایده روز اول نشان دادن چیزهای "پایه" در Rust است که باید در زبان های دیگر مشابهت های فوری داشته باشند. قسمت های پیشرفته تر Rust در روزهای بعد عرضه می شوند.
ja: 1 日目は、他の言語にも共通する Rust の「基本的な」事項を示します。Rust のより高度な部分については、後日説明します。
pt_br: A ideia para o primeiro dia é mostrar as coisas "básicas" em Rust que devem ter paralelos imediatos em outras linguagens. As partes mais avançadas do Rust vêm nos dias subsequentes.
uk: Ідея першого дня полягає в тому, щоб показати "базові" речі в Rust, які повинні мати безпосередні паралелі в інших мовах. Більш просунуті частини Rust будуть розглянуті в наступні дні.
