Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Use `cargo`, trusting a [toolchain](https://rustup.rs/) and/or [crates downloaded from the internet](https://crates.io/)
fa: از `cargo` استفاده کنید، به یک [toolchain](https://rustup.rs/) و/یا [crateهای دانلود شده از اینترنت]‌(https://crates.io/) اعتماد کنید.
pt_br: Use `cargo`, confiando em um [conjunto de ferramentas](https://rustup.rs/) e/ou [crates baixados da internet](https://crates.io/)
uk: Використовувати `cargo`, довіряючи [інструментарію](https://rustup.rs/) та/або [крейтам, завантаженим з Інтернету](https://crates.io/).

source: From here on we'll be focusing on `gn` and `ninja`, because this is how Rust code can be built into the Chromium browser. At the same time, Cargo is an important part of the Rust ecosystem and you should keep it in your toolbox.
fa: از اینجا به بعد ما روی `gn` و `ninja` تمرکز خواهیم کرد، زیرا به این ترتیب می‌توان کد Rust را در مرورگر Chromium ایجاد کرد. در عین حال، Cargo بخش مهمی از اکوسیستم Rust است و شما باید آن را در جعبه ابزار خود نگه دارید.
pt_br: Daqui em diante, estaremos focando em `gn` e `ninja`, porque é assim que o código Rust pode ser compilado no navegador Chromium. Ao mesmo tempo, o Cargo é uma parte importante do ecossistema Rust e você deve mantê-lo em sua caixa de ferramentas.
uk: Відтепер ми зосередимося на `gn` та `ninja`, тому що саме так код Rust можна вбудувати в браузер Chromium. У той же час, Cargo є важливою частиною екосистеми Rust, і ви повинні мати його у своєму арсеналі інструментів.

source: Mini exercise
fa: خرده تمرین
pt_br: Mini exercício
uk: Міні вправа

source: Split into small groups and:
fa: به گروه‌های کوچک تقسیم شده و:
pt_br: Dividam-se em pequenos grupos e:
uk: Розділіться на невеликі групи та:

source: Brainstorm scenarios where `cargo` may offer an advantage and assess the risk profile of these scenarios.
fa: سناریوهای طوفان فکری که در آن `cargo` ممکن است مزیتی را ارائه دهد و نمایه ریسک‌های این سناریوها را ارزیابی کند.
pt_br: Faça um brainstorm de cenários em que o `cargo` pode oferecer uma vantagem e avalie o perfil de risco desses cenários.
uk: Проведіть мозковий штурм сценаріїв, де `cargo` може дати перевагу, і оцініть профіль ризику цих сценаріїв.

source: Discuss which tools, libraries, and groups of people need to be trusted when using `gn` and `ninja`, offline `cargo`, etc.
fa: در هنگام استفاده از `gn` و `ninja`و `cargo` آفلاین و غیره در مورد ابزارها، کتابخانه‌ها و گروه‌هایی از افراد بحث کنید.
pt_br: Discuta quais ferramentas, bibliotecas e grupos de pessoas precisam ser confiáveis ao usar `gn` e `ninja`, `cargo` offline, etc.
uk: Обговоріть, яким інструментам, бібліотекам і групам людей варто довіряти при використанні `gn` і `ninja`, офлайнового `cargo` тощо.

source: Ask students to avoid peeking at the speaker notes before completing the exercise. Assuming folks taking the course are physically together, ask them to discuss in small groups of 3-4 people.
fa: از دانش‌آموزان بخواهید که قبل از اتمام تمرین از نگاه کردن به یادداشت‌های سخنران خودداری کنند. با فرض اینکه افرادی که دوره را می‌گذرانند از نظر فیزیکی با هم هستند، از آنها بخواهید در گروه های کوچک ۳-۴ نفره بحث کنند.
pt_br: Peça aos alunos que evitem olhar as notas do apresentador antes de completar o exercício. Supondo que as pessoas que fazem o curso estejam fisicamente juntas, peça-lhes que discutam em pequenos grupos de 3-4 pessoas.
uk: Попросіть студентів не підглядати в нотатки доповідача до завершення вправи. Припускаючи, що учасники курсу фізично знаходяться разом, попросіть їх обговорити питання в малих групах по 3-4 особи.

source: Notes/hints related to the first part of the exercise ("scenarios where Cargo may offer an advantage"):
fa: نکته‌ها/تکنیک‌ها مربوط به بخش اول تمرین ("سناریوهایی که Cargo ممکن است مزیتی را ارائه دهد"):
pt_br: Notas/dicas relacionadas à primeira parte do exercício ("cenários em que o Cargo pode oferecer uma vantagem"):
uk: Зауваження/підказки, пов'язані з першою частиною вправи ("сценарії, в яких Cargo може мати перевагу"):

source: It's fantastic that when writing a tool, or prototyping a part of Chromium, one has access to the rich ecosystem of crates.io libraries. There is a crate for almost anything and they are usually quite pleasant to use. (`clap` for command-line parsing, `serde` for serializing/deserializing to/from various formats, `itertools` for working with iterators, etc.).
fa: این فوق العاده است که هنگام نوشتن یک ابزار یا نمونه‌سازی بخشی از Chromium به اکوسیستم غنی کتابخانه‌های crates.io دسترسی داشته باشید. تقریباً برای هر چیزی یک crate وجود دارد و معمولاً استفاده از آنها بسیار لذت بخش است. (`clap` برای تجزیه خط فرمان، `serde` برای سریال‌سازی/جداسازی‌سریال به/از قالب‌های مختلف، `itertools` برای کار با تکرارکننده‌ها (iterators) و غیره).
pt_br: É fantástico que, ao escrever uma ferramenta ou prototipar uma parte do Chromium, tenha-se acesso ao rico ecossistema de bibliotecas do crates.io. Há um _crate_ para quase tudo e eles geralmente são bastante agradáveis de usar. (`clap` para análise de linha de comando, `serde` para serialização/desserialização para/de vários formatos, `itertools` para trabalhar com iteradores, etc.).
uk: Це фантастично, що при написанні інструменту або прототипуванні частини Chromium, ви маєте доступ до багатої екосистеми бібліотек crates.io. Майже для будь-чого є своя бібліотека, і вони, як правило, досить приємні у використанні. (`clap` для розбору командного рядка, `serde` для серіалізації/десеріалізації у/з різні формати, `itertools` для роботи з ітераторами тощо).

source: `cargo` makes it easy to try a library (just add a single line to `Cargo.toml` and start writing code)
fa: ‏ `cargo` بررسی کردن یک کتابخانه را آسان می‌کند (فقط یک خط به `Cargo.toml` اضافه کنید و شروع به نوشتن کد کنید)
pt_br: O `cargo` torna fácil experimentar uma biblioteca (basta adicionar uma única linha ao `Cargo.toml` e começar a escrever o código)
uk: `cargo` дозволяє легко спробувати бібліотеку (просто додайте один рядок до `Cargo.toml` і починайте писати код)

source: It may be worth comparing how CPAN helped make `perl` a popular choice. Or comparing with `python` + `pip`.
fa: شاید ارزش این را داشته باشد که چگونه CPAN به انتخاب `perl` کمک کرد. یا مقایسه با `python` + `pip`.
pt_br: Pode valer a pena comparar como o CPAN ajudou a tornar o `perl` uma escolha popular. Ou comparar com `python` + `pip`.
uk: Можливо, варто порівняти, як CPAN допоміг зробити `perl` популярним вибором. Або порівняти з `python` + `pip`.

source: Development experience is made really nice not only by core Rust tools (e.g. using `rustup` to switch to a different `rustc` version when testing a crate that needs to work on nightly, current stable, and older stable) but also by an ecosystem of third-party tools (e.g. Mozilla provides `cargo vet` for streamlining and sharing security audits; `criterion` crate gives a streamlined way to run benchmarks).
pt_br: A experiência de desenvolvimento é tornada realmente agradável não apenas pelas ferramentas principais do Rust (por exemplo, usando `rustup` para alternar para uma versão diferente do `rustc` ao testar um _crate_ que precisa funcionar no nightly, estável atual e estável antigo), mas também por um ecossistema de ferramentas de terceiros (por exemplo, a Mozilla fornece `cargo vet` para agilizar e compartilhar auditorias de segurança; o _crate_ `criterion` fornece uma maneira simplificada de executar _benchmarks_).
uk: Процес розробки полегшують не лише основні інструменти Rust (наприклад, використання `rustup` для перемикання на іншу версію `rustc` при тестуванні крейту, який має працювати на нічних, поточних стабільних та старих стабільних версіях), але й екосистема сторонніх інструментів (наприклад, Mozilla надає `cargo vet` для впорядкування та спільного використання аудитів безпеки; крейт `criterion` надає спрощений спосіб запуску бенчмарків).

source: `cargo` makes it easy to add a tool via `cargo install --locked cargo-vet`.
fa: ‏ `cargo` افزودن ابزارها را از طریق`cargo install --locked cargo-vet` تسهیل می‌کند.
pt_br: O `cargo` torna fácil adicionar uma ferramenta via `cargo install --locked cargo-vet`.
uk: `cargo` спрощує додавання інструмента за допомогою `cargo install --locked cargo-vet`.

source: It may be worth comparing with Chrome Extensions or VScode extensions.
fa: ممکن است ارزش مقایسه با برنامه‌های افزودنی کروم یا افزونه‌های VScode را داشته باشد.
pt_br: Pode valer a pena comparar com as extensões do Chrome ou as extensões do VScode.
uk: Можливо, варто порівняти з розширеннями Chrome або VScode.

source: Broad, generic examples of projects where `cargo` may be the right choice:
fa: نمونه‌های کلی و عمومی از پروژه‌هایی که `cargo` ممکن است انتخاب مناسبی باشد:
pt_br: Exemplos amplos e genéricos de projetos em que o `cargo` pode ser a escolha certa:
uk: Широкі, загальні приклади проектів, де `cargo` може бути правильним вибором:

source: Perhaps surprisingly, Rust is becoming increasingly popular in the industry for writing command line tools. The breadth and ergonomics of libraries is comparable to Python, while being more robust (thanks to the rich typesystem) and running faster (as a compiled, rather than interpreted language).
fa: شاید تعجب‌آور باشد که Rust به طور فزاینده ای در صنعت برای نوشتن ابزارهای خط فرمان محبوب می‌شود. گستردگی و ارگونومی کتابخانه‌ها با پایتون قابل مقایسه است، درحالی‌که قوی‌تر (به لطف تایپ سیستم غنی) است و سریعتر کار می‌کند (به عنوان یک زبان کامپایل شده و نه مفسری).
pt_br: Talvez surpreendentemente, o Rust está se tornando cada vez mais popular na indústria para escrever ferramentas de linha de comando. A amplitude e a ergonomia das bibliotecas são comparáveis ao Python, enquanto são mais robustas (graças ao rico sistema de tipos) e executam mais rápido (como uma linguagem compilada, em vez de interpretada).
uk: Можливо, це дивно, але Rust стає все більш популярним в індустрії написання інструментів командного інтерфейсу. Широта та ергономічність бібліотек порівнянна з Python, при цьому вона більш надійна (завдяки багатій системі типів) і працює швидше (як скомпільована, а не інтерпретована мова).

source: Participating in the Rust ecosystem requires using standard Rust tools like Cargo. Libraries that want to get external contributions, and want to be used outside of Chromium (e.g. in Bazel or Android/Soong build environments) should probably use Cargo.
fa: مشارکت در اکوسیستم Rust مستلزم استفاده از ابزار استاندارد Rust مانند Cargo است. کتابخانه‌هایی که می‌خواهند مشارکت‌های خارجی دریافت کنند و می‌خواهند خارج از Chromium استفاده شوند (مثلاً در محیط‌های ساخت Bazel یا Android/Soong) احتمالاً باید از Cargo استفاده کنند.
pt_br: Participar do ecossistema Rust requer o uso de ferramentas padrão do Rust, como o Cargo. Bibliotecas que desejam obter contribuições externas e desejam ser usadas fora do Chromium (por exemplo, em ambientes de compilação Bazel ou Android/Soong) devem usar o Cargo.
uk: Для участі в екосистемі Rust потрібно використовувати стандартні інструменти Rust, такі як Cargo. Бібліотекам, які хочуть отримати зовнішні надходження і використовувати їх поза межами Chromium (наприклад, у середовищах збірки Bazel або Android/Soong), ймовірно, варто використовувати Cargo.

source: Examples of Chromium-related projects that are `cargo`\-based:
fa: نمونه‌هایی از پروژه‌های مرتبط با Chromium که مبتنی بر `cargo` هستند:
pt_br: Exemplos de projetos relacionados ao Chromium que são baseados no `cargo`:
uk: Приклади проектів, пов'язаних з Chromium, які базуються на `cargo`:

source: `serde_json_lenient` (experimented with in other parts of Google which resulted in PRs with performance improvements)
fa: ‏ `serde_json_lenient` (در قسمت‌های دیگر Google آزمایش شده که منجر به PRهایی با بهبود در عملکرد می‌باشد.)
pt_br: `serde_json_lenient` (experimentado em outras partes do Google, o que resultou em PRs com melhorias de desempenho)
uk: `serde_json_lenient` ( з ним експериментували в інших частинах Google, що призвело до PRs з покращенням продуктивності)

source: Fontations libraries like `font-types`
fa: کتابخانه‌های فونت مانند `font-types`
pt_br: Bibliotecas Fontations como `font-types`
uk: Бібліотеки шрифтів на кшталт `font-types`

source: `gnrt` tool (we will meet it later in the course) which depends on `clap` for command-line parsing and on `toml` for configuration files.
fa: ابزار `gnrt` (ما بعداً در دوره با آن آشنا خواهیم شد) که برای تجزیه خط فرمان به `clap` و برای فایل‌های پیکربندی به `toml` بستگی دارد.
pt_br: Ferramenta `gnrt` (vamos conhecê-la mais adiante no curso) que depende do `clap` para análise de linha de comando e do `toml` para arquivos de configuração.
uk: Інструмент `gnrt` (ми познайомимося з ним пізніше у курсі), який залежить від `clap` для розбору командного рядка і від `toml` для конфігураційних файлів.

source: Disclaimer: a unique reason for using `cargo` was unavailability of `gn` when building and bootstrapping Rust standard library when building Rust toolchain.
uk: Застереження: єдиною причиною використання `cargo` була недоступність `gn` при збиранні та завантаженні стандартної бібліотеки Rust під час побудови інструментарію Rust.

source: `run_gnrt.py` uses Chromium's copy of `cargo` and `rustc`. `gnrt` depends on third-party libraries downloaded from the internet, but `run_gnrt.py` asks `cargo` that only `--locked` content is allowed via `Cargo.lock`.)
fa: ‏ `run_gnrt.py` از کپی Chromium از `cargo` و `rustc` استفاده می‌کند.`gnrt` به کتابخانه‌های شخص ثالثی بستگی دارد که از اینترنت دانلود شده‌اند، اما `run_gnrt.py` از `cargo` می‌پرسد که فقط محتوای `--locked` از طریق `Cargo.lock` مجاز است.)
uk: У `run_gnrt.py` використовується копія `cargo` та `rustc` у Chromium. `gnrt` залежить від сторонніх бібліотек, завантажених з інтернету, тому `run_gnrt.py` запитує `cargo` про те, що лише `--locked` контент дозволено через `Cargo.lock`.

source: Students may identify the following items as being implicitly or explicitly trusted:
fa: دانش‌آموزان ممکن است موارد زیر را به طور ضمنی یا صریح مورد اعتماد تشخیص‌دهند:
pt_br: Os alunos podem identificar os seguintes itens como sendo implicitamente ou explicitamente confiáveis:
uk: Студенти можуть визначити наступні пункти як такі, що викликають у них явну чи неявну довіру:

source: `rustc` (the Rust compiler) which in turn depends on the LLVM libraries, the Clang compiler, the `rustc` sources (fetched from GitHub, reviewed by Rust compiler team), binary Rust compiler downloaded for bootstrapping
fa: `rustc` (کامپایلر Rust) که به نوبه خود به کتابخانه‌های LLVM، کامپایلر Clang، منابع `rustc` (برگرفته از GitHub، بررسی شده توسط تیم کامپایلر Rust) وابسته است، کامپایلر Rust باینری که برای راه‌اندازی بارگیری (bootstrapping) شده است
pt_br: `rustc` (o compilador Rust), que por sua vez depende das bibliotecas LLVM, do compilador Clang, das fontes `rustc` (buscadas no GitHub, revisadas pela equipe do compilador Rust), compilador Rust binário baixado para inicialização
uk: `rustc` (компілятор Rust), який, у свою чергу, залежить від бібліотек LLVM, компілятор Clang, вихідні коди `rustc` (отримані з GitHub, переглянуті командою компілятора Rust), бінарний компілятор Rust, завантажений для початкової обробки

source: `rustup` (it may be worth pointing out that `rustup` is developed under the umbrella of the https://github.com/rust-lang/ organization - same as `rustc`)
fa: ‏ `rustup` (شاید شایان ذکر است که `rustup` زیر چتر سازمان https://github.com/rust-lang/ - همانند `rustc` توسعه یافته است)
pt_br: `rustup` (pode valer a pena observar que o `rustup` é desenvolvido sob a supervisão da organização https://github.com/rust-lang/ - o mesmo que o `rustc`)
uk: `rustup` (варто зазначити, що `rustup` розробляється під егідою організації https://github.com/rust-lang/ - так само, як і `rustc`)

source: `cargo`, `rustfmt`, etc.
fa: `cargo`, `rustfmt`,سایر موارد.
uk: `cargo`, `rustfmt` тощо.

source: Various internal infrastructure (bots that build `rustc`, system for distributing the prebuilt toolchain to Chromium engineers, etc.)
fa: زیرساخت‌های داخلی مختلف (ربات‌هایی که `rustc` می‌سازند، سیستمی برای توزیع toolchain از پیش‌ساخته شده بین مهندسان Chromium و بقیغ)
pt_br: Diversas infraestruturas internas (robôs que compilam `rustc`, sistema para distribuir o conjunto de ferramentas pré-compilado para engenheiros do Chromium, etc.)
uk: Різноманітна внутрішня інфраструктура (боти, що збирають `rustc`, система розповсюдження готового інструментарію серед інженерів Chromium тощо).

source: Cargo tools like `cargo audit`, `cargo vet`, etc.
fa: ابزار Cargo مانند `cargo audit`، `cargo vet` و غیره.
pt_br: Ferramentas do Cargo como `cargo audit`, `cargo vet`, etc.
uk: Інструменти Cargo, такі як `cargo audit`, `cargo vet`тощо.

source: Rust libraries vendored into `//third_party/rust` (audited by security@chromium.org)
fa: کتابخانه‌های Rust در `//third_party/rust` عرضه شده است (بازرسی شده توسط security@chromium.org)
pt_br: Bibliotecas Rust hospedadas em `//third_party/rust` (auditadas por security@chromium.org)
uk: Бібліотеки Rust, що постачаються у `//third_party/rust` (перевірено security@chromium.org)

source: Other Rust libraries (some niche, some quite popular and commonly used)
fa: سایر کتابخانه‌های Rust (بعضی خاص، برخی کاملاً محبوب و پرکاربرد)
pt_br: Outras bibliotecas Rust (algumas de nicho, algumas bastante populares e comumente usadas)
uk: Інші бібліотеки Rust (деякі нішеві, деякі досить популярні та часто застосовуються)

source: Chromium Rust policy
fa: رویکرد Chromium Rust
pt_br: Política do Rust para Chromium
uk: Політика Chromium щодо Rust

source: Chromium does not yet allow first-party Rust except in rare cases as approved by Chromium's [Area Tech Leads](https://source.chromium.org/chromium/chromium/src/+/main:ATL_OWNERS).
fa: ‏ Chromium هنوز Rust شخص اول را مجاز نمی‌کند، مگر در موارد نادر که توسط [Area Tech Leads](https://source.chromium.org/chromium/chromium/src/+/main:ATL_OWNERS) تأیید شده است.
pt_br: O Chromium ainda não permite que Rust seja utlizado diretamente, exceto em casos raros, conforme aprovado pelos [Area Tech Leads](https://source.chromium.org/chromium/chromium/src/+/main:ATL_OWNERS) do Chromium.
uk: Chromium поки що не дозволяє сторонній Rust, за винятком рідкісних випадків, схвалених Chromium [Area Tech Leads](https://source.chromium.org/chromium/chromium/src/+/main:ATL_OWNERS).

source: Chromium's policy on third party libraries is outlined [here](https://chromium.googlesource.com/chromium/src/+/main/docs/adding_to_third_party.md#rust) - Rust is allowed for third party libraries under various circumstances, including if they're the best option for performance or for security.
fa: رویکردهای Chromium در مورد کتابخانه‌های شخص ثالث [اینجا](https://chromium.googlesource.com/chromium/src/+/main/docs/adding_to_third_party.md#rust) مشخص شده است. Rust برای کتابخانه‌های شخص ثالث تحت شرایط مختلف مجاز است، از جمله اینکه آیا آنها بهترین گزینه برای کارایی بالا یا موارد امنیتی هستند.
pt_br: A política do Chromium sobre bibliotecas de terceiros é descrita [aqui](https://chromium.googlesource.com/chromium/src/+/main/docs/adding_to_third_party.md#rust) - o Rust é permitido para bibliotecas de terceiros em várias circunstâncias, incluindo se forem a melhor opção para desempenho ou para segurança.
uk: Політика Chromium щодо сторонніх бібліотек описана [тут](https://chromium.googlesource.com/chromium/src/+/main/docs/adding_to_third_party.md#rust) - Rust дозволяється для сторонніх бібліотек за різних обставин, зокрема, якщо вони є найкращим варіантом для продуктивності або безпеки.

source: Very few Rust libraries directly expose a C/C++ API, so that means that nearly all such libraries will require a small amount of first-party glue code.
fa: تعداد بسیار کمی از کتابخانه‌های Rust مستقیماً یک C/C++ API را در معرض دید (expose) قرار می‌دهند، به این معنی که تقریباً همه این کتابخانه‌ها به مقدار کمی glue code اول شخص نیاز دارند.
pt_br: Muito poucas bibliotecas Rust expõem diretamente uma API C/C++, o que significa que quase todas essas bibliotecas exigirão diretamente um pouco de código de integração.
uk: Дуже мало бібліотек Rust безпосередньо надають C/C++ API, а це означає, що майже всі такі бібліотеки потребують невеликої кількості стороннього коду для склеювання.

source: ```bob "C++" Rust .- - - - - - - - - -. .- - - - - - - - - - - - - - - - - - - - - - -. : : : : : Existing Chromium : : Chromium Rust Existing Rust : : "C++" : : "wrapper" crate : : +---------------+ : : +----------------+ +-------------+ : : | | : : | | | | : : | o-----+-+-----------+-+-> o-+----------+--> | : : | | : Language : | | Crate | | : : +---------------+ : boundary : +----------------+ API +-------------+ : : : : : `- - - - - - - - - -' `- - - - - - - - - - - - - - - - - - - - - - -' ```
uk: ```bob "C++" Rust .- - - - - - - - - -. .- - - - - - - - - - - - - - - - - - - - - - -. : : : : : Існуючий Chromium : : Chromium Rust Існуючий Rust : : "C++" : : "обгортка" крейт : : +---------------+ : : +----------------+ +-------------+ : : | | : : | | | | : : | o-----+-+-----------+-+-> o-+----------+--> | : : | | : Межі : | | Крейт | | : : +---------------+ : мови : +----------------+ API +-------------+ : : : : : `- - - - - - - - - -' `- - - - - - - - - - - - - - - - - - - - - - -' ```

source: First-party Rust glue code for a particular third-party crate should normally be kept in `third_party/rust/<crate>/<version>/wrapper`.
fa: کد Rust glue اول شخص برای یک crate شخص ثالث خاص معمولاً باید در `third_party/rust/<crate>/<version>/wrapper` نگهداری شود.
pt_br: O código próprio de integração Rust para um determinado _crate_ de terceiros deve ser mantido normalmente em `third_party/rust/<crate>/<version>/wrapper`.
uk: Код склейки Rust від сторонніх розробників для конкретного стороннього скрипта зазвичай слід зберігати у `third_party/rust/<crate>/<version>/wrapper`.

source: Because of this, today's course will be heavily focused on:
fa: به‌همین دلیل، دوره‌ی امروز به شدت بر روی موارد زیر متمرکز خواهد شد:
pt_br: Por causa disso, o curso de hoje será fortemente focado em:
uk: Через це сьогоднішній курс буде значною мірою сфокусований на:

source: Bringing in third-party Rust libraries ("crates")
fa: آوردن کتابخانه های Rust شخص ثالث ("crates")
pt_br: Trabalhando com bibliotecas Rust de terceiros ("crates")
uk: Залучення сторонніх бібліотек Rust ("крейтів")

source: Writing glue code to be able to use those crates from Chromium C++.
fa: نوشتن glue code برای اینکه بتوانید به کمک آن crateها از ++Chromium C استفاده کنید.
pt_br: Escrevendo código de integração para poder usar esses _crates_ a partir do C++ do Chromium.
uk: Написання коду для використання цих крейтів з Chromium C++.

source: If this policy changes over time, the course will evolve to keep up.
fa: اگر این رویکرد در طول زمان تغییر کند، این دوره به گونه‌ای تکامل می‌یابد که در مسیر مناسب ادامه یابد.
pt_br: Se essa política mudar com o tempo, o curso evoluirá para acompanhar.
uk: Якщо ця політика з часом зміниться, курс буде розвиватися, щоб не відставати від неї.

source: Build rules
fa: قوانین Build
pt_br: Regras de Compilação
uk: Правила побудови

source: Rust code is usually built using `cargo`. Chromium builds with `gn` and `ninja` for efficiency --- its static rules allow maximum parallelism. Rust is no exception.
fa: کد Rust معمولاً با استفاده از `cargo` ساخته می‌شود. Chromium با `gn` و `ninja` جهت کارایی بیشتر ساخته می‌شود --- قواعد استاتیک آن حداکثر موازی‌سازی را امکان‌پذیر می‌سازد. Rust نیز از این قاعده مستثنی نیست.
pt_br: O código Rust geralmente é compilado usando `cargo`. O Chromium é compilado com `gn` e `ninja` para eficiência --- suas regras estáticas permitem a máxima paralelização. O Rust não é exceção.
uk: Код Rust зазвичай збирається за допомогою `cargo`. Chromium збирає за допомогою `gn` та `ninja` для ефективності --- його статичні правила дозволяють максимальний паралелізм. Rust не є винятком.
