Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: This assumes full knowledge of the target platform. Not recommended for production.
es: Esto supone un conocimiento completo de la plataforma objetivo. No se recomienda para producción.
fa: این مستلزم آگاهی کامل از پلتفرم هدف است و برای production توصیه نمی‌شود.
ja: これは、ターゲット プラットフォームを完全に理解していることを前提としています。本番環境での使用推奨されません。
ko: 이러한 방법은 타겟 플랫폼의 모든 부분을 사전에 알고 있다는 전제를 깔고 있습니다. 상용 프로젝트에서는 권장하지 않습니다.
pt_br: Isso pressupõe conhecimento total da plataforma de destino. Não recomendado para produção.
uk: Це передбачає повне знання цільової платформи. Не рекомендується для використання.

source: We will look at better options next.
es: A continuación, estudiaremos otras opciones mejores.
fa: در ادامه گزینه‌های بهتر را بررسی خواهیم کرد.
ja: 次に、より良い選択肢を見ていきます。
ko: 좀 더 나은 옵션을 살펴보겠습니다.
pt_br: Veremos opções melhores a seguir.
uk: Далі ми розглянемо кращі варіанти.

source: Using Bindgen
es: Uso de Bindgen
fa: با استفاده از Bindgen
ja: Bindgen の使用
ko: Bindgen 사용하기
pt_br: Usando Bindgen
uk: Використання Bindgen

source: The [bindgen](https://rust-lang.github.io/rust-bindgen/introduction.html) tool can auto-generate bindings from a C header file.
es: La herramienta [bindgen](https://rust-lang.github.io/rust-bindgen/introduction.html) puede generar automáticamente enlaces desde un archivo de encabezado de C.
fa: ابزار [bindgen](https://rust-lang.github.io/rust-bindgen/introduction.html) می‌تواند اتصالات را از یک فایل هدر C به طور خودکار ایجاد کند.
ja: [bindgen](https://rust-lang.github.io/rust-bindgen/introduction.html) ツールを使用すると、C ヘッダー ファイルからバインディングを自動生成できます。
ko: [bindgen](https://rust-lang.github.io/rust-bindgen/introduction.html)는 C 헤더파일에서 러스트 바인딩을 자동으로 생성하는 도구입니다.
pt_br: A ferramenta [bindgen](https://rust-lang.github.io/rust-bindgen/introduction.html) pode gerar vínculos (_bindings_) automaticamente a partir de um arquivo de cabeçalho C.
uk: Інструмент [bindgen](https://rust-lang.github.io/rust-bindgen/introduction.html) може автоматично генерувати прив’язки з файлу заголовка C.

source: First create a small C library:
es: En primer lugar, crea una biblioteca de C pequeña:
fa: ابتدا یک کتابخانه کوچک C ایجاد کنید:
ja: まず、小さな C ライブラリを作成します。
ko: 먼저 작은 C라이브러리를 만들어 보겠습니다:
pt_br: Primeiro crie uma pequena biblioteca C:
uk: Спочатку створіть невелику бібліотеку C:

source: "| Happy Birthday %s!\n"
pt_br: "|Feliz Aniversário %s!\n"
uk: "| З днем народженняy %s!\n"

source: "| Congratulations with the %i years!\n"
pt_br: "|Parabéns pelos %i anos!\n"
uk: "| Вітаємо з %i роками!\n"

source: Add this to your `Android.bp` file:
es: Añade lo siguiente a tu archivo `Android.bp`:
fa: این را به فایل `Android.bp` خود اضافه کنید:
ja: これを `Android.bp` ファイルに追加します。
ko: `Android.bp` 파일에 아래를 추가합니다:
pt_br: Adicione isto ao seu arquivo `Android.bp`:
uk: Додайте це до свого файлу `Android.bp`:

source: Create a wrapper header file for the library (not strictly needed in this example):
es: Crea un archivo de encabezado de envoltorio para la biblioteca (no es estrictamente necesario en este ejemplo):
fa: یک فایل هدر wrapper برای کتابخانه ایجاد کنید (در این مثال به شدت مورد نیاز نیست):
ja: ライブラリのラッパー ヘッダー ファイルを作成します（この例では必須ではありません）。
ko: 라이브러리에 대한 헤더 파일을 만듭니다(이 예시에서는 반드시 필요한 것은 아닙니다.):
pt_br: Crie um arquivo de cabeçalho _wrapper_ para a biblioteca (não estritamente necessário neste exemplo):
uk: Створіть файл заголовка оболонки для бібліотеки (у цьому прикладі це не обов’язково):

source: You can now auto-generate the bindings:
es: Ahora puedes generar automáticamente los enlaces:
fa: اکنون می توانید اتصالات (bindings) را به طور خودکار ایجاد کنید:
ja: これで、バインディングを自動生成できます。
ko: 이제 바인딩을 자동으로 생성할 수 있습니다:
pt_br: Agora você pode gerar automaticamente as vinculações (_bindings_):
uk: Тепер ви можете автоматично генерувати прив’язки:

source: "bindings"
uk: "прив'язки"

source: Finally, we can use the bindings in our Rust program:
es: Por último, podemos utilizar los enlaces de nuestro programa de Rust:
fa: در نهایت، می‌توانیم از bindingها در برنامه Rust خود استفاده کنیم:
ja: これで、Rust プログラムでバインディングを使用できます。
ko: 마침내, 러스트 프로그램에서 바인딩을 사용할 수 있습니다:
pt_br: Finalmente, podemos usar as vinculações (_bindings_) em nosso programa Rust:
uk: Нарешті, ми можемо використовувати прив’язки в нашій програмі Rust:

source: //! Bindgen demo.
ja: //! Bindgen のデモ。
uk: //! Демонстрація Bindgen.

source: // SAFETY: The pointer we pass is valid because it came from a Rust // reference, and the `name` it contains refers to `name` above which also // remains valid. `print_card` doesn't store either pointer to use later // after it returns.
uk: // БЕЗПЕКА: Вказівник, який ми передаємо, є дійсним, оскільки він прийшов з // Rust посилання, а `name`, яке воно містить, посилається на `name` // вище, яке також залишається дійсним. `print_card` не зберігає жодного з вказівників, щоб використати // їх пізніше після повернення.

source: Finally, we can run auto-generated tests to ensure the bindings work:
es: Por último, podemos ejecutar pruebas generadas automáticamente para comprobar que los enlaces funcionan:
fa: در نهایت، ما می‌توانیم تست‌های تولید شده خودکار را برای اطمینان از کارکرد اتصالات (bindings) اجرا کنیم:
ja: これで、自動生成されたテストを実行して、バインディングが機能していることを確認できます。
ko: 마지막으로, 바인딩이 잘 작동하는지 확인하기 위해, 자동 생성된 테스트를 실행해 보겠습니다:
pt_br: Por fim, podemos executar testes gerados automaticamente para garantir que as vinculações funcionem:
uk: Нарешті, ми можемо запустити автоматично згенеровані тести, щоб переконатися, що прив’язки працюють:

source: // Generated file, skip linting
ja: // 生成されたファイル、lint チェックをスキップ
pt_br: // Arquivo gerado, pule o linting
uk: // Згенерований файл, пропустити лінтування

source: Calling Rust
es: Llamar a Rust
fa: فراخوانی Rust
ja: Rust の呼び出し
ko: C에서 러스트 호출
pt_br: Chamando Rust
uk: Виклик Rust

source: Exporting Rust functions and types to C is easy:
es: Es fácil exportar las funciones y los tipos de Rust a C:
fa: صدور یا Exporting توابع و تایپ‌ها از Rust به C آسان است:
ja: Rust の関数と型は、C に簡単にエクスポートできます。
ko: 러스트에서 타입과 함수를 C로 내보내는 것은 간단합니다:
pt_br: Exportar funções e tipos do Rust para C é fácil:
uk: Експортувати функції та типи Rust на C легко:

source: //! Rust FFI demo.
ja: //! Rust FFI のデモ。
uk: //! Демонстрація Rust FFI.

source: /// Analyze the numbers.
ja: /// 数値を分析します。
pt_br: /// Analisar os números.
uk: /// Проаналізувати числа.

source: "x ({x}) is smallest!"
pt_br: "x ({x}) é o menor!"
uk: "x ({x}) є найменшим!"

source: "y ({y}) is probably larger than x ({x})"
fa: " مقدارy ({y}) احتمالا بزرگتر از x ({x}) است"
pt_br: "y ({y}) é provavelmente maior que x ({x})"
uk: "y ({y}) ймовірно більше, ніж x ({x})"

source: We can now call this from a C binary:
es: Ahora podemos llamarlo desde un binario de C:
fa: اکنون می توانیم این را از یک باینری C فراخوانی کنیم:
ja: これで、これを C バイナリから呼び出せるようになりました。
ko: 이제 이 러스트 함수를 C바이너리에서 호출할 수 있습니다:
pt_br: Agora podemos chamá-lo a partir de um binário C:
uk: Тепер ми можемо викликати це з бінарного файлу C:

source: `#[no_mangle]` disables Rust's usual name mangling, so the exported symbol will just be the name of the function. You can also use `#[export_name = "some_name"]` to specify whatever name you want.
es: "#\[no_mangle\]" inhabilita la modificación de nombres habitual de Rust, por lo que el símbolo exportado será el nombre de la función. También puedes utilizar `#[export_name = "some_name"]` para especificar el nombre que quieras.
fa: `#[no_mangle]` نام‌گذاری معمول Rust را غیرفعال می‌کند، بنابراین نماد صادر شده فقط نام تابع خواهد بود. همچنین می‌توانید از `#[export_name = "some_name"]` برای تعیین هر نامی استفاده کنید.
ja: `#[no_mangle]` により Rust の通常の名前のマングリングが無効になるため、エクスポートされたシンボルは単に関数の名前になります。`#[export_name = "some_name"]` を使用して任意の名前を指定することもできます。
ko: `#[no_mangle]`은 러스트의 네임 맹글링(name mangling)을 비활성화하므로 외부로 노출되는 심볼의 이름은 함수의 이름 그대로가 됩니다. 심볼 이름을 바꾸고 싶다면 `#[export_name = "some_name"]`을 사용합니다.
pt_br: `#[no_mangle]` desativa a alteração de name usual do Rust, então o símbolo exportado será apenas o nome da função. Você também pode usar `#[export_name = "algum_nome"]` para especificar qualquer nome que desejar.
uk: `#[no_mangle]` вимикає звичайне перетворення назв Rust, тому експортований символ буде просто назвою функції. Ви також можете використовувати `#[export_name = "some_name"]`, щоб вказати будь-яке ім’я.

source: The [CXX crate](https://cxx.rs/) makes it possible to do safe interoperability between Rust and C++.
es: El [crate CXX](https://cxx.rs/) permite una interoperabilidad segura entre Rust y C++.
fa: این [CXX crate](https://cxx.rs/) امکان همکاری امن بین Rust و C++ را فراهم می‌کند.
ja: [CXX クレート](https://cxx.rs/)を使用すると、Rust と C++ の間で安全な相互運用性を確保できます。
ko: [CXX 크레이트](https://cxx.rs/)는 러스트와 C++ 사이의 안전한 상호운용성을 가능하게 해줍니다.
pt_br: O [crate CXX](https://cxx.rs/) possibilita a interoperabilidade segura entre Rust e C++.
uk: [Крейт CXX](https://cxx.rs/) дає змогу безпечно взаємодіяти між Rust і C++.

source: The overall approach looks like this:
es: El enfoque general es el siguiente:
fa: رویکرد کلی به این صورت است:
ja: 全体的なアプローチは次のようになります。
ko: 전체적인 접근 방법은 다음과 같습니다:
pt_br: A abordagem geral é assim:
uk: Загальний підхід виглядає так:

source: CXX relies on a description of the function signatures that will be exposed from each language to the other. You provide this description using extern blocks in a Rust module annotated with the `#[cxx::bridge]` attribute macro.
fa: ‏ CXX متکی به توصیفی از signatureهای تابع است که از هر زبان به زبان دیگر در معرض دید قرار می‌گیرد. شما این توضیحات را با استفاده از بلوک‌های خارجی در یک ماژول Rust ارائه می‌کنید که با attribute ماکروها `#[cxx::bridge]` شرح داده شده است.
ja: CXX は、各言語から他の言語に公開される関数シグネチャの記述に依存します。この記述は、`#[cxx::bridge]` 属性マクロでアノテーションされた Rust モジュール内の extern ブロックを使用して指定します。
pt_br: O CXX depende de uma descrição das assinaturas de função que serão expostas de cada linguagem para a outra. Você fornece essa descrição usando blocos externos em um módulo Rust anotado com a macro de atributo `#[cxx::bridge]`.
uk: CXX покладається на опис сигнатур функцій, які будуть передаватися з однієї мови до іншої. Ви надаєте цей опис за допомогою блоків extern у модулі Rust, анотованому макросом з атрибутом `#[cxx::bridge]`.

source: // Shared structs with fields visible to both languages.
ja: // 両方の言語からアクセスできるフィールドを持つ共有構造体。
pt_br: // Estruturas compartilhadas com campos visíveis para ambas as linguagens.
uk: // Спільні структури з полями, видимими для обох мов.

source: // Rust types and signatures exposed to C++.
ja: // C++ に公開される Rust の型とシグネチャ。
pt_br: // Tipos e assinaturas Rust expostos ao C++.
uk: // Типи та сигнатури Rust, що доступні у C++.

source: // C++ types and signatures exposed to Rust.
ja: // Rust に公開される C++ の型とシグネチャ。
pt_br: // Tipos e assinaturas C++ expostos ao Rust.
uk: // Типи та сигнатури C++, доступні у Rust.

source: The bridge is generally declared in an `ffi` module within your crate.
fa: پل به طور کلی در یک ماژول `ffi`در crate شما اعلام می‌شود.
ja: ブリッジは通常、クレート内の `ffi` モジュールで宣言します。
pt_br: O _bridge_ geralmente é declarado em um módulo `ffi` dentro do seu _crate_.
uk: Міст зазвичай оголошується у модулі `ffi` у вашому крейті.

source: From the declarations made in the bridge module, CXX will generate matching Rust and C++ type/function definitions in order to expose those items to both languages.
fa: از اعلان‌های (declarations) انجام شده در ماژول پل، CXX تعاریف مطابق با type/function در Rust و ++C را ایجاد می‌کند تا آن موارد را در معرض هر دو زبان قرار دهد.
ja: ブリッジ モジュールで行われた宣言から、CXX はマッチする Rust と C++ の型 / 関数の定義を生成し、これらのアイテムを両方の言語に公開します。
pt_br: A partir das declarações feitas no módulo _bridge_, o CXX gerará definições de tipo/função correspondentes em Rust e C++ para expor esses itens para ambas as linguagens.
uk: На основі оголошень, зроблених у модулі-містку, CXX згенерує відповідні визначення типів/функцій Rust та C++, щоб зробити ці елементи доступними для обох мов.

source: To view the generated Rust code, use [cargo-expand](https://github.com/dtolnay/cargo-expand) to view the expanded proc macro. For most of the examples you would use `cargo expand ::ffi` to expand just the `ffi` module (though this doesn't apply for Android projects).
fa: برای مشاهده کد Rust ایجاد شده از [cargo-expand](https://github.com/dtolnay/cargo-expand) که برای مشاهده ماکرو proc توسعه یافته استفاده کنید. برای بیشتر نمونه‌ها از `cargo expand ::ffi` فقط برای گسترش ماژول `ffi` استفاده کنید (اگرچه این برای پروژه‌های Android کاربرد ندارد).
ja: 生成された Rust コードを表示するには、[cargo-expand](https://github.com/dtolnay/cargo-expand) を使用して、展開された proc マクロを表示します。ほとんどの例では、`cargo expand ::ffi` を使用して `ffi` モジュールのみを展開します（ただし、これは Android プロジェクトには当てはまりません）。
pt_br: Para visualizar o código Rust gerado, use [cargo-expand](https://github.com/dtolnay/cargo-expand) para visualizar a macro de procedimento expandida. Para a maioria dos exemplos, você usaria `cargo expand ::ffi` para expandir apenas o módulo `ffi` (embora isso não se aplique a projetos Android).
uk: Щоб переглянути згенерований код Rust, скористайтеся [cargo-expand](https://github.com/dtolnay/cargo-expand) для перегляду розширеного макросу proc. У більшості прикладів ви можете використовувати `cargo expand ::ffi` для розгортання лише модуля `ffi` (хоча це не стосується проектів для Android).

source: To view the generated C++ code, look in `target/cxxbridge`.
fa: برای مشاهده کد ++C تولید شده به `target/cxxbridge` نگاه کنید.
ja: 生成された C++ コードを表示するには、`target/cxxbridge` を確認します。
pt_br: Para visualizar o código C++ gerado, procure em `target/cxxbridge`.
uk: Щоб переглянути згенерований C++ код, подивіться у `target/cxxbridge`.

source: Rust Bridge Declarations
fa: تعریف پل در Rust
ja: Rust のブリッジ宣言
pt_br: Declarações de _Bridge_ Rust
uk: Декларації мосту на мові Rust

source: // Opaque type
ja: // オペーク型
pt_br: // Tipo opaco
uk: // Непрозорий тип

source: // Method on `MyType`
ja: // `MyType` のメソッド
pt_br: // Método em `MyType`
uk: // Метод на `MyType`

source: // Free function
pt_br: // Função livre
uk: // Вільна функція

source: Items declared in the `extern "Rust"` reference items that are in scope in the parent module.
fa: موارد اعلام شده در موارد `extern "Rust"` reference که در محدوده ماژول والد قرار دارند.
ja: 親モジュールのスコープ内にある `extern "Rust"` 参照アイテムで宣言されたアイテム。
pt_br: Os itens declarados em `extern "Rust"` referenciam itens que estão no escopo no módulo pai.
uk: Елементи, оголошені у посиланнях `extern "Rust"`, які знаходяться в області видимості батьківського модуля.

source: The CXX code generator uses your `extern "Rust"` section(s) to produce a C++ header file containing the corresponding C++ declarations. The generated header has the same path as the Rust source file containing the bridge, except with a .rs.h file extension.
fa: تولیدکننده کد CXX از `extern "Rust"` خارجی شما برای تولید یک فایل هدر ++C حاوی اعلان‌های ++C مربوطه استفاده می‌کند. header تولید‌شده همان مسیری را دارد که فایل منبع Rust حاوی پل دارای آن است، به جز استفاده از پسوند فایل rs.h.
ja: CXX コード ジェネレータは、`extern "Rust"` セクションを使用して、対応する C++ 宣言を含む C++ ヘッダー ファイルを生成します。生成されるヘッダーのパスは、rs.hというファイル拡張子部分を除き、ブリッジを含む Rust ソースファイルと同じになります。
pt_br: O gerador de código CXX usa sua(s) seção(ões) `extern "Rust"` para produzir um arquivo de cabeçalho C++ contendo as declarações C++ correspondentes. O cabeçalho gerado tem o mesmo caminho do arquivo de origem Rust contendo a ponte, exceto com uma extensão de arquivo .rs.h.
uk: Генератор коду CXX використовує вашу секцію (секції) `extern "Rust"` для створення заголовного файлу C++, що містить відповідні оголошення C++. Створений заголовок має той самий шлях, що і вихідний файл Rust, який містить міст, за винятком розширення файлу .rs.h.

source: Results in (roughly) the following C++:
fa: نتیجه (تقریبی) ++C در زیر است:
ja: おおよそ次のような C++ が生成されます。
pt_br: Resulta (aproximadamente) no seguinte C++:
uk: В результаті маємо (приблизно) наступний код на C++:

source: C++ Bridge Declarations
ja: C++ のブリッジ宣言
pt_br: Declarações de _Bridge_ C++
uk: Декларації мосту на мові C++

source: Results in (roughly) the following Rust:
fa: نتیجه (تقریبی) Rust در زیر است:
ja: おおよそ次のような Rust が生成されます。
pt_br: Resulta (aproximadamente) no seguinte Rust:
uk: В результаті отримуємо (приблизно) такий Rust:

source: The programmer does not need to promise that the signatures they have typed in are accurate. CXX performs static assertions that the signatures exactly correspond with what is declared in C++.
fa: برنامه‌نویس نیازی به تضمینی در مورد درست بودن signatureهایی که تایپ کرده است ندارد. CXX اظهارات ثابتی را انجام می دهد که signatureها دقیقاً با آنچه در ++C اعلام شده مطابقت دارند.
ja: プログラマーは、入力したシグネチャが正確であることを保証する必要はありません。CXX は、シグネチャが C++ で宣言されたものと完全に対応するということを静的に保証します。
pt_br: O programador não precisa prometer que as assinaturas que ele digitou estão corretas. O CXX realiza verificações estáticas de que as assinaturas correspondem exatamente ao que é declarado em C++.
uk: Програмісту не потрібно обіцяти, що введені ним сигнатури є точними. CXX виконує статичні перевірки того, що сигнатури точно відповідають тому, що оголошено у C++.

source: `unsafe extern` blocks allow you to declare C++ functions that are safe to call from Rust.
fa: بلوک‌های `unsafe extern` به شما امکان می‌دهند توابع ++C را که برای فراخوانی از Rust امن هستند را اعلام کنید.
ja: `unsafe extern` ブロックを使用すると、Rust から安全に呼び出せる C++ 関数を宣言できます。
pt_br: Os blocos `unsafe extern` permitem que você declare funções C++ que podem ser chamadas com segurança do Rust.
uk: Блоки `unsafe extern` дозволяють вам оголошувати функції C++, які безпечно викликати з Rust.

source: Only C-like (unit) enums are supported.
fa: فقط C-like (unit) enums پشتیبانی می‌شود.
ja: C のような（単位）列挙型のみがサポートされています。
pt_br: Apenas enums C-like (unit) são suportados.
uk: Підтримуються тільки C-подібні (одиничні) переліки.

source: A limited number of traits are supported for `#[derive()]` on shared types. Corresponding functionality is also generated for the C++ code, e.g. if you derive `Hash` also generates an implementation of `std::hash` for the corresponding C++ type.
fa: تعداد محدودی از ویژگی‌ها برای `#[derive()]`در انواع مشترک پشتیبانی می‌شوند. عملکرد مربوطه نیز برای کد ++C ایجاد می شود، به عنوان مثال. اگر `Hash` را استخراج کنید، پیاده‌سازی `std::hash` برای نوع ++C مربوطه نیز ایجاد می‌کند.
ja: 共有型の `#[derive()]` では、サポートされるトレイトの数が限られています。対応する機能は C++ コードでも生成されます。たとえば、`Hash` を導出すると、対応する C++ 型の `std::hash` の実装も生成されます。
pt_br: Um número limitado de _traits_ são suportados para `#[derive()]` em tipos compartilhados. A funcionalidade correspondente também é gerada para o código C++, por exemplo, se você derivar `Hash` também gera uma implementação de `std::hash` para o tipo C++ correspondente.
uk: Для `#[derive()]` на спільних типах підтримується обмежена кількість трейтів. Відповідна функціональність також генерується для C++ коду, наприклад, якщо ви виводите `Hash`, також генерується реалізація `std::hash` для відповідного типу C++.

source: Generated Rust:
ja: 生成された Rust:
pt_br: Rust gerado:
uk: Згенерований Rust

source: Generated C++:
ja: 生成された C++:
pt_br: C++ gerado:
uk: Згенерований C++:

source: On the Rust side, the code generated for shared enums is actually a struct wrapping a numeric value. This is because it is not UB in C++ for an enum class to hold a value different from all of the listed variants, and our Rust representation needs to have the same behavior.
fa: در سمت Rust، کد تولید شده برای enums مشترک در واقع ساختاری است که یک مقدار عددی را بسته‌بندی می‌کند. به این دلیل که UB در ++C نیست تا یک کلاس enum مقداری متفاوت از همه انواع فهرست شده داشته باشد و نمایش‌دهنده Rust مورد نظر ما باید رفتار مشابهی داشته باشد.
ja: Rust 側では、共有列挙型に対して生成されるコードは、実際には数値をラップした構造体です。これは、列挙型クラスがリストされたすべてのバリアントとは異なる値を保持することは C++ では UB ではなく、Rust 表現は同じ動作をする必要があるためです。
pt_br: No lado Rust, o código gerado para enums compartilhados é realmente uma estrutura que envolve um valor numérico. Isso ocorre porque não é UB em C++ para uma classe enum ter um valor diferente de todas as variantes listadas, e nossa representação Rust precisa ter o mesmo comportamento.
uk: З боку Rust, код, що генерується для спільних переліків, насправді є структурою, що обгортає числове значення. Це пов'язано з тим, що у C++ це не є UB для класу переліку зберігати значення, відмінне від усіх перелічених варіантів, і наше представлення у Rust повинно мати таку саму поведінку.

source: "fallible1 requires depth > 0"
fa: "fallible1 به عمق > 0 نیاز دارد"
pt_br: "fallible1 requer profundidade > 0"
uk: "fallible1 вимагає глибини > 0"

source: "Success!"
pt_br: "Sucesso!"
uk: "Успіх!"

source: Rust functions that return `Result` are translated to exceptions on the C++ side.
fa: توابع Rust که «نتیجه» را برمی‌گردانند به exceptionهای سمت ++C ترجمه می‌شوند.
ja: `Result` を返す Rust 関数は、C++ 側で例外に変換されます。
pt_br: As funções Rust que retornam `Result` são traduzidas para exceções no lado C++.
uk: Функції Rust, які повертають `Result`, транслюються у виняткові ситуації на стороні C++.

source: The exception thrown will always be of type `rust::Error`, which primarily exposes a way to get the error message string. The error message will come from the error type's `Display` impl.
fa: این exception به وقوع پیوسته همیشه از نوع `rust::Error` خواهد بود که در درجه اول راهی برای دریافت string پیام خطا نشان می‌دهد. پیغام خطا از نوع خطای`Display` می‌آید.
ja: スローされる例外は常に `rust::Error` 型で、主にエラー メッセージの文字列を取得する手段を提供します。エラー メッセージは、エラー型の `Display` の実装から取得されます。
pt_br: A exceção lançada sempre será do tipo `rust::Error`, que expõe principalmente uma maneira de obter a string da mensagem de erro. A mensagem de erro virá da implementação `Display` do tipo de erro.
uk: Виняткова ситуація, яку буде згенеровано, завжди матиме тип `rust::Error`, який, насамперед, надає можливість отримати рядок з повідомленням про помилку. Повідомлення про помилку буде отримано з імплементації `Display` для типу помилки.

source: A panic unwinding from Rust to C++ will always cause the process to immediately terminate.
fa: باز شدن panic از Rust به ++C همیشه باعث می‌شود که فرآیند بلافاصله خاتمه یابد.
ja: Rust から C++ にパニック アンワインドを行うと、プロセスは必ず直ちに終了します。
pt_br: Um pânico propagando do Rust para o C++ sempre fará com que o processo
uk: Паніка при переході з Rust на C++ завжди призведе до негайного завершення процесу.

source: "Error: {}"
pt_br: "Erro: {}"
uk: "Помилка: {}"

source: C++ functions declared to return a `Result` will catch any thrown exception on the C++ side and return it as an `Err` value to the calling Rust function.
fa: توابع ++C اعلام شده (declared) برای برگرداندن `Result`، هر exception صورت گرفته شده در سمت ++C را می‌گیرند و آن را به عنوان مقدار `Err` به تابع فراخوانی Rust برمی‌گردانند.
ja: `Result` を返すように宣言された C++ 関数は、C++ 側でスローされたあらゆる例外をキャッチし、呼び出し元の Rust 関数に `Err` 値として返します。
pt_br: As funções C++ declaradas para retornar um `Result` capturarão qualquer exceção lançada no lado C++ e a retornarão como um valor `Err` para a função
uk: Функції C++, оголошені як такі, що повертають `Result`, перехоплять будь-яке згенероване виключення на стороні C++ і повернуть його у вигляді значення `Err` до викликаючої функції Rust.
