Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: `static` provides object identity: an address in memory and state as required by types with interior mutability such as `Mutex<T>`.
es: `static` proporciona la identidad del objeto: una dirección en la memoria y en el estado que requieren los tipos con mutabilidad interior, como `Mutex<T>`.
fa: `static` هویت شی را فراهم می‌کند: آدرسی در حافظه و حالتی که توسط انواع با تغییرپذیری داخلی مانند <span dir=ltr>`Mutex<T>`</span> را نیاز دارد.
ja: `static` はオブジェクト ID（メモリ内のアドレス）と、内部可変性を持つ型に必要な状態（`Mutex<T>` など）を提供します。
ko: `static`은 객체에 정체성을 부여합니다. 정체정이란 메모리 상에서의 주소, 그리고 내부 상태를 의미합니다.
pt_br: `static` fornece identidade de objeto: um endereço na memória e estado conforme exigido por tipos com mutabilidade interior tais como `Mutex<T>`.
uk: `static` забезпечує ідентичність об’єкта: адресу в пам’яті та стан відповідно до типів із внутрішньою змінністю, таких як `Mutex<T>`.

source: Because `static` variables are accessible from any thread, they must be `Sync`. Interior mutability is possible through a [`Mutex`](https://doc.rust-lang.org/std/sync/struct.Mutex.html), atomic or similar.
ja: `static` 変数はどのスレッドからでもアクセスできるため、`Sync` である必要があります。内部の可変性は、[`Mutex`](https://doc.rust-lang.org/std/sync/struct.Mutex.html) やアトミックなどの方法で実現できます。
pt_br: Como variáveis estáticas (`static`) são acessíveis de qualquer _thread_, elas precisam ser `Sync`. A mutabilidade interior é possível através de um [`Mutex`](https://doc.rust-lang.org/std/sync/struct.Mutex.html), atômico ou similar.
uk: Оскільки `static` змінні доступні з будь-якого потоку, вони повинні бути `Sync`. Внутрішня змінність можлива через [`Mutex`](https://doc.rust-lang.org/std/sync/struct.Mutex.html), atomic або подібні до них.

source: Thread-local data can be created with the macro `std::thread_local`.
ja: マクロ `std::thread_local` を使用して、スレッド ローカルのデータを作成できます。
pt_br: Dados locais da thread podem ser criados com a macro `std::thread_local`.
uk: Локальні дані потоку можна створити за допомогою макросу `std::thread_local`.

source: A type alias creates a name for another type. The two types can be used interchangeably.
fa: تایپ alias، نامی برای نوع دیگر ایجاد می کند. این دو نوع را می توان به جای هم استفاده کرد.
ja: 型エイリアスは、別の型の名前を作成します。この 2 つの型は同じ意味で使用できます。
pt_br: Um _alias_ de tipo cria um nome para outro tipo. Os dois tipos podem ser usados ​​de forma intercambiável.
uk: Псевдонім типу створює ім'я для іншого типу. Ці два типи можна використовувати взаємозамінно.

source: // Aliases are more useful with long, complex types:
ja: // エイリアスは長くて複雑な型に使用すると便利です。
pt_br: // _Aliases_ são mais úteis com tipos longos e complexos:
uk: // Псевдоніми більш корисні для довгих, складних типів:

source: C programmers will recognize this as similar to a `typedef`.
fa: برنامه‌نویسان C این را شبیه به `typedef` تشخیص می‌دهند.
ja: C プログラマーは、これを `typedef` と同様のものと考えるでしょう。
pt_br: Programadores C reconhecerão isso como semelhante a um `typedef`.
uk: Програмісти на C впізнають це як схоже на `typedef`.

source: We will create a data structure to represent an event in an elevator control system. It is up to you to define the types and functions to construct various events. Use `#[derive(Debug)]` to allow the types to be formatted with `{:?}`.
fa: ما یک ساختار داده برای نمایش یک رویداد در یک سیستم کنترل آسانسور ایجاد خواهیم کرد. این به شما بستگی دارد که انواع و عملکردها را برای ساخت رویدادهای مختلف تعریف کنید. از `#[derive(Debug)]` استفاده کنید تا اجازه دهید انواع با `{:?}` قالببندی شوند.
ja: エレベーター制御システムでイベントを表すデータ構造を作成します。さまざまなイベントを構築するための型と関数を自由に定義して構いません。`#[derive(Debug)]` を使用して、型を `{:?}` でフォーマットできるようにします。
pt_br: Vamos criar uma estrutura de dados para representar um evento em um sistema de controle de elevador. Cabe a você definir os tipos e funções para construir vários eventos. Use `#[derive(Debug)]` para permitir que os tipos sejam formatados com `{:?}`.
uk: Ми створимо структуру даних для представлення події в системі керування ліфтом. Ви самі визначаєте типи та функції для створення різних подій. Використовуйте `#[derive(Debug)]`, щоб дозволити форматування типів за допомогою `{:?}`.

source: This exercise only requires creating and populating data structures so that `main` runs without errors. The next part of the course will cover getting data out of these structures.
fa: این تمرین فقط به ایجاد و پر کردن ساختارهای داده نیاز دارد تا `main` بدون خطا اجرا شود. بخش بعدی این دوره دریافت داده‌ها از این ساختارها را پوشش می‌دهد.
ja: この演習に必要なのは、`main` がエラーなしで実行されるように、データ構造を作成して入力することだけです。このコースの次のパートでは、これらの構造からデータを取得する方法を説明します。
pt_br: Este exercício requer apenas a criação e o preenchimento de estruturas de dados para que o `main` seja executado sem erros. A próxima parte do curso abordará a obtenção de dados dessas estruturas.
uk: У цій вправі потрібно лише створити і заповнити структури даних так, щоб `main` працював без помилок. Наступна частина курсу буде присвячена отриманню даних з цих структур.

source: /// An event in the elevator system that the controller must react to.
ja: /// コントローラが反応する必要があるエレベーター システム内のイベント。
pt_br: /// Um evento no sistema de elevador ao qual o controlador deve reagir.
uk: /// Подія в ліфтовій системі, на яку повинен реагувати контролер.

source: // TODO: add required variants
ja: // TODO: 必要なバリアントを追加する
pt_br: // TODO: adicionar variantes necessárias
uk: // TODO: додайте необхідні варіанти

source: /// A direction of travel.
ja: /// 運転方向。
pt_br: /// Uma direção da viagem.
uk: /// Напрямок руху.

source: /// The car has arrived on the given floor.
ja: /// かごが所定の階に到着した。
pt_br: /// O elevador chegou no andar dado.
uk: /// Кабіна ліфта прибув на вказаний поверх.

source: /// The car doors have opened.
ja: /// かごのドアが開いた。
pt_br: /// As portas do elevador se abriram.
uk: /// Двері у кабіні ліфта відчинилися.

source: /// The car doors have closed.
ja: /// かごのドアが閉まった。
pt_br: /// As portas do elevador se fecharam.
uk: /// Двері у кабіні ліфта зачинилися.

source: /// A directional button was pressed in an elevator lobby on the given floor.
ja: /// 所定の階のエレベーター ロビーで方向ボタンが押された。
pt_br: /// Um botão direcional foi pressionado em um saguão de elevador no andar dado.
uk: /// У ліфтовому холі на даному поверсі була натиснута кнопка виклику в заданому напрямку.

source: /// A floor button was pressed in the elevator car.
ja: /// エレベーターのかごの階数ボタンが押された。
pt_br: /// Um botão de andar foi pressionado no elevador.
uk: /// У кабіні ліфта була натиснута кнопка поверху.

source: "A ground floor passenger has pressed the up button: {:?}"
pt_br: "Um passageiro do térreo pressionou o botão para subir: {:?}"
uk: "Пасажир першого поверху натиснув кнопку вгору: {:?}"

source: "The car has arrived on the ground floor: {:?}"
fa: "ماشین به طبقه همکف رسیده است: {:?}"
pt_br: "O elevador chegou no térreo: {:?}"
uk: "Кабіна ліфта заїхала на перший поверх: {:?}"

source: "The car door opened: {:?}"
fa: "در ماشین باز شد: {:?}"
pt_br: "A porta do elevador se abriu: {:?}"
uk: "Двері у кабіні ліфта відчинилися: {:?}"

source: "A passenger has pressed the 3rd floor button: {:?}"
fa: "یک مسافر دکمه طبقه 3 را فشار داده است: {:?}"
pt_br: "Um passageiro pressionou o botão do 3º andar: {:?}"
uk: "Пасажир натиснув кнопку 3-го поверху: {:?}"

source: "The car door closed: {:?}"
fa: "در ماشین بسته شد: {:?}"
pt_br: "A porta do elevador se fechou: {:?}"
uk: "Двері у кабіні ліфта зачинилися: {:?}"

source: "The car has arrived on the 3rd floor: {:?}"
fa: "ماشین به طبقه ۳ رسیده است: {:?}"
pt_br: "O elevador chegou no 3º andar: {:?}"
uk: "Кабіна ліфта заїхала на 3-й поверх: {:?}"

source: /// A button was pressed.
ja: /// ボタンが押された。
pt_br: /// Um botão foi pressionado.
uk: /// Була натиснута кнопка.

source: /// The car has arrived at the given floor.
ja: /// 車両が所定の階に到着した。
pt_br: /// O elevador chegou no andar dado.
uk: /// Кабіна ліфта прибула на вказаний поверх.

source: /// The car's doors have opened.
ja: /// かごのドアが開いた。
pt_br: /// As portas do elevador se abriram.
uk: /// Двері кабіни ліфта відчинилися.

source: /// The car's doors have closed.
ja: /// かごのドアが閉まった。
pt_br: /// As portas do elevador se fecharam.
uk: /// Двері кабіни ліфта зачинилися.

source: /// A floor is represented as an integer.
ja: /// 階は整数として表される。
pt_br: /// Um andar é representado como um inteiro.
uk: /// Поверх задається цілим числом.

source: /// A user-accessible button.
ja: /// ユーザーがアクセスできるボタン。
pt_br: /// Um botão acessível ao usuário.
uk: /// Кнопка, доступна для користувача.

source: /// A button in the elevator lobby on the given floor.
ja: /// 所定の階のエレベーター ロビーにあるボタン。
pt_br: /// Um botão no saguão do elevador no andar dado.
uk: /// Кнопка в холі ліфта на даному поверсі.

source: /// A floor button within the car.
ja: /// かご内の階数ボタン。
pt_br: /// Um botão de andar dentro do elevador.
uk: /// Кнопка поверху в кабіни ліфта.

source: Welcome to Day 2
es: Te damos la bienvenida al día 2
fa: به روز ۲ خوش آمدید
ja: 2日目の講座へようこそ
ko: 2일차 개요
pt_br: Bem-vindos ao Dia 2
uk: Ласкаво просимо до Дня 2

source: Now that we have seen a fair amount of Rust, today will focus on Rust's type system:
fa: اکنون که مقدار زیادی از Rust را دیده ایم، امروز بر روی سیستم تایپ Rust تمرکز خواهیم کرد:
ja: Rust についてかなり多くのことを学んできましたが、今日は Rust の型システムに焦点を当てます。
pt_br: Agora que vimos uma boa quantidade de Rust, hoje focaremos no sistema de tipos do Rust:
uk: Тепер, коли ми побачили достатню кількість Rust, ми зосередимося на системі типів Rust:

source: Pattern matching: extracting data from structures.
fa: تطبیق الگو: استخراج داده از ساختارها.
ja: パターン マッチング: 構造からのデータの抽出。
pt_br: Correspondência de padrões: extraindo de dados de estruturas.
uk: Зіставлення шаблонів: вилучення даних зі структур.

source: Methods: associating functions with types.
fa: متد‌ها: ارتباط توابع با تایپ ها.
ja: メソッド: 関数と型の関連付け。
pt_br: Métodos: associando funções com tipos.
uk: Методи: зв'язування функцій з типами.

source: Traits: behaviors shared by multiple types.
fa: Traits: رفتارهایی که توسط چندین تایپ مشترک هستند.
ja: トレイト: 複数の型で共有される挙動。
pt_br: Traits: comportamentos compartilhados por múltiplos tipos.
uk: Трэйти: поведінка, спільна для кількох типів

source: Generics: parameterizing types on other types.
fa: Generics: پارامتری‌سازی تایپ‌ها بر اساس تایپ‌های دیگر.
ja: ジェネリクス: 他の型での型のパラメータ化。
pt_br: Genéricos: parametrizando tipos em outros tipos.
uk: Узагальнення: параметризація типів в інших типах.

source: Standard library types and traits: a tour of Rust's rich standard library.
fa: کتابخانه‌استاندارد تایپ‌ها و traits: یک گردش در کتابخانه‌ استاندارد و ارزشمند Rust.
ja: 標準ライブラリの型とトレイト: Rust の豊富な標準ライブラリの紹介。
pt_br: Tipos e traits da biblioteca padrão: um passeio pela rica biblioteca padrão do Rust.
uk: Типи та властивості стандартної бібліотеки: екскурсія по багатій стандартній бібліотеці Rust.

source: The `match` keyword lets you match a value against one or more _patterns_. The comparisons are done from top to bottom and the first match wins.
fa: کلمه کلیدی `match` به شما اجازه می‌دهد یک مقدار را با یک یا چند _الگو_ مطابقت دهید. مقایسه‌ها از بالا به پایین انجام می‌شوند و اولین تطابق انتخاب می‌شود.
ja: `match` キーワードを使用すると、1 つ以上のパターンに対して値を照合できます。上から順に照合が行われ、最初に一致したパターンのみが実行されます。
pt_br: A palavra-chave `match` permite que você corresponda um valor a um ou mais _padrões_ (_patterns_). As comparações são feitas de cima para baixo e a primeira correspondência encontrada é selecionada.
uk: Ключове слово `match` дозволяє зіставити значення з одним або декількома _шаблонами_. Порівняння відбуваються зверху вниз, і виграє перший збіг.

source: The patterns can be simple values, similarly to `switch` in C and C++:
es: Los patrones pueden ser valores simples, del mismo modo que `switch` en C y C++:
fa: الگوها می توانند مقادیر ساده ای باشند، شبیه به `switch` در C و ++C:
ja: C や C++ の `switch` と同様に、パターンには単純な値を指定できます。
ko: C/C++의 `switch`와 비슷하게 값을 패턴으로 사용할 수도 있습니다:
pt_br: Os padrões podem ser valores simples, similarmente a `switch` em C e C++:
uk: Шаблони можуть бути простими значеннями, подібно до `switch` у C та C++:

source: "Quitting"
fa: "ترک کردن"
pt_br: "Encerrando"
uk: "Виходжу"

source: "Moving around"
fa: "حرکت در اطراف"
pt_br: "Movendo por aí"
uk: "Пересування"

source: "Number input"
fa: "ورودی شماره"
pt_br: "Entrada de número"
uk: "Введення числа"

source: "Lowercase: {key}"
fa: "حروف کوچک: {key}"
pt_br: "Minúsculas: {key}"
uk: "Нижній регістр: {key}"

source: "Something else"
fa: "یک چیز دیگر"
pt_br: "Alguma outra coisa"
uk: "Щось інше"

source: The `_` pattern is a wildcard pattern which matches any value. The expressions _must_ be exhaustive, meaning that it covers every possibility, so `_` is often used as the final catch-all case.
fa: الگوی `_` یک الگوی عام (Wildcard) است که با هر مقداری مطابقت دارد. عبارت‌ها باید جامع باشند، به این معنی که همه احتمالات را پوشش دهند، بنابراین `_` اغلب به عنوان آخرین حالت برای پوشش تمامی موارد استفاده می‌شود.
pt_br: O padrão `_` é um padrão curinga que corresponde a qualquer valor. As expressões _devem_ ser irrefutáveis, o que significa que cobre todas as possibilidades, então `_` é frequentemente usado como o último caso de captura.
uk: Шаблон `_` - це шаблон підстановки, який відповідає будь-якому значенню. Вирази _повинні_ бути вичерпними, тобто охоплювати всі можливі варіанти, тому `_` часто використовується як остаточний всеохоплюючий випадок.

source: Match can be used as an expression. Just like `if`, each match arm must have the same type. The type is the last expression of the block, if any. In the example above, the type is `()`.
fa: `match` می‌تواند به عنوان یک عبارت استفاده شود. دقیقاً مانند `if`، هر شاخه match باید از یک تایپ باشد. تایپ بازگشتی، تایپ آخرین عبارت در بلاک است، اگر وجود داشته باشد. در مثال بالا، تایپ بازگشتی `()` است.
ja: 一致を式として使用できます。`if` と同様に、各マッチアームは同じ型にする必要があります。型は、ブロックの最後の式です（存在する場合）。上記の例では、型は `()` です。
pt_br: Correspondência pode ser usada como uma expressão. Assim como `if`, cada braço de correspondência deve ter o mesmo tipo. O tipo é a última expressão do bloco, se houver. No exemplo acima, o tipo é `()`.
uk: Match можна використовувати як вираз. Як і у випадку з `if`, кожна гілка зіставлення повинно мати однаковий тип. Тип - це останній вираз у блоці, якщо такий є. У наведеному вище прикладі тип `()`.

source: A variable in the pattern (`key` in this example) will create a binding that can be used within the match arm.
fa: یک متغیر در الگو (`key` در این مثال) یک اتصال ایجاد می‌کند که می‌توان از آن در بخش مطابقت استفاده کرد.
ja: パターンの変数（この例では `key`）により、マッチアーム内で使用できるバインディングが作成されます。
pt_br: Uma variável no padrão (`key` neste exemplo) criará uma ligação que pode ser usada dentro do braço de correspondência.
uk: Змінна у шаблоні (у цьому прикладі - `key`) створить прив'язку, яку можна використовувати у гілці зіставлення.

source: A match guard causes the arm to match only if the condition is true.
fa: یک guard در عبارت `match` باعث می‌شود که آن شاخه تنها در صورتی مطابقت داشته باشد که شرط برقرار باشد.
ja: マッチガードにより、条件が true の場合にのみアームが一致します。
pt_br: Uma guarda de correspondência faz com que o braço corresponda somente se a condição for verdadeira.
uk: Запобіжник зіставлення призводить до гілці зіставлення, тільки якщо умова істинна.

source: You might point out how some specific characters are being used when in a pattern
es: Puedes señalar cómo se usan algunos caracteres concretos en un patrón
fa: بهتر است که اشاره کنید چطوری میتوان از کاراکترهای خاص در الگو استفاده کرد
ja: 特定の文字がパターンでどのように使用されるかを説明します。
ko: 패턴에서 사용되는 특수 문자들을 알려주세요
pt_br: Você pode apontar como alguns caracteres específicos podem ser usados em um padrão
uk: Ви можете вказати, як деякі конкретні символи використовуються в шаблоні

source: `|` as an `or`
es: `|` como `or`,
fa: `|` به عنوان `or`
ja: `|` を `or` として指定する
ko: `|`: or 기호입니다
pt_br: `|` como um `or`
uk: `|` як `or`

source: `..` can expand as much as it needs to be
es: `..` se puede ampliar tanto como sea necesario.
fa: `..` برای تعیین همه محدوده یا تا جایی که میتوان گسترش یابد
ja: `..` は必要に応じて展開できる
ko: `..`: 필요한 만큼 확장합니다
pt_br: `..` pode expandir o quanto for necessário
uk: `..` може розширюватися настільки, наскільки це потрібно

source: `1..=5` represents an inclusive range
es: `1..=5` representa un intervalo inclusivo.
fa: <span dir=ltr><code class=hljs>1..=5</code></span> نمایانگر یک محدوده خاص است
ja: `1..=5` は 5 を含む範囲を表す
ko: `1..=5`: 끝 값(여기서는 5)을 포함하는 범위를 나타냅니다
pt_br: `1..=5` representa um intervalo inclusivo
uk: `1..=5` представляє включний діапазон

source: `_` is a wild card
es: `_` es un comodín.
fa: `_` نمایانگر هر حالتی است
ja: `_` はワイルドカードを表す
ko: `_`: 와일드카드입니다
pt_br: `_` é um curinga
uk: `_` - символ підстановки

source: Match guards as a separate syntax feature are important and necessary when we wish to concisely express more complex ideas than patterns alone would allow.
es: Las guardas de coincidencia, como característica sintáctica independiente, son importantes y necesarios cuando queremos expresar de forma concisa ideas más complejas de lo que permitirían los patrones por sí solos.
fa: guard های تطبیق به عنوان یک ویژگی سینتکس جداگانه دسته بندی می‌شوند, زمانی مهم و ضروری هستند که بخواهیم ایده های پیچیده تر از الگوهای ساده بیان کنیم.
ja: パターンのみでは表現できない複雑な概念を簡潔に表現したい場合、独立した構文機能であるマッチガードは重要かつ必要です。
ko: 매치 가드는 별도의 문법 요소로서 패턴 자체만으로 표현하기 어려운 복잡한 경우를 간결하게 표현하고자 할 때 유용합니다.
pt_br: Guardas de correspondência, como um recurso de sintaxe separado, são importantes e necessárias quando se quer expressar ideias mais complexas do que somente o padrão permitiria.
uk: Запобіжники зіставлення як окрема функція синтаксису є важливою та необхідною, коли ми хочемо стисло висловити більш складні ідеї, ніж це дозволили б самі шаблони.

source: They are not the same as separate `if` expression inside of the match arm. An `if` expression inside of the branch block (after `=>`) happens after the match arm is selected. Failing the `if` condition inside of that block won't result in other arms of the original `match` expression being considered.
es: No son lo mismo que una expresión `if` independiente dentro del brazo de coincidencias. Una expresión `if` dentro del bloque de ramas (después de `=>`) se produce tras seleccionar el brazo de coincidencias. Si no se cumple la condición `if` dentro de ese bloque, no se tienen en cuenta otros brazos de la expresión `match` original.
fa: آنها با عبارت `if` جداگانه ای در داخل یک شاخه تطبیق هستند یکسان نیستند. یک عبارت `if` در داخل بلاک شاخه (پس از <span dir=ltr>`=>`</span>) پس از ورود به اون شاخه خاص صدا زده میشود. اگر شرط `if` برقرار نباشد کاری به سایر شاخه های عبارت `match` اصلی ندارد.
ja: マッチガードは、マッチアーム内の個別の `if` 式とは異なります。分岐ブロック内（`=>` の後）の `if` 式は、マッチアームが選択された後に実行されます。そのブロック内で `if` 条件が満たされなかった場合、元の `match` 式の他のアームは考慮されません。
ko: 매치의 각 팔(혹은 가지) 안에 따로 `if`를 사용한 것과 다릅니다. 매치 가지의 `=>` 뒤에 사용된 `if` 표현식은 해당 가지가 선택된 다음에 실행됩니다. 따라서 여기서 `if` 조건이 실패하더라도 원래 `match`의 다른 가지는 고려되지 않습니다.
pt_br: Eles não são iguais à expressão `if` separada dentro do bloco de correspondência. Uma expressão `if` dentro do bloco de ramificação (depois de `=>`) acontece depois que a correspondência é selecionada. A falha na condição `if` dentro desse bloco não resultará em outras verificações de correspondência da expressão `match` original serem consideradas.
uk: Це не те саме, що окремий вираз `if` всередині гілкі зіставлення. Вираз `if` всередині блоку розгалуження (після `=>`) виникає після вибору гілкі зіставлення. Невиконання умови `if` всередині цього блоку не призведе до розгляду інших частин вихідного виразу `match`.

source: The condition defined in the guard applies to every expression in a pattern with an `|`.
es: La condición definida en el guarda se aplica a todas las expresiones de un patrón con un `|`.
fa: شرط تعریف شده در guard با کمک `|` به شرط های تطبیق الگو اضافه می‌شود.
ja: ガードで定義された条件は、`|` が付いたパターン内のすべての式に適用されます。
ko: 가드에 정의된 조건은 `|` 를 포함하는 패턴의 모든 표현식에 적용됩니다.
pt_br: A condição definida na guarda se aplica a todas as expressões em um padrão com um `|`.
uk: Умова, визначена в запобіжнику, застосовується до кожного виразу в шаблоні з `|`.

source: More To Explore
uk: Більше інформації для вивчення

source: Another piece of pattern syntax you can show students is the `@` syntax which binds a part of a pattern to a variable. For example:
uk: Ще одним елементом синтаксису шаблону, який ви можете показати учням, є синтаксис `@`, який прив'язує частину шаблону до змінної. Наприклад:

source: In this example `inner` has the value 123 which it pulled from the `Option` via destructuring, `outer` captures the entire `Some(inner)` expression, so it contains the full `Option::Some(123)`. This is rarely used but can be useful in more complex patterns.
uk: У цьому прикладі `inner` має значення 123, яке він витягнув з `Option` за допомогою деструктуризації, `outer` перехоплює весь вираз `Some(inner)`, тому він містить повний вираз `Option::Some(123)`. Це рідко використовується, але може бути корисним у більш складних шаблонах.

source: Structs
es: Estructuras (_Structs_)
fa: ساختارها
ja: 構造体（structs）
ko: 구조체
uk: Структури

source: Like tuples, Struct can also be destructured by matching:
fa: مانند tuple ها، ساختار را نیز می توان با تطبیق تخریب کرد:
pt_br: Como tuplas, _structs_ também podem ser desestruturados por meio de correspondência:
uk: Як і кортежі, структури також можуть бути деструктуровані шляхом зіставлення:

source: "y = {y}, other fields were ignored"
fa: "در y = {y} ، سایر فیلدها نادیده گرفته شدند"
pt_br: "y = {y}, outros campos foram ignorados"
uk: "y = {y}, інші поля були проігноровані"

source: Change the literal values in `foo` to match with the other patterns.
es: Cambia los valores literales de `foo` para que coincidan con los demás patrones.
fa: تغییر مقادیر لیترال در foo برای مطابقت با سایر الگوها.
ja: `foo` のリテラル値を他のパターンと一致するように変更します。
ko: `foo`의 리터럴 값을 다른 패턴과 일치하도록 변경합니다.
pt_br: Modifique os valores em `foo` para corresponder com os outros padrões.
uk: Змініть значення літералів у `foo`, відповідно до інших шаблонів.

source: Add a new field to `Foo` and make changes to the pattern as needed.
es: Añade un campo nuevo a `Foo` y realiza los cambios necesarios en el patrón.
fa: اضافه کردن یک فیلد جدید به Foo و ایجاد تغییرات مورد نیاز.
ja: `Foo` に新しいフィールドを追加し、必要に応じてパターンに変更を加えます。
ko: `Foo`에 새 필드를 추가하고 필요에 따라 패턴을 변경합니다.
pt_br: Adicione um novo campo a `Foo` e faça mudanças nos padrões conforme necessário.
uk: Додайте нове поле до `Foo` і внесіть потрібні зміни до шаблону.

source: The distinction between a capture and a constant expression can be hard to spot. Try changing the `2` in the second arm to a variable, and see that it subtly doesn't work. Change it to a `const` and see it working again.
es: La diferencia entre una captura y una expresión constante puede ser difícil de detectar. Prueba a cambiar el `2` del segundo brazo por una variable y observa que no funciona. Cámbialo a `const` y verás que vuelve a funcionar.
fa: تشخیص تفاوت بین یک گرفتن متغییر و یک عبارت ثابت می‌تواند دشوار باشد. سعی کنید ‍`2` را در شاخه دوم به یک متغیر تغییر دهید و خواهید دید که کار نمی‌کند. آن را به یک `const` تغییر دهید و خواهید دید که دوباره کار می‌کند.
ja: キャプチャと定数式を区別しづらい場合があります。2 つ目のアームの `2` を変数に変更してみて、うまく機能しないことを確認します。これを `const` に変更して、再び動作することを確認します。
ko: 캡처와 상수 표현식은 구분하기 어려울 수 있습니다. 두 번째 부문의 `2`를 변수로 변경해 보고 작동하지 않는 것을 확인하세요. `const`로 변경하고 다시 작동하는지 확인합니다.
pt_br: A diferença entre uma captura (_capture_) e uma expressão constante pode ser difícil de perceber. Tente modificar o `2` no segundo braço para uma variável, e veja que, de forma sútil, não funciona. Mude para `const` e veja funcionando novamente.
uk: Різницю між захопленням і постійним виразом може бути важко помітити. Спробуйте змінити `2` у другій гілці на змінну, і побачте, що це непомітно не працює. Змініть ії на `const` і подивіться, що це знову запрацює.
