Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: `cortex-m-rt` provides the vector table, among other things.
es: `cortex-m-rt` proporciona la tabla de vectores, entre otras cosas.
fa: `cortex-m-rt` جدول برداری را از جمله موارد دیگر ارائه می‌دهد.
ja: `cortex-m-rt`はベクタテーブルも提供します。
ko: `cortex-m-rt`는 무엇보다도 벡터 테이블을 제공합니다.
pt_br: `cortex-m-rt` fornece a tabela de vetores, entre outras coisas.
uk: `cortex-m-rt` надає векторну таблицю, серед іншого.

source: If you `cargo install cargo-binutils` then you can run `cargo objdump --bin pac -- -d --no-show-raw-insn` to see the resulting binary.
es: Si instalas `cargo install cargo-binutils` puedes ejecutar `cargo objdump --bin pac -- -d --no-show-raw-insn` para ver el binario resultante.
fa: اگر`cargo install cargo-binutils` را انجام دهید، می‌توانید `cargo objdump --bin pac -- -d --no-show-raw-insn` را اجرا کنید تا باینری حاصل را ببینید.
ja: もし`cargo install cargo-binutils`を実行していれば、`cargo objdump --bin pac -- -d --no-show-raw-insn`を実行することにより生成されたバイナリの中身を見ることができます。
ko: `cargo install cargo-binutils`을 실행한 후, `cargo objdump --bin pac -- -d --no-show-raw-insn`을 실행하여 생성된 바이너리의 내용을 확인할 수 있습니다.
pt_br: Se você `cargo install cargo-binutils`, poderá executar `cargo objdump --bin pac -- -d --no-show-raw-insn` para ver o binário resultante.
uk: Якщо ви `cargo install cargo-binutils`, ви можете запустити `cargo objdump --bin pac -- -d --no-show-raw-insn`, щоб побачити результуючий бінарний файл.

source: HAL crates
es: Crates HAL
ja: HALクレート
ko: HAL 크레이트들
pt_br: _Crates_ HAL
uk: Крейти HAL

source: [HAL crates](https://github.com/rust-embedded/awesome-embedded-rust#hal-implementation-crates) for many microcontrollers provide wrappers around various peripherals. These generally implement traits from [`embedded-hal`](https://crates.io/crates/embedded-hal).
es: [Los crates HAL](https://github.com/rust-embedded/awesome-embedded-rust#hal-implementation-crates) de muchos microcontroladores incluyen envoltorios alrededor de varios periféricos. Por lo general, implementan traits de [`embedded-hal`](https://crates.io/crates/embedded-hal).
fa: این [crateهای HAL]‌(https://github.com/rust-embedded/wesome-embedded-rust#hal-implementation-crates) برای بسیاری از میکروکنترلرها بسته‌بندی‌هایی را در اطراف تجهیزات جانبی مختلف ارائه می‌دهند. اینها معمولاً ویژگی‌های [`embedded-hal`](https://crates.io/crates/embedded-hal) را پیاده‌سازی می‌کنند.
ja: 多くのマイクロコントローラに対する[HALクレート](https://github.com/rust-embedded/awesome-embedded-rust#hal-implementation-crates)が様々な周辺I/Oに対するラッパーを提供しています。これらのクレートの多くは[`embedded-hal`](https://crates.io/crates/embedded-hal)が定義するトレイトを実装しています。
ko: 다양한 주변 장치에 대한 래퍼를 제공하는 [HAL 크레이트](https://github.com/rust-embedded/awesome-embedded-rust#hal-implementation-crates)들이 있습니다. 이 크레이트들은 일반적으로 [`embedded-hal`](https://crates.io/crates/embedded-hal)의 트레잇을 구현합니다.
pt_br: Os [_crates_ HAL (Hardware Abstraction Layer)](https://github.com/rust-embedded/awesome-embedded-rust#hal-implementation-crates) para muitos microcontroladores fornecem _wrappers_ para vários periféricos. Esses geralmente implementam _traits_ de [`embedded-hal`](https://crates.io/crates/embedded-hal).
uk: [Крейти HAL](https://github.com/rust-embedded/awesome-embedded-rust#hal-implementation-crates) для багатьох мікроконтролерів забезпечують оболонки для різних периферійних пристроїв. Зазвичай вони реалізують трейти з [`embedded-hal`](https://crates.io/crates/embedded-hal).

source: // Create HAL wrapper for GPIO port 0.
pt_br: // Crie um _wrapper_ HAL para a porta 0 do GPIO.
uk: // Створити HAL-обгортку для порту GPIO 0

source: `set_low` and `set_high` are methods on the `embedded_hal` `OutputPin` trait.
es: `set_low` y `set_high` son métodos del trait `OutputPin` de `embedded_hal`.
ja: `set_low`と`set_high`は`embedded_hal`の`OutputPin`トレイトの定義するメソッドです。
ko: `set_low` 및 `set_high`는 `embedded_hal` `OutputPin` 트레잇의 메서드입니다.
pt_br: `set_low` e `set_high` são métodos do _trait_ `OutputPin` do `embedded_hal`.
uk: `set_low` і `set_high` — це методи трейту `embedded_hal` `OutputPin`.

source: HAL crates exist for many Cortex-M and RISC-V devices, including various STM32, GD32, nRF, NXP, MSP430, AVR and PIC microcontrollers.
es: Hay crates HAL para muchos dispositivos Cortex-M y RISC-V, incluidos varios microcontroladores STM32, GD32, nRF, NXP, MSP430, AVR y PIC.
fa: بسیاری از HAL crateها برای انواعی از دستگاه های Cortex-M و RISC-V از جمله میکروکنترلرهای STM32، GD32، nRF، NXP، MSP430، AVR و PIC مختلف وجود دارد.
ja: Cortex-MやRISC-Vの多くのデバイスに対してHALクレートが存在し、これらにはSTM32、GD32、nRF、NXP、MSP430、AVR、PICマイクロコントローラなどが含まれます。
ko: 다양한 STM32, GD32, nRF, NXP, MSP430, AVR, PIC 마이크로컨트롤러를 비롯한 많은 Cortex-M 및 RISC-V 기기를 위한 HAL 크레이트가 있습니다
pt_br: Existem _crates_ HAL para vários dispositivos Cortex-M e RISC-V, incluindo vários microcontroladores STM32, GD32, nRF, NXP, MSP430, AVR e PIC.
uk: Існують крейти HAL для багатьох пристроїв Cortex-M і RISC-V, включаючи різні мікроконтролери STM32, GD32, nRF, NXP, MSP430, AVR і PIC.

source: Board support crates
es: Crates de compatibilidad de placa
ja: ボードサポートクレート
pt_br: _Crates_ de suporte a placas
uk: Крейти для підтримки плат

source: Board support crates provide a further level of wrapping for a specific board for convenience.
es: Los crates de compatibilidad de placa proporcionan un nivel adicional de envoltorio a una placa específica para mayor comodidad.
ja: ボードサポートクレードは特定のボードに対して更に利便性を向上させるラッパーを提供します。
ko: 보드 지원 크레이트들은, 특정 보드를 더 손쉽게 사용할 수 있게 해 주는 더 높은 수준의 추상화를 제공합니다.
pt_br: Os _crates_ de suporte a placas convenientemente fornecem um nível adicional de _wrapping_ para uma placa específica.
uk: Крейти для підтримки плат забезпечують додатковий рівень обгортання для конкретної дошки для зручності.

source: In this case the board support crate is just providing more useful names, and a bit of initialisation.
es: En este caso, el crate de compatibilidad de placa proporciona solo nombres más útiles y un poco de inicialización.
fa: در این مورد crate پشتیبانی برد فقط نام‌های مفیدتر و مقداری مقداردهی اولیه را ارائه می‌دهد.
ja: この例では、ボードサポートクレートは単に分かりやすい名前を提供し、少しの初期化を実施しているだけです。
ko: 이 경우 보드 지원 크레이트는 좀 더 직관적인 이름들과 적당한 수준의 초기화를 제공합니다.
pt_br: Neste caso, o _crate_ de suporte à placa está apenas fornecendo nomes mais úteis e um pouco de inicialização.
uk: У цьому випадку крейти для підтримки плати просто надає корисніші назви та трохи ініціалізації.

source: The crate may also include drivers for some on-board devices outside of the microcontroller itself.
es: El crate también puede incluir controladores para algunos dispositivos integrados fuera del propio microcontrolador .
fa: این crate ممکن است شامل درایورهایی برای برخی از دستگاه‌های داخلی خارج از خود میکروکنترلر نیز باشد.
ja: マイクロコントローラの外に実装されたオンボードデバイスに対するドライバも提供されていることがあります。
ko: 이 크레이트는 마이크로컨트롤 밖에 있는 (즉, 보드에 설치된) 장치에 대한 드라이버도 포함할 수 있습니다.
pt_br: O _crate_ também pode incluir drivers para alguns dispositivos embarcados fora do próprio microcontrolador.
uk: Крейт також може містити драйвери для деяких вбудованих пристроїв за межами самого мікроконтролера.

source: `microbit-v2` includes a simple driver for the LED matrix.
es: `microbit-v2` incluye un controlador sencillo para la matriz de LED.
fa: ء `microbit-v2` شامل یک درایور ساده برای ماتریس LED است.
ja: `microbit-v2`はマトリクスLEDに対する簡単なドライバを含んでいます。
ko: `microbit-v2`에는 LED 매트릭스를 위한 간단한 드라이버가 포함되어 있습니다.
pt_br: `microbit-v2` inclui um driver simples para a matriz de LED.
uk: `microbit-v2` містить простий драйвер для світлодіодної матриці.

source: The type state pattern
es: El patrón de tipo de estado
fa: یک تایپ state pattern
ja: タイプステートパターン
ko: 타입 상태 패턴
pt_br: O padrão de estado de tipo
uk: Шаблон стану типу

source: // let gpio0_01_again = gpio0.p0_01; // Error, moved.
pt_br: // let gpio0_01_again = gpio0.p0_01; // Erro, movido.
uk: // let gpio0_01_again = gpio0.p0_01; // Помилка, переміщено.

source: // pin_input.is_high(); // Error, moved.
pt_br: // pin_input.is_high(); // Erro, movido.
uk: // pin_input.is_high(); // Помилка, переміщено.

source: Pins don't implement `Copy` or `Clone`, so only one instance of each can exist. Once a pin is moved out of the port struct nobody else can take it.
es: Los pines no implementan `Copy` ni `Clone`, por lo que solo puede haber una instancia de cada uno. Cuando se quita un pin de la estructura del puerto, nadie más puede usarlo.
fa: پین‌ها `Copy` یا `Clone` را اجرا نمی‌کنند، بنابراین فقط یک نمونه از هر کدام می‌تواند وجود داشته باشد. هنگامی که یک pin از ساختار پورت خارج می شود، هیچ کس دیگری نمی تواند آن را بگیرد.
ja: この例では、ピンを表すタイプは`Copy`も`Clone`も実装していません。そのため、ただ一つのインスタンスだけが存在可能です。ピンがポート構造体からムーブされると、他の誰もそのピンにアクセスすることはできなくなります。
ko: 핀은 `Copy` 또는 `Clone`을 구현하지 않으므로 각각 하나의 인스턴스만 존재할 수 있습니다. 핀을 포트 구조체 밖으로 이동하면 아무도 사용할 수 없습니다.
pt_br: _Pins_ não implementam `Copy` ou `Clone`, portanto, apenas uma instância de cada um pode existir. Uma vez que um _pin_ é movido para fora da estrutura da porta, ninguém mais pode pegá-lo.
uk: Піни не реалізують `Copy` або `Clone`, тому може існувати лише один екземпляр кожного з них. Після того, як пін буде переміщено зі структури порту, ніхто інший не зможе його взяти.

source: Changing the configuration of a pin consumes the old pin instance, so you can’t keep use the old instance afterwards.
es: Si cambias la configuración de un pin, se consumirá la instancia del pin anterior y no podrás seguir usando la instancia previa.
fa: تغییر پیکربندی pin، نمونه pin ​​قدیمی را مصرف می‌کند، بنابراین نمی‌توانید پس از آن از pin قدیمی استفاده کنید.
ja: ピンの設定を変更することは古いピンのインスタンスを消費することになります。そのため、それ以降は古いインスタンスを使い続けることはできなくなります。
ko: 핀 구성을 변경하면 이전 핀 인스턴스가 사용되므로 이후에 이전 인스턴스를 계속 사용할 수 없습니다.
pt_br: Alterar a configuração de um _pin_ consome a instância antiga do _pin_, portanto, você não pode continuar usando a instância antiga depois.
uk: Зміна конфігурації піна поглинає старий екземпляр піна, тому ви не можете продовжувати використовувати старий екземпляр після цього.

source: The type of a value indicates the state that it is in: e.g. in this case, the configuration state of a GPIO pin. This encodes the state machine into the type system, and ensures that you don't try to use a pin in a certain way without properly configuring it first. Illegal state transitions are caught at compile time.
es: El tipo de un valor indica el estado en el que se encuentra: por ejemplo, en este caso, el estado de configuración de un pin de GPIO. De esta manera, se codifica la máquina de estados en el sistema de tipos, asegurando así que no se use un pin de cierta forma sin antes configurarlo correctamente. Las transiciones de estado ilegales se detectan durante el tiempo de compilación.
fa: این type یک مقدار state را نشان می‌دهد که در آن قرار دارد: به عنوان مثال. در این مورد، وضعیت پیکربندی یک پین GPIO. این state machine را در type system رمزگذاری می‌کند و تضمین می‌کند که سعی نکنید از pin به روشی خاص استفاده کنید بدون اینکه ابتدا آن را به درستی پیکربندی کنید. state transition غیرمجاز در زمان کامپایل شناسایی می‌شود.
ja: 変数の型はその状態を表すようになっています。例えば、この例では型がGPIOピンの状態を表しています。このようにステートマシンをタイプシステムに織り込むことで、正しい設定をせずにピンを使ってしまうことがなくなります。不正な状態遷移に関してはコンパイル時に発見されるようになります。
ko: 값 유형은 현재 상태를 나타냅니다. 예를 들어 이 경우에는 GPIO 핀의 구성 상태입니다. 이렇게 하면 상태 머신이 유형 시스템으로 인코딩되며, 먼저 올바르게 구성한 후 특정 방식으로 핀을 사용하도록 합니다. 잘못된 상태 전환은 컴파일 시간에 포착됩니다.
pt_br: O tipo de um valor indica o estado em que ele está: por exemplo, neste caso, o estado de configuração de um _pin_ GPIO. Isso codifica a máquina de estados no sistema de tipos e garante que você não tente usar um _pin_ de uma certa maneira sem configurá-lo corretamente primeiro. Transições de estado ilegais são capturadas em tempo de compilação.
uk: Тип значення вказує на стан, у якому воно перебуває: наприклад, у цьому випадку це стан конфігурації піна GPIO. Це кодує машину станів у систему типів і гарантує, що ви не спробуєте використати пін певним чином, не налаштувавши його належним чином. Незаконні переходи станів перехоплюються під час компіляції.

source: You can call `is_high` on an input pin and `set_high` on an output pin, but not vice-versa.
es: Puedes llamar a `is_high` en un pin de entrada y a `set_high` en un pin de salida, pero no al revés.
fa: می‌توانید `is_high` را در یک پین ورودی و `set_high` را در یک پایه خروجی فراخوانی کنید، اما برعکس امکان پذیر نیست.
ja: インプットピンに対して`is_high`を呼び出すことは可能で、アウトプットピンに対して`set_high`を呼び出すことも可能です。しかし、その逆の組み合わせは不可能です。
ko: 입력 핀에서 `is_high`를 호출하고 출력 핀에서 `set_high`를 호출할 수 있지만 그 반대로는 안 됩니다.
pt_br: Você pode chamar `is_high` em um _pin_ de entrada e `set_high` em um _pin_ de saída, mas não o contrário.
uk: Ви можете викликати `is_high` на вхідному піні та `set_high` на вихідному піні, але не навпаки.

source: Many HAL crates follow this pattern.
es: Muchos crates HAL siguen este patrón.
fa: بسیاری از HAL crateها از این الگو پیروی می‌کنند.
ja: 多くのHALクレートがこのパターンを用いています。
ko: 많은 HAL 크레이트들이 이 패턴을 따릅니다.
pt_br: Muitos _crates_ HAL seguem esse padrão.
uk: Багато крейтів HAL дотримуються цієї моделі.

source: The [`embedded-hal`](https://crates.io/crates/embedded-hal) crate provides a number of traits covering common microcontroller peripherals:
fa: این crate ['embedded-hal'](https://crates.io/crates/embedded-hal) تعدادی ویژگی را ارائه می‌دهد که میکروکنترلرهای جانبی رایج را پوشش می‌دهد:
uk: Крейт [`embedded-hal`](https://crates.io/crates/embedded-hal) надає низку трейтів, що охоплюють поширені периферійні пристрої мікроконтролерів:

source: Delay timers
fa: تایمرهای تاخیری
uk: Таймери затримки

source: I2C and SPI buses and devices
fa: گذرگاه‌ها و دستگاه‌های I2C و SPI
uk: Шини та пристрої I2C і SPI

source: Similar traits for byte streams (e.g. UARTs), CAN buses and RNGs and broken out into [`embedded-io`](https://crates.io/crates/embedded-io), [`embedded-can`](https://crates.io/crates/embedded-can) and [`rand_core`](https://crates.io/crates/rand_core) respectively.
fa: ویژگی‌های مشابه برای جریان‌های بایت (مانند UART)، گذرگاه‌های CAN و RNG و تقسیم شدن به [`embedded-io`](https://crates.io/crates/embedded-io)، [`embedded-can`](https ://crates.io/crates/embedded-can) و [`rand_core`](https://crates.io/crates/rand_core) به ترتیب.
uk: Аналогічні трейти для байтових потоків (наприклад, UART), CAN-шини та ГВЧ (RNGs) і розбиті на [`embedded-io`](https://crates.io/crates/embedded-io), [`embedded-can`](https://crates.io/crates/embedded-can) та [`rand_core`](https://crates.io/crates/rand_core), відповідно.

source: Other crates then implement [drivers](https://github.com/rust-embedded/awesome-embedded-rust#driver-crates) in terms of these traits, e.g. an accelerometer driver might need an I2C or SPI device instance.
fa: سپس crateهای دیگر [درایورها](https://github.com/rust-embedded/wesome-embedded-rust#driver-crates) را بر حسب این ویژگی‌ها پیاده‌سازی می‌کنند، به عنوان مثال. یک درایور شتاب سنج ممکن است به یک نمونه دستگاه I2C یا SPI نیاز داشته باشد.
uk: Інші крейти потім реалізують [драйвери](https://github.com/rust-embedded/awesome-embedded-rust#driver-crates) у термінах цих трейтів, наприклад драйверу акселерометра може знадобитися кземпляр пристрою I2C або SPI.

source: The traits cover using the peripherals but not initialising or configuring them, as initialisation and configuration is usually highly platform-specific.
fa: این ویژگی‌ها با استفاده از وسایل جانبی(peripherals) پوشش می‌دهند، اما آنها را مقداردهی اولیه یا پیکربندی نمی‌کنند، زیرا مقداردهی اولیه و پیکربندی معمولاً به پلتفرم خاص بستگی دارد.
uk: Трейти охоплюють використання периферійних пристроїв, але не їх ініціалізацію чи конфігурацію, оскільки ініціалізація та конфігурація, як правило, сильно залежить від платформи.

source: There are implementations for many microcontrollers, as well as other platforms such as Linux on Raspberry Pi.
es: Hay implementaciones para muchos microcontroladores, así como otras plataformas como Linux en Raspberry Pi.
fa: پیاده‌سازی‌هایی برای بسیاری از میکروکنترلرها و همچنین پلتفرم‌های دیگری مانند لینوکس در Raspberry Pi وجود دارد.
ja: 多くのマイクロコントローラに対する実装に加えて、Raspberry Pi上のLinux向けの実装も存在します。
ko: 라스베리 파이에서 돌아가는 리눅스 같은 플랫폼 뿐만 아니라 다른 여러 마이크로컨트롤러에 대한 구현이 있습니다.
pt_br: Há implementações para vários microcontroladores, bem como outras plataformas como o Linux no Raspberry Pi.
uk: Існують реалізації для багатьох мікроконтролерів, а також інших платформ, таких як Linux на Raspberry Pi.

source: [`embedded-hal-async`](https://crates.io/crates/embedded-hal-async) provides async versions of the traits.
fa: برای[`embedded-hal-async`](https://crates.io/crates/embedded-hal-async) نسخه‌های async از traitها را ارائه می دهد.
uk: Крейт [`embedded-hal-async`](https://crates.io/crates/embedded-hal-async) надає асинхронні версії трейтів.

source: [`embedded-hal-nb`](https://crates.io/crates/embedded-hal-nb) provides another approach to non-blocking I/O, based on the [`nb`](https://crates.io/crates/nb) crate.
fa: مورد [`embedded-hal-nb`](https://crates.io/crates/embedded-hal-nb) رویکرد دیگری را برای عدم مسدود کردن I/O ارائه می دهد که بر اساس [`nb`](https:// crates.io/crates/nb) crate است.
uk: Крейт [`embedded-hal-nb`](https://crates.io/crates/embedded-hal-nb) надає інший підхід до неблокуючого вводу/виводу, заснований на крейті [`nb`](https://crates.io/crates/nb).

source: [probe-rs](https://probe.rs/) is a handy toolset for embedded debugging, like OpenOCD but better integrated.
es: [probe-rs](https://probe.rs/) es un conjunto de herramientas de depuración integradas muy útil, como OpenOCD, pero mejor integrado.
fa: یک [probe-rs](https://probe.rs/) یک مجموعه ابزار مفید برای اشکال زدایی جاسازی شده است، مانند OpenOCD است، اما بهتر یکپارچه شده است.
ja: [probe-rs](https://probe.rs/)は組み込み向けデバッグに有用なツールセットです。これはOpenOCDのようなものですが、より高度に統合されています。
ko: [probe-rs](https://probe.rs/)는 임베디드 시스템을 위한 도구 모임입니다. OpenOCD와 비슷하지만, Rust에 더 잘 통합되어 있습니다.
pt_br: [probe-rs](https://probe.rs/) é um conjunto de ferramentas útil para depuração embarcada, como o OpenOCD, mas melhor integrado.
uk: [probe-rs](https://probe.rs/) — це зручний набір інструментів для вбудованого налагодження, як OpenOCD, але краще інтегрований.

source: SWD (Serial Wire Debug) and JTAG via CMSIS-DAP, ST-Link and J-Link probes
fa: SWD (Serial Wire Debug) و JTAG از طریق پروب های CMSIS-DAP، ST-Link و J-Link
ja: SWD (Serial Wire Debug) やCMSIS-DAP経由のJTAG、 ST-LinkやJ-Linkプローブ
pt_br: SWD (Serial Wire Debug) e JTAG via CMSIS-DAP, sondas ST-Link e J-Link
uk: SWD (Serial Wire Debug) і JTAG через CMSIS-DAP, ST-Link і J-Link зонди

source: GDB stub and Microsoft DAP (Debug Adapter Protocol) server
fa: GDB stub و Microsoft DAP (Debug Adapter Protocol) server
ja: GDBスタブやMicrosoft DAP (Debug Adapter Protocol)サーバ
pt_br: GDB _stub_ e servidor Microsoft DAP (Debug Adapter Protocol)
uk: GDB заглушка та сервер Microsoft DAP (Debug Adapter Protocol)

source: Cargo integration
es: Integración de Cargo
fa: ادغام Cargo
ja: Cargoとのインテグレーション
ko: Cargo에 통합됨
pt_br: Integração com Cargo
uk: Інтеграція Cargo

source: `cargo-embed` is a cargo subcommand to build and flash binaries, log RTT (Real Time Transfers) output and connect GDB. It's configured by an `Embed.toml` file in your project directory.
fa: `buddy_system_allocator`یک third-party crate است که یک تخصیص‌دهنده buddy system را پیاده‌سازی می‌کند. crateهای دیگر در دسترس هستند یا می‌توانید نسخه مربوط به خود را بنویسید یا به تخصیص دهنده موجود خود متصل کنید.
ja: `cargo-embed`はcargoのサブコマンドであり、バイナリをビルドしたり、フラッシュしたり、RTT（Real Time Transfers）の出力ログを取得したり、GDBに接続するためのものです。設定は対象とするプロジェクトディレクトリにおける`Embed.toml`ファイルにより行います。
pt_br: `cargo-embed` é um subcomando do cargo para compilar e gravar binários, registrar a saída do RTT (Real Time Transfers) e conectar o GDB. Ele é configurado por um arquivo `Embed.toml` no diretório do seu projeto.
uk: `cargo-embed` - це підкоманда cargo для збирання та прошивання двійкових файлів, ведення журналу RTT (Real Time Transfers) та підключення GDB. Вона налаштовується за допомогою файлу `Embed.toml` у каталозі вашого проекту.

source: [CMSIS-DAP](https://arm-software.github.io/CMSIS_5/DAP/html/index.html) is an Arm standard protocol over USB for an in-circuit debugger to access the CoreSight Debug Access Port of various Arm Cortex processors. It's what the on-board debugger on the BBC micro:bit uses.
es: [CMSIS-DAP](https://arm-software.github.io/CMSIS_5/DAP/html/index.html) es un protocolo estándar de Arm mediante USB que permite que un depurador en circuito acceda al puerto de acceso de depuración CoreSight de varios procesadores Cortex de Arm. Es lo que utiliza el depurador integrado en el BBC micro:bit
fa: [CMSIS-DAP](https://arm-software.github.io/CMSIS_5/DAP/html/index.html) یک پروتکل استاندارد ARM از طریق USB است که برای یک دیباگر درون مداری جهت دسترسی به پورت CoreSight Debug Access در انواع مختلف پردازنده‌های Arm Cortex مورد استفاده قرار گرفته و این همان چیزی است که دیباگر داخلی در BBC micro:bit از آن استفاده می‌کند.
ja: [CMSIS-DAP](https://arm-software.github.io/CMSIS_5/DAP/html/index.html) はUSB上のARM標準プロトコルで、インサーキット・デバッガが様々なArm Cortexプロセッサのコアサイト・デバッグ・アクセスポートにアクセスするためのものです。BBC micro:bit のオンボード・デバッガもこれを利用しています。
ko: [CMSIS-DAP](https://arm-software.github.io/CMSIS_5/DAP/html/index.html)는 Arm에서 정의한 프로토콜로, USB를 통해 Arm Cortex 프로세서의 CoreSight 디버그 액세스 포트에 접근할 수 있게 해 줍니다. BBC micro:bit에 있는 온보드 디버거도 이 프로토콜을 지원합니다.
pt_br: [CMSIS-DAP](https://arm-software.github.io/CMSIS_5/DAP/html/index.html) é um protocolo padrão da Arm sobre USB para um depurador em circuito acessar a porta de acesso de depuração CoreSight de vários processadores Arm Cortex. É o que o depurador embarcado no BBC micro:bit usa.
uk: [CMSIS-DAP](https://arm-software.github.io/CMSIS_5/DAP/html/index.html) - це стандартний протокол Arm через USB для внутрішньосхемного налагоджувача для доступу до порту CoreSight Debug Access Port різних процесорів Arm Cortex. Це те, що використовує вбудований відладчик на BBC micro:bit.

source: ST-Link is a range of in-circuit debuggers from ST Microelectronics, J-Link is a range from SEGGER.
es: ST-Link es una gama de depuradores en circuito de ST Microelectronics. J-Link es una gama de SEGGER.
fa: ST-Link طیفی از دیباگرهای درون مدار از ST Microelectronics است، J-Link محدوده ای از SEGGER است.
ja: ST-Link はST Microelectronicsによるインサーキット・デバッガの総称で、 J-LinkはSEGGERによるインサーキット・デバッガの総称です。
ko: ST-Link는 ST Microelectronics사에서 만든 in-circuit 디버거들이며, J-Link는 SEGGER사의 in-circuit 디버거들입니다.
pt_br: ST-Link é uma gama de depuradores em circuito da ST Microelectronics, J-Link é uma gama da SEGGER.
uk: ST-Link — це ряд внутрішньосхемних налагоджувачів від ST Microelectronics, J-Link — це ряд від SEGGER.

source: The Debug Access Port is usually either a 5-pin JTAG interface or 2-pin Serial Wire Debug.
es: El puerto de acceso de depuración suele ser una interfaz JTAG de 5 pines o una SWD de 2 pines.
fa: پورت دسترسی Debug معمولا یا یک رابط JTAG 5 پین یا Serial Wire Debug 2 پین است.
ja: デバッグ・アクセスポートは通常５ピンのJTAGインタフェースか、2ピンのシリアルワイヤデバッグです。
ko: 디버그 액세스 포트의 물리적인 구성은 일반적으로 5핀 JTAG 인터페이스 혹은, 2핀 Serial Wire Debug 인터페이스 입니다.
pt_br: A porta de acesso de depuração geralmente é uma interface JTAG de 5 pinos ou depuração Serial Wire de 2 pinos.
uk: Порт доступу для налагодження зазвичай являє собою або 5-контактний інтерфейс JTAG, або 2-контактний Serial Wire Debug.

source: probe-rs is a library which you can integrate into your own tools if you want to.
es: probe-rs es una biblioteca que puedes integrar en tus propias herramientas.
fa: probe-rs یک کتابخانه است که در صورت تمایل می‌توانید آن را در ابزارهای خود ادغام کنید.
ja: probe-rsは自分で独自のツールを統合したい場合に利用できるライブラリです。
ko: probe-rs는 라이브러리로 구현되어 있어서, 다른 도구들에 통합되기가 쉽습니다.
pt_br: probe-rs é uma biblioteca que você pode integrar em suas próprias ferramentas se quiser.
uk: probe-rs — це бібліотека, яку ви можете інтегрувати у власні інструменти, якщо хочете.
