Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: In this exercise, we want to use our new knowledge to implement a broadcast chat application. We have a chat server that the clients connect to and publish their messages. The client reads user messages from the standard input, and sends them to the server. The chat server broadcasts each message that it receives to all the clients.
es: En este ejercicio, queremos usar nuestros nuevos conocimientos para implementar una aplicación de chat de difusión. Disponemos de un servidor de chat al que los clientes se conectan y publican sus mensajes. El cliente lee los mensajes de usuario de la entrada estándar y los envía al servidor. El servidor del chat transmite cada mensaje que recibe a todos los clientes.
fa: در این تمرین، ما می‌خواهیم از دانش جدید خود برای پیاده سازی یک برنامه broadcast chat استفاده کنیم. ما یک سرور چت داریم که کاربران به آن متصل می‌شوند و پیام‌های خود را منتشر می‌کنند. کلاینت پیام‌های کاربر را از ورودی استاندارد می‌خواند و آنها را به سرور ارسال می‌کند. سرور چت هر پیامی را که دریافت می‌کند برای همه کاربران پخش می‌کند.
ja: この演習では、新たに身に付けた知識を活かしてブロードキャスト チャット アプリを実装します。クライアントが接続してメッセージを公開するチャット サーバーがあります。クライアントは標準入力からユーザー メッセージを読み取り、サーバーに送信します。チャット サーバーは受信した各メッセージをすべてのクライアントにブロードキャストします。
pt_br: Neste exercício, queremos usar nosso novo conhecimento para implementar um aplicativo de bate-papo por _broadcast_. Temos um servidor de bate-papo ao qual os clientes se conectam e publicam suas mensagens. O cliente lê as mensagens do usuário da entrada padrão e as envia para o servidor. O servidor de bate-papo transmite cada mensagem que recebe para todos os clientes.
uk: У цій вправі ми хочемо використати наші нові знання для реалізації програми чату. У нас є чат-сервер, до якого підключаються клієнти і публікують свої повідомлення. Клієнт читає повідомлення користувача зі стандартного вводу і надсилає їх на сервер. Сервер чату транслює кожне повідомлення, яке він отримує, усім клієнтам.

source: For this, we use [a broadcast channel](https://docs.rs/tokio/latest/tokio/sync/broadcast/fn.channel.html) on the server, and [`tokio_websockets`](https://docs.rs/tokio-websockets/) for the communication between the client and the server.
fa: برای این کار، از [ broadcast channel](https://docs.rs/tokio/latest/tokio/sync/broadcast/fn.channel.html) در سمت سرور و [`tokio_websockets`](https://docs.rs/tokio-websockets/) برای ارتباط بین کلاینت و سرور.
ja: このために、サーバー上の [ブロードキャスト チャンネル](https://docs.rs/tokio/latest/tokio/sync/broadcast/fn.channel.html) を使用し、クライアントとサーバー間の通信には [`tokio_websockets`](https://docs.rs/tokio-websockets/) を使用します。
pt_br: Para isso, usamos [um canal de _broadcast_](https://docs.rs/tokio/latest/tokio/sync/broadcast/fn.channel.html) no servidor e [`tokio_websockets`](https://docs.rs/tokio-websockets/) para a comunicação entre o cliente e o servidor.
uk: Для цього ми використовуємо [трансляційний канал](https://docs.rs/tokio/latest/tokio/sync/broadcast/fn.channel.html) на сервері та [`tokio_websockets`](https://docs.rs/tokio_websockets/) для зв’язку між клієнтом і сервером.

source: Create a new Cargo project and add the following dependencies:
es: Crea un proyecto de Cargo y añade las siguientes dependencias:
fa: یک پروژه Cargo جدید ایجاد کنید و وابستگی‌های زیر را اضافه کنید:
ja: 新しい Cargo プロジェクトを作成し、次の依存関係を追加します。
pt_br: Crie um novo projeto Cargo e adicione as seguintes dependências:
uk: Створіть новий проект Cargo та додайте такі залежності:

source: The required APIs
es: Las APIs necesarias
fa: ‏API‌های مورد نیاز
ja: 必要な API
pt_br: As APIs necessárias
uk: Необхідні API

source: You are going to need the following functions from `tokio` and [`tokio_websockets`](https://docs.rs/tokio-websockets/). Spend a few minutes to familiarize yourself with the API.
fa: شما به توابع زیر از `tokio` و [`tokio_websockets`](https://docs.rs/tokio-websockets/) نیاز دارید. چند دقیقه را برای آشنایی با API اختصاص دهید.
ja: `tokio` と [`tokio_websockets`](https://docs.rs/tokio-websockets/) の以下の関数が必要になります。少し時間をかけて API に対する理解を深めてください。
pt_br: Você vai precisar das seguintes funções de `tokio` e [`tokio_websockets`](https://docs.rs/tokio-websockets/). Dedique alguns minutos para se familiarizar com a API.
uk: Вам знадобляться такі функції з `tokio` і [`tokio_websockets`](https://docs.rs/tokio-websockets/tokio-websockets/). Витратьте кілька хвилин на ознайомлення з API.

source: [StreamExt::next()](https://docs.rs/futures-util/0.3.28/futures_util/stream/trait.StreamExt.html#method.next) implemented by `WebSocketStream`: for asynchronously reading messages from a Websocket Stream.
fa: ‏ [StreamExt::next()](https://docs.rs/futures-util/0.3.28/futures_util/stream/trait.StreamExt.html#method.next) توسط `WebSocketStream`: برای خواندن ناهمزمان پیام‌ها از یک جریان وب سوکت.
ja: `WebSocketStream` によって実装された [StreamExt::next()](https://docs.rs/futures-util/0.3.28/futures_util/stream/trait.StreamExt.html#method.next): Websocket Stream からのメッセージを非同期で読み取ります。
pt_br: [StreamExt::next()](https://docs.rs/futures-util/0.3.28/futures_util/stream/trait.StreamExt.html#method.next) implementado por `WebSocketStream`: para ler mensagens de forma assíncrona de um _stream_ de _Websocket_.
uk: [StreamExt::next()](https://docs.rs/futures-util/0.3.28/futures_util/stream/trait.StreamExt.html#method.next), реалізований `WebsocketStream`: для асинхронного читання повідомлень з потоку Websocket.

source: [SinkExt::send()](https://docs.rs/futures-util/0.3.28/futures_util/sink/trait.SinkExt.html#method.send) implemented by `WebSocketStream`: for asynchronously sending messages on a Websocket Stream.
fa: ‏[SinkExt::send()](https://docs.rs/futures-util/0.3.28/futures_util/sink/trait.SinkExt.html#method.send) پیاده‌سازی شده توسط `WebSocketStream`: برای ارسال ناهمزمان پیام‌ها در یک Websocket Stream.
ja: `WebSocketStream` によって実装された [SinkExt::send()](https://docs.rs/futures-util/0.3.28/futures_util/sink/trait.SinkExt.html#method.send): Websocket Stream 上でメッセージを非同期で送信します。
pt_br: [SinkExt::send()](https://docs.rs/futures-util/0.3.28/futures_util/sink/trait.SinkExt.html#method.send) implementado por `WebSocketStream`: para enviar mensagens de forma assíncrona em um _stream_ de _Websocket_.
uk: [SinkExt::send()](https://docs.rs/futures-util/0.3.28/futures_util/sink/trait.SinkExt.html#method.send), реалізований `WebsocketStream`: для асинхронного надсилання повідомлень у потоці Websocket.

source: [Lines::next_line()](https://docs.rs/tokio/latest/tokio/io/struct.Lines.html#method.next_line): for asynchronously reading user messages from the standard input.
es: [Lines::next_line()](https://docs.rs/tokio/latest/tokio/io/struct.Lines.html#method.next_line): para la lectura asíncrona de mensajes de usuario de la entrada estándar.
fa: ‏[Lines::next_line()](https://docs.rs/tokio/latest/tokio/io/struct.Lines.html#method.next_line): برای خواندن ناهمزمان پیام‌های کاربر از ورودی استاندارد.
ja: [Lines::next_line()](https://docs.rs/tokio/latest/tokio/io/struct.Lines.html#method.next_line): 標準入力からのユーザー メッセージを非同期で読み取ります。
pt_br: [Lines::next_line()](https://docs.rs/tokio/latest/tokio/io/struct.Lines.html#method.next_line): para ler mensagens de forma assíncrona do usuário da entrada padrão.
uk: [Lines::next_line()](https://docs.rs/tokio/latest/tokio/io/struct.Lines.html#method.next_line): для асинхронного читання повідомлень користувача зі стандартного вводу.

source: [Sender::subscribe()](https://docs.rs/tokio/latest/tokio/sync/broadcast/struct.Sender.html#method.subscribe): for subscribing to a broadcast channel.
es: [Sender::subscribe()](https://docs.rs/tokio/latest/tokio/sync/broadcast/struct.Sender.html#method.subscribe): para suscribirse a un canal en abierto.
fa: ‏[Sender::subscribe()](https://docs.rs/tokio/latest/tokio/sync/broadcast/struct.Sender.html#method.subscribe): برای اشتراک در یک broadcast channel.
ja: [Sender::subscribe()](https://docs.rs/tokio/latest/tokio/sync/broadcast/struct.Sender.html#method.subscribe): ブロードキャスト チャンネルをサブスクライブします。
pt_br: [Sender::subscribe()](https://docs.rs/tokio/latest/tokio/sync/broadcast/struct.Sender.html#method.subscribe): para se inscrever em um canal de transmissão.
uk: [Sender::subscribe()](https://docs.rs/tokio/latest/tokio/sync/broadcast/struct.Sender.html#method.subscribe): для підписки на канал трансляції.

source: Two binaries
es: Dos binarios
fa: دو باینری
ja: 2 つのバイナリ
pt_br: Dois binários
uk: Два бінарні файли

source: Normally in a Cargo project, you can have only one binary, and one `src/main.rs` file. In this project, we need two binaries. One for the client, and one for the server. You could potentially make them two separate Cargo projects, but we are going to put them in a single Cargo project with two binaries. For this to work, the client and the server code should go under `src/bin` (see the [documentation](https://doc.rust-lang.org/cargo/reference/cargo-targets.html#binaries)).
fa: به طور معمول در یک پروژه Cargo، شما می توانید فقط یک فایل باینری و یک فایل `src/main.rs` داشته باشید. در این پروژه به دو باینری نیاز داریم. یکی برای کلاینت و دیگری برای سرور. شما به طور بالقوه می‌توانید آنها را در دو پروژه Cargo جداگانه بسازید، اما ما آنها را در یک پروژه Cargo واحد با دو باینری قرار می‌دهیم. برای این کار، کلاینت و کد سرور باید زیر `src/bin` قرار گیرند (به[documentation](https://doc.rust-lang.org/cargo/reference/cargo-targets.html#binaries) مراجعه کنید ).
ja: 通常、Cargo プロジェクトに含めることができるのは 1 つのバイナリと 1 つの `src/main.rs` ファイルのみです。このプロジェクトには 2 つのバイナリが必要です。1 つはクライアント用、もう 1 つはサーバー用です。2 つの独立した Cargo プロジェクトを作成することもできますが、ここでは 1 つの Cargo プロジェクトに 2 つのバイナリを入れます。そのためには、クライアントとサーバーのコードを `src/bin` に配置する必要があります（[ドキュメント](https://doc.rust-lang.org/cargo/reference/cargo-targets.html#binaries) をご覧ください）。
pt_br: Normalmente em um projeto Cargo, você pode ter apenas um binário e um arquivo `src/main.rs`. Neste projeto, precisamos de dois binários. Um para o cliente e outro para o servidor. Você poderia potencialmente torná-los dois projetos Cargo separados, mas vamos colocá-los em um único projeto Cargo com dois binários. Para que isso funcione, o código do cliente e do servidor deve ir em `src/bin` (consulte a [documentação](https://doc.rust-lang.org/cargo/reference/cargo-targets.html#binaries)).
uk: Зазвичай у проекті Cargo можна мати лише один бінарний файл і один файл `rc/main.rs`. У цьому проекті нам потрібні два бінарних файли. Один для клієнта і один для сервера. Потенційно ви могли б зробити їх двома окремими проектами Cargo, але ми збираємося помістити їх в один проект Cargo з двома бінарними файлами. Для того, щоб це працювало, клієнтський і серверний код має знаходитися у каталозі `src/bin` (дивиться [документацію](https://doc.rust-lang.org/cargo/reference/cargo-targets.html#binaries)).

source: Copy the following server and client code into `src/bin/server.rs` and `src/bin/client.rs`, respectively. Your task is to complete these files as described below.
fa: کد سرور و کلاینت زیر را به ترتیب در`src/bin/server.rs` و `src/bin/client.rs` کپی کنید. وظیفه شما این است که این فایل‌ها را همانطور که در زیر توضیح داده شده است تکمیل کنید.
ja: 次のサーバーとクライアントのコードを、それぞれ`src/bin/server.rs` と `src/bin/client.rs` にコピーします。ここでのタスクは、以下で説明するように、これらのファイルを完成させることです。
pt_br: Copie o seguinte código do servidor e do cliente para `src/bin/server.rs` e `src/bin/client.rs`, respectivamente. Sua tarefa é completar esses arquivos conforme descrito abaixo.
uk: Скопіюйте наступний серверний та клієнтський код у файли `src/bin/server.rs` та `src/bin/client.rs` відповідно. Ваше завдання - доповнити ці файли, як описано нижче.

source: // TODO: For a hint, see the description of the task below.
ja: // TODO: ヒントについては、以下のタスクの説明をご覧ください。
pt_br: // TODO: Para uma dica, veja a descrição da tarefa abaixo.
uk: // TODO: Підказку дивіться в описі завдання нижче.

source: "listening on port 2000"
pt_br: "ouvindo na porta 2000"
uk: "слухаємо на порту 2000"

source: "New connection from {addr:?}"
fa: "اتصال جدید از {addr:?}"
pt_br: "Nova conexão de {addr:?}"
uk: "Нове з'єднання з {addr:?}"

source: // Wrap the raw TCP stream into a websocket.
ja: // 未加工の TCP ストリームを WebSocket にラップします。
pt_br: // Envolver o _stream_ TCP bruto em um _websocket_.
uk: // Обернути необроблений TCP потік у веб-сокет.

source: Running the binaries
es: Ejecutar los binarios
fa: راه‌اندازی باینری
ja: バイナリの実行
pt_br: Executando os binários
uk: Запуск бінарних файлів

source: Run the server with:
es: Ejecuta el servidor con:
fa: سرور را راه‌اندازی کنید با استفاده از:
ja: 次のコマンドでサーバーを実行します。
pt_br: Execute o servidor com:
uk: Запустіть сервер за допомогою:

source: and the client with:
es: y el cliente con:
fa: و این کلاینت با:
ja: 次のコマンドでクライアントを実行します。
pt_br: e o cliente com:
uk: і клієнт за допомогою:

source: Implement the `handle_connection` function in `src/bin/server.rs`.
es: Implementa la función `handle_connection` en `src/bin/server.rs`.
fa: تابع `handle_connection` را در `src/bin/server.rs` پیاده‌سازی کنید.
ja: `src/bin/server.rs` に `handle_connection` 関数を実装します。
pt_br: Implemente a função `handle_connection` em `src/bin/server.rs`.
uk: Реалізуйте функцію `handle_connection` у `src/bin/server.rs`.

source: Hint: Use `tokio::select!` for concurrently performing two tasks in a continuous loop. One task receives messages from the client and broadcasts them. The other sends messages received by the server to the client.
es: Sugerencia: usa `tokio::select!` para realizar dos tareas simultáneamente en un bucle continuo. Una tarea recibe mensajes del cliente y los transmite. La otra envía los mensajes que recibe el servidor al cliente.
fa: نکته: از `tokio::select!` برای انجام همزمان دو task در یک حلقه پیوسته استفاده کنید. یک task پیام‌هایی را از کلاینت دریافت می‌کند و آنها را پخش(broadcast) می‌کند. دیگری پیام‌های دریافت شده توسط سرور را برای کاربر ارسال می‌کند.
ja: ヒント: 2 つのタスクを連続ループで同時に実行するには、`tokio::select!` を使用します。1 つのタスクは、クライアントからメッセージを受信してブロードキャストします。もう 1 つのタスクは、サーバーで受信したメッセージをクライアントに送信します。
pt_br: Dica: Use `tokio::select!` para realizar concorrentemente duas tarefas em um loop contínuo. Uma tarefa recebe mensagens do cliente e as transmite. A outra envia mensagens recebidas pelo servidor para o cliente.
uk: Підказка: використовуйте `tokio::select!` для одночасного виконання двох завдань у безперервному циклі. Одне завдання отримує повідомлення від клієнта і транслює їх. Інше надсилає повідомлення, отримані сервером, клієнту.

source: Complete the main function in `src/bin/client.rs`.
es: Completa la función principal en `src/bin/client.rs`.
fa: تابع اصلی را در `src/bin/client.rs` تکمیل کنید.
ja: `src/bin/client.rs` のメイン関数を完成させます。
pt_br: Complete a função principal em `src/bin/client.rs`.
uk: Завершіть основну функцію в `src/bin/client.rs`.

source: Hint: As before, use `tokio::select!` in a continuous loop for concurrently performing two tasks: (1) reading user messages from standard input and sending them to the server, and (2) receiving messages from the server, and displaying them for the user.
es: Sugerencia: al igual que antes, usa `tokio::select!` en un bucle continuo para realizar dos tareas simultáneamente: (1) leer los mensajes del usuario desde la entrada estándar y enviarlos al servidor, y (2) recibir mensajes del servidor y mostrárselos al usuario.
fa: نکته: مانند قبل، از `tokio::select!` در یک حلقه پیوسته برای انجام همزمان دو task استفاده کنید: (۱) خواندن پیام های کاربر از ورودی استاندارد و ارسال آنها به سرور و (۲) دریافت پیام از سرور و نمایش آنها برای کاربر.
ja: ヒント: 前の例と同様に、`tokio::select!` を連続ループで使用し、（1）標準入力からユーザー メッセージを読み取ってサーバーに送信するタスクと、（2）サーバーからメッセージを受信してユーザーに表示するタスクを同時に実行します。
pt_br: Dica: Como antes, use `tokio::select!` em um loop contínuo para realizar concorrentemente duas tarefas: (1) ler mensagens do usuário da entrada padrão e enviá-las para o servidor, e (2) receber mensagens do servidor e exibi-las para o usuário.
uk: Підказка: як і раніше, використовуйте `tokio::select!` у безперервному циклі для одночасного виконання двох завдань: (1) читання повідомлень користувача зі стандартного вводу та надсилання їх на сервер, і (2) отримання повідомлень від сервера, і відображення їх для користувача.

source: Optional: Once you are done, change the code to broadcast messages to all clients, but the sender of the message.
es: Opcional: cuando termines, cambia el código para difundir mensajes a todos los clientes, excepto al remitente.
fa: اختیاری: پس از اتمام کار، کد را تغییر دهید تا پیام‌ها برای همه کلاینت‌ها، به جز فرستنده پیام، منتشر شود.
ja: 省略可: 完了したら、メッセージの送信者以外のすべてのクライアントにメッセージをブロードキャストするようにコードを変更します。
pt_br: Opcional: Depois de terminar, altere o código para transmitir mensagens para todos os clientes, exceto o remetente da mensagem.
uk: Необов’язково: коли ви закінчите, змініть код, щоб транслювати повідомлення всім клієнтам, крім відправника повідомлення.

source: // Keep trying until we have both forks // Pick up forks...
uk: // Продовжуємо пробувати, поки не знайдемо обидві виделки // Беремо виделки...

source: // The locks are dropped here
ja: // ここでロックがドロップされます。
pt_br: // Os _locks_ são descartados aqui
uk: // Тут скидаються блокування

source: // tx is dropped here, so we don't need to explicitly drop it later
ja: // tx はここでドロップされるので、後で明示的に削除する必要はありません。
pt_br: // tx é descartado aqui, então não precisamos descartá-lo explicitamente mais tarde
uk: // tx відкидається тут, тому нам не потрібно явно відкидати його пізніше

source: "Here is a thought: {thought}"
fa: "در اینجا یک ایده وجود دارد: {thought}"
pt_br: "Aqui está um pensamento: {thought}"
uk: "Є така думка: {thought}"

source: "Welcome to chat! Type a message"
fa: "به chat خوش آمدید! یک پیام تایپ کنید"
pt_br: "Bem-vindo ao bate-papo! Digite uma mensagem"
uk: "Ласкаво просимо до чату! Введіть повідомлення"

source: // A continuous loop for concurrently performing two tasks: (1) receiving // messages from `ws_stream` and broadcasting them, and (2) receiving // messages on `bcast_rx` and sending them to the client.
ja: // (1) `ws_stream` からメッセージを受信してブロードキャストするタスクと、 // （2）`bcast_rx` でメッセージを受信してクライアントに送信しするタスクを // 同時に実行するための連続ループ。
pt_br: // Um loop contínuo para realizar concorrentemente duas tarefas: (1) recebendo // mensagens de `ws_stream` e transmitindo-as, e (2) recebendo // mensagens em `bcast_rx` e enviando-as para o cliente.
uk: // Безперервний цикл для одночасного виконання двох задач: (1) отримання // повідомлень з `ws_stream` та їх трансляції, та (2) отримання // повідомлень на `bcast_rx` і відправлення їх клієнту.

source: "From client {addr:?} {text:?}"
pt_br: "Do cliente {addr:?} {text:?}"
uk: "Від клієнта {addr:?} {text:?}"

source: // Continuous loop for concurrently sending and receiving messages.
ja: // メッセージの同時送受信のための継続的なループ。
pt_br: // Loop contínuo para enviar e receber mensagens concorrentemente.
uk: // Безперервний цикл для одночасної відправки та отримання повідомлень.

source: "From server: {}"
pt_br: "Do servidor: {}"
uk: "З сервера: {}"

source: _Thank you for taking Comprehensive Rust 🦀!_ We hope you enjoyed it and that it was useful.
es: _Gracias por realizar el curso Comprehensive Rust 🦀._ Esperamos que te haya gustado y que te haya resultado útil.
fa: ممنون که آموزش‌هایی را از Comprehensive Rust 🦀! رو گرفتید. امیدواریم لذت برده باشید و برای‌ شما مفید بوده باشد.
ja: Comprehensive Rust 🦀! を受講いただきありがとうございました。
ko: Comprehensive Rust 🦀를 이용해 주셔서 감사합니다. 즐겁고 유익한 시간이었기를 바랍니다.
pt_br: _Obrigado por fazer o Comprehensive Rust 🦀!_ Esperamos que tenha gostado e que tenha sido útil.
uk: _Дякуємо, що прослухали курс Comprehensive Rust 🦀!_ Сподіваємося, вам сподобалось і було корисно.

source: We've had a lot of fun putting the course together. The course is not perfect, so if you spotted any mistakes or have ideas for improvements, please get in [contact with us on GitHub](https://github.com/google/comprehensive-rust/discussions). We would love to hear from you.
es: Nos lo hemos pasado muy bien preparando el curso. Sabemos que no es perfecto, así que si has detectado algún error o tienes ideas para mejorarlo, [ponte en contacto con nosotros en GitHub](https://github.com/google/comprehensive-rust/discussions). Nos encantaría saber tu opinión.
fa: ما از برگزاری این دوره بسیار لذت بردیم. این دوره کامل نیست، بنابراین اگر اشتباهی را مشاهده کردید یا ایده‌ای برای بهبود دارید، لطفاً با [در GitHub با ما تماس بگیرید](https://github.com/google/comprehensive-rust/discussions) وارد شوید. ما دوست داریم از شما بشنویم.
ja: ここまで多くのことを学んできましたが、このコースは完璧ではないため、間違いを見つけた場合や改善のアイデアがある場合は [GitHub でお知らせください](https://github.com/google/comprehensive-rust/discussions)。皆さんからのフィードバックをお待ちしています。
ko: 강의가 완벽하진 않으니 실수나 개선점이 있다면 언제든지 [깃허브](https://github.com/google/comprehensive-rust/discussions)로 연락주세요.
pt_br: Nós nos divertimos muito montando o curso. O curso não é perfeito, portanto, se você identificou algum erro ou tem ideias para melhorias, entre em [entre em contato conosco no GitHub](https://github.com/google/comprehensive-rust/discussions). Nós adoraríamos ouvir você.
uk: Нам було дуже весело створювати курс. Курс не ідеальний, тож якщо ви помітили будь-які помилки або маєте ідеї щодо покращення, [зв’яжіться з нами на GitHub](https://github.com/google/comprehensive-rust/discussions). Ми будемо раді почути від вас.

source: The following is a glossary which aims to give a short definition of many Rust terms. For translations, this also serves to connect the term back to the English original.
fa: در زیر واژه‌نامه‌ای است که هدف آن ارائه تعریف کوتاهی از بسیاری از اصطلاحات در زبان Rust است. برای ترجمه‌ها، این مورد نیز برای اتصال این اصطلاح به زبان اصلی انگلیسی است.
ja: 以下は、Rust の多くの用語を簡単に定義することを目的とした用語集です。翻訳時に用語を英語の原文に関連付けるのにも役立ちます。
pt_br: A seguir, há um glossário que tem como objetivo fornecer uma definição breve de muitos termos de Rust. Para traduções, isso também serve para conectar o termo de volta ao original em inglês.
uk: Нижче наведено глосарій, який має на меті дати коротке визначення багатьох термінів Rust. У перекладах він також допомагає пов'язати термін з англійським оригіналом.

source: allocate: Dynamic memory allocation on [the heap](memory-management/review.md).
fa: allocate: تخصیص حافظه پویا در [heap]‌(memory-management/review.md).
uk: виділяти: Динамічний розподіл пам'яті на [купі](memory-management/review.md).

source: argument: Information that is passed into a function or method.
fa: argument: اطلاعاتی که به یک تابع یا متد منتقل می‌شود.
ja: 引数（argument）: 関数またはメソッドに渡される情報。
pt_br: argumento: Informação que é passada para uma função ou método.
uk: аргумент: Інформація, яка передається у функцію або метод.

source: associated type: A type associated with a specific trait. Useful for defining the relationship between types.
fa: نوع مرتبط: نوعی که با یک ویژگی خاص مرتبط است. برای تعریف رابطه بین typeها مفید است.
uk: асоційований тип: Тип, пов'язаний з певним трейтом. Корисний для визначення взаємозв'язку між типами.

source: Bare-metal Rust: Low-level Rust development, often deployed to a system without an operating system. See [Bare-metal Rust](bare-metal.md).
fa: Bare-metal Rust: توسعه سطح پایین Rust، اغلب در سیستم‌هایی که سیستم‌عامل ندارند، مستقر می‌شود. [Bare-metal Rust](bare-metal.md) را ببینید.
ja: ベアメタル Rust（Bare-metal Rust）: 低レベルの Rust 開発。多くの場合、オペレーティング システムのないシステムにデプロイされます。[ベアメタル Rust](bare-metal.md) をご覧ください。
pt_br: Rust _bare-metal_: Desenvolvimento de baixo nível em Rust, frequentemente implantado em um sistema sem um sistema operacional. Veja [Rust _bare-metal_](bare-metal.md).
uk: Rust на голому залізі: Низькорівнева розробка Rust, часто розгорнута на системі без операційної системи. See [Bare-metal Rust](bare-metal.md). Дивіться [Rust на голому залізі](bare-metal.md).

source: block: See [Blocks](control-flow-basics/blocks-and-scopes.md) and _scope_.
fa: block: ‏[Blocks]‌(control-flow-basics/blocks-and-scopes.md) و _scope_ را ببینید.
uk: блок: Дивіться [Блоки](control-flow-basics/blocks-and-scopes.md) та _область видимості_.
