Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Although this looks like a regular Rust `mod`, the `#[cxx::bridge]` procedural macro does complex things to it. The generated code is quite a bit more sophisticated - though this does still result in a `mod` called `ffi` in your code.
fa: اگرچه این شبیه به یک `mod` معمولی Rust است، اما ماکرو رویه‌ای `#[cxx::bridge]` کارهای پیچیده‌ای برای آن انجام می‌دهد و کد تولید شده کمی پیچیده تر است - اگرچه این کار همچنان منجر به یک `mod` به نام `ffi` در کد شما می شود.
pt_br: Embora isso pareça um `mod` Rust regular, a macro procedural `#[cxx::bridge]` faz coisas complexas com ele. O código gerado é bastante sofisticado - embora isso ainda resulte em um `mod` chamado `ffi` em seu código.
uk: Хоча це виглядає як звичайний `mod` у Rust, процедурний макрос `#[cxx::bridge]` робить з ним складні речі. Згенерований код є дещо складнішим - хоча це все одно призведе до появи у вашому коді `mod` з назвою `ffi`.

source: Native support for C++'s `std::unique_ptr` in Rust
fa: پشتیبانی Native در ++C برای`std::unique_ptr`در Rust
pt_br: Suporte nativo para `std::unique_ptr` do C++ no Rust
uk: Вбудована підтримка `std::unique_ptr` з C++ у Rust

source: Native support for Rust slices in C++
fa: پشتیبانی Native برای Rust Slices در ++C
pt_br: Suporte nativo para _slices_ Rust no C++
uk: Вбудована підтримка зрізів Rust у C++

source: Calls from C++ to Rust, and Rust types (in the top part)
fa: فراخوانی از ++C به Rust و تایپ‌های Rust (در قسمت بالا)
pt_br: Chamadas do C++ para o Rust e tipos Rust (na parte superior)
uk: Виклики з C++ на Rust та типи Rust (у верхній частині)

source: Calls from Rust to C++, and C++ types (in the bottom part)
fa: فراخوانی از Rust به ++C و تایپ‌های ++C (در قسمت پایین)
pt_br: Chamadas do Rust para o C++ e tipos C++ (na parte inferior)
uk: Виклики з Rust на C++ та типи C++ (у нижній частині)

source: **Common misconception**: It _looks_ like a C++ header is being parsed by Rust, but this is misleading. This header is never interpreted by Rust, but simply `#include`d in the generated C++ code for the benefit of C++ compilers.
fa: تصور نادرست رایج**: به نظر می‌رسد هِدِر ++C توسط Rust تجزیه می‌شود، اما این گمراه کننده است. این هِدِر هرگز توسط Rust تفسیر نمی‌شود، بلکه به سادگی `#include` در کد ++C تولید‌شده برای کامپایلرهای ++C است.
pt_br: **Equívocos comuns**: Parece que um cabeçalho C++ está sendo analisado pelo Rust, mas isso é enganoso. Este cabeçalho nunca é interpretado pelo Rust, mas simplesmente `#include`d no código C++ gerado para o benefício dos compiladores C++.
uk: **Поширена помилка**: _Виглядає_ так, ніби заголовок C++ розбирається Rust'ом, але це оманлива думка. Цей заголовок ніколи не інтерпретується Rust'ом, а просто `#include`d у згенерований C++ код на користь компіляторів C++.

source: By far the most useful page when using CXX is the [type reference](https://cxx.rs/bindings.html).
fa: تا حد زیادی مفیدترین صفحه هنگام استفاده از CXX برابر [type reference](https://cxx.rs/bindings.html) است.
pt_br: De longe, a página mais útil ao usar o CXX é a [referência de tipo](https://cxx.rs/bindings.html).
uk: Безумовно, найбільш корисною сторінкою при використанні CXX є [довідник типів](https://cxx.rs/bindings.html).

source: CXX fundamentally suits cases where:
fa: ‏ CXX به‌طورکلی مناسب مواردی است که:
pt_br: CXX fundamentalmente é adequado para casos em que:
uk: CXX принципово підходить для випадків, коли:

source: Your Rust-C++ interface is sufficiently simple that you can declare all of it.
fa: اینترفیس ++Rust-C شما به اندازه کافی ساده است که می‌توانید همه آن را اعلام یا declare کنید.
pt_br: Sua interface Rust-C++ é suficientemente simples para que você possa declarar tudo.
uk: Ваш інтерфейс Rust-C++ достатньо простий, щоб ви могли оголосити все це.

source: You're using only the types natively supported by CXX already, for example `std::unique_ptr`, `std::string`, `&[u8]` etc.
fa: شما فقط از تایپ‌هایی استفاده می‌کنید که قبلاً توسط CXX ​​پشتیبانی می‌شوند، برای مثال`std::unique_ptr`, `std::string`, `&[u8]` و غیره.
pt_br: Você está usando apenas os tipos já suportados nativamente pelo CXX, por exemplo, `std::unique_ptr`, `std::string`, `&[u8]` etc.
uk: Ви використовуєте лише типи, які вже підтримуються CXX, наприклад, `std::unique_ptr`, `std::string`, `&[u8]` тощо.

source: It has many limitations --- for example lack of support for Rust's `Option` type.
fa: این مورد محدودیت‌های زیادی دارد --- برای مثال عدم پشتیبانی از تایپ 'Option' Rust.
pt_br: Ele tem muitas limitações --- por exemplo, falta de suporte para o tipo `Option` do Rust.
uk: Це має багато обмежень --- наприклад, відсутність підтримки типу `Option` у Rust.

source: These limitations constrain us to using Rust in Chromium only for well isolated "leaf nodes" rather than for arbitrary Rust-C++ interop. When considering a use-case for Rust in Chromium, a good starting point is to draft the CXX bindings for the language boundary to see if it appears simple enough.
fa: این محدودیت‌ها ما را محدود می‌کنند تا از Rust در Chromium فقط برای "گره‌های برگ" به خوبی ایزوله شده استفاده کنیم نه برای تعامل دلخواه ++Rust-C. هنگام در نظر گرفتن یک مورد استفاده برای Rust در Chromium، یک نقطه شروع خوب این است که پیش نویس پیوندهای CXX برای مرز زبان (language boundary) را پیش‌نویس کنید تا ببینید آیا به اندازه کافی ساده به نظر می رسد یا خیر.
pt_br: Essas limitações nos restringem a usar o Rust no Chromium apenas para "leaf nodes" ("nós folha") bem isolados, em vez de para interoperabilidade Rust-C++ arbitrária. Ao considerar um caso de uso para o Rust no Chromium, um bom ponto de partida é elaborar os _bindings_ CXX para a fronteira entre as linguagens para ver se ela parece simples o suficiente.
uk: Ці обмеження обмежують нас у використанні Rust у Chromium лише для добре ізольованих "листових вузлів", а не для довільної взаємодії Rust-C++. Розглядаючи варіанти використання Rust у Chromium, гарною відправною точкою є складання проекту прив'язки CXX для мовної межі, щоб побачити, чи виглядає він достатньо простим.

source: You should also discuss some of the other sticky points with CXX, for example:
fa: همچنین باید برخی از نکات مهم دیگر را با CXX مطرح کنید، به عنوان مثال:
pt_br: Você também deve discutir alguns dos outros pontos problemáticos com o CXX, por exemplo:
uk: Ви також повинні обговорити деякі інші проблемні моменти з CXX, наприклад:

source: Its error handling is based around C++ exceptions (given on the next slide)
fa: مدیریت خطای آن بر اساسC++ exception است (در اسلاید بعدی ارائه شده است)
pt_br: Seu tratamento de erros é baseado em exceções C++ (dado no próximo slide)
uk: Обробка помилок базується на винятках C++ (наведені на наступному слайді)

source: Function pointers are awkward to use.
fa: استفاده ازFunction pointerها دشوار است.
pt_br: Ponteiros de função são difíceis de usar.
uk: Функціональні покажчики незручні у використанні.

source: CXX's [support for `Result<T,E>`](https://cxx.rs/binding/result.html) relies on C++ exceptions, so we can't use that in Chromium. Alternatives:
fa: ‏ CXX [پشتیبانی از `Result<T,E>`](https://cxx.rs/binding/result.html) به C++ exception متکی است، بنابراین نمی‌توانیم از آن در Chromium استفاده کنیم. جایگزین‌های آن عبارتند از:
pt_br: O [suporte do CXX para `Result<T,E>`](https://cxx.rs/binding/result.html) depende de exceções C++, portanto, não podemos usá-lo no Chromium. Alternativas:
uk: У CXX [підтримка `Result<T,E>`](https://cxx.rs/binding/result.html) покладається на винятки C++, тому ми не можемо використовувати її у Chromium. Альтернативи:

source: The `T` part of `Result<T, E>` can be:
fa: قسمت `T` از `نتیجه<T، E>` می تواند باشد:
pt_br: A parte `T` de `Result<T, E>` pode ser:
uk: Частина `T` у `Result<T, E>` може бути:

source: Returned via out parameters (e.g. via `&mut T`). This requires that `T` can be passed across the FFI boundary - for example `T` has to be:
fa: از طریق پارامترهای خارجی (به عنوان مثال از طریق `&mut T`) برگردانده شده است. این مستلزم آن است که `T` بتواند از مرز FFI عبور کند - برای مثال `T` باید باشد:
pt_br: Retornado via parâmetros de saída (por exemplo, via `&mut T`). Isso requer que `T` possa ser passado pela fronteira FFI - por exemplo, `T` tem que ser:
uk: Повернута через вихідні параметри (наприклад, через `&mut T`). Для цього потрібно, щоб `T` можна було передати через межу FFI - наприклад, `T` має бути:

source: A primitive type (like `u32` or `usize`)
fa: یک type اولیه (مانند `u32` یا `usize`)
pt_br: Um tipo primitivo (como `u32` ou `usize`)
uk: Примітивний тип (наприклад, `u32` або `usize`)

source: A type natively supported by `cxx` (like `UniquePtr<T>`) that has a suitable default value to use in a failure case (_unlike_ `Box<T>`).
fa: تایپی که به طور native توسط `cxx` پشتیبانی می‌شود (مانند `UniquePtr<T>`) که دارای یک مقدار پیش‌فرض مناسب برای استفاده در موارد خرابی است (_unlike_ `Box<T>`).
pt_br: Um tipo suportado nativamente por `cxx` (como `UniquePtr<T>`) que tem um valor padrão adequado para usar em um caso de falha (_ao contrário_ de `Box<T>`).
uk: Тип, що підтримується `cxx` (наприклад, `UniquePtr<T>`), який має відповідне значення за замовчуванням для використання у випадку невдачі (_на відміну_ від `Box<T>`).

source: Retained on the Rust side, and exposed via reference. This may be needed when `T` is a Rust type, which cannot be passed across the FFI boundary, and cannot be stored in `UniquePtr<T>`.
fa: در سمت Rust حفظ شده و از طریق مرجع در معرض دید قرار گرفته است. این کار ممکن است زمانی مورد نیاز باشد که `T` یک تایپ Rust است که نمی‌تواند از مرز FFI عبور کند و نمی تواند در `UniquePtr<T>` ذخیره شود.
pt_br: Mantido no lado Rust e exposto por referência. Isso pode ser necessário quando `T` é um tipo Rust, que não pode ser passado pela fronteira FFI e não pode ser armazenado em `UniquePtr<T>`.
uk: Збережена на стороні Rust та доступна за посиланням. Це може знадобитися, коли `T` є типом Rust, який не може бути переданий через межу FFI і не може бути збережений у `UniquePtr<T>`.

source: The `E` part of `Result<T, E>` can be:
fa: قسمت `E` از `Result<T, E>` می‌تواند باشد:
pt_br: A parte `E` de `Result<T, E>` pode ser:
uk: Частина `E` у `Result<T, E>` може бути:

source: Returned as a boolean (e.g. `true` representing success, and `false` representing failure)
fa: به‌عنوان یک boolean برگردانده می‌شود (مثلاً `true` نشان‌دهنده موفقیت و `false` نشان‌دهنده یک شکست است)
pt_br: Retornado como um booleano (por exemplo, `true` representando sucesso e `false` representando falha)
uk: Повернута як булеве значення (наприклад, `true` означає успіх, а `false` - невдачу)

source: Preserving error details is in theory possible, but so far hasn't been needed in practice.
fa: حفظ جزئیات خطا در تئوری امکان پذیر است، اما تاکنون در عمل مورد نیاز نبوده است.
pt_br: A preservação dos detalhes do erro é teoricamente possível, mas até agora não foi necessária na prática.
uk: Збереження деталей помилок теоретично можливе, але поки що на практиці воно не було потрібне.

source: CXX Error Handling: QR Example
fa: مدیریت خطا CXX: مثال QR
pt_br: Tratamento de Erros no CXX: Exemplo QR
uk: Обробка помилок CXX: Приклад з QR

source: The QR code generator is [an example](https://source.chromium.org/chromium/chromium/src/+/main:components/qr_code_generator/qr_code_generator_ffi_glue.rs;l=13-18;drc=7bf1b75b910ca430501b9c6a74c1d18a0223ecca) where a boolean is used to communicate success vs failure, and where the successful result can be passed across the FFI boundary:
fa: تولید کد QR [نمونه‌ای](https://source.chromium.org/chromium/chromium/src/+/main:components/qr_code_generator/qr_code_generator_ffi_glue.rs;l=13-18;drc=7bf1b75b9101ca2013) است که در آن بولی برای ارتباط موفقیت در مق‌بل شکست و جایی که نتیجه موفقیت آمیز را می‌توان از مرز FFI عبور داد استفاده می شود:
pt_br: O gerador de código QR é [um exemplo](https://source.chromium.org/chromium/chromium/src/+/main:components/qr_code_generator/qr_code_generator_ffi_glue.rs;l=13-18;drc=7bf1b75b910ca430501b9c6a74c1d18a0223ecca) onde um booleano é usado para comunicar sucesso vs falha e onde o resultado bem-sucedido pode ser passado pela fronteira FFI:
uk: Генератор QR-кодів - це [приклад](https://source.chromium.org/chromium/chromium/src/+/main:components/qr_code_generator/qr_code_generator_ffi_glue.rs;l=13-18;drc=7bf1b75b910ca430501b9c6a74c1d18a0223ecca), де булеве значення використовується для передачі інформації про успіх чи невдачу, і де успішний результат може бути переданий через межу FFI:

source: Students may be curious about the semantics of the `out_qr_size` output. This is not the size of the vector, but the size of the QR code (and admittedly it is a bit redundant - this is the square root of the size of the vector).
fa: دانش آموزان ممکن است در مورد معنایی خروجی `out_qr_size` کنجکاو باشند. این اندازه بردار نیست بلکه اندازه کد QR است (و مسلماً کمی اضافی است - درواقع این جذر اندازه بردار است).
pt_br: Os alunos podem estar curiosos sobre a semântica da saída `out_qr_size`. Este não é o tamanho do vetor, mas o tamanho do código QR (e, reconhecidamente, é um pouco redundante - esta é a raiz quadrada do tamanho do vetor).
uk: Студентам може бути цікаво дізнатися про семантику виведення `out_qr_size`. Це не розмір вектора, а розмір QR-коду (і слід визнати, що це трохи зайве - це квадратний корінь з розміру вектора).

source: It may be worth pointing out the importance of initializing `out_qr_size` before calling into the Rust function. Creation of a Rust reference that points to uninitialized memory results in Undefined Behavior (unlike in C++, when only the act of dereferencing such memory results in UB).
fa: شاید لازم باشد قبل از فراخوانی تابع Rust به اهمیت مقداردهی اولیه `out_qr_size` اشاره کنیم. ایجاد یک مرجع Rust که به حافظه اولیه اشاره می‌کند، منجر به رفتار نامشخص می‌شود (برخلاف ++C، زمانی که تنها عمل عدم ارجاع چنین حافظه‌ای منجر به UB می‌شود).
pt_br: Pode valer a pena destacar a importância de inicializar `out_qr_size` antes de chamar a função Rust. A criação de uma referência Rust que aponta para a memória não inicializada resulta em Comportamento Indefinido (ao contrário do C++, quando apenas o ato de desreferenciar tal memória resulta em UB).
uk: Варто звернути увагу на важливість ініціалізації `out_qr_size` перед викликом функції Rust. Створення посилання у Rust, яке вказує на неініціалізовану пам'ять, призводить до Undefined Behavior (на відміну від C++, де лише акт розіменування такої пам'яті призводить до UB).

source: If students ask about `Pin`, then explain why CXX needs it for mutable references to C++ data: the answer is that C++ data can’t be moved around like Rust data, because it may contain self-referential pointers.
fa: اگر دانش‌آموزان درباره `Pin` سؤال می‌کنند، توضیح دهید که چرا CXX برای ارجاع‌های قابل تغییر به داده‌های ++C به آن نیاز دارد: پاسخ این است که داده‌های++C را نمی‌توان مانند داده‌های Rust جابه‌جا کرد، زیرا ممکن است حاوی نشانگرهای خودارجاعی (self-referential pointers) باشد.
pt_br: Se os alunos perguntarem sobre `Pin`, explique por que o CXX precisa dele para referências mutáveis a dados C++: a resposta é que os dados C++ não podem ser movidos como os dados Rust, porque podem conter ponteiros auto-referenciais.
uk: Якщо студенти запитають про `Pin`, поясніть, навіщо він потрібен CXX для змінних посилань на дані C++: відповідь полягає в тому, що дані C++ не можна переміщати, як дані Rust, оскільки вони можуть містити самопосилальні вказівники.

source: CXX Error Handling: PNG Example
fa: مدیریت خطا CXX: مثال PNG
pt_br: Tratamento de Erros no CXX: Exemplo PNG
uk: Обробка помилок CXX: Приклад PNG

source: A prototype of a PNG decoder illustrates what can be done when the successful result cannot be passed across the FFI boundary:
fa: نمونه اولیه PNG decoder نشان می‌دهد که وقتی نتیجه موفقیت آمیز نمی‌تواند از مرز FFI عبور کند و چه کاری می توان انجام داد:
pt_br: Um protótipo de um decodificador PNG ilustra o que pode ser feito quando o resultado bem-sucedido não pode ser passado pela fronteira FFI:
uk: Прототип декодера PNG ілюструє, що можна зробити, коли успішний результат не може бути переданий через межу FFI:

source: /// This returns an FFI-friendly equivalent of `Result<PngReader<'a>, /// ()>`.
pt_br: /// Isso retorna um equivalente amigável ao FFI de `Result<PngReader<'a>, /// ()>`.
uk: /// Повертає дружній до FFI еквівалент `Result<PngReader<'a>, /// ()>`.

source: /// C++ bindings for the `crate::png::ResultOfPngReader` type.
pt_br: /// _Bindings_ C++ para o tipo `crate::png::ResultOfPngReader`.
uk: /// Зв'язування C++ для типу `crate::png::ResultOfPngReader`.

source: /// C++ bindings for the `crate::png::PngReader` type.
pt_br: /// _Bindings_ C++ para o tipo `crate::png::PngReader`.
uk: /// Зв'язування C++ для типу `crate::png::PngReader`.

source: `PngReader` and `ResultOfPngReader` are Rust types --- objects of these types cannot cross the FFI boundary without indirection of a `Box<T>`. We can't have an `out_parameter: &mut PngReader`, because CXX doesn't allow C++ to store Rust objects by value.
fa: ‏ "PngReader" و "ResultOfPngReader" تایپ‌های Rust هستند --- objectهای از این نوع نمیتوانند بدون جهت‌گیری غیرمستقیم `Box<T>` از مرز FFI عبور کنند. ما نمی‌توانیم `out_parameter: &mut PngReader` داشته باشیم، زیرا CXX به ++C اجازه نمی‌دهد Rust object ها را براساس مقدار ذخیره کند.
pt_br: `PngReader` e `ResultOfPngReader` são tipos Rust --- objetos desses tipos não podem cruzar a fronteira FFI sem a indireção de um `Box<T>`. Não podemos ter um `out_parameter: &mut PngReader`, porque o CXX não permite que o C++ armazene objetos Rust por valor.
uk: `PngReader` та `ResultOfPngReader` є типами Rust --- об'єкти цих типів не можуть перетинати межу FFI без опосередкування `Box<T>`. Ми не можемо мати `out_parameter: &mut PngReader`, оскільки CXX не дозволяє C++ зберігати об'єкти Rust за значенням.

source: This example illustrates that even though CXX doesn't support arbitrary generics nor templates, we can still pass them across the FFI boundary by manually specializing / monomorphizing them into a non-generic type. In the example `ResultOfPngReader` is a non-generic type that forwards into appropriate methods of `Result<T, E>` (e.g. into `is_err`, `unwrap`, and/or `as_mut`).
fa: این مثال نشان می‌دهد که حتی اگر CXX از genericها و templateهای دلخواه پشتیبانی نمی‌کند، ما همچنان می‌توانیم آنها را از مرز FFI عبور دهیم و آنها را به‌صورت دستی تخصصی/تک‌شکلی ( specializing / monomorphizing) در یک نوع غیرعمومی تبدیل کنیم. در مثال `ResultOfPngReader` یک نوع non-generic است که به متدهای مناسب `Result<T, E>` (به عنوان مثال به «is_err»، «unwrap» و/یا «as_mut» ارسال می‌شود.
pt_br: Este exemplo ilustra que, embora o CXX não suporte genéricos nem modelos arbitrários, ainda podemos passá-los pela fronteira FFI especializando / monomorfizando-os manualmente em um tipo não genérico. No exemplo, `ResultOfPngReader` é um tipo não genérico que encaminha para métodos apropriados de `Result<T, E>` (por exemplo, para `is_err`, `unwrap` e/ou `as_mut`).
uk: Цей приклад ілюструє, що навіть якщо CXX не підтримує довільні узагальнення або шаблони, ми все одно можемо передати їх через межу FFI, вручну спеціалізувавши / мономорфізувавши їх до не узагальненого типу. У прикладі `ResultOfPngReader` є не узагальненим типом, який передається у відповідні методи `Result<T, E>` (наприклад, у `is_err`, `unwrap` та/або `as_mut`).

source: Using cxx in Chromium
fa: استفاده از cxx در Chromium
pt_br: Usando CXX no Chromium
uk: Використання cxx у Chromium

source: In Chromium, we define an independent `#[cxx::bridge] mod` for each leaf-node where we want to use Rust. You'd typically have one for each `rust_static_library`. Just add
fa: در Chromium، یک `#[cxx::bridge] mod` مستقل برای هر برگ گره‌ای که می‌خواهیم از Rust استفاده کنیم را تعریف می‌کنیم. شما معمولاً برای هر `rust_static_library` یکی دارید. پس فقط اضافه کنید.
pt_br: No Chromium, definimos um `#[cxx::bridge] mod` independente para cada nó folha onde queremos usar o Rust. Normalmente, você teria um para cada `rust_static_library`. Basta adicionar
uk: У Chromium ми визначаємо незалежний `#[cxx::bridge] mod` для кожного листового вузла, де ми хочемо використовувати Rust. Зазвичай у вас буде по одному модулю для кожної `rust_static_library`. Просто додайте

source: ```gn cxx_bindings = [ "my_rust_file.rs" ] # list of files containing #[cxx::bridge], not all source files allow_unsafe = true ```
uk: ```gn cxx_bindings = [ "my_rust_file.rs" ] # список файлів, що містять #[cxx::bridge], не всі вхідні файли allow_unsafe = true ```

source: to your existing `rust_static_library` target alongside `crate_root` and `sources`.
fa: به هدف `rust_static_library` موجود در کنار `crate_root` و `sources`.
pt_br: para o seu alvo `rust_static_library` existente ao lado de `crate_root` e `sources`.
uk: до вашої існуючої цілі `rust_static_ibrary` разом з `crate_root` та `sources`.

source: C++ headers will be generated at a sensible location, so you can just
fa: headerهای ++C در یک مکان منطقی تولید می‌شوند، بنابراین شما می‌توانید
pt_br: Cabeçalhos C++ serão gerados em um local sensato, então você pode apenas
uk: C++ заголовки будуть згенеровані в доцільному місці, тому ви можете просто

source: You will find some utility functions in `//base` to convert to/from Chromium C++ types to CXX Rust types --- for example [`SpanToRustSlice`](https://source.chromium.org/chromium/chromium/src/+/main:base/containers/span_rust.h;l=21).
fa: برخی از توابع کاربردی را در `//base` برای تبدیل به/از تایپ‌های ++Chromium C به انواع CXX Rust پیدا خواهید کرد --- برای مثال [`SpanToRustSlice`](https://source.chromium.org/chromium/chromium/src /+/main:base/containers/span_rust.h;l=21).
pt_br: Você encontrará algumas funções utilitárias em `//base` para converter de/ para tipos C++ do Chromium para tipos Rust CXX --- por exemplo [`SpanToRustSlice`](https://source.chromium.org/chromium/chromium/src/+/main:base/containers/span_rust.h;l=21).
uk: У `//base` ви знайдете деякі утиліти для перетворення типів Chromium C++ у типи CXX Rust --- наприклад [`SpanToRustSlice`](https://source.chromium.org/chromium/chromium/src/+/main:base/containers/span_rust.h;l=21).

source: Students may ask --- why do we still need `allow_unsafe = true`?
fa: دانش‌آموزان ممکن است بپرسند --- چرا هنوز به `allow_unsafe = true` نیاز داریم؟
pt_br: Os alunos podem perguntar --- por que ainda precisamos de `allow_unsafe = true`?
uk: Студенти можуть запитати --- навіщо нам все ще потрібно `allow_unsafe = true`?
