Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Demonstrate that the return from `add` is cheap because the compiler can eliminate the copy operation. Change the above code to print stack addresses and run it on the [Playground](https://play.rust-lang.org/?version=stable&mode=release&edition=2021&gist=0cb13be1c05d7e3446686ad9947c4671) or look at the assembly in [Godbolt](https://rust.godbolt.org/). In the "DEBUG" optimization level, the addresses should change, while they stay the same when changing to the "RELEASE" setting:
ja: コンパイラはコピー オペレーションを省略できるため、`add` からのリターンはコストであることを示します。スタック アドレスを出力するように上記のコードを変更し、[Playground](https://play.rust-lang.org/?version=stable&mode=release&edition=2021&gist=0cb13be1c05d7e3446686ad9947c4671)で実行するか、[Godbolt](https://rust.godbolt.org/) のアセンブリを確認します。「DEBUG」最適化レベルではアドレスが変更されますが、「RELEASE」設定に変更した場合はアドレスが変更されません。

source: The Rust compiler can do return value optimization (RVO).
es: El compilador de Rust puede hacer la optimización del valor devuelto (RVO).
ja: Rust コンパイラは戻り値の最適化（RVO）を行うことができます。
ko: 러스트 컴파일러는 반환값 최적화(RVO)를 수행할 수 있습니다.

source: In C++, copy elision has to be defined in the language specification because constructors can have side effects. In Rust, this is not an issue at all. If RVO did not happen, Rust will always perform a simple and efficient `memcpy` copy.
es: En C++, la elisión de copia tiene que definirse en la especificación del lenguaje, ya que los constructores pueden tener efectos secundarios. En Rust, esto no supone ningún problema. Si no hay RVO, Rust siempre realizará una copia `memcpy` simple y eficiente.
ja: C++ では、コンストラクタが副作用をもたらす可能性があるため、言語仕様でコピー省略を定義する必要があります。Rust では、これはまったく問題になりません。RVO が行われなかった場合でも、Rust は常にシンプルで効率的な `memcpy` コピーを実行します。
ko: C++에서 copy elision은 생성자의 부수효과 가능성이 있어 언어레벨의 정의가 필요하지만 러스트에서는 문제가 되지 않습니다. 만약 RVO가 발생하지 않으면 러스트는 항상 간단하고 효율적인 `memcpy`복사를 수행할 것입니다.

source: `Cell` wraps a value and allows getting or setting the value, even with a shared reference to the `Cell`. However, it does not allow any references to the value. Since there are no references, borrowing rules cannot be broken.
ja: `Cell` は、値をラップし、`Cell` の共有参照を通してでもその値を取得または設定可能にしています。ただし、その内包する値への参照は許していません。

source: `Rc` only allows shared (read-only) access to its contents, since its purpose is to allow (and count) many references. But we want to modify the value, so we need interior mutability.
ja: `Rc` は多くの参照を許可（およびカウント）することを目的としているため、コンテンツへの共有（読み取り専用）アクセスのみを許可します。しかし、ここでは値を変更したいので、内部可変性が必要です。

source: Demonstrate that reference loops can be created by adding `root` to `subtree.children`.
ja: `subtree.children` に `root` を追加して参照ループを作成できることを示します。

source: To demonstrate a runtime panic, add a `fn inc(&mut self)` that increments `self.value` and calls the same method on its children. This will panic in the presence of the reference loop, with `thread 'main' panicked at 'already borrowed: BorrowMutError'`.
es: Para demostrar un pánico en tiempo de ejecución, añade un `fn inc(&mut self)` que incremente `self.value` y llame al mismo método en sus hijos. Esto entrará en pánico en presencia del bucle de referencia, con `thread 'main' panicked at 'already borrowed: BorrowMutError'`.
ja: 実行時のパニックを示すため、`self.value` をインクリメントしてその子に対して同じメソッドを呼び出す `fn inc(&mut self)` を追加します。これは、参照ループがあるとパニックとなり、`thread 'main' panicked at 'already borrowed: BorrowMutError'` というエラーが出力されます。
ko: `self.value`를 증가시키는 메서드인`fn inc(&mut self)`를 추가하고 그 메서드를 자식노드에서 호출하세요. 그러면 `thread 'main' panicked at 'already borrowed: BorrowMutError'` 런타임 패닉이 발생함을 보이세요.

source: [Slices: &\[T\]](./slices-and-lifetimes/slices.md) (10 minutes)
ja: [Slices: &\[T\]](./slices-and-lifetimes/slices.md)（10 分）

source: [String References](./slices-and-lifetimes/str.md) (10 minutes)
ja: [文字列参照](./slices-and-lifetimes/str.md)（10 分）

source: [Lifetime Annotations](./slices-and-lifetimes/lifetime-annotations.md) (10 minutes)
ja: [ライフタイム アノテーション](./slices-and-lifetimes/lifetime-annotations.md)（10 分）

source: [Lifetime Elision](./slices-and-lifetimes/lifetime-elision.md) (5 minutes)
ja: [ライフタイムの省略](./slices-and-lifetimes/lifetime-elision.md)（5 分）

source: [Struct Lifetimes](./slices-and-lifetimes/struct-lifetimes.md) (5 minutes)
ja: [構造体のライフタイム](./slices-and-lifetimes/struct-lifetimes.md)（5 分）

source: [Exercise: Protobuf Parsing](./slices-and-lifetimes/exercise.md) (30 minutes)
ja: [演習: Protobuf の解析](./slices-and-lifetimes/exercise.md)（30 分）

source: We can now understand the two string types in Rust: `&str` is almost like `&[char]`, but with its data stored in a variable-length encoding (UTF-8).
ja: これで、Rust の 2 つの文字列型を理解できるようになりました。`&str` は `&[char]` とほぼ同じですが、そのデータは可変長エンコード（UTF-8）で保存されます。

source: Rust terminology:
es: Terminología de Rust:
ja: Rust の用語:
ko: 러스트 용어:

source: `&str` an immutable reference to a string slice.
es: `&str` es una referencia inmutable a un slice de una cadena.
ja: `&str`: 文字列スライスへの不変の参照。
ko: `&str`은 문자열 슬라이스에 대한 (불변) 참조입니다.

source: `String` a mutable string buffer.
es: `String` es un búfer de cadena mutable.
ja: `String`: 可変の文字列バッファ。
ko: `String`은 문자열을 담을 수 있는 버퍼입니다.

source: `&str` introduces a string slice, which is an immutable reference to UTF-8 encoded string data stored in a block of memory. String literals (`”Hello”`), are stored in the program’s binary.
ja: `&str` は文字列スライスを導入します。これは、メモリブロックに保存されている UTF-8 でエンコードされた文字列データへの不変の参照です。文字列リテラル（`”Hello”`）は、プログラムのバイナリに格納されます。

source: Rust’s `String` type is a wrapper around a vector of bytes. As with a `Vec<T>`, it is owned.
es: El tipo `String` de Rust es un envoltorio que rodea a un vector de bytes. Como sucede con `Vec<T>`, tiene propiedad.
ja: Rust の `String` 型は、バイトのベクターのラッパーです。`Vec<T>` と同様、所有されます。
ko: 러스트의 `String`타입은 실제로는 문자열을 이루는 바이트에 대한 백터(`Vec<u8>`)입니다. `Vec<T>`가 `T`를 소유하고 있듯이, `String`이 가리키고 있는 문자열은 `String`의 소유입니다.

source: // erase(text);
ja: // 消去（テキスト）;

source: [Welcome](./welcome-day-4.md) (3 minutes)
ja: [ようこそ](./welcome-day-4.md)（3 分）

source: [Iterators](./iterators.md) (45 minutes)
ja: [イテレータ](./iterators.md)（45 分）

source: [Modules](./modules.md) (40 minutes)
ja: [モジュール](./modules.md)（40 分）

source: [Testing](./testing.md) (1 hour and 5 minutes)
ja: [テスト](./testing.md)（1 時間 5 分）

source: [Iterator](./iterators/iterator.md) (5 minutes)
ja: [Iterator](./iterators/iterator.md)（5 分）

source: [IntoIterator](./iterators/intoiterator.md) (5 minutes)
ja: [IntoIterator](./iterators/intoiterator.md)（5 分）

source: [FromIterator](./iterators/fromiterator.md) (5 minutes)
ja: [FromIterator](./iterators/fromiterator.md)（5 分）

source: [Exercise: Iterator Method Chaining](./iterators/exercise.md) (30 minutes)
ja: [演習: イテレータ メソッドのチェーン化](./iterators/exercise.md)（30 分）

source: [Modules](./modules/modules.md) (5 minutes)
ja: [モジュール](./modules/modules.md)（5 分）

source: [Filesystem Hierarchy](./modules/filesystem.md) (5 minutes)
ja: [ファイル システム階層](./modules/filesystem.md)（5 分）

source: [Visibility](./modules/visibility.md) (5 minutes)
ja: [可視性](./modules/visibility.md)（5 分）

source: [use, super, self](./modules/paths.md) (10 minutes)
ja: [use、super、self](./modules/paths.md)（10 分）

source: [Exercise: Modules for a GUI Library](./modules/exercise.md) (15 minutes)
ja: [演習: GUI ライブラリのモジュール](./modules/exercise.md)（15 分）

source: This segment should take about 40 minutes
ja: このセグメントの所要時間は約 40 分です

source: [Test Modules](./testing/unit-tests.md) (5 minutes)
ja: [テスト] モジュール(./testing/unit-tests.md)（5 分）

source: [Other Types of Tests](./testing/other.md) (10 minutes)
ja: [その他の種類のテスト](./testing/other.md)（10 分）

source: [Useful Crates](./testing/useful-crates.md) (3 minutes)
ja: [便利なクレート](./testing/useful-crates.md)（3 分）

source: [GoogleTest](./testing/googletest.md) (5 minutes)
ja: [GoogleTest](./testing/googletest.md)（5 分）

source: [Mocking](./testing/mocking.md) (5 minutes)
ja: [モック](./testing/mocking.md)（5 分）

source: [Compiler Lints and Clippy](./testing/lints.md) (5 minutes)
ja: [コンパイラの リント と Clippy](./testing/lints.md)（5 分）

source: [Exercise: Luhn Algorithm](./testing/exercise.md) (30 minutes)
ja: [演習: Luhn アルゴリズム](./testing/exercise.md)（30 分）

source: Rust comes with only basic support for writing tests.
es: Rust solo incluye asistencia básica para las pruebas de escritura.
ja: Rust は、テストを作成するための基本的なサポートのみを提供します。
ko: 러스트는 테스트 작성과 관련해서는 기본적인 기능만 지원합니다.

source: Here are some additional crates which we recommend for writing tests:
es: A continuación, se indican algunos crates adicionales que recomendamos para escribir pruebas:
ja: テストを作成する際に推奨されるその他のクレートを以下に示します。
ko: 다음은 테스트를 작성할 때 권장되는 추가 크레이트입니다:

source: [googletest](https://docs.rs/googletest): Comprehensive test assertion library in the tradition of GoogleTest for C++.
es: [googletest](https://docs.rs/googletest): biblioteca completa de aserción de pruebas en la tradición de GoogleTest para C++.
ja: [googletest](https://docs.rs/googletest): 従来の C++ 向け GoogleTestのような包括的なテスト アサーション ライブラリです。
ko: [googletest](https://docs.rs/googletest): C++용 GoogleTest의 방식을 따르는 테스트 라이브러리 입니다.

source: [proptest](https://docs.rs/proptest): Property-based testing for Rust.
es: [proptest](https://docs.rs/proptest): pruebas basadas en propiedades para Rust.
ja: [proptest](https://docs.rs/proptest): Rust のプロパティ ベースのテストです。
ko: [proptest](https://docs.rs/proptest): Rust용 속성 기반 테스트입니다.

source: [rstest](https://docs.rs/rstest): Support for fixtures and parameterised tests.
es: [rstest](https://docs.rs/rstest): asistencia para _fixtures_ y pruebas parametrizadas.
ja: [rstest](https://docs.rs/rstest): フィクスチャとパラメータ化されたテストをサポートします。
ko: [rstest](https://docs.rs/rstest): 픽스처 및 매개변수화된 테스트를 지원합니다.

source: This just scratches the surface, there are many builtin matchers.
ja: ここで扱っているものはごく一部であり、他にも多くの組み込みマッチャーがあります。

source: A particularly nice feature is that mismatches in multi-line strings strings are shown as a diff:
ja: 特に便利なのは、複数行の文字列の不一致が差分として表示される機能です。

source: GoogleTest is available for use in AOSP.
ja: GoogleTest は AOSP で使用できます。

source: The advice here is for Android (AOSP) where Mockall is the recommended mocking library. There are other [mocking libraries available on crates.io](https://crates.io/keywords/mock), in particular in the area of mocking HTTP services. The other mocking libraries work in a similar fashion as Mockall, meaning that they make it easy to get a mock implementation of a given trait.
ja: ここでは、Mockall が推奨モック ライブラリである Android（AOSP）向けのアドバイスを行います。特に HTTP サービスのモックに関しては、[crates.io で他のモック ライブラリが公開されています](https://crates.io/keywords/mock)。他のモック ライブラリも Mockall と 同様で、特定のトレイトのモック実装を簡単に得ることができます。

source: Ignore all spaces. Reject number with less than two digits.
es: Ignora todos los espacios. Rechaza los números con menos de dos dígitos.
ja: すべてのスペースを無視し、2 桁未満の番号を拒否します。
ko: 모든 공백을 무시합니다. 2자리 미만 숫자는 무시합니다.

source: The provided code provides a buggy implementation of the luhn algorithm, along with two basic unit tests that confirm that most the algorithm is implemented correctly.
ja: 提供されているコードでは、luhn アルゴリズムのバグのある実装と、ほとんどのアルゴリズムが正しく実装されていることを確認する 2 つの基本的な単体テストを提供しています。

source: [Error Handling](./error-handling.md) (45 minutes)
ja: [エラー処理](./error-handling.md)（45 分）

source: [Unsafe Rust](./unsafe-rust.md) (1 hour and 5 minutes)
ja: [アンセーフRust](./unsafe-rust.md)（1 時間 5 分）

source: Including 10 minute breaks, this session should take about 2 hours
ja: このセッションの所要時間は、10 分間の休憩を入れて約 2 時間です。

source: [Panics](./error-handling/panics.md) (3 minutes)
ja: [パニック](./error-handling/panics.md)（3 分）

source: [Try Operator](./error-handling/try.md) (5 minutes)
ja: [try 演算子](./error-handling/try.md)（5 分）

source: [Try Conversions](./error-handling/try-conversions.md) (5 minutes)
ja: [try 変換](./error-handling/try-conversions.md)（5 分）

source: [Error Trait](./error-handling/error.md) (5 minutes)
ja: [エラートレイト](./error-handling/error.md)（5 分）

source: [thiserror and anyhow](./error-handling/thiserror-and-anyhow.md) (5 minutes)
ja: [thiserror と anyhow](./error-handling/thiserror-and-anyhow.md)（5 分）

source: [Exercise: Rewriting with Result](./error-handling/exercise.md) (20 minutes)
ja: [演習: Result を使用した書き換え](./error-handling/exercise.md)（20 分）

source: Note that `main` can return a `Result<(), E>` as long as it implements `std::process:Termination`. In practice, this means that `E` implements `Debug`. The executable will print the `Err` variant and return a nonzero exit status on error.
ja: なお、`main` は `std::process:Termination` を実装している限り、Result<(), E>` を返すことができます。つまり、実際には `E` が`Debug` を実装していることを意味します。この実行可能ファイルはエラー発生時にErrバリアントを出力し、ゼロ以外の終了ステータスを返します。

source: `thiserror` is often used in libraries to create custom error types that implement `From<T>`.
ja: `thiserror`は、`From<T>` を実装するカスタムのエラー型を作成するためにライブラリで頻繁に使用されます。

source: [Unsafe](./unsafe-rust/unsafe.md) (5 minutes)
ja: [アンセーフRust](./unsafe-rust/unsafe.md)（5 分）

source: [Dereferencing Raw Pointers](./unsafe-rust/dereferencing.md) (10 minutes)
ja: [未加工ポインタの参照外し](./unsafe-rust/dereferencing.md)（10 分）

source: [Mutable Static Variables](./unsafe-rust/mutable-static.md) (5 minutes)
ja: [可変の静的変数](./unsafe-rust/mutable-static.md)（5 分）

source: [Unions](./unsafe-rust/unions.md) (5 minutes)
ja: [共用体](./unsafe-rust/unions.md)（5 分）

source: [Unsafe Functions](./unsafe-rust/unsafe-functions.md) (5 minutes)
ja: [アンセーフな関数](./unsafe-rust/unsafe-functions.md)（5 分）

source: [Unsafe Traits](./unsafe-rust/unsafe-traits.md) (5 minutes)
ja: [アンセーフなトレイト](./unsafe-rust/unsafe-traits.md)（5 分）

source: [Exercise: FFI Wrapper](./unsafe-rust/exercise.md) (30 minutes)
ja: [演習: FFI ラッパー](./unsafe-rust/exercise.md)（30 分）

source: // Safe because r1 and r2 were obtained from references and so are // guaranteed to be non-null and properly aligned, the objects underlying // the references from which they were obtained are live throughout the // whole unsafe block, and they are not accessed either through the // references or concurrently through any other pointers.
ja: // 次の理由により安全: r1 と r2 は参照から取得されており、 // 非 null で適切にアラインされていることが保証されています。 // 取得元である参照の基になるオブジェクトは、 // アンセーフブロック全体を通じて存続します。参照を介したアクセスや、 // 他のポインタを介した同時アクセスは行われません。

source: // Safe because the indices are in the correct order, within the bounds of // the string slice, and lie on UTF-8 sequence boundaries.
ja: // インデックスが正しい順序で文字列スライスの境界内にあり、 // UTF-8 シーケンスの境界上にあるため、安全です。

source: // Undefined behavior if abs misbehaves.
ja: // abs 誤動作の場合の動作は未定義。

source: // Safe because ...
ja: // 安全です。理由は...

source: // Safe because u32 has a defined representation and no padding.
ja: // u32 には定義された表現があり、パディングがないため、安全です。

source: Add `vendor_available: true` if your AIDL file is used by a binary in the vendor partition.
es: Añade `vendor_available: true` si un binario de la partición del proveedor utiliza tu archivo de AIDL.
ja: AIDL ファイルがベンダー パーティション内のバイナリで使用されている場合は、`vendor_available: true` を追加します。
ko: AIDL 파일이 벤더 파티션에 있는 바이너리에서 사용될 경우 `vendor_available: true`를 추가합니다.

source: //! Implementation of the `IBirthdayService` AIDL interface.
ja: //! `IBirthdayService` AIDL インターフェースの実装。

source: /// Connect to the BirthdayService.
ja: /// BirthdayService に接続します。

source: // SAFETY: `print_card` is safe to call with a valid `card` pointer.
ja: // SAFETY: `print_card` は有効な `card` ポインタで安全に呼び出せます。

source: For the microcontroller part of the course we will use the [BBC micro:bit](https://microbit.org/) v2 as an example. It's a [development board](https://tech.microbit.org/hardware/) based on the Nordic nRF51822 microcontroller with some LEDs and buttons, an I2C-connected accelerometer and compass, and an on-board SWD debugger.
es: En la parte del curso dedicada a los microcontroladores, utilizaremos la versión 2 de [BBC micro:bit](https://microbit.org/) como ejemplo. Es una [placa de desarrollo](https://tech.microbit.org/hardware/) basada en el microcontrolador Nordic nRF51822 con algunos LED y botones, un acelerómetro y una brújula conectados mediante I2C y un depurador SWD integrado.
ja: マイクロコントローラ向けの学習では[BBC micro:bit](https://microbit.org/) v2を題材として使います。これは、Nordic nRF51822マイコンベースの[開発ボード](https://tech.microbit.org/hardware/) で、いくつかのLEDやボタンスイッチ、I2C接続の加速度センサやコンパス、そしてオンボードSWDデバッガを搭載しています。
ko: 이 강의에서는 [BBC micro:bit](https://microbit.org/) v2마이크로컨트롤러를 사용합니다. 이 마이크로컨트롤러는 Nordic nRF51822 마이크로컨트롤러에 기반한 [개발 보드](https://tech.microbit.org/hardware/)로써, LED와 버튼, I2C 연결 가속도계 및 나침반, 온보드 SWD 디버거를 포함하고 있습니다.

source: The [`embedded-hal`](https://crates.io/crates/embedded-hal) crate provides a number of traits covering common microcontroller peripherals.
es: El crate [`embedded-hal`](https://crates.io/crates/embedded-hal) proporciona una serie de traits que cubren los periféricos habituales de los microcontroladores.
ja: [`embedded-hal`](https://crates.io/crates/embedded-hal)クレートはマイクロコントローラの周辺I/Oに関して共通に必要とされる多くのトレイトを提供します。
ko: [`embedded-hal`](https://crates.io/crates/embedded-hal) 크레이트는 다양한 마이크로컨트롤러에서 공통적으로 찾아볼 수 있는 주변기기를 추상회 하는 다양한 트레잇을 제공합니다.

source: Other crates then implement [drivers](https://github.com/rust-embedded/awesome-embedded-rust#driver-crates) in terms of these traits, e.g. an accelerometer driver might need an I2C or SPI bus implementation.
es: Es entonces cuando otros crates implementan \[controladores\][drivers](https://github.com/rust-embedded/awesome-embedded-rust#driver-crates) en función de estos traits. Por ejemplo, un controlador de acelerómetro podría necesitar una implementación de bus I2C o SPI.
ja: 多くのクレートはこれらのトレイトに対応することで[ドライバ](https://github.com/rust-embedded/awesome-embedded-rust#driver-crates)を実装します。例えば、加速度センサのドライバにはI2CやSPIバスの実装が必要かもしれません。
ko: 그러면 다른 크레이트는 이 트레잇들을 활용하여 [드라이버](https://github.com/rust-embedded/awesome-embedded-rust#driver-crates)를 구현합니다. 예를 들어 가속도계 드라이버를 구현할 떄 I2C 또는 SPI 버스 구현을 사용할 수 있습니다.

source: There is work in progress on an `async` version of `embedded-hal`, but it isn't stable yet.
es: Se está trabajando en una versión `async` de `embedded-hal`, pero aún no es estable.
ja: `embedded-hal`の`async`バージョンも開発中ですが、まだ安定してはいません。
ko: `embedded-hal`의 'async' 버전에 관한 작업이 진행 중이지만 아직 안정적이지 않습니다.

source: The LSM303AGR driver needs something implementing the `embedded_hal::blocking::i2c::WriteRead` trait. The [`microbit::hal::Twim`](https://docs.rs/microbit-v2/latest/microbit/hal/struct.Twim.html) struct implements this.
es: El controlador LSM303AGR necesita algo que implemente el trait `embedded_hal::blocking::i2c::WriteRead`. La estructura [`microbit::hal::Twim`](https://docs.rs/microbit-v2/latest/microbit/hal/struct.Twim.html) implementa esto.
ja: LSM303AGRドライバは`embedded_hal::blocking::i2c::WriteRead`を実装するものを必要とします。 [`microbit::hal::Twim`](https://docs.rs/microbit-v2/latest/microbit/hal/struct.Twim.html)構造体がこれを実装しています。

source: Use `let handle = thread::spawn(...)` and later `handle.join()` to wait for the thread to finish.
es: Utiliza `let handle = thread::spawn(...)` y, después, `handle.join()` para esperar a que el hilo termine.
ja: `let handle = thread::spawn(…)`と後に`handle.join()`を使って、スレッドが完了するのを待ってみてください。
ko: 만약 메인 스레드가 자식 스레드가 끝날 때 까지 기다리기를 원한다면 `let handle = thread::spawn(...)`으로 스레드를 선언한 후 `handle.join()`로 연결하여 사용합니다.

source: Trigger a panic in the thread, notice how this doesn't affect `main`.
es: Activa un pánico en el hilo y observa cómo esto no afecta a `main`.
ja: スレッド内でパニックを引き起こしてみて、それがどのように`main`に影響しないかを観察してみてください。
ko: 자식 스레드에서 발생한 패닉이 메인 스레드에는 영향을 주지 않음을 확인하시기 바랍니다.

source: Use the `Result` return value from `handle.join()` to get access to the panic payload. This is a good time to talk about [`Any`](https://doc.rust-lang.org/std/any/index.html).
es: Usa el valor devuelto `Result` de `handle.join.()` para acceder a la carga útil del pánico. Este es un buen momento para hablar sobre [`Any`](https://doc.rust-lang.org/std/any/index.html).
ja: `handle.join()`の返り値の`Result`を使って、パニックペイロードへのアクセスを得てみてください。 これは[`Any`](https://doc.rust-lang.org/std/any/index.html)について話すのに良いタイミングです。
ko: `handle.join()`사용시 `Result` 반환값을 통해 패닉의 추가정보에 접근할 수 있습니다. 이 시점에서 [`Any`](https://doc.rust-lang.org/std/any/index.html)에 대해 이야기를 해 보면 좋습니다.

source: A bounded channel with a size of zero is called a "rendezvous channel". Every send will block the current thread until another thread calls `read`.
es: Un canal delimitado con un tamaño de cero se denomina "canal rendezvous". Cada envío bloqueará el hilo actual hasta que otro hilo llame a `read`.
ja: サイズが０のBoundedチャネルは「ランデブーチャネル」と呼ばれます。別のスレッドが`read`を呼ぶまでは、それぞれのsendは現在のスレッドをブロックします。

source: `Send` and `Sync` are [unsafe traits](../unsafe/unsafe-traits.md). The compiler will automatically derive them for your types as long as they only contain `Send` and `Sync` types. You can also implement them manually when you know it is valid.
es: `Send` y `Sync` son [traits inseguros](../unsafe/unsafe-traits.md). El compilador los derivará automáticamente a tus tipos siempre que solo contengan los tipos `Send` y `Sync`. También puedes implementarlos de forma manual cuando sepas que es válido.
ja: `Send`と`Sync`は[unsafeなトレイト](../unsafe/unsafe-traits.md)です。 あなたが新たに定義する型が`Send`と`Sync`の型のみを含む場合、コンパイラはその新しい型に対して`Send`と`Sync`を自動的に導出します。そうでなくても妥当であるならば`Send`と`Sync`を自分自身で実装することもできます。
ko: `Send`와 `Sync` 트레잇은 [안전하지 않은 트레잇](../unsafe/unsafe-traits.md)입니다. 컴파일러는 타입의 요소들이 모두 `Send`와 `Sync` 타입이면 자동으로 이 트레잇들을 적용시켜 줍니다. 물론 여러분 스스로 맞다고 알고 있다면 직접 구현해도 됩니다.

source: `i8`, `f32`, `bool`, `char`, `&str`, ...
es: `i8`, `f32`, `bool`, `char`, `&str`, etc.
ja: `i8`、`f32`、`bool`、`char`、`&str` など

source: `(T1, T2)`, `[T; N]`, `&[T]`, `struct { x: T }`, ...
es: `(T1, T2)`, `[T; N]`, `&[T]`, `struct { x: T }`, etc.
ja: `(T1, T2)`、`[T; N]`、`&[T]`、`struct { x: T }` など

source: Rust uses the type system to enforce synchronization of shared data. This is primarily done via two types:
es: Rust utiliza el sistema de tipos para implementar la sincronización de los datos compartidos. Esto se hace principalmente a través de dos tipos:
ja: Rustは共有データを確実に同期するために型システムを利用します。これは主に2つの型により行われます：
ko: 러스트는 주로 아래 두 가지 타입을 이용해서 공유 데이터 동기화를 수행합니다:

source: [`Arc<T>`](https://doc.rust-lang.org/std/sync/struct.Arc.html), atomic reference counted `T`: handles sharing between threads and takes care to deallocate `T` when the last reference is dropped,
es: [`Arc<T>`](https://doc.rust-lang.org/std/sync/struct.Arc.html), recuento atómico de referencias `T`: gestiona el uso compartido entre hilos y se encarga de desasignar `T` cuando se elimina la última referencia.
ja: [`Arc<T>`](https://doc.rust-lang.org/std/sync/struct.Arc.html), atomic reference counted `T` : スレッド間の共有を扱い、最後の参照がドロップされたとき `T` をデアロケートすることを担当する、
ko: [`Arc<T>`](https://doc.rust-lang.org/std/sync/struct.Arc.html), `T`에 대한 아토믹 참조 카운트: 이 참조는 다수의 스레드 사이에서 공유될 수 있고, 참조하던 마지막 스레드가 종료할 경우 `T`를 반환합니다.

source: [`Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html): ensures mutually exclusive access to the `T` value.
es: [`Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html): asegura el acceso mutuamente excluyente al valor `T`.
ja: [`Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html): `T`型の値への相互排他的なアクセスを保証する。
ko: [`Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html): `T`값에 대한 상호 배제 엑세스를 보장합니다.

source: [`Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html) ensures mutual exclusion _and_ allows mutable access to `T` behind a read-only interface (another form of [interior mutability](../../borrowing/interior-mutability)):
ja: [`Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html) は相互排他を保証し、 _かつ_ 読み取り専用のインターフェースの裏側で `T` へのミュータブルなアクセスを可能にします：

source: Let us practice our new concurrency skills with
es: Vamos a practicar nuestras nuevas habilidades de concurrencia con
ja: 次の演習を行い、並行性に関する新しいスキルを獲得しましょう。
ko: 동시성 기법들을 연습해 봅시다

source: Dining philosophers: a classic problem in concurrency.
es: La cena de los filósofos: un problema clásico de concurrencia.
ja: 食事する哲学者：並行性に関する古典的な問題。
ko: 식사하는 철학자 문제: 고적적인 동시성 문제입니다.
