Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: The `bitflags!` macro creates a newtype something like `Flags(u16)`, along with a bunch of method implementations to get and set flags.
es: La macro `bitflags!` crea un newtype, como `Flags(u16)`, junto con un montón de implementaciones de métodos para obtener y definir _flags_ (banderas).
fa: ماکرو `bitflags!` یک نوع جدید چیزی مانند`Flags(u16)` را به همراه تعدادی پیاده‌سازی متد برای دریافت و تنظیم flagها ایجاد می‌کند.
ja: `bitflags!`マクロは`Flags(u16)`のような新しいタイプを生成し、フラグを読み書きするための多くのメソッド実装を一緒に提供します。
pt_br: A macro `bitflags!` cria um _newtype_ algo como `Flags(u16)`, junto com um monte de implementações de método para obter e setar _flags_.
uk: Макрос `bitflags!` створює новий тип, щось на кшталт `Flags(u16)` разом із купою реалізацій методів для отримання та встановлення прапорів.

source: Multiple registers
es: Varios registros
fa: رجیستر چندگانه
ja: 複数のレジスタ
pt_br: Registradores múltiplos
uk: Кілька регістрів

source: We can use a struct to represent the memory layout of the UART's registers.
es: Podemos utilizar una estructura para representar la disposición de la memoria de los registros de UART.
fa: ما می‌توانیم از یک ساختار برای نمایش طرح memory layout یک رجیستر UART استفاده کنیم.
ja: 構造体を使ってUARTのレジスタのメモリレイアウトを表現することができます。
pt_br: Podemos usar um struct para representar o layout de memória dos registradores do UART.
uk: Ми можемо використовувати структуру для представлення розташування пам’яті регістрів UART.

source: [`#[repr(C)]`](https://doc.rust-lang.org/reference/type-layout.html#the-c-representation) tells the compiler to lay the struct fields out in order, following the same rules as C. This is necessary for our struct to have a predictable layout, as default Rust representation allows the compiler to (among other things) reorder fields however it sees fit.
es: [`#[repr(C)]`](https://doc.rust-lang.org/reference/type-layout.html#the-c-representation) indica al compilador que ordene los campos de la estructura siguiendo las mismas reglas que en C. Esto es necesario para que nuestra estructura tenga un diseño predecible, ya que la representación predeterminada de Rust permite que el compilador (entre otras cosas) reordene los campos como crea conveniente.
fa: ‏ [`#[repr(C)]`](https://doc.rust-lang.org/reference/type-layout.html#the-c-representation) به کامپایلر می گوید که فیلدهای ساختاری را به ترتیب قرار دهد و این پیروی از قوانین مشابه با زبان C است. این کار را برای ساختار ما برای داشتن یک طرح قابل پیش‌بینی ضروری است، زیرا نمایش پیش‌فرض Rust به کامپایلر اجازه می دهد تا (از جمله موارد دیگر) فیلدها را به هر نحوی که صلاح بداند مرتب کند.
ja: [`#[repr(C)]`](https://doc.rust-lang.org/reference/type-layout.html#the-c-representation) はコンパイラに対して、Cと同じ規則に従って構造体のフィールドを定義されている順番で配置することを指示します。これは構造体のレイアウトを予測可能にするために必要です。なぜならば、Rust標準の表現はコンパイラがフィールドを好きなように並び替えること（他にも色々とありますが）を許しているからです。
pt_br: [`#[repr(C)]`](https://doc.rust-lang.org/reference/type-layout.html#the-c-representation) diz ao compilador para dispor os campos do struct em ordem, seguindo as mesmas regras do C. Isso é necessário para que nosso struct tenha um layout previsível, pois a representação padrão do Rust permite que o compilador (entre outras coisas) reordene os campos como quiser.
uk: [`#[repr(C)]`](https://doc.rust-lang.org/reference/type-layout.html#the-c-representation) каже компілятору розмістити поля структури в потрібному порядку, дотримуючись тих самих правил, що й C. Це необхідно для того, щоб наша структура мала передбачуваний порядок розміщення, оскільки представлення Rust за замовчуванням дозволяє компілятору (між іншим) змінювати порядок полів, як він вважає за потрібне.

source: Now let's use the new `Registers` struct in our driver.
es: Ahora vamos a utilizar la nueva estructura de `Registers` en nuestro controlador.
fa: حال بیایید از ساختار جدید `Registers` در درایور خود استفاده کنیم.
ja: 新しく定義した`Registers` 構造体を我々のドライバで使ってみましょう。
pt_br: Agora vamos usar o novo struct `Registers` em nosso driver.
uk: Тепер давайте використаємо нову структуру `Registers` у нашому драйвері.

source: /// Driver for a PL011 UART.
pt_br: /// Driver para um UART PL011.
uk: /// Драйвер для PL011 UART.

source: // SAFETY: We know that self.registers points to the control registers // of a PL011 device which is appropriately mapped.
uk: // БЕЗПЕКА: ми знаємо, що self.registers вказує на керуючі // регістри пристрою PL011, який відповідним чином відображено.

source: /// Reads and returns a pending byte, or `None` if nothing has been /// received.
pt_br: /// Lê e retorna um byte pendente ou `None` se nada foi /// recebido.
uk: /// Читає і повертає байт очікування, або `None`, якщо нічого не було /// отримано.

source: // SAFETY: We know that self.registers points to the control // registers of a PL011 device which is appropriately mapped.
uk: // БЕЗПЕКА: ми знаємо, що self.registers вказує на керуючі // регістри пристрою PL011, який відповідним чином відображено.

source: // TODO: Check for error conditions in bits 8-11.
pt_br: // TODO: Verifique as condições de erro nos bits 8-11.
uk: // TODO: Перевірити на наявність помилок у бітах 8-11.

source: Note the use of `addr_of!` / `addr_of_mut!` to get pointers to individual fields without creating an intermediate reference, which would be unsound.
es: Fíjate en el uso de `addr_of!` y `addr_of_mut!` para llevar punteros a campos individuales sin crear una referencia intermedia. Sería una acción insegura.
fa: به استفاده از `addr_of!` / `addr_of_mut!` برای دریافت pointerها به فیلدهای جداگانه بدون ایجاد یک reference میانی توجه کنید، که ممکن است نادرست باشد.
ja: `addr_of!`と`addr_of_mut!` を使用して個々のフィールドに対するポインタを取得することで、不健全となってしまう中間的な参照を作らずに済んでいることに注目してください。
pt_br: Observe o uso de `addr_of!` / `addr_of_mut!` para obter ponteiros para campos individuais sem criar uma referência intermediária, o que seria incorreto.
uk: Зверніть увагу на використання `addr_of!` / `addr_of_mut!` для отримання вказівників на окремі поля без створення проміжного посилання, що було б нерозумним.

source: Using it
es: Uso
fa: با استفاده از آن
ja: 使用例
pt_br: Usando
uk: Використання

source: Let's write a small program using our driver to write to the serial console, and echo incoming bytes.
es: Vamos a crear un pequeño programa con nuestro controlador para escribir en la consola serie y compartir los bytes entrantes.
fa: بیایید یک برنامه کوچک با استفاده از درایور خود بنویسیم تا روی کنسول سریال بنویسیم و بایت‌های ورودی را echo کنیم.
ja: 我々のドライバを使って、シリアルコンソールにライトし、そして入力されたバイトをエコーする小さなプログラムを書いてみましょう。
pt_br: Vamos escrever um pequeno programa usando nosso driver para escrever no console serial e ecoar os bytes recebidos.
uk: Давайте напишемо невелику програму, використовуючи наш драйвер для запису в послідовну консоль і відлуння вхідних байтів.

source: /// Base address of the primary PL011 UART.
pt_br: /// Endereço base do UART PL011 primário.
uk: /// Базова адреса основного PL011 UART.

source: // SAFETY: `PL011_BASE_ADDRESS` is the base address of a PL011 device, and // nothing else accesses that address range.
uk: // БЕЗПЕКА: `PL011_BASE_ADDRESS` є базовою адресою пристрою PL011, // і ніщо інше не має доступу до цього діапазону адресації.

source: "Bye!"
pt_br: "Tchau!"
uk: "Бувайте!"

source: As in the [inline assembly](../inline-assembly.md) example, this `main` function is called from our entry point code in `entry.S`. See the speaker notes there for details.
es: Al igual que en el ejemplo de [ensamblaje integrado](../inline-assembly.md), esta función `main` se llama desde nuestro código de punto de entrada en `entry.S`. Consulta las notas del orador para obtener más información.
fa: همانطور که در مثال [inline assembly]‌(../inline-assembly.md)، این تابع `main` از کد نقطه ورودی ما در `entry.S` فراخوانی می‌شود. برای جزئیات بیشتر، یادداشت‌های سخنرانی‌ها را در آنجا ببینید.
ja: [インラインアセンブリ](../inline-assembly.md) の例と同じように、この`main`関数は`entry.S`におけるエントリポイントから呼び出されます。詳細はそちらのspeaker notesを参照してください。
pt_br: Como no exemplo de [assembly inline](../inline-assembly.md), esta função `main` é chamada a partir do nosso código de ponto de entrada em `entry.S`. Veja os _speaker notes_ lá para mais detalhes.
uk: Як і у прикладі [вбудована збірка](../inline-assembly.md), ця функція `main` викликається з нашого коду точки входу в `entry.S`. Докладніше дивиться у примітках доповідача.

source: Run the example in QEMU with `make qemu` under `src/bare-metal/aps/examples`.
es: Ejecuta el ejemplo en QEMU con `make qemu` en `src/bare-metal/aps/examples`.
fa: مثال را در QEMU با `make qemu` در زیر `src/bare-metal/aps/examples` اجرا کنید.
ja: この例を`src/bare-metal/aps/examples`において`make qemu`とすることでQEMUにより実行してみましょう。
pt_br: Execute o exemplo no QEMU com `make qemu` em `src/bare-metal/aps/examples`.
uk: Запустіть приклад у QEMU за допомогою `make qemu` у `src/bare-metal/aps/examples`.

source: It would be nice to be able to use the logging macros from the [`log`](https://crates.io/crates/log) crate. We can do this by implementing the `Log` trait.
es: Estaría bien poder utilizar las macros de registro del crate [`log`](https://crates.io/crates/log). Podemos hacerlo implementando el trait `Log`.
fa: خوب است که بتوانید از ماکروهای logging از crate [`log`](https://crates.io/crates/log) استفاده کنید. ما می‌توانیم این کار را با اجرای ویژگی `Log` انجام دهیم.
ja: [`log`](https://crates.io/crates/log) クレートが提供するログ用マクロを使えると良いでしょう。これは`Log`トレイトを実装することで可能になります。
ko: [`log`](https://crates.io/crates/log) 크레이트의 로깅 매크로를 사용할 수 있으면 좋습니다. 이는 `Log` 트레잇을 구현하면 됩니다.
pt_br: Seria bom poder usar os macros de _logging_ do _crate_ [`log`](https://crates.io/crates/log). Podemos fazer isso implementando o _trait_ `Log`.
uk: Було б чудово мати можливість використовувати макроси журналювання з крейту [`log`](https://crates.io/crates/log). Ми можемо зробити це, реалізувавши трейт `Log`.

source: /// Initialises UART logger.
pt_br: /// Inicializa o _logger_ UART.
uk: /// Ініціалізує логгер UART.

source: The unwrap in `log` is safe because we initialise `LOGGER` before calling `set_logger`.
es: La desenvoltura en `log` es segura porque inicializamos `LOGGER` antes de llamar a `set_logger`.
fa: باز کردن در`log` ایمن است زیرا `LOGGER` را قبل از فراخوانی `set_logger` مقداردهی اولیه می‌کنیم.
ja: `LOGGER` を`set_logger`を呼び出す前に初期化しているので、log` におけるunwrapはセーフです。
ko: `log`함수 안에서 `unwrap`하는 것은 괜찮습니다.. 왜냐하면 `set_logger`를 호출하기 전에 `LOGGER`를 초기화하기 때문입니다.
pt_br: O _unwrap_ em `log` é seguro porque inicializamos `LOGGER` antes de chamar `set_logger`.
uk: Розгортання в `log` є безпечним, оскільки ми ініціалізуємо `LOGGER` перед викликом `set_logger`.

source: We need to initialise the logger before we use it.
es: Debemos inicializar el registrador antes de utilizarlo.
fa: قبل از استفاده از لاگر باید مقداردهی اولیه کنیم.
ja: 使用前にloggerを初期化する必要があります。
pt_br: Precisamos inicializar o _logger_ antes de usá-lo.
uk: Нам потрібно ініціалізувати логгер перед його використанням.

source: Note that our panic handler can now log details of panics.
es: Ten en cuenta que nuestro controlador de _panic_ ahora ya puede registrar la información de los pánicos.
fa: توجه داشته باشید که panic handler ما اکنون می تواند جزئیات panic را ثبت کند.
ja: 我々のパニックハンドラがパニックの詳細についてログ出力できるようになったことに注目してください。
pt_br: Observe que nosso manipulador de pânico agora pode registrar detalhes de panes.
uk: Зверніть увагу, що наш обробник паніки тепер може реєструвати деталі паніки.

source: Run the example in QEMU with `make qemu_logger` under `src/bare-metal/aps/examples`.
es: Ejecuta el ejemplo en QEMU con `make qemu_logger` en `src/bare-metal/aps/examples`.
fa: مثال را در QEMU با `make qemu_logger` در زیر `src/bare-metal/aps/examples` اجرا کنید.
ja: この例を`src/bare-metal/aps/examples`において`make qemu_logger`とすることでQEMUにより実行してみましょう。
pt_br: Execute o exemplo no QEMU com `make qemu_logger` em `src/bare-metal/aps/examples`.
uk: Запустіть приклад у QEMU за допомогою `make qemu_logger` у `src/bare-metal/aps/examples`.

source: AArch64 defines an exception vector table with 16 entries, for 4 types of exceptions (synchronous, IRQ, FIQ, SError) from 4 states (current EL with SP0, current EL with SPx, lower EL using AArch64, lower EL using AArch32). We implement this in assembly to save volatile registers to the stack before calling into Rust code:
es: AArch64 define una tabla de vectores de excepción con 16 entradas, para 4 tipos de excepciones (synchronous, IRQ, FIQ, SError) desde 4 estados (EL actual con SP0, EL actual con SPx, EL inferior con AArch64 y EL inferior con AArch32). Implementamos esto en el ensamblaje para guardar los registros volátiles en la _stack_ antes de llamar al código de Rust:
fa: ‏ AArch64 یک جدول برداری استثنایی با ۱۶ ورودی، برای ۴ نوع استثنا (synchronous، IRQ، FIQ، SError) از ۴ حالت (Ecurrent EL with SP0, current EL with SPx, lower EL using AArch64, lower EL using AArch32) تعریف می‌کند. ما این کار را در اسمبلی پیاده‌سازی می‌کنیم تا رجیسترهای فرار (volatile) را قبل از فراخوانی Rust در stack ذخیره کنیم:
ja: AArch64は16エントリを持つ例外ベクターテーブルを定義しており、これらは４つのステート（現在のELでSP0利用、現在のELでSPx利用、低位のELでAArch64、低位のELでAArch32）における４つのタイプの例外（同期、IRQ、FIQ、SError）に対応します。ここではRustコードの呼び出し前に揮発レジスタの値をスタックに退避するためにベクターテーブルをアセンブリ言語で実装しています：
pt_br: AArch64 define uma tabela de vetor de exceção com 16 entradas, para 4 tipos de exceções (síncronas, IRQ, FIQ, SError) de 4 estados (EL atual com SP0, EL atual com SPx, EL inferior usando AArch64, EL inferior usando AArch32). Implementamos isso em assembly para salvar os registradores voláteis na pilha antes de chamar o código Rust:
uk: AArch64 визначає векторну таблицю винятків із 16 записами для 4 типів винятків (синхронний, IRQ, FIQ, SError) із 4 станів (поточний EL із SP0, поточний EL із SPx, нижчий EL із використанням AArch64, нижчий EL із застосуванням AArch32). Ми реалізуємо це в асемблері, щоб зберегти непостійні регістри в стеку перед викликом коду Rust:

source: EL is exception level; all our examples this afternoon run in EL1.
es: EL significa nivel de excepción (por sus siglas en inglés); todos nuestros ejemplos de esta tarde se ejecutan en EL1.
fa: ‏ EL سطح استثنا است. تمام نمونه‌های ما امروز بعدازظهر در EL1 اجرا می‌شوند.
ja: ELは例外レベルです。本日の午後に扱ったすべての例はEL1で実行されています。
pt_br: EL é nível de exceção; todos os nossos exemplos esta tarde são executados em EL1.
uk: EL - це рівень винятків; усі наші приклади сьогодні працюють на EL1.

source: For simplicity we aren't distinguishing between SP0 and SPx for the current EL exceptions, or between AArch32 and AArch64 for the lower EL exceptions.
es: Para simplificar, no distinguimos entre SP0 y SPx para las excepciones del EL actual, ni entre AArch32 y AArch64 para las excepciones de EL inferiores.
fa: برای سادگی، ما بین SP0 و SPx برای استثناهای EL فعلی، یا بین AArch32 و AArch64 برای استثناهای پایین EL تمایز قائل نمی‌شویم.
ja: 簡単化のために、ここでは現在のEL例外におけるSP0とSPｘの違い、低位のELレベルにおけるAArch32とAArch64の違いを区別していません。
pt_br: Para simplificar, não estamos distinguindo entre SP0 e SPx para as exceções do EL atual, ou entre AArch32 e AArch64 para as exceções do EL inferior.
uk: Для простоти ми не розрізняємо SP0 і SPx для поточних винятків EL або між AArch32 і AArch64 для нижчих винятків EL.

source: For this example we just log the exception and power down, as we don't expect any of them to actually happen.
es: En este ejemplo, nos limitaremos a registrar la excepción y a apagarla, ya que no esperamos que se produzca ninguna.
fa: برای این مثال، ما فقط exception را log کرده و سپس خاموش می‌کنیم، زیرا انتظار نداریم هیچ یک از آنها واقعاً اتفاق بیفتد.
ja: ここではこれらの例外が発生しないはずなので、ただ例外に関するログを出力し、電源を落としています。
pt_br: Neste exemplo, apenas registramos a exceção e desligamos, pois não esperamos que nenhuma delas realmente aconteça.
uk: У цьому прикладі ми просто реєструємо виняток і вимикаємо живлення, оскільки ми не очікуємо, що будь-що з цього станеться.

source: We can think of exception handlers and our main execution context more or less like different threads. [`Send` and `Sync`](../../concurrency/send-sync.md) will control what we can share between them, just like with threads. For example, if we want to share some value between exception handlers and the rest of the program, and it's `Send` but not `Sync`, then we'll need to wrap it in something like a `Mutex` and put it in a static.
es: Podríamos pensar en los controladores de excepciones y en nuestro contexto de ejecución principal como si fueran hilos diferentes. [`Send` y `Sync`](../../concurrency/send-sync.md) controlarán lo que podemos compartir entre ellos, igual que con los hilos. Por ejemplo, si queremos compartir algún valor entre los controladores de excepciones y el resto del programa, y es `Send`en vez de `Sync`, necesitaremos envolverlo en un `Mutex`, por ejemplo, y ponerlo en un estático.
ja: 例外ハンドラとメインの実行コンテキストは異なるスレッドのようなものだと考えることができます。ちょうどスレッド間の共有と同じように、[`Send`と`Sync`](../../concurrency/send-sync.md)により何を共有するかを制御することができます。例えば、例外ハンドラとプログラムの他のコンテキストでとある値を共有したい場合に、もしそれが `Send`であり`Sync`でなければ、`Mutex` のようなものでラップして、staticに定義しなければなりません。
pt_br: Podemos pensar nos manipuladores de exceção e no nosso contexto de execução principal mais ou menos como em _threads_ diferentes. [`Send` e `Sync`](../../concurrency/send-sync.md) controlarão o que podemos compartilhar entre eles, assim como com _threads_. Por exemplo, se quisermos compartilhar algum valor entre os manipuladores de exceção e o restante do programa, e ele for `Send` mas não `Sync`, então precisaremos envolvê-lo em algo como um `Mutex` e colocá-lo em um estático.
uk: Ми можемо розглядати обробники винятків і наш основний контекст виконання більш-менш як різні потоки. [`Send` і `Sync`](../../concurrency/send-sync.md) керуватимуть тим, чим ми можемо обмінюватися між ними, як і з потоками. Наприклад, якщо ми хочемо поділитися деяким значенням між обробниками винятків та рештою програми, і це `Send`, але не `Sync`, тоді нам потрібно буде загорнути його в щось на зразок `Mutex` і помістити у статику.

source: "coreboot without the C"
es: "coreboot sin la C".
ja: "Cのない（つまり、C言語を使わない）coreboot"
pt_br: "coreboot sem o C"
uk: "coreboot без C"

source: Supports x86, aarch64 and RISC-V.
es: Compatible con x86, aarch64 y RISC-V.
fa: پشتیبانی از x86، aarch64 و RISC-V.
ja: アーキテクチャはx86、aarch64ならびにRISC-Vをサポート。
pt_br: Suporta x86, aarch64 e RISC-V.
uk: Підтримує x86, aarch64 і RISC-V.

source: Relies on LinuxBoot rather than having many drivers itself.
es: Depende de LinuxBoot en lugar de tener controladores propios.
fa: به جای اینکه خود درایورهای زیادی داشته باشد، به LinuxBoot متکی است.
ja: 自身で多くのドライバを抱えずにLinuxBootに依存。
pt_br: Depende do LinuxBoot em vez de ter muitos drivers próprios.
uk: Покладається на LinuxBoot, замість того, щоб самому мати багато драйверів.

source: [Rust RaspberryPi OS tutorial](https://github.com/rust-embedded/rust-raspberrypi-OS-tutorials)
es: [Tutorial del SO de Rust en RaspberryPi][Rust RaspberryPi OS tutorial](https://github.com/rust-embedded/rust-raspberrypi-OS-tutorials)
pt_br: [Tutorial do Rust RaspberryPi OS](https://github.com/rust-embedded/rust-raspberrypi-OS-tutorials)
uk: [Навчальний посібник Rust з ОС RaspberryPi](https://github.com/rust-embedded/rust-raspberrypi-OS-tutorials)

source: Initialisation, UART driver, simple bootloader, JTAG, exception levels, exception handling, page tables
es: Inicialización, controlador de UART, bootloader sencillo, JTAG, niveles de excepción, gestión de excepciones, tablas de páginas, etc.
fa: راه‌اندازی، درایور UART و bootloader ساده، JTAG، سطوح exception، مدیریت exception و page tableها
ja: 初期化、UARTドライバ、単純なブートローダ、JTAG、例外レベル、例外ハンドラ、ページテーブル
pt_br: Inicialização, driver UART, _bootloader_ simples, JTAG, níveis de exceção, tratamento de exceção, tabelas de páginas
uk: Ініціалізація, драйвер UART, простий завантажувач, JTAG, рівні винятків, обробка винятків, таблиці сторінок

source: Some dodginess around cache maintenance and initialisation in Rust, not necessarily a good example to copy for production code.
es: Algunas dudas sobre el mantenimiento de la caché y la inicialización en Rust, aunque no es precisamente un buen ejemplo para copiar en código de producción.
fa: برخی ابهامات در مورد نگهداری کَش و راه‌اندازی اولیه در Rust، لزوماً مثال خوبی برای کپی کردن برای کد production نیست.
ja: キャッシュメンテナンスとRustの初期化に関してちょっと疑わしいところがあるので、製品コードで真似するには必ずしも良い例ではありません。
pt_br: Algumas coisas estranhas em torno da manutenção e inicialização de cache em Rust, não necessariamente um bom exemplo para copiar para código de produção.
uk: Деякі хитрощі щодо обслуговування кешу та ініціалізації в Rust, не обов’язково хороший приклад для копіювання для виробничого коду.

source: Static analysis to determine maximum stack usage.
es: Análisis estático para determinar el uso máximo de la _stack_.
fa: تجزیه‌و‌تحلیل استاتیک برای تعیین حداکثر استفاده از stack.
ja: スタックの最大使用量に関する静的解析。
pt_br: Análise estática para determinar o uso máximo de pilha.
uk: Статичний аналіз для визначення максимального використання стека.

source: The RaspberryPi OS tutorial runs Rust code before the MMU and caches are enabled. This will read and write memory (e.g. the stack). However:
es: El tutorial del sistema operativo en RaspberryPi ejecuta código de Rust antes de que la MMU y las cachés se habiliten. De este modo, se leerá y escribirá memoria (por ejemplo, la _stack_). Sin embargo:
fa: آموزش سیستم عامل RaspberryPi، کد Rust را قبل از فعال شدن MMU و حافظه کَش اجرا می‌کند. این کار memory را می‌خواند و روی آن می‌نویسد (به عنوان مثال stack). بااین‌حال:
ja: RaspberryPi OS チュートリアルはMMUやキャッシュを有効化する前にRustコードを実行しています。これにより、例えばスタックメモリをreadしたりwriteしたりすることになります。しかし：
pt_br: O tutorial do RaspberryPi OS executa código Rust antes que a MMU e os caches sejam habilitados. Isso lerá e gravará memória (por exemplo, a pilha). No entanto:
uk: Підручник з ОС RaspberryPi запускає код Rust до ввімкнення MMU та кешу. Це дозволить читати та записувати пам’ять (наприклад, стек). Однак:

source: Without the MMU and cache, unaligned accesses will fault. It builds with `aarch64-unknown-none` which sets `+strict-align` to prevent the compiler generating unaligned accesses so it should be alright, but this is not necessarily the case in general.
es: Sin la MMU y la caché, los accesos no alineados fallarán. Se compila con `aarch64-unknown-none`, que define `+strict-align` para evitar que el compilador genere accesos no alineados. Debería estar bien, pero no tiene por qué ser así, en general.
ja: MMUとキャッシュを有効化していないと、アラインされていないアクセスはフォールトを引き起こします。そのチュートリアルでは、コンパイラがアラインされていないアクセスを生成しない`+strict-align`オプションをセットする`aarch64-unknown-none`をターゲットとしてビルドしているので大丈夫なはずですが、一般的には大丈夫とは限りません。
pt_br: Sem a MMU e o cache, acessos não alinhados falharão. Ele é construído com `aarch64-unknown-none` que define `+strict-align` para evitar que o compilador gere acessos não alinhados, portanto, deve estar tudo bem, mas isso não é necessariamente o caso em geral.
uk: Без MMU та кешу невирівняні доступи призведуть до помилки. Код створюється за допомогою `aarch64-unknown-none`, який встановлює `+strict-align`, щоб запобігти генерації компілятором невирівняних доступів, тому це має бути гаразд, але це не обов’язково так загалом.
