Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: C++ also has [`std::move`](https://en.cppreference.com/w/cpp/utility/move), which is used to indicate when a value may be moved from. If the example had been `s2 = std::move(s1)`, no heap allocation would take place. After the move, `s1` would be in a valid but unspecified state. Unlike Rust, the programmer is allowed to keep using `s1`.
fa: البته که زبان <span dir=ltr>C++</span> دارای [<span dir=ltr>`std::move`</span>](https://en.cppreference.com/w/cpp/utility/move) است که برای انتقال یک متغییر استفاده میشود. اگر مثال ما <span dir=ltr>`s2 = std::move(s1)`</span> بود هیچ تخصیص انباشتی صورت نمیگرفت بلکه `s1` در یک وضعیت معتبر البته نامشخص قرار میگرفت و برخلاف زبان Rust, توی زبان <span dir=ltr>C++</span> برنامه‌نویس مجاز است که دوباره از `s1` استفاده کند.
ja: C++ には [`std::move`](https://en.cppreference.com/w/cpp/utility/move) もありますが、これは値をムーブできるタイミングを示すために使用されます。この例で `s2 = std::move(s1)` となっていた場合は、ヒープ割り当ては行われません。ムーブ後、`s1` は有効であるものの、未指定の状態になります。Rust とは異なり、プログラマーは `s1` を引き続き使用できます。
pt_br: O C++ também possui [`std::move`](https://en.cppreference.com/w/cpp/utility/move), que é usado para indicar quando um valor pode ser movido. Se o exemplo fosse `s2 = std::move(s1)`, nenhuma alocação de heap seria feita. Após a movimentação, `s1` estaria em um estado válido, mas não especificado. Diferentemente do Rust, o programador pode continuar usando `s1`.
uk: C++ також має [`std::move`](https://en.cppreference.com/w/cpp/utility/move), який використовується щоб вказати коли значення можна перемістити. Якби приклад був `s2 = std::move(s1)`, розподілу купи не відбулося б. Після переміщення `s1` буде в діючому, але не визначеному стані. На відміну від Rust, програмісту дозволено використовувати `s1`.

source: Unlike Rust, `=` in C++ can run arbitrary code as determined by the type which is being copied or moved.
fa: بر خلاف Rust، `=` در <span dir=ltr>C++</span> می‌تواند برای کپی کردن و هم انتقال دادن استفاده شود.
ja: Rust とは異なり、C++ の `=` は、コピーまたは移動される型によって決定される任意のコードを実行できます。
pt_br: Diferentemente do Rust, `=` em C++ pode executar código arbitrário conforme determinado pelo tipo que está sendo copiado ou movido.
uk: На відміну від Rust, `=` у C++ може виконувати довільний код, який визначається типом, який копіюється або переміщується.

source: Sometimes you _want_ to make a copy of a value. The `Clone` trait accomplishes this.
fa: گاهی اوقات شما _می‌خواهید_ یک نسخه از مقدار بسازید. ویژگی `Clone` این کار را انجام می‌دهد.
ja: 値のコピーを作成したい場合は、`Clone` トレイトを使用できます。
pt_br: Às vezes você _quer_ fazer uma cópia de um valor. O _trait_ `Clone` consegue isso.
uk: Іноді вам _необхідно_ зробити копію значення. Для цього призначений крейт `Clone`.

source: The idea of `Clone` is to make it easy to spot where heap allocations are occurring. Look for `.clone()` and a few others like `vec!` or `Box::new`.
fa: ایده‌ی `Clone` این است که شناسایی مکان‌های تخصیص حافظه heap آسان‌تر شود. به دنبال `()clone.` و چند مورد دیگر مانند `!vec` یا `Box::new` بگردید.
uk: Ідея `Clone` полягає у тому, щоб полегшити виявлення місць, де відбувається виділення пам'яті у купі. Шукайте `.clone()` та деякі інші, такі як `vec!` або `Box::new`.

source: It's common to "clone your way out" of problems with the borrow checker, and return later to try to optimize those clones away.
fa: معمولاً برای حل مشکلات مربوط به بررسی‌کننده قرض‌گیری (borrow checker) از کپی کردن استفاده می‌شود و سپس در آینده تلاش می‌شود تا آن کپی‌ها بهینه‌سازی شوند.
ja: 借用チェッカーが通らない場合に「とりあえずクローンを作成して切り抜けておいて」、あとからクローンのないコードへの最適化を試みるのもよくあることです。
pt_br: É comum "clonar seu caminho para fora" de problemas com o verificador de empréstimo, e retornar mais tarde para tentar otimizar esses clones.
uk: Зазвичай, ви "клонуєте свій вихід" з проблем з перевіркою позик, а потім повертаєтесь пізніше, щоб спробувати оптимізувати ці клони.

source: `clone` generally performs a deep copy of the value, meaning that if you e.g. clone an array, all of the elements of the array are cloned as well.
fa: `clone` معمولاً یک کپی عمیق از مقدار را انجام می‌دهد، به این معنی که اگر به عنوان مثال یک آرایه را کپی کنید، تمام عناصر آن آرایه نیز کپی خواهند شد.
uk: `clone` зазвичай виконує глибоку копію значення, тобто якщо ви, наприклад, клонуєте масив, то всі елементи масиву також будуть клоновані.

source: The behavior for `clone` is user-defined, so it can perform custom cloning logic if needed.
fa: رفتار `clone` توسط کاربر تعریف می‌شود، بنابراین می‌تواند در صورت نیاز، منطق کپی‌برداری سفارشی را اجرا کند.
uk: Поведінка функції `clone` визначається користувачем, тому вона може виконувати власну логіку клонування, якщо це необхідно.

source: While move semantics are the default, certain types are copied by default:
es: Aunque la semántica de movimiento es la opción predeterminada, algunos tipos se copian de forma predeterminada:
fa: در حالی که مفهوم انتقال به صورت پیش‌فرض است، در زبان راست چند نوع خاص به صورت پیش‌فرض کپی می‌شوند:
ja: 言語としてのデフォルトはムーブセマンティクスですが、特定の型ではデフォルトでコピーが行われます。
ko: 이동이 기본 설정이지만, 특정 타입은 복사됩니다:
pt_br: Embora a semântica de movimento seja o padrão, certos tipos são copiados por padrão:
uk: Хоча семантика переміщення використовується за замовчуванням, певні типи копіюються за замовчуванням:

source: These types implement the `Copy` trait.
es: Estos tipos implementan el trait `Copy`.
fa: این انواع‌داده ویژگی `Copy` را پیاده‌سازی کرده‌اند.
ja: これらの型は `Copy` トレイトを実装しているからです。
ko: 이러한 타입들은 `Copy` 트레잇을 구현합니다.
pt_br: Esses tipos implementam o _trait_ `Copy`.
uk: Ці типи реалізують трейт `Copy`.

source: You can opt-in your own types to use copy semantics:
es: Puedes habilitar tus propios tipos para que usen la semántica de copia:
fa: البته که میتوان برای نوع‌هایی که میسازید هم مفهوم کپی را داشته باشید:
ja: あなたが定義した独自の型のデフォルトをコピーセマンティクスにすることが出来ます。
ko: 직접 만든 타입들도 `Copy`트레잇을 구현하여 복사를 할 수 있습니다:
pt_br: Você pode habilitar seus próprios tipos para usar a semântica de cópia:
uk: Ви можете вибрати власні типи для використання семантики копіювання:

source: After the assignment, both `p1` and `p2` own their own data.
es: Después de la asignación, tanto `p1` como `p2` tienen sus propios datos.
fa: پس از انتساب، هر دو `p1` و `p2` داده‌های خود مستقل خود را دارند.
ja: 代入後は、`p1` と `p2` の両方が独自のデータを所有します。
ko: 할당 후, `p1`와 `p2`는 자신의 데이터를 소유합니다.
pt_br: Após a atribuição, tanto `p1` quanto `p2` possuem seus próprios dados.
uk: Після присвоєння обидва `p1` і `p2` володіють власними даними.

source: We can also use `p1.clone()` to explicitly copy the data.
es: También podemos utilizar `p1.clone()` para copiar los datos de forma explícita.
fa: همچنین می‌توانیم از <span dir=ltr>`p1.clone()`</span> برای کپی صریح داده‌ها استفاده کنیم.
ja: `p1.clone()` を使用してデータを明示的にコピーすることもできます。
ko: 명시적으로 `p1.clone()`를 사용하여 데이터를 복사할 수 있습니다.
pt_br: Também podemos usar `p1.clone()` para copiar os dados explicitamente.
uk: Ми також можемо використовувати `p1.clone()` для явного копіювання даних.

source: Copying and cloning are not the same thing:
es: Copiar y clonar no es lo mismo:
fa: کپی‌برداری و کلون‌سازی یکسان نیستند:
ja: コピーとクローン作成は同じではありません。
ko: 복사(copy)와 복제(clone)는 같지 않습니다:
pt_br: Copia e clonagem não são a mesma coisa:
uk: Копіювання та клонування – це не одне й те саме:

source: Copying refers to bitwise copies of memory regions and does not work on arbitrary objects.
es: Copiar hace referencia a las copias bit a bit de regiones de memoria y no funciona en cualquier objeto.
fa: کپی‌برداری به کپی‌های بیت به بیت از مناطق حافظه اشاره دارد و روی همه انواع تعریف شده توسط شما کار نمی‌کند.
ja: コピーとは、メモリ領域のビット単位コピーのことであり、任意のオブジェクトでは機能しません。
ko: 복사는 메모리의 내용을 그대로 한 벌 더 만드는 것을 의미하며, 아무 객체에서나 다 지원하지는 않습니다.
pt_br: Cópia refere-se a cópias bit a bit de regiões de memória e não funciona em objetos arbitrários.
uk: Копіювання стосується побітових копій областей пам’яті та не працює з довільними об’єктами.

source: Copying does not allow for custom logic (unlike copy constructors in C++).
es: Copiar no permite lógica personalizada (a diferencia de los constructores de copias de C++).
fa: کپی‌برداری اجازه منطق سفارشی را نمی‌دهد (بر خلاف کپی constructors در <span dir=ltr>C++</span>).
ja: コピーではカスタムロジックは使用できません（C++ のコピーコンストラクタとは異なります）。
ko: 복사는 커스터마이즈 할 수 없습니다. (C++에서 복사 생성자를 통해 복사 동작을 임의로 구현할 수 있는 것과 비교가 됩니다.)
pt_br: Cópia não permite lógica personalizada (ao contrário dos construtores de cópia em C++).
uk: Копіювання не допускає створювати власну логіку (на відміну від конструкторів копіювання в C++).

source: Cloning is a more general operation and also allows for custom behavior by implementing the `Clone` trait.
es: Clonar es una operación más general y que permite un comportamiento personalizado implementando el trait `Clone`.
fa: کلون‌سازی یک عملیات عمومی‌تر است و همچنین با پیاده‌سازی ویژگی `Clone` امکان رفتار سفارشی را فراهم می‌کند.
ja: クローン作成はより一般的なオペレーションであり、`Clone` トレイトを実装することでカスタム動作も可能になります。
ko: 복제는 보다 일반적인 작업이며, `Clone`트레잇을 구현하여 복제시 동작을 커스터마이즈 할 수 있습니다.
pt_br: Clonagem é uma operação mais geral e também permite um comportamento personalizado através da implementação do trait `Clone`.
uk: Клонування — це більш загальна операція, яка також допускає нестандартну поведінку шляхом реалізації трейта `Clone`.

source: Copying does not work on types that implement the `Drop` trait.
es: Copiar no funciona en los tipos que implementan el trait `Drop`.
fa: کپی‌برداری روی انواع داده‌ای که ویژگی Drop را پیاده سازی کرده اند کار نمی‌کند.
ja: `Drop` トレイトを実装している型では、コピーは出来ません。
ko: `Drop` 트레잇을 구현한 타입은 복사되지 않습니다.
pt_br: Cópia não funciona em tipos que implementam o trait `Drop`.
uk: Копіювання не працює з типами, які реалізують трейт `Drop`.

source: In the above example, try the following:
es: En el ejemplo anterior, prueba lo siguiente:
fa: در مثال بالا، موارد زیر را امتحان کنید:
ja: 上記の例で、次の方法を試してください。
ko: 위의 예시에서 다음을 시도해 보시기 바랍니다:
pt_br: No exemplo acima, tente o seguinte:
uk: У наведеному вище прикладі спробуйте наступне:

source: Add a `String` field to `struct Point`. It will not compile because `String` is not a `Copy` type.
es: Añade un campo `String` a `struct Point`. No se compilará porque `String` no es de tipo `Copy`.
fa: یک فیلد `String` به `struct Point` اضافه کنید. کامپایل نمی‌شود زیرا `String` یک نوع `Copy` نیست.
ja: `String` フィールドを`struct Point` に追加します。`String` が `Copy` 型ではないため、コンパイルできなくなります。
ko: `Point`구조체에 `String`필드를 추가하세요. 컴파일 되지 않을 것입니다. 왜냐하면 `String`은 `Copy`트레잇을 구현하고 있지 않기 때문입니다.
pt_br: Adicione um campo `String` ao `struct Point`. Ele não irá compilar porque `String` não é um tipo `Copy`.
uk: Додайте поле `String` до `struct Point`. Це не скомпілюється, оскільки `String` не є типом `Copy`.

source: Remove `Copy` from the `derive` attribute. The compiler error is now in the `println!` for `p1`.
fa: ویژگی `Copy` را از صفت `derive` حذف کنید. اکنون خطای کامپایلر در `!println` برای `p1` قرار دارد.
ja: `derive` 属性から `Copy` を削除します。`p1` の `println!` でコンパイラ エラーが発生します。
pt_br: Remova `Copy` do atributo `derive`. O erro do compilador agora está no `println!` para `p1`.
uk: Видаліть `Copy` з атрибута `derive`. Помилка компілятора тепер у `println!` для `p1`.

source: Show that it works if you clone `p1` instead.
es: Demuestra que funciona si clonas `p1`.
fa: نشان دهید که اگر `p1` را به جای کپی آن کلون کنید، کار می‌کند.
ja: 代わりに `p1` のクローンを作成すれば解決できることを示します。
ko: `p1`을 복제하면 잘 동작함을 확인해 보세요.
pt_br: Mostre que ele funciona se ao invés disso você clonar `p1`.
uk: Покажіть, що це працює, якщо замість цього клонувати `p1`.

source: Shared references are `Copy`/`Clone`, mutable references are not. This is because rust requires that mutable references be exclusive, so while it's valid to make a copy of a shared reference, creating a copy of a mutable reference would violate Rust's borrowing rules.
fa: ارجاعات مشترک (`shared references`) دارای ویژگی `Copy`/`Clone` هستند، اما ارجاعات قابل تغییر (`mutable references`) این‌طور نیستند. این به این دلیل است که Rust نیاز دارد که ارجاعات قابل تغییر منحصر به فرد باشند، بنابراین در حالی که کپی کردن یک ارجاع مشترک معتبر است، ایجاد یک کپی از یک ارجاع قابل تغییر قوانین قرض‌گیری Rust را نقض می‌کند.
uk: Спільні посилання є `Copy`/`Clone`, змінні посилання - ні. Це пов'язано з тим, що Rust вимагає, щоб змінювані посилання були ексклюзивними, тому, хоча створення копії спільного посилання є допустимим, створення копії змінюваного посилання порушуватиме правила запозичення Rust.

source: The `Drop` Trait
es: El Trait `Drop`
fa: ویژگی `Drop`
ja: `Drop` トレイト
ko: `Drop` 트레잇
pt_br: O Trait `Drop`
uk: Трейт `Drop`

source: Values which implement [`Drop`](https://doc.rust-lang.org/std/ops/trait.Drop.html) can specify code to run when they go out of scope:
es: Los valores que implementan [`Drop`](https://doc.rust-lang.org/std/ops/trait.Drop.html) pueden especificar el código que se ejecutará cuando salgan del ámbito:
fa: مقادیر که ویژگی [`Drop`](https://doc.rust-lang.org/std/ops/trait.Drop.html) را پیاده‌سازی می‌کنند می‌توانند کدی را مشخص کنند که هنگام خروج از دامنه اجرا شود:
ja: [`Drop`](https://doc.rust-lang.org/std/ops/trait.Drop.html) を実装している値では、スコープから外れるときに実行するコードを指定できます。
ko: [`Drop`](https://doc.rust-lang.org/std/ops/trait.Drop.html)트레잇을 구현하면, 그 값이 스코프 밖으로 나갈 때 실행될 코드를 작성할 수 있습니다:
pt_br: Valores que implementam [`Drop`](https://doc.rust-lang.org/std/ops/trait.Drop.html) podem especificar o código a ser executado quando saem do escopo:
uk: Значення, які реалізують [`Drop`](https://doc.rust-lang.org/std/ops/trait.Drop.html), можуть вказувати код, який запускатиметься, коли вони виходять за межі області видимості:

source: "Dropping {}"
pt_br: "Descartando {}"
uk: "Відкидаємо {}"

source: "Exiting block B"
pt_br: "Saindo do bloco B"
uk: "Виходимо з блоку B"

source: "Exiting block A"
pt_br: "Saindo do bloco A"
uk: "Виходимо з блоку A"

source: "Exiting main"
pt_br: "Saindo do main"
uk: "Виходимо з main"

source: Note that `std::mem::drop` is not the same as `std::ops::Drop::drop`.
fa: توجه داشته باشید که `std::mem::drop` با `std::ops::Drop::drop` یکسان نیست.
ja: `std::mem::drop` は `std::ops::Drop::drop` と同じではありません。
pt_br: Observe que `std::mem::drop` não é o mesmo que `std::ops::Drop::drop`.
uk: Зверніть увагу, що `std::mem::drop` не те саме, що `std::ops::Drop::drop`.

source: Values are automatically dropped when they go out of scope.
fa: مقادیر به طور خودکار زمانی که از دامنه خارج می‌شوند، حذف می‌شوند.
ja: スコープ外になると、値は自動的にドロップされます。
pt_br: Os valores são descartados automaticamente quando saem do escopo.
uk: Значення автоматично відкидаються, коли вони виходять за межі області видимості.

source: When a value is dropped, if it implements `std::ops::Drop` then its `Drop::drop` implementation will be called.
fa: زمانی که یک مقدار حذف می‌شود، اگر آن مقدار ویژگی `std::ops::Drop` را پیاده‌سازی کرده باشد، پیاده‌سازی `Drop::drop` آن فراخوانی خواهد شد.
ja: 値がドロップされる際、`std::ops::Drop` を実装している場合は、その `Drop::drop` 実装が呼び出されます。
pt_br: Quando um valor é descartado, se ele implementa `std::ops::Drop` então sua implementação `Drop::drop` será chamada.
uk: Коли значення відкидається, якщо воно реалізує `std::ops::Drop`, то буде викликано його реалізацію `Drop::drop`.

source: All its fields will then be dropped too, whether or not it implements `Drop`.
fa: تمام فیلدهای آن نیز سپس حذف خواهند شد، چه آن مقدار ویژگی `Drop` را پیاده‌سازی کرده باشد یا نه.
ja: その後、`Drop` を実装しているかどうかにかかわらず、すべてのフィールドもドロップされます。
pt_br: Todas as seus campos serão descartadas também, independentemente de implementar `Drop`.
uk: Всі його поля також будуть видалені, незалежно від того, чи реалізовано в ньому `Drop` чи ні.

source: `std::mem::drop` is just an empty function that takes any value. The significance is that it takes ownership of the value, so at the end of its scope it gets dropped. This makes it a convenient way to explicitly drop values earlier than they would otherwise go out of scope.
fa: `std::mem::drop` یک تابع خالی است که هر مقداری را می‌پذیرد. اهمیت آن در این است که مالکیت مقدار را به عهده می‌گیرد، بنابراین در پایان دامنه‌اش حذف می‌شود. این ویژگی آن را به روشی مناسب برای حذف صریح مقادیر پیش از آنچه که معمولاً از دامنه خارج می‌شوند، تبدیل می‌کند.
ja: `std::mem::drop` は、任意の値を受け取る空の関数にすぎません。重要なのは、この関数が値の所有権を取得することで、スコープの最後で値がドロップされることです。これは、スコープ外になる前に値を明示的にドロップするための便利な方法です。
pt_br: `std::mem::drop` é apenas uma função vazia que recebe qualquer valor. A importância é que ela assume a _ownership_ do valor, então no final de seu escopo ele é descartado. Isso torna uma maneira conveniente de descartar explicitamente valores mais cedo do que eles sairiam do escopo.
uk: `std::mem::drop` - це просто порожня функція, яка приймає будь-яке значення. Важливо те, що вона отримує володіння значенням, тому в кінці своєї області видимості вона його відкидає. Це робить її зручним способом явного відкидання значень раніше, ніж вони вийдуть за межі області видимості.

source: This can be useful for objects that do some work on `drop`: releasing locks, closing files, etc.
fa: این می‌تواند برای اشیائی که در هنگام `drop` کاری انجام می‌دهند مفید باشد: آزاد کردن قفل‌ها، بستن فایل‌ها و غیره.
ja: この方法は、`drop` で何らかの処理（ロックの解放、ファイルのクローズなど）を行うオブジェクトに使用すると便利です。
pt_br: Isso pode ser útil para objetos que fazem algum trabalho em `drop`: liberando travas, fechando arquivos, etc.
uk: Це може бути корисно для об'єктів, які виконують деяку роботу на `drop`: зняття блокування, закриття файлів тощо.

source: Why doesn't `Drop::drop` take `self`?
es: ¿Por qué `Drop::drop` no acepta `self`?
fa: چرا `Drop::drop` `self` را نمی‌گیرد؟
ja: `Drop::drop` が `self` をパラメータとして取らないのはなぜですか？
ko: `Drop::drop`은 왜 `self`를 인자로 받지 않습니까?
pt_br: Por que `Drop::drop` não recebe `self`?
uk: Чому `Drop::drop` не приймає `self`?

source: Short-answer: If it did, `std::mem::drop` would be called at the end of the block, resulting in another call to `Drop::drop`, and a stack overflow!
es: Respuesta corta: si lo hiciera, se llamaría a `std::mem::drop` al final del bloque, lo que daría como resultado otra llamada a `Drop::drop` y un desbordamiento de la _stack_.
fa: پاسخ کوتاه: اگر این‌طور بود، `std::mem::drop` در پایان بلوک فراخوانی می‌شد که منجر به فراخوانی مجدد `Drop::drop` و ایجاد خطای سرریز (stack overflow) stack می‌شد!
ja: 短い回答: その場合、ブロックの最後に `std::mem::drop` が呼び出されるため、別の `Drop::drop` が呼び出され、スタック オーバーフローが発生します。
ko: 짧은 대답: 만약 그렇게 된다면 `std::mem::drop`이 블록의 끝에서 호출되고, 다시 `Drop::drop`을 호출하게 되어, 스택 오버플로가 발생합니다!
pt_br: Resposta curta: Se recebesse, `std::mem::drop` seria chamado no final do bloco, resultando em outra chamada para `Drop::drop` ocasionando um estouro de pilha.
uk: Коротка відповідь: якби це було так, `std::mem::drop` викликався б у кінці блоку, що призвело б до ще одного виклику `Drop::drop` і переповнення стеку!

source: Try replacing `drop(a)` with `a.drop()`.
es: Prueba a sustituir `drop(a)` por `a.drop()`.
fa: سعی کنید `drop(a)` را با `()a.drop` جایگزین کنید.
ja: `drop(a)` を `a.drop()` に置き換えてみてください。
ko: `drop(a)`를 `a.drop()`로 변경해 보시기 바랍니다.
pt_br: Tente substituir `drop(a)` por `a.drop()`.
uk: Спробуйте замінити `drop(a)` на `a.drop()`.

source: In this example, we will implement a complex data type that owns all of its data. We will use the "builder pattern" to support building a new value piece-by-piece, using convenience functions.
fa: در این مثال، ما یک نوع داده پیچیده را پیاده‌سازی خواهیم کرد که مالک تمام داده‌های خود است. ما از "الگوی سازنده" برای پشتیبانی از ساخت یک مقدار جدید به صورت قطعه‌قطعه، با استفاده از توابع کمکی، استفاده خواهیم کرد.
ja: この例では、すべてのデータを持つ複雑なデータ型を実装します。「ビルダー パターン」で便利な関数を使用して、新しい値を 1 つずつ構築できるようにします。
pt_br: Neste exemplo, implementaremos um tipo de dados complexo que possui todos os seus dados. Usaremos o _"builder pattern"_ para suportar a construção de um novo valor peça por peça, usando funções de conveniência.
uk: У цьому прикладі ми реалізуємо складний тип даних, який володіє всіма своїми даними. Ми використаємо патерн "конструктор" для підтримки побудови нового значення по частинах за допомогою зручних функцій.

source: Fill in the missing pieces.
fa: جا‌های خالی را پر کنید.
ja: 抜けている部分を記入してください。
pt_br: Preencha as peças que faltam.
uk: Заповніть пропущені частини.

source: /// A representation of a software package.
ja: /// ソフトウェア パッケージの表現。
pt_br: /// Uma representação de um pacote de software.
uk: /// Представлення програмного пакету.

source: /// Return a representation of this package as a dependency, for use in /// building other packages.
ja: /// このパッケージの表現を依存関係として返し、 /// 他のパッケージのビルドに使用します。
pt_br: /// Retorna uma representação deste pacote como uma dependência, para uso na /// construção de outros pacotes.
uk: /// Повертає представлення цього пакунка у вигляді залежності для використання у /// збірці інших пакетів.

source: /// A builder for a Package. Use `build()` to create the `Package` itself.
ja: /// パッケージのビルダー。`build()` を使用して `Package` 自体を作成します。
pt_br: /// Um construtor para um Pacote. Use `build()` para criar o próprio `Package`.
uk: /// Конструктор для Package. Використовуйте `build()` для створення самого `Package`.

source: /// Set the package version.
ja: /// パッケージのバージョンを設定します。
pt_br: /// Define a versão do pacote.
uk: /// Задає версію пакета.

source: /// Set the package authors.
ja: /// パッケージ作成者を設定します。
pt_br: /// Define os autores do pacote.
uk: /// Задає автора пакета.

source: /// Add an additional dependency.
ja: /// 依存関係を追加します。
pt_br: /// Adiciona uma dependência adicional.
uk: /// Додає додаткову залежність.

source: /// Set the language. If not set, language defaults to None.
ja: /// 言語を設定します。設定しない場合、言語はデフォルトで None になります。
pt_br: /// Define a linguagem. Se não definida, a linguagem é None.
uk: /// Задає мову. Якщо не вказано, за замовчуванням буде встановлено значення None.

source: [`Box`](https://doc.rust-lang.org/std/boxed/struct.Box.html) is an owned pointer to data on the heap:
es: [`Box`](https://doc.rust-lang.org/std/boxed/struct.Box.html) es un puntero propio de datos en el _heap_:
fa: [`Box`](https://doc.rust-lang.org/std/boxed/struct.Box.html) یک اشاره‌گر مالک به داده‌های روی heap است:
ja: [`Box`](https://doc.rust-lang.org/std/boxed/struct.Box.html) は、ヒープ上のデータへの所有ポインタです。
ko: [`Box`](https://doc.rust-lang.org/std/boxed/struct.Box.html)는 힙 데이터에 대한 소유 포인터입니다:
pt_br: [`Box`](https://doc.rust-lang.org/std/boxed/struct.Box.html) é um ponteiro _owned_ para dados no heap:
uk: [`Box`](https://doc.rust-lang.org/std/boxed/struct.Box.html) — це вказівник на дані в купі:

source: `Box<T>` implements `Deref<Target = T>`, which means that you can [call methods from `T` directly on a `Box<T>`](https://doc.rust-lang.org/std/ops/trait.Deref.html#more-on-deref-coercion).
es: `Box<T>` implementa `Deref<Target = T>`, lo que significa que puedes [llamar a métodos desde `T` directamente en un `Box<T>`](https://doc.rust-lang.org/std/ops/trait.Deref.html#more-on-deref-coercion).
fa: `<Box<T` ویژگی `<Deref<Target = T` را پیاده‌سازی می‌کند، که به این معناست که می‌توانید [مستقیم روش‌های `T` را روی `<Box<T` فراخوانی کنید](https://doc.rust-lang.org/std/ops/trait.Deref.html#more-on-deref-coercion).
ja: `Box<T>` は `Deref<Target = T>` を実装しているため、[`Box<T>` に対して T のメソッドを直接呼び出す](https://doc.rust-lang.org/std/ops/trait.Deref.html#more-on-deref-coercion)ことができます。
ko: `Box<T>`은 [`Deref<Target = T>`](https://doc.rust-lang.org/std/ops/trait.Deref.html#more-on-deref-coercion)를 구현합니다. 이는 [`Box<T>`에서 `T` 메서드를 직접 호출](https://doc.rust-lang.org/std/ops/trait.Deref.html#more-on-deref-coercion) 할 수 있다는 의미입니다.
pt_br: `Box<T>` implementa `Deref<Target = T>`, o que significa que você pode [chamar métodos de `T` diretamente em um `Box<T>`](https://doc.rust-lang.org/std/ops/trait.Deref.html#more-on-deref-coercion).
uk: `Box<T>` реалізує `Deref<Target = T>`, що означає, що ви можете [викликати методи з `T` безпосередньо на `Box<T>`](https://doc.rust-lang.org/std/ops/trait.Deref.html#more-on-deref-coercion).
