Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Rust allows you to associate functions with your new types. You do this with an `impl` block:
es: Rust te permite asociar funciones a los nuevos tipos. Para ello, usa un bloque `impl`:
fa: Rust به شما این امکان را می‌دهد که توابعی را با تایپ جدید خود مرتبط کنید. این کار را با استفاده از بلوک `impl` انجام می‌دهید:
ja: Rust を使用すると、関数を新しい型に関連付けることができます。これは `impl` ブロックで実行します。
ko: 러스트에서 선언된 타입에 대해 `impl`블록에 함수를 선언하여 메서드를 연결 할 수 있습니다:
pt_br: Rust permite que você associe funções aos seus novos tipos. Você faz isso com um bloco `impl`:
uk: Rust дозволяє пов’язувати функції з новими типами. Ви робите це за допомогою блоку `impl`:

source: // No receiver, a static method
ja: // レシーバなし、静的メソッド
pt_br: // Sem receptor, um método estático
uk: // Немає отримувача, статичний метод

source: // Exclusive borrowed read-write access to self
ja: // 自身に対する排他的な読み取り / 書き込み借用アクセス
pt_br: // Empréstimo único com acesso de leitura e escrita em self
uk: // Ексклюзивний запозичений доступ на читання та запис до себе

source: // Shared and read-only borrowed access to self
ja: // 自身に対する共有および読み取り専用の借用アクセス
pt_br: // Empréstimo compartilhado com acesso apenas de leitura em self
uk: // Спільний та запозичений доступ тільки на читання до себе

source: "Recorded {} laps for {}:"
fa: "ضبط {} دور برای {}:"
pt_br: "Registrou {} voltas para {}:"
uk: "Записано {} кіл для {}:"

source: "Lap {idx}: {lap} sec"
pt_br: "Volta {idx}: {lap} seg"
uk: "Коло {idx}: {lap} sec"

source: // Exclusive ownership of self
ja: // 自身の排他的所有権
pt_br: // Propriedade exclusiva de self
uk: // Виключне володіння собою

source: "Race {} is finished, total lap time: {}"
fa: "مسابقه {} به پایان رسید، کل زمان دور: {}"
pt_br: "Corrida {} foi encerrada, tempo total de voltas: {}"
uk: "Гонка {} завершена, загальний час проходження кола: {}"

source: "Monaco Grand Prix"
fa: "جایزه بزرگ موناکو"
uk: "Гран-прі Монако"

source: The `self` arguments specify the "receiver" - the object the method acts on. There are several common receivers for a method:
fa: آرگومان‌های `self` "گیرنده" را مشخص می‌کنند - شیئی که متد بر روی آن عمل می‌کند. چندین گیرنده رایج برای یک متد وجود دارد:
ja: `self` 引数は、「レシーバ」、つまりメソッドが操作するオブジェクトを指定します。メソッドの一般的なレシーバは次のとおりです。
pt_br: Os argumentos `self` especificam o "receptor" - o objeto em que o método age. Existem vários receptores comuns para um método:
uk: Аргументи `self` визначають "отримувача" - об'єкт, на який діє метод. Існує декілька типових отримувачів для методу:

source: `&self`: borrows the object from the caller using a shared and immutable reference. The object can be used again afterwards.
es: `&self`: toma prestado el objeto del llamador utilizando una referencia compartida e inmutable. El objeto se puede volver a utilizar después.
fa: `self&`: شیئی را از فراخواننده با استفاده از یک مرجع مشترک و غیرقابل تغییر قرض می‌گیرد. شیء می‌تواند بعداً دوباره استفاده شود.
ja: `&self`: 共有の不変参照を使用して、呼び出し元からオブジェクトを借用します。このオブジェクトは後で再び使用できます。
ko: `&self`: 호출자로부터 공유가능한 불변 참조 방식으로 객체를 빌려옴을 나타냅니다. 객체는 메소드 호출 뒤에도 사용될 수 있습니다.
pt_br: `&self`: pega emprestado o objeto do chamador como uma referência compartilhada e imutável. O objeto pode ser usado novamente depois.
uk: `&self`: запозичує об’єкт у викликувача за допомогою спільного та незмінного посилання. Після цього об’єкт можна використовувати знову.

source: `&mut self`: borrows the object from the caller using a unique and mutable reference. The object can be used again afterwards.
es: `&mut self`: toma prestado el objeto del llamador mediante una referencia única y mutable. El objeto se puede volver a utilizar después.
fa: `mut self&`: شیء را از فراخواننده با استفاده از یک مرجع منحصر به فرد و قابل تغییر قرض می‌گیرد. شی پس از آن نمی‌تواند دوباره استفاده شود تا زمانی که مرجع به پایان برسد.
ja: `&mut self`: 一意の可変参照を使用して、呼び出し元からオブジェクトを借用します。このオブジェクトは後で再び使用できます。
ko: `&mut self`: 호출자로부터 유일한 가변 참조 방식으로 객체를 빌려옴을 나타냅니다. 객체는 메소드 호출 뒤에도 사용될 수 있습니다.
pt_br: `&mut self`: pega emprestado o objeto do chamador como uma referência única e mutável. O objeto pode ser usado novamente depois.
uk: `&mut self`: запозичує об’єкт у викликувача, використовуючи унікальне та мутабельне посилання. Після цього об’єкт можна використовувати знову.

source: `self`: takes ownership of the object and moves it away from the caller. The method becomes the owner of the object. The object will be dropped (deallocated) when the method returns, unless its ownership is explicitly transmitted. Complete ownership does not automatically mean mutability.
es: `self`: asume el _ownership_ del objeto y lo aleja del llamador. El método se convierte en el propietario del objeto. El objeto se eliminará (es decir, se anulará la asignación) cuando el método devuelva un resultado, a menos que se transmita su _ownership_ de forma explícita. El _ownership_ completa no implica automáticamente una mutabilidad.
fa: `self`: مالکیت شیء را به عهده می‌گیرد و آن را از فراخواننده منتقل می‌کند. متد مالک شیء می‌شود. شیء هنگامی که متد باز می‌گردد حذف خواهد شد، مگر اینکه مالکیت آن به‌طور صریح منتقل شود. مالکیت کامل به‌طور خودکار به معنای قابلیت تغییر نیست.
ja: `self`: オブジェクトの所有権を取得し、呼び出し元から遠ざけます。メソッドがオブジェクトの所有者になります。所有権が明示的に送信されない限り、メソッドが戻ると、オブジェクトは破棄（デアロケート）されます。完全な所有権は、必ずしも可変性を意味するわけではありません。
ko: `self`: 호출자로부터 객체의 소유권을 가져오고 객체는 호출자로부터 메소드로 이동됩니다. 메소드가 객체를 소유하게 되며 따라서 명시적으로 소유권을 다른 곳으로 전달하지 않는다면 메서드 종료와 함께 객체는 drop(해제)됩니다.
pt_br: `self`: toma posse do objeto e o move do chamador. O método se torna o proprietário do objeto. O objeto será descartado (desalocado) quando o método retorna, a menos que sua _ownership_ (posse) seja explicitamente transmitida. Posse completa não significa automaticamente mutabilidade.
uk: `self`: приймає право власності на об'єкт і переміщує його від викликувача. Метод стає власником об'єкта. Об’єкт буде видалено (звільнено), коли метод завершиться, якщо володіння їм не передано явно. Повне володіння не означає автоматичної мутабельності.

source: `mut self`: same as above, but the method can mutate the object.
fa: `mut self`: مشابه مورد بالا، اما متد می‌تواند شیء را تغییر دهد.
ja: `mut self`: 上記と同じですが、メソッドはオブジェクトを変更できます。
pt_br: `mut self`: o mesmo que acima, mas o método pode modificar o objeto.
uk: `mut self`: те саме, що й вище, але метод може змінювати об’єкт.

source: No receiver: this becomes a static method on the struct. Typically used to create constructors which are called `new` by convention.
es: Sin receptor: se convierte en un método estático de la estructura. Normalmente se utiliza para crear constructores que se suelen denominar `new`.
fa: بدون گیرنده: این تبدیل به یک متد استاتیک در ساختار می‌شود. معمولاً برای ایجاد سازنده‌ها استفاده می‌شود که به‌طور معمول `new` نامیده می‌شوند.
ja: レシーバなし: 構造体の静的メソッドになります。通常は、`new` と呼ばれるコンストラクタを作成するために使用されます。
ko: 리시버 없음: 구조체의 정적 메서드가 됩니다. 주로 생성자를 만들때 사용하게 되며, 생성자는 흔히 `new`라고 이름붙입니다.
pt_br: Sem receptor: isso se torna um método estático (_static_) no struct. Normalmente usado para criar construtores que, por convenção, são chamados `new`.
uk: Немає отримувача: це стає статичним методом у структурі. Зазвичай використовується для створення конструкторів, які за домовленістю називаються `new`.

source: It can be helpful to introduce methods by comparing them to functions.
es: Puede resultar útil presentar los métodos comparándolos con funciones.
fa: مفید است که متدها را با مقایسه آنها با توابع معرفی کنیم.
ja: メソッドを関数と比較して紹介するとよいでしょう。
ko: 메서드를 함수와 비교하여 소개하는 것도 도움이 될 수 있습니다.
pt_br: Pode ser útil introduzir métodos comparando-os com funções.
uk: Може бути корисно представити методи, порівнюючи їх із функціями.

source: Methods are called on an instance of a type (such as a struct or enum), the first parameter represents the instance as `self`.
es: Se llama a los métodos en una instancia de un tipo (como un estructura o una enumeración) y el primer parámetro representa la instancia como `self`.
fa: متدها بر روی یک نمونه از تایپی (مانند struct یا enum) فراخوانی می‌شوند، و پارامتر اول نمونه را به‌عنوان نمونه `self`.
ja: メソッドは型（構造体や列挙型など）のインスタンスで呼び出されます。最初のパラメータはインスタンスを `self` として表します。
ko: 메서드는 구조체나 열거형과 같은 타입의 인스턴스에서 호출 되며, 첫번째 매개변수(파라메터)는 인스턴스를 `self`로 표기합니다.
pt_br: Métodos são chamados em uma instância de um tipo (como _struct_ ou _enum_), o primeiro parâmetro representa a instância como `self`.
uk: Методи викликаються для екземпляра типу (такі як структура або перелік), перший параметр представляє екземпляр як `self`.

source: Developers may choose to use methods to take advantage of method receiver syntax and to help keep them more organized. By using methods we can keep all the implementation code in one predictable place.
es: Los desarrolladores pueden optar por utilizar métodos para aprovechar la sintaxis de los receptores de métodos y para ayudar a mantenerlos más organizados. Mediante el uso de métodos podemos mantener todo el código de implementación en un lugar predecible.
fa: توسعه‌دهندگان ممکن است تصمیم بگیرند از متدها استفاده کنند تا از نحو گیرنده متد بهره‌برداری کنند و به سازمان‌دهی بهتر کد کمک کنند. با استفاده از متدها، می‌توانیم تمامی کدهای پیاده‌سازی را در یک مکان قابل پیش‌بینی نگه داریم.
ja: デベロッパーは、メソッド レシーバ構文でコードを整理する目的で、メソッドを使用することもできます。メソッドを使用することで、すべての実装コードを 1 つの予測可能な場所にまとめることができます。
ko: 메서드를 이용하면 receiver 문법을 사용할 수 있고 코드를 좀더 체계적으로 정리할 수 있습니다. 메서드들이 예측 가능한 위치에 모여 있으니 찾기 쉽습니다.
pt_br: Desenvolvedores podem optar por usar métodos para aproveitar a sintaxe do receptor do método e ajudar a mantê-los mais organizados. Usando métodos, podemos manter todo o código de implementação em um local previsível.
uk: Розробники можуть використовувати методи, щоб скористатися перевагами синтаксису отримувача методів і допомогти їм бути більш організованими. Використовуючи методи, ми можемо зберігати весь код реалізації в одному передбачуваному місці.

source: Point out the use of the keyword `self`, a method receiver.
es: Señala el uso de la palabra clave `self`, receptor de un método.
fa: استفاده از کلمه کلیدی `self`، که به‌عنوان گیرنده متد عمل می‌کند، را مشخص کنید.
ja: メソッド レシーバである `self` というキーワードの使用について説明します。
ko: 메서드 receiver인 `self` 키워드 사용을 언급해 주시기 바랍니다.
pt_br: Destaque o uso da palavra-chave `self`, um receptor de método.
uk: Зверніть увагу на використання ключового слова `self`, отримувача методу.

source: Show that it is an abbreviated term for `self: Self` and perhaps show how the struct name could also be used.
es: Indica que se trata de un término abreviado de `self:&Self` y muestra cómo se podría utilizar también el nombre de la estructura.
fa: نشان دهید که `self` یک اصطلاح کوتاه‌شده برای `self: Self` است و شاید نشان دهید که چگونه نام struct نیز می‌تواند استفاده شود.
ja: `self: Self` の略語であることを示し、構造体名の使用方法についても説明することをおすすめします。
ko: 예제의 경우 `self: &Self`의 줄인 버전임을 알려주고, 구조체의 이름을 직접 사용하면 어떻게 되는지 보여주는 것도 좋습니다.
pt_br: Mostre que é um termo abreviado para `self: Self` e talvez mostre como o nome da _struct_ também poderia ser usado.
uk: Покажіть, що це скорочений термін для `self: Self` і, можливо, покажіть, як можна також використовувати назву структури.

source: Explain that `Self` is a type alias for the type the `impl` block is in and can be used elsewhere in the block.
es: Explica que `Self` es un tipo de alias para el tipo en el que está el bloque `impl` y que se puede usar en cualquier parte del bloque.
fa: توضیح دهید که `Self` یک نام مستعار نوع برای تایپ است که بلوک `impl` در آن قرار دارد و می‌تواند در سایر بخش‌های بلوک استفاده شود.
ja: `Self` は `impl` ブロックが存在する型の型エイリアスであり、ブロック内の他の場所で使用できることを説明します。
ko: `impl` 블록 내부에서는 `Self`가 해당 타입의 이름 대용으로 사용될 수 있음을 알려주세요.
pt_br: Explique que `Self` é um alias de tipo para o tipo em que o bloco `impl` está e pode ser usado em qualquer outro lugar no bloco.
uk: Поясніть, що `Self` — це псевдонім типу для типу, до якого входить блок `impl`, і його можна використовувати деінде в блоці.

source: Note how `self` is used like other structs and dot notation can be used to refer to individual fields.
es: Ten en cuenta que se puede usar `self` como otras estructuras y que la notación de puntos puede utilizarse para referirse a campos concretos.
ja: `self` は他の構造体と同様に使用され、ドット表記を使用して個々のフィールドを参照できることを説明します。
ko: 구조체의 필드를 접근할 때 점 표기를 사용하듯이 `self`에 점 표기를 사용하여 개별 필드들을 접근할 수 있습니다.
pt_br: Observe como `self` é usado como outras _structs_ e a notação de ponto pode ser usada para se referir a campos individuais.
uk: Зауважте, що `self` використовується, як і інші структури, і крапкова нотація може використовуватися для посилання на окремі поля.

source: This might be a good time to demonstrate how the `&self` differs from `self` by trying to run `finish` twice.
fa: این ممکن است زمان مناسبی باشد برای نشان دادن تفاوت بین `self&` و `self` با تلاش برای اجرای متد `finish` دو بار.
ja: ここで `finish` を 2 回実行して、`&self` と `self` の違いを示すことをおすすめします。
pt_br: Este pode ser um bom momento para demonstrar como `&self` difere de `self` modificando o código e tentando executar `finish` duas vezes.
uk: Це може бути гарний час, щоб продемонструвати, чим `&self` відрізняється від `self`, спробувавши запустити `finish` двічі.

source: Beyond variants on `self`, there are also [special wrapper types](https://doc.rust-lang.org/reference/special-types-and-traits.html) allowed to be receiver types, such as `Box<Self>`.
es: Además de las variantes `self`, también hay [tipos de envoltorios especiales](https://doc.rust-lang.org/reference/special-types-and-traits.html) que pueden ser tipos de receptor, como `Box<Self>`.
fa: فراتر از حالت‌های مختلف `self`، تایپ‌های [special wrapper types](https://doc.rust-lang.org/reference/special-types-and-traits.html) نیز وجود دارند که به‌عنوان تایپ‌های گیرنده مجاز هستند، مانند `<Box<Self`.
ja: `self` のバリアント以外にも、レシーバ型として許可されている [特別なラッパー型](https://doc.rust-lang.org/reference/special-types-and-traits.html)（`Box<Self>` など）もあります。
ko: `self`를 사용하는 이같은 변형들 외에도 `Box<Self>`와 같이 리시버 타입으로 허용되는 [특별한 래퍼 타입](https://doc.rust-lang.org/reference/special-types-and-traits.html)이 있습니다.
pt_br: Além das variantes de `self`, também existem [tipos especiais de _wrapper_](https://doc.rust-lang.org/reference/special-types-and-traits.html) que podem ser tipos de receptores, como `Box<Self>`.
uk: Окрім варіантів `self`, існують також [спеціальні типи обгорток](https://doc.rust-lang.org/reference/special-types-and-traits.html), які можуть бути типами отримувачів, наприклад `Box<Self>`.

source: Rust lets you abstract over types with traits. They're similar to interfaces:
es: Rust te permite abstraer sobre tipos con _traits_. Son similares a las interfaces:
fa: راست به شما این امکان را می‌دهد که با استفاده از traits بر روی تایپ‌ها انتزاع ایجاد کنید. آنها مشابه interface ها هستند:
ja: Rustでは、型に関しての抽象化をトレイトを用いて行うことができます。トレイトはインターフェースに似ています：
ko: 트레잇은 타입을 추상화 하는데 사용됩니다. 인터페이스와 비슷합니다:
pt_br: Rust permite abstrair características dos tipos usando `trait`. Eles são semelhantes a interfaces:
uk: Rust дозволяє абстрагування над типами за допомогою трейтів. Вони схожі на інтерфейси:

source: /// Return a sentence from this pet.
pt_br: /// Retorna uma frase deste animal de estimação.
uk: /// Повертає речення від цього вихованця.

source: /// Print a string to the terminal greeting this pet.
pt_br: /// Imprime uma string no terminal saudando este animal de estimação.
uk: /// Виводить на термінал рядок привітання цього вихованця.

source: A trait defines a number of methods that types must have in order to implement the trait.
fa: یک trait مجموعه‌ای از متدها را تعریف می‌کند که تایپ‌ها باید آن‌ها را داشته باشند تا بتوانند آن trait را پیاده‌سازی کنند.
ja: トレイトは、そのトレイトを実装するために各型に必要な多数のメソッドを定義します。
pt_br: Um _trait_ define um número de métodos que os tipos devem ter para implementar o _trait_.
uk: Трейт визначає ряд методів, які повинні мати типи, щоб реалізувати цій трейт.

source: In the "Generics" segment, next, we will see how to build functionality that is generic over all types implementing a trait.
fa: در بخش "Generics"، در ادامه خواهیم دید که چگونه می‌توانیم عملکردی بسازیم که generic بر روی تمام تایپ‌های که یک trait را پیاده‌سازی کرده‌اند باشد.
pt_br: No segmento "Genéricos", a seguir, veremos como construir funcionalidades que são genéricas para todos os tipos que implementam um _trait_.
uk: Далі у розділі "Узагальнення" ми побачимо, як побудувати функціональність, яка є загальною для всіх типів, що реалізують трейт.

source: "Oh you're a cutie! What's your name? {}"
fa: "اوه تو چثدر زیبا هستی! اسمت چیه؟ {}"
pt_br: "Oh, você é adorável! Qual é o seu nome? {}"
uk: "Який же ти милий! Як тебе звати? {}"

source: "Woof, my name is {}!"
fa: " Woof، نام من {} است!"
pt_br: "Auau, meu nome é {}"
uk: "Гав, мене звуть {}!"

source: "Fido"
pt_br: "Bidu"
uk: "Фідо"

source: To implement `Trait` for `Type`, you use an `impl Trait for Type { .. }` block.
fa: برای پیاده‌سازی `Trait` برای `Type`، از بلوک `{ .. } impl Trait for Type` استفاده می‌کنید.
pt_br: Para implementar `Trait` para `Type`, você usa um bloco `impl Trait for Type { .. }`.
uk: Щоб реалізувати `Trait` для `Type`, ви використовуєте `impl Trait for Type { .. }` блок.

source: Unlike Go interfaces, just having matching methods is not enough: a `Cat` type with a `talk()` method would not automatically satisfy `Pet` unless it is in an `impl Pet` block.
fa: برخلاف رابط‌های Go، داشتن فقط متدهای مطابقت‌دهنده کافی نیست: نوع `Cat` با متد `()talk` به‌طور خودکار `Pet` را برآورده نمی‌کند، مگر اینکه در یک بلوک `impl Pet` قرار داشته باشد.
pt_br: Ao contrário das interfaces Go, apenas ter métodos correspondentes não é suficiente: um tipo `Cat` com um método `talk()` não satisfaria automaticamente `Pet` a menos que esteja em um bloco `impl Pet`.
uk: На відміну від інтерфейсів Go, просто мати відповідні методи недостатньо: тип `Cat` з методом `talk()` не буде автоматично задовольняти `Pet`, якщо він не знаходиться у блоці `impl Pet`.

source: Traits may provide default implementations of some methods. Default implementations can rely on all the methods of the trait. In this case, `greet` is provided, and relies on `talk`.
fa: Traits ممکن است پیاده‌سازی‌های پیش‌فرض برای برخی از متدها ارائه دهند. پیاده‌سازی‌های پیش‌فرض می‌توانند به تمامی متدهای trait وابسته باشند. در این مورد، `greet` ارائه شده است و به `talk` وابسته است.
pt_br: Os _traits_ podem fornecer implementações padrão de alguns métodos. As implementações padrão podem depender de todos os métodos do _trait_. Neste caso, `greet` é fornecido e depende de `talk`.
uk: Трейти можуть надавати реалізації за замовчуванням для деяких методів. Реалізації за замовчуванням можуть покладатися на всі методи трейту. У цьому випадку надається `greet`, який покладається на `talk`.

source: A trait can require that types implementing it also implement other traits, called _supertraits_. Here, any type implementing `Pet` must implement `Animal`.
fa: یک trait می‌تواند نیاز داشته باشد که تایپ‌هایی که آن را پیاده‌سازی می‌کنند، همچنین traits دیگری به نام _supertraits_ را نیز پیاده‌سازی کنند. در اینجا، هر نوعی که `Pet` را پیاده‌سازی کند، باید `Animal` را نیز پیاده‌سازی کند.
pt_br: Um _trait_ pode exigir que os tipos que o implementam também implementem outros _traits_, chamados _supertraits_. Aqui, qualquer tipo que implemente `Pet` deve implementar `Animal`.
uk: Трейт може вимагати, щоб типи, які його реалізують, також реалізовували інші трейти, так звані _супертрейти_. У цьому випадку, будь-який тип, що реалізує `Pet`, повинен реалізувати `Animal`.

source: "Rex"
uk: "Рекс"

source: "{} has {} legs"
pt_br: "{} tem {} pernas"
uk: "{} має {} ніг"

source: This is sometimes called "trait inheritance" but students should not expect this to behave like OO inheritance. It just specifies an additional requirement on implementations of a trait.
fa: این گاهی اوقات "trait inheritance" نامیده می‌شود، اما دانش‌آموزان نباید انتظار داشته باشند که این رفتار مشابه وراثت در برنامه‌نویسی شیءگرا (OO) باشد. این تنها یک الزام اضافی بر روی پیاده‌سازی‌های یک trait را مشخص می‌کند.
pt_br: Isso é às vezes chamado de "herança de _trait_", mas os alunos não devem esperar que isso se comporte como herança de OO. Ele apenas especifica um requisito adicional nas implementações de um _trait_.
uk: Іноді це називають "успадкуванням трейтів", але студенти не повинні очікувати, що це буде схоже на успадкування об'єктів OO. Це просто вказує додаткову вимогу до реалізації трейту.

source: Associated types are placeholder types which are supplied by the trait implementation.
fa: تایپ‌های مرتبط تایپ‌هایی جایگزین هستند که توسط پیاده‌سازی trait تأمین می‌شوند.
pt_br: Tipos associados são tipos de espaço reservado que são fornecidos pela implementação do _trait_.
uk: Асоціативні типи - це типи-заповнювачі, які надаються реалізацією трейту.

source: Associated types are sometimes also called "output types". The key observation is that the implementer, not the caller, chooses this type.
fa: تایپ‌های مرتبط گاهی اوقات "تایپ‌های خروجی" نیز نامیده می‌شوند. نکته کلیدی این است که پیاده‌ساز، نه فراخواننده، این تایپ را انتخاب می‌کند.
pt_br: Os tipos associados são às vezes também chamados de "tipos de saída". A observação chave é que o implementador, e não o chamador, escolhe esse tipo.
uk: Асоціативні типи іноді також називають "вихідними типами". Ключовим зауваженням є те, що цей тип вибирає реалізатор, а не той, хто його викликає.

source: Many standard library traits have associated types, including arithmetic operators and `Iterator`.
fa: بسیاری از traitهای کتابخانه استاندارد دارای نوع‌های مرتبط هستند، از جمله اپراتورهای حسابی و `Iterator`.
pt_br: Muitos _traits_ da biblioteca padrão têm tipos associados, incluindo operadores aritméticos e `Iterator`.
uk: Багато стандартних бібліотечних трейтів мають асоційовані типи, включаючи арифметичні оператори та `Iterator`.

source: Supported traits can be automatically implemented for your custom types, as follows:
fa: Traitهای پشتیبانی‌شده می‌توانند به‌طور خودکار برای تایپ‌های سفارشی شما پیاده‌سازی شوند، به شرح زیر:
ja: サポートされているトレイトは、次のようにカスタム型に自動的に実装できます。
pt_br: Os _traits_ suportados podem ser implementados automaticamente para seus tipos personalizados, como segue:
uk: Підтримувані трейти можуть бути автоматично застосовані до ваших кастомних типів наступним чином:

source: // Default trait adds `default` constructor.
ja: // デフォルト トレイトで `default` コンストラクタを追加します。
pt_br: // O _trait_ `Default` adiciona um construtor `default`.
uk: // Трейт Default додає `default` конструктор .

source: // Clone trait adds `clone` method.
ja: // クローン トレイトで `clone` メソッドを追加します。
pt_br: // O _trait_ `Clone` adiciona um método `clone`.
uk: // Трейт Clone додає `clone` метод.

source: // Debug trait adds support for printing with `{:?}`.
ja: // デバッグ トレイトで、`{:?}` を使用した出力のサポートを追加します。
pt_br: // O _trait_ `Debug` adiciona suporte para impressão com `{:?}`.
uk: // Трейт Debug додає підтримку друку з `{:?}`.

source: Derivation is implemented with macros, and many crates provide useful derive macros to add useful functionality. For example, `serde` can derive serialization support for a struct using `#[derive(Serialize)]`.
fa: انتساب (Derivation) با استفاده از ماکروها پیاده‌سازی می‌شود و بسیاری از crateها ماکروهای مفیدی برای اضافه کردن قابلیت‌های کاربردی ارائه می‌دهند. به عنوان مثال، `serde` می‌تواند پشتیبانی از ترتیب را برای یک ساختار با استفاده از `[derive(Serialize)]#` فراهم کند.
ja: 導出はマクロで実装され、多くのクレートには有用な機能を追加するための便利な導出マクロが用意されています。たとえば、`serde` は `#[derive(Serialize)]` を使用して、構造体のシリアル化のサポートを導出できます。
pt_br: A derivação é implementada com macros e muitas _crates_ fornecem macros de derivação úteis para adicionar funcionalidades úteis. Por exemplo, `serde` pode derivar suporte de serialização para uma _struct_ usando `#[derive(Serialize)]`.
uk: Виведення реалізовано за допомогою макросів, і багато крейтів надають корисні макроси виведення для додавання корисної функціональності. Наприклад, `serde` може виводити підтримку серіалізації для структури за допомогою `#[derive(Serialize)]`.

source: Exercise: Logger Trait
fa: تمرین: Trait Logger
pt_br: Exercício: _Trait_ de Logger
uk: Вправа: Трейт логгера
