Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: These are just guidelines --- work with reviewers from `security@chromium.org` to work out the right way to become confident of the crate.
fa: این‌ها فقط دستورالعمل‌هایی هستند --- با بازبین‌هایی از `security@chromium.org` کار کنید تا راه درستی برای اطمینان از crate پیدا کنید.
pt_br: Estas são apenas diretrizes --- trabalhe com revisores do `security@chromium.org` para descobrir a maneira certa de se tornar confiante no _crate_.
uk: Це лише рекомендації - попрацюйте з рецензентами з `security@chromium.org`, щоб виробити правильний спосіб отримати впевненість в крейті.

source: Checking Crates into Chromium Source Code
fa: بررسی Crateها در کد منبع Chromium
pt_br: Verificando _Crates_ no Código-Fonte do Chromium
uk: Включення крейтів у вхідний код Chromium

source: `git status` should reveal:
fa: ‏ `git status` باید نشان دهد:
pt_br: `git status` deve revelar:
uk: `git status` повинен показати:

source: Crate code in `//third_party/rust/chromium_crates_io`
fa: کد Crate در `//third_party/rust/chromium_crates_io`
pt_br: Código do _crate_ em `//third_party/rust/chromium_crates_io`
uk: Код крейту в `//third_party/rust/chromium_crates_io`

source: Metadata (`BUILD.gn` and `README.chromium`) in `//third_party/rust/<crate>/<version>`
fa: متادیتا (`BUILD.gn` و `README.chromium`) in `//third_party/rust/<crate>/<version>`
pt_br: Metadata (`BUILD.gn` e `README.chromium`) em `//third_party/rust/<crate>/<versão>`
uk: Метадані (`BUILD.gn` та `README.chromium`) у `//third_party/rust/<crate>/<version>`

source: Please also add an `OWNERS` file in the latter location.
fa: لطفاً یک فایل`OWNERS` در مکان دیگر نیز اضافه کنید.
pt_br: Por favor, adicione também um arquivo `OWNERS` no último local.
uk: Будь ласка, додайте також файл `OWNERS` в останнє місце.

source: You should land all this, along with your `Cargo.toml` and `gnrt_config.toml` changes, into the Chromium repo.
fa: باید همه اینها را به همراه تغییرات `Cargo.toml` و `gnrt_config.toml` خود در مخزن Chromium قرار دهید.
pt_br: Você deve depositar tudo isso, junto com suas alterações `Cargo.toml` e `gnrt_config.toml`, no repositório do Chromium.
uk: Все це, разом зі змінами в файлах `Cargo.toml` і `gnrt_config.toml`, слід завантажити в репозиторій Chromium.

source: **Important**: you need to use `git add -f` because otherwise `.gitignore` files may result in some files being skipped.
fa: **مهم**: باید از `git add -f` استفاده کنید زیرا در غیر این صورت فایل‌های `.gitignore` ممکن است منجر به حذف برخی از فایل‌ها شود.
pt_br: **Importante**: você precisa usar `git add -f` porque, caso contrário, os arquivos `.gitignore` podem resultar na exclusão de alguns arquivos.
uk: **Важливо**: ви повинні використовувати `git add -f`, оскільки інакше файли `.gitignore` можуть бути пропущені.

source: As you do so, you might find presubmit checks fail because of non-inclusive language. This is because Rust crate data tends to include names of git branches, and many projects still use non-inclusive terminology there. So you may need to run:
pt_br: Ao fazer isso, você pode descobrir que as verificações de pré-envio (_presubmit_) falham por causa de linguagem não inclusiva. Isso ocorre porque os dados do _crate_ Rust tendem a incluir nomes de _branches_ do git, e muitos projetos ainda usam terminologia não inclusiva lá. Então você pode precisar executar:
uk: У процесі цього ви можете виявити, що перевірка перед відправкою не спрацьовує через неінклюзивну термінологію. Це пов'язано з тим, що дані крейту Rust, як правило, містять назви гілок git'а, а у багатьох проектах все ще використовується неінклюзивна термінологія. Тож, можливо, вам доведеться запустити:

source: As the OWNER of any third party Chromium dependency, you are [expected to keep it up to date with any security fixes](https://chromium.googlesource.com/chromium/src/+/main/docs/adding_to_third_party.md#add-owners). It is hoped that we will soon automate this for Rust crates, but for now, it's still your responsibility just as it is for any other third party dependency.
fa: شما به‌عنوان مالک هر وابستگی شخص ثالث Chromium، [انتظار می‌رود آن را با هرگونه اصلاحات امنیتی به‌روز نگه دارید](https://chromium.googlesource.com/chromium/src/+/main/docs/adding_to_third_party.md#add-owners). امید است که ما به زودی این را برای crateهای Rust خودکار کنیم، اما در حال حاضر، همچنان مسئولیت شماست، همانطور که برای هر وابستگی به شخص ثالث دیگر این مسئولیت را دارید.
pt_br: Como o OWNER de qualquer dependência de terceiros do Chromium, você é [responsável para mantê-lo atualizado com quaisquer correções de segurança](https://chromium.googlesource.com/chromium/src/+/main/docs/adding_to_third_party.md#add-owners). Espera-se que em breve automatizaremos isso para _crates_ Rust, mas, por enquanto, ainda é sua responsabilidade, assim como para qualquer outra dependência de terceiros.
uk: Як ВЛАСНИК будь-якої сторонньої залежності від Chromium, ви [маєте підтримувати її в актуальному стані з будь-якими виправленнями безпеки](https://chromium.googlesource.com/chromium/src/+/main/docs/adding_to_third_party.md#add-owners). Сподіваємося, що незабаром ми автоматизуємо цю процедуру для крейтів Rust, але наразі ви все ще несете відповідальність за це, як і за будь-яку іншу сторонню залежність.

source: Add [uwuify](https://crates.io/crates/uwuify) to Chromium, turning off the crate's [default features](https://doc.rust-lang.org/cargo/reference/features.html#the-default-feature). Assume that the crate will be used in shipping Chromium, but won't be used to handle untrustworthy input.
pt_br: Adicione [uwuify](https://crates.io/crates/uwuify) ao Chromium, desativando os [recursos padrão](https://doc.rust-lang.org/cargo/reference/features.html#the-default-feature) do _crate_. Suponha que o _crate_ será usado no release do Chromium, mas não será usado para lidar com entrada não confiável.
uk: Додайте [uwuify](https://crates.io/crates/uwuify) до Chromium, вимкнувши [можливості за замовчуванням](https://doc.rust-lang.org/cargo/reference/features.html#the-default-feature). Передбачається, що крейт буде використовуватися при постачанні Chromium, але не буде використовуватися для обробки ненадійних вхідних даних.

source: (In the next exercise we'll use uwuify from Chromium, but feel free to skip ahead and do that now if you like. Or, you could create a new [`rust_executable` target](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/rust_executable.gni) which uses `uwuify`).
fa: (در تمرین بعدی از uwuify برای Chromium استفاده خواهیم کرد، اما در صورت تمایل می‌توانید این کار را انجام دهید. همینطور می‌توانید یک هدف ['rust_executable'](https://source.chromium.org /chromium/chromium/src/+/main:build/rust/rust_executable.gni) جدید ایجاد کنید که از `uwuify` استفاده می‌کند).
pt_br: (No próximo exercício, usaremos uwuify do Chromium, mas sinta-se à vontade para pular e fazer isso agora, se desejar. Ou você pode criar um novo alvo [`rust_executable`](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/rust_executable.gni) que usa `uwuify`).
uk: (У наступній вправі ми будемо використовувати uwuify з Chromium, але ви можете зробити це прямо зараз, якщо хочете. Або ви можете створити нову ціль [`rust_executable`](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/rust_executable.gni), яка використовує `uwuify`).

source: Students will need to download lots of transitive dependencies.
fa: دانش‌آموزان باید تعداد زیادی وابستگی گذرا را دانلود کنند.
pt_br: Os alunos precisarão baixar várias dependências transitivas.
uk: Студентам потрібно буде завантажити багато транзитивних залежностей.

source: The total crates needed are:
fa: کل crateهای مورد نیاز عبارتند از:
pt_br: Os _crates_ totais necessários são:
uk: Загальна кількість необхідних крейтів:

source: `smallvec`, and
fa: `smallvec`, و
pt_br: `smallvec` e
uk: `smallvec`, та

source: If students are downloading even more than that, they probably forgot to turn off the default features.
fa: اگر دانش‌آموزان حتی بیشتر از آن دانلود می‌کنند، احتمالا فراموش کرده‌اند که ویژگی‌های پیش‌فرض را خاموش کنند.
pt_br: Se os alunos estiverem baixando ainda mais do que isso, eles provavelmente esqueceram de desativar os recursos padrão.
uk: Якщо студенти завантажують ще більше, то, ймовірно, вони забули вимкнути можливості за замовчуванням.

source: Thanks to [Daniel Liu](https://github.com/Daniel-Liu-c0deb0t) for this crate!
fa: با تشکر از [Daniel Liu](https://github.com/Daniel-Liu-c0deb0t) برای این crate!
pt_br: Obrigado a [Daniel Liu](https://github.com/Daniel-Liu-c0deb0t) por este _crate_!
uk: Дякуємо [Daniel Liu](https://github.com/Daniel-Liu-c0deb0t) за цей крейт!

source: Bringing It Together --- Exercise
fa: برای جمع‌آوری آن --- تمرین کنید
pt_br: Juntando Tudo --- Exercício
uk: Збираємо все докупи --- Вправа

source: In this exercise, you're going to add a whole new Chromium feature, bringing together everything you already learned.
fa: در این تمرین، می‌خواهید یک ویژگی کاملاً جدید Chromium را اضافه کنید و همه چیزهایی را که قبلاً یاد گرفته‌اید جمع آوری کنید.
pt_br: Neste exercício, você vai adicionar um novo recurso completo do Chromium, juntando tudo o que você já aprendeu.
uk: У цій вправі ви спробуєте додати абсолютно нову функцію Chromium, об'єднавши все, що ви вже вивчили.

source: The Brief from Product Management
fa: خلاصه‌ای از مدیریت محصول
pt_br: O Resumo da Gerência de Produto
uk: Коротка доповідь від продуктового менеджменту

source: A community of pixies has been discovered living in a remote rainforest. It's important that we get Chromium for Pixies delivered to them as soon as possible.
fa: جامعه‌ای از pixyها کشف شده است که در یک جنگل بارانی دور افتاده زندگی می کنند. مهم است که Chromium برای pixyها را در اسرع وقت به آنها تحویل دهیم.
pt_br: Uma comunidade de duendes foi descoberta vivendo em uma floresta tropical remota. É importante que entreguemos o Chromium para Duendes a eles o mais rápido possível.
uk: У віддаленому тропічному лісі виявили спільноту ельфів, які живуть там. Важливо, щоб ми доставили їм Chromium for Pixies якнайшвидше.

source: The requirement is to translate all Chromium's UI strings into Pixie language.
fa: لازمه کار این است که تمام stringهای رابط کاربری Chromium به زبان Pixie ترجمه شوند.
pt_br: O requisito é traduzir todas as strings de IU do Chromium para o idioma dos Duendes.
uk: Вимога полягає в тому, щоб перекласти всі рядки інтерфейсу користувача Chromium на мову ельфів.

source: There's not time to wait for proper translations, but fortunately pixie language is very close to English, and it turns out there's a Rust crate which does the translation.
fa: زمانی برای منتظر ماندن برای ترجمه‌های مناسب وجود ندارد، اما خوشبختانه زبان pixie بسیار نزدیک به انگلیسی است و به نظر می‌رسد که Rust crate ای وجود دارد که ترجمه را انجام می‌دهد.
pt_br: Não há tempo para esperar por traduções adequadas, mas, felizmente, o idioma dos duendes é muito próximo do inglês, e descobriu-se que há um _crate_ Rust que faz a tradução.
uk: Немає часу чекати на нормальний переклад, але, на щастя, мова ельфів дуже близька до англійської, і, виявляється, є крейт Rust, яка робить переклад.

source: In fact, you already [imported that crate in the previous exercise](https://crates.io/crates/uwuify).
fa: در واقع، شما قبلا [آن crate را در تمرین قبلی وارد کردید](https://crates.io/crates/uwuify).
pt_br: Na verdade, você já [importou esse _crate_ no exercício anterior](https://crates.io/crates/uwuify).
uk: Насправді, ви вже [імпортували цей крейт у попередній вправі](https://crates.io/crates/uwuify).

source: (Obviously, real translations of Chrome require incredible care and diligence. Don't ship this!)
fa: (بدیهی است که ترجمه های واقعی Chrome نیاز به دقت و تلاش باورنکردنی دارند. این مورد را ارسال نکنید!)
pt_br: (Obviamente, as traduções reais do Chrome exigem cuidado e diligência incríveis. Não lance isso!)
uk: (Очевидно, що справжні переклади для Chrome вимагають неймовірної ретельності та старанності. Не публікуйте це!)

source: Steps
fa: گام‌ها
pt_br: Passos
uk: Кроки

source: Modify `ResourceBundle::MaybeMangleLocalizedString` so that it uwuifies all strings before display. In this special build of Chromium, it should always do this irrespective of the setting of `mangle_localized_strings_`.
fa: ‏ `ResourceBundle::MaybeMangleLocalizedString` را تغییر دهید تا همه stringها را قبل از نمایش یکپارچه کند. در این build خاص Chromium، بدون در نظر گرفتن تنظیمات `mangle_localized_strings_` همیشه باید این کار را انجام دهد.
pt_br: Modifique `ResourceBundle::MaybeMangleLocalizedString` para que ele uwuifique todas as strings antes da exibição. Nesta compilação especial do Chromium, ele deve sempre fazer isso, independentemente da configuração de `mangle_localized_strings_`.
uk: Змініть `ResourceBundle::MaybeMangleLocalizedString` так, щоб він використовував uwuify для усіх рядків перед відображенням. У цій спеціальній збірці Chromium він має робити це завжди, незалежно від значення параметра `mangle_localized_strings_`.

source: If you've done everything right across all these exercises, congratulations, you should have created Chrome for pixies!
fa: اگر همه این تمرین‌ها را درست انجام داده‌اید، به شما تبریک می‌گوییم، باید Chrome را برای pixies ایجاد می‌کردید!
pt_br: Se você fez tudo certo em todos esses exercícios, parabéns, você deve ter criado o Chrome para duendes!
uk: Якщо ви зробили все правильно у всіх цих вправах, вітаємо, вам варто було створити Chrome для ельфів!

source: UTF16 vs UTF8. Students should be aware that Rust strings are always UTF8, and will probably decide that it's better to do the conversion on the C++ side using `base::UTF16ToUTF8` and back again.
fa: ‏ UTF16 در مقابل UTF8. دانش‌آموزان باید بدانند که stringهای Rust همیشه UTF8 هستند و احتمالاً تصمیم خواهند گرفت که بهتر است تبدیل را در سمت C++ با استفاده از `base::UTF16ToUTF8` انجام دهند و دوباره برگردند.
pt_br: UTF16 vs UTF8. Os alunos devem estar cientes de que as strings Rust são sempre UTF8 e provavelmente decidirão que é melhor fazer a conversão no lado C++ usando `base::UTF16ToUTF8` e vice-versa.
uk: UTF16 vs UTF8. Студенти повинні знати, що рядки Rust завжди мають кодування UTF8, і, ймовірно, вирішать, що краще зробити перетворення на стороні C++ за допомогою `base::UTF16ToUTF8` і навпаки.

source: If students decide to do the conversion on the Rust side, they'll need to consider [`String::from_utf16`](https://doc.rust-lang.org/std/string/struct.String.html#method.from_utf16), consider error handling, and consider which [CXX supported types can transfer a lot of u16s](https://cxx.rs/binding/slice.html).
fa: اگر دانش‌آموزان تصمیم بگیرند که تبدیل را در سمت Rust انجام دهند، باید [`String::from_utf16`](https://doc.rust-lang.org/std/string/struct.String.html#method را در نظر بگیرند. مدیریت خطا را در نظر بگیرید و در نظر داشته باشید که کدام [نوع های پشتیبانی شده از CXX می توانند تعداد زیادی از u16 ها را منتقل کنند](https://cxx.rs/binding/slice.html).
pt_br: Se os alunos decidirem fazer a conversão no lado Rust, eles precisarão considerar [`String::from_utf16`](https://doc.rust-lang.org/std/string/struct.String.html#method.from_utf16), considerar o tratamento de erros e considerar quais [tipos suportados pelo CXX podem transferir muitos u16s](https://cxx.rs/binding/slice.html).
uk: Якщо студенти вирішать виконати перетворення на стороні Rust, їм потрібно буде розглянути [`String::from_utf16`](https://doc.rust-lang.org/std/string/struct.String.html#method.from_utf16), обміркувати обробку помилок і визначити, які [CXX-підтримувані типи можуть передавати багато u16s](https://cxx.rs/binding/slice.html).

source: Students may design the C++/Rust boundary in several different ways, e.g. taking and returning strings by value, or taking a mutable reference to a string. If a mutable reference is used, CXX will likely tell the student that they need to use [`Pin`](https://doc.rust-lang.org/std/pin/). You may need to explain what `Pin` does, and then explain why CXX needs it for mutable references to C++ data: the answer is that C++ data can't be moved around like Rust data, because it may contain self-referential pointers.
fa: دانش‌آموزها ممکن است مرز C++/Rust را به روش های مختلف طراحی کنند، به عنوان مثال. گرفتن و برگرداندن stringها بر اساس مقدار، یا گرفتن یک مرجع قابل تغییر به یک string. اگر از یک مرجع قابل تغییر استفاده شود، CXX احتمالاً به دانش‌آموز می‌گوید که باید از [`Pin`](https://doc.rust-lang.org/std/pin/) استفاده کند. ممکن است لازم باشد توضیح دهید `Pin` چه می‌کند و سپس توضیح دهید که چرا CXX به آن برای ارجاع‌های قابل تغییر به داده‌های C++ نیاز دارد: پاسخ این است که داده‌های C++ را نمی‌توان مانند داده‌های Rust جابه‌جا کرد، زیرا ممکن است حاوی نشانگرهای خودارجاعی (self-referential pointers) باشد.
pt_br: Os alunos podem projetar o limite C++/Rust de várias maneiras diferentes, por exemplo, pegando e retornando strings por valor ou pegando uma referência mutável a uma string. Se uma referência mutável for usada, o CXX provavelmente dirá ao aluno que ele precisa usar [`Pin`](https://doc.rust-lang.org/std/pin/). Você pode precisar explicar o que `Pin` faz e, em seguida, explicar por que o CXX precisa dele para referências mutáveis a dados C++: a resposta é que os dados C++ não podem ser movidos como dados Rust, porque eles podem conter ponteiros auto-referenciais.
uk: Студенти можуть створити межу між C++ і Rust кількома різними способами, наприклад, приймати і повертати рядки за значенням, або приймати мутабельне посилання на рядок. Якщо використовується мутабільне посилання, CXX, ймовірно, скаже студенту, що потрібно використовувати [`Pin`](https://doc.rust-lang.org/std/pin/). Можливо, вам доведеться пояснити, що робить `Pin`, а потім пояснити, навіщо він потрібен CXX для мутабельних посилань на дані C++: відповідь полягає у тому, що дані C++ не можна переміщувати, як дані Rust, оскільки вони можуть містити самопосилальні вказівники.

source: The C++ target containing `ResourceBundle::MaybeMangleLocalizedString` will need to depend on a `rust_static_library` target. The student probably already did this.
fa: هدف C++ حاوی `ResourceBundle::MaybeMangleLocalizedString` باید به هدف `rust_static_library` وابسته باشد. دانش‌آموز احتمالاً از قبل این کار را انجام داده است.
pt_br: O alvo C++ contendo `ResourceBundle::MaybeMangleLocalizedString` precisará depender de um alvo `rust_static_library`. O aluno provavelmente já fez isso.
uk: Ціль C++, що містить `ResourceBundle::MaybeMangleLocalizedString`, повинна залежати від цілі `rust_static_biblioteka`. Студенти, ймовірно, вже зробили це.

source: The `rust_static_library` target will need to depend on `//third_party/rust/uwuify/v0_2:lib`.
fa: هدف `rust_static_library` باید به `//third_party/rust/uwuify/v0_2:lib` وابسته باشد.
pt_br: O alvo `rust_static_library` precisará depender de `//third_party/rust/uwuify/v0_2:lib`.
uk: Ціль `rust_static_library` має залежати від `//third_party/rust/uwuify/v0_2:lib`.

source: Solutions to the Chromium exercises can be found in [this series of CLs](https://chromium-review.googlesource.com/c/chromium/src/+/5096560).
fa: راه‌حل‌های تمرینات Chromium را می‌توانید در [این سری از CLs](https://chromium-review.googlesource.com/c/chromium/src/+/5096560) پیدا کنید.
pt_br: As soluções para os exercícios do Chromium podem ser encontradas nesta [série de CLs](https://chromium-review.googlesource.com/c/chromium/src/+/5096560).
uk: Рішення вправ з Chromium можна знайти в [цій серії CLs](https://chromium-review.googlesource.com/c/chromium/src/+/5096560).

source: Welcome to Bare Metal Rust
es: Te damos la bienvenida a Bare Metal Rust
fa: به Bare Metal Rust خوش آمدید
ja: ベアメタルRustへようこそ
pt_br: Bem-vindo ao Rust _Bare Metal_ 🦀
uk: Ласкаво просимо до Rust на голому залізі

source: This is a standalone one-day course about bare-metal Rust, aimed at people who are familiar with the basics of Rust (perhaps from completing the Comprehensive Rust course), and ideally also have some experience with bare-metal programming in some other language such as C.
es: Este es un curso independiente de un día sobre Rust bare-metal, dirigido a personas que están familiarizadas con los conceptos básicos de Rust (tal vez después de completar el curso Comprehensive Rust). Lo ideal sería que también tuvieran experiencia con la programación bare-metal en otros lenguajes, como C.
fa: این یک دوره مستقل یک روزه در مورد bare-metal Rust است که با هدف افرادی که با اصول Rust آشنا هستند (شاید از اتمام دوره جامع Rust) و در حالت ایده آل نیز تجربه برنامه‌نویسی bare-metal به زبان دیگری را دارند، مانند C می‌باشد.
ja: こちらはベアメタルRustに関する独立した１日コースです。対象としているのは、Rustの基本的な部分に関しては習得済みな人で（例えば、本講座で）、Cなどの他の言語でベアメタル開発の経験があると理想的です。
ko: 이 과정은 Rust에 대해 어느정도 경험이 있고 (아마도 Comprehensive Rust 과정을 통해) C와 같은 다른 언어로 bare-metal 프로그래밍을 해 본 사용자를 대상으로 하는 bare-metal Rust에 관한 독립적인 1일 과정입니다.
pt_br: Este é um curso independente de um dia sobre Rust _bare-metal_, destinado a pessoas que estão familiarizadas com o básico do Rust (talvez por completar o curso Comprehensive Rust), e idealmente também têm alguma experiência com programação _bare-metal_ em alguma outra linguagem como C.
uk: Це окремий одноденний курс про Rust на голому залізі, призначений для людей, які знайомі з основами Rust (можливо, після завершення комплексного курсу Rust), а в ідеалі також мають певний досвід програмування на голому залізі якоюсь іншою мовою, такою як C.

source: Today we will talk about 'bare-metal' Rust: running Rust code without an OS underneath us. This will be divided into several parts:
es: Hoy vamos a hablar de Rust "bare-metal": ejecutar código de Rust sin un sistema operativo. Se dividirá en varias partes:
fa: امروز ما در مورد'bare-metal' Rust صحبت خواهیم کرد: اجرای کد Rust بدون سیستم‌عامل در ادامه به چند بخش تقسیم خواهد شد:
ja: 今日、取り扱うのは、ベアメタルRustです。すなわち、OSなしでRustのコードを実行します。この章は以下のような構成になります:
ko: 오늘은 OS를 사용하지 않고 Rust 코드를 실행하는 'bare-metal' Rust에 관해 알아봅니다. 본 강의의 구성은 다음과 같습니다.
pt_br: Hoje falaremos sobre Rust _bare-metal_: executando código Rust sem um SO abaixo de nós. Isso será dividido em várias partes:
uk: Сьогодні ми поговоримо про Rust на 'голому залізі': запуск коду Rust без операційної системи під нами. Цей розділ буде розділено на кілька частин:

source: What is `no_std` Rust?
es: ¿Qué es `no_std` en Rust?
fa: این `no_std` Rust چیست؟
ja: `no_std` Rustとは?
ko: `no_std` Rust란 무엇인가요?
pt_br: O que é Rust `no_std`?
uk: Що таке `no_std` Rust?

source: Writing firmware for microcontrollers.
es: Escribir firmware para microcontroladores.
fa: نوشتنfirmware برای میکروکنترلرها.
ja: マイクロコントローラ向けのファームウェア開発。
ko: 마이크로컨트롤러용 펌웨어 작성
pt_br: Escrevendo firmware para microcontroladores.
uk: Написання мікропрограм для мікроконтролерів.

source: Writing bootloader / kernel code for application processors.
es: Escribir código bootloader o kernel para procesadores de aplicaciones.
fa: نوشتن کد bootloader / kernel برای پردازنده‌های برنامه.
ja: アプリケーションプロセッサ向けのブートローダ／カーネル開発。
ko: 애플리케이션 프로세서를 위한 부트로더 / 커널 코드 작성
pt_br: Escrevendo código de bootloader / kernel para processadores de aplicativos.
uk: Написання коду завантажувача/ядра для прикладних процесорів.

source: Some useful crates for bare-metal Rust development.
es: Algunos crates útiles para el desarrollo de Rust bare-metal.
fa: برخی از crateهای مفید برای توسعه bare-metal Rust.
ja: ベアメタルRust開発に役立つクレートの紹介。
ko: bare-metal Rust 개발을 위한 유용한 크레이트
pt_br: Alguns _crates_ úteis para o desenvolvimento de Rust _bare-metal_.
uk: Кілька корисних крейтів для розробки Rust на голому залізі.
