Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Both `RefCell` and `Cell` are `!Sync`, which means `&RefCell` and `&Cell` can't be passed between threads. This prevents two threads trying to access the cell at once.
fa: هر دو `RefCell` و `Cell` دارای `!Sync` هستند، به این معنی که `RefCell&` و `&Cell` نمی‌توانند بین نخ‌ها منتقل شوند. این امر مانع از دسترسی همزمان دو نخ به سلول می‌شود.
uk: І `RefCell`, і `Cell` є `!Sync`, що означає, що `&RefCell` і `&Cell` не можна передавати між потоками. Це запобігає спробам двох потоків одночасно отримати доступ до комірки.

source: You're working on implementing a health-monitoring system. As part of that, you need to keep track of users' health statistics.
es: Estás trabajando en la implementación de un sistema de monitorización de salud. Por ello, debes realizar un seguimiento de las estadísticas de salud de los usuarios.
fa: شما در حال پیاده‌سازی یک سیستم پایش سلامت هستید. به عنوان بخشی از این کار، نیاز دارید تا آمار سلامت کاربران را دنبال کنید.
ja: 健康管理システムの実装の一環として、ユーザーの健康に関する統計情報を追跡する必要があります。
ko: 당신은 건강 상태를 모니터링하는 시스템을 구현하는 일을 하고 있습니다. 그 일환으로 당신은 사용자의 건강 상태 통계를 추적해야합니다.
pt_br: Você está trabalhando na implementação de um sistema de monitoramento de saúde. Como parte disso, você precisa acompanhar as estatísticas de saúde dos usuários.
uk: Ви працюєте над впровадженням системи моніторингу здоров’я. У рамках цього вам потрібно відстежувати статистику здоров’я користувачів.

source: You'll start with a stubbed function in an `impl` block as well as a `User` struct definition. Your goal is to implement the stubbed out method on the `User` `struct` defined in the `impl` block.
fa: شما با یک تابع ابتدایی در بلوک `impl` و همچنین یک تعریف `struct` به نام `User` شروع خواهید کرد. هدف شما پیاده‌سازی متد ابتدایی در `struct` `User` است که در بلوک `impl` تعریف شده است.
ja: `impl` ブロックのスタブ関数と、`User` 構造体の定義がある状態から開始します。`User` 構造体の `impl` ブロックにおいてスタブ化された関数を実装することです。
pt_br: Você começará com um esboço de função em um bloco `impl` e também uma definição de `struct` `User`. Seu objetivo é implementar o método esboçado na `struct` `User` definida no bloco `impl`.
uk: Ви почнете із заглушки функції у блоці `impl`, а також з визначення структури `User`. Ваша мета — рреалізувати заглушений метод в структурі `User`, визначений у блоці `impl`.

source: Copy the code below to <https://play.rust-lang.org/> and fill in the missing method:
fa: کد زیر را به <https://play.rust-lang.org/> کپی کنید و متد‌های ناقص را تکمیل کنید:
ja: 以下のコードを <https://play.rust-lang.org/> にコピーし、実体がないメソッドの中身を実装します。
pt_br: Copie o código abaixo em <https://play.rust-lang.org/> e implemente os métodos que estão faltando:
uk: Скопіюйте код нижче в <https://play.rust-lang.org/> та заповніть відсутній метод:

source: "Update a user's statistics based on measurements from a visit to the doctor"
fa: "به‌روزرسانی آمار یک کاربر بر اساس اندازه‌گیری معبار بازدید از پزشک"
pt_br: "Atualiza as estatísticas de um usuário com base nas medições de uma visita ao médico"
uk: " Оновити статистику користувача на основі вимірювань під час візиту до лікаря"

source: "I'm {} and my age is {}"
fa: "من {} هستم و سن من {} است"
uk: "Мене звуть {}, а мій вік - {}"

source: A reference has a _lifetime_, which must not "outlive" the value it refers to. This is verified by the borrow checker.
fa: یک مرجع دارای _طول عمر_ است که نباید از ارزش مورد اشاره بیشتر باشد. این موضوع توسط بررسی‌کننده قرض‌ها تایید می‌شود.
ja: 参照にはライフタイムがあり、これは参照する値よりも「長く存続」してはなりません。これは借用チェッカーによって検証されます。
pt_br: Uma referência tem um _tempo de vida_ (lifetime), que não deve "sobreviver" ao valor ao qual se refere. Isso é verificado pelo _borrow checker_ (verificador de empréstimo).
uk: Посилання має _тривалість життя_, яка не повинна "пережити" значення, на яке воно посилається. Це перевіряється чекером запозичень.

source: The lifetime can be implicit - this is what we have seen so far. Lifetimes can also be explicit: `&'a Point`, `&'document str`. Lifetimes start with `'` and `'a` is a typical default name. Read `&'a Point` as "a borrowed `Point` which is valid for at least the lifetime `a`".
fa: طول عمر می‌تواند ضمنی باشد - این همان چیزی است که تا کنون مشاهده کرده‌ایم. طول عمرها می‌توانند صریح نیز باشند: `&'a Point`، `&'document str`. طول عمرها با `'` شروع می‌شوند و `'a` نام پیش‌فرض معمولی است. `&'a Point` را به عنوان "یک `Point` قرضی که برای حداقل طول عمر `a` معتبر است" بخوانید.
ja: これまで見てきたとおり、ライフタイムは暗黙に扱えますが、`&'a Point`、`&'document str` のように明示的に指定することもできます。ライフタイムは `'` で始まり、`'a` が一般的なデフォルト名です。`&'a Point` は、「少なくともライフタイム `a` の間は有効な、借用した `Point`」とと解釈します。
pt_br: O tempo de vida pode ser implícito - isso é o que vimos até agora. Os tempos de vida também podem ser explícitos: `&'a Point`, `&'document str`. Os tempos de vida começam com `'` e `'a` é um nome padrão típico. Leia `&'a Point` como "um `Point` emprestado que é válido por pelo menos o tempo de vida `a`".
uk: Тривалість життя може бути неявною - це те, що ми бачили досі. Часи життя також можуть бути явними: `&'a Point'', `&'document str''. Тривалість життя починається з `'`, а `'a` є типовим іменем за замовчуванням. Читати `&'a Point` як "запозичений `Point`, який є дійсним принаймні протягом тривалості життя `a`".

source: Lifetimes are always inferred by the compiler: you cannot assign a lifetime yourself. Explicit lifetime annotations create constraints where there is ambiguity; the compiler verifies that there is a valid solution.
fa: طول عمرها همیشه توسط کامپایلر استنتاج می‌شوند: شما نمی‌توانید به طور دستی طول عمر را اختصاص دهید. انتساب‌های صریح طول عمر محدودیت‌هایی ایجاد می‌کنند که در صورت وجود ابهام است؛ کامپایلر تأیید می‌کند که یک راه‌حل معتبر وجود دارد.
ja: ライフタイムは常にコンパイラによって推測されます。自分でライフタイムを割り当てることはできません。明示的なライフタイム アノテーションを使用すると、あいまいなところに制約を課すことができます。それに対し、コンパイラはその制約を満たすライフタイムを設定できることを検証します。
pt_br: Os tempos de vida são sempre inferidos pelo compilador: você não pode atribuir um tempo de vida por conta própria. Anotações explícitas de tempo de vida criam restrições onde há ambiguidade; o compilador verifica se há uma solução válida.
uk: Тривалість життя завжди визначається компілятором: ви не можете призначити час життя самостійно. Явні анотації часу життя створюють обмеження там, де існує неоднозначність; компілятор перевіряє, чи існує правильний розв'язок.

source: Lifetimes become more complicated when considering passing values to and returning values from functions.
fa: طول عمرها وقتی که به عبور مقادیر به توابع و بازگشت مقادیر از توابع می‌پردازیم پیچیده‌تر می‌شوند.
ja: 関数に値を渡し、関数から値を返すことを考慮する場合、ライフタイムはより複雑になります。
pt_br: Os tempos de vida se tornam mais complicados ao considerar a passagem de valores para e a devolução de valores de funções.
uk: Часи життя ускладнюються, якщо врахувати передачу значень у функції та повернення значень з них.

source: // What is the lifetime of p3?
ja: // p3 のライフタイムは？
pt_br: // Qual é o tempo de vida de p3?
uk: // Яка тривалість життя p3?

source: In this example, the compiler does not know what lifetime to infer for `p3`. Looking inside the function body shows that it can only safely assume that `p3`'s lifetime is the shorter of `p1` and `p2`. But just like types, Rust requires explicit annotations of lifetimes on function arguments and return values.
fa: در این مثال، کامپایلر نمی‌داند که طول عمر `p3` را چگونه استنباط کند. نگاه کردن به بدنه تابع نشان می‌دهد که تنها به‌طور ایمن می‌تواند فرض کند که طول عمر `p3` کوتاه‌تر از `p1` و `p2` است. اما مانند تایپ‌ها، راست نیاز به توضیحات صریح طول عمرها در آرگومان‌های تابع و مقادیر بازگشتی دارد.
ja: この例では、コンパイラは `p3` のライフライムを推測するこが出来ませんん。関数本体の内部を見ると、`p3` のライフタイムは `p1` と `p2` のいずれか短いしかし想定できることがわかります。ただし、型と同様に、Rust では関数の引数や戻り値にライフタイムの明示的なアノテーションが必要です。
uk: У цьому прикладі компілятор не знає, яку тривалість життя виводити для `p3`. Якщо зазирнути у тіло функції, то можна з упевненістю припустити, що час життя `p3` є меншим з двох: `p1` та `p2`. Але так само, як і типи, Rust вимагає явних анотацій тривалості життя для аргументів функції та значень, що повертаються.

source: Add `'a` appropriately to `left_most`:
fa: به تابع `left_most` به صورت مناسب `'a` را اضافه کنید:
ja: `left_most` に `'a` を適切に追加します。
pt_br: Adicione `'a` apropriadamente a `left_most` (mais à esquerda):
uk: Додає `'a` відповідним чином до `left_most`:

source: This says, "given p1 and p2 which both outlive `'a`, the return value lives for at least `'a`.
fa: این به این معناست که "با توجه به اینکه `p1` و `p2` هر دو از `'a` بیشتر عمر می‌کنند، مقدار بازگشتی برای مدت `'a` معتبر خواهد بود.
ja: これは、「p1 と p2 の両方が `'a` より長く存続すると、戻り値は少なくとも `'a` の間存続する」という意味になります。
pt_br: Isto diz, "dado p1 e p2 que sobrevivem a `'a`, o valor de retorno vive por pelo menos `'a`.
uk: Це говорить, що "за умови, що p1 і p2 живуть довше за `'a`, значення, що повертається, живе принаймні `'a`.

source: In common cases, lifetimes can be elided, as described on the next slide.
fa: در موارد معمول، عمر متغیرها می‌تواند نادیده گرفته شود، همانطور که در اسلاید بعدی توضیح داده شده است.
ja: 一般的なケースでは、次のスライドで説明するようにライフタイムを省略できます。
pt_br: Em casos comuns, os tempos de vida podem ser omitidos, como descrito no próximo slide.
uk: У поширених випадках час життя можна опустити, як описано на наступному слайді.

source: Lifetimes in Function Calls
es: Tiempos de Vida en Llamadas a Función
fa: طول عمر در فراخوانی‌ توابع
ja: 関数とライフタイム
ko: 함수 호출에서의 수명
pt_br: Tempos de vida (Lifetimes) em Chamadas de Função
uk: Тривалість життя у викликах функцій

source: Lifetimes for function arguments and return values must be fully specified, but Rust allows lifetimes to be elided in most cases with [a few simple rules](https://doc.rust-lang.org/nomicon/lifetime-elision.html). This is not inference -- it is just a syntactic shorthand.
fa: عمرهای مربوط به آرگومان‌های تابع و مقادیر بازگشتی باید به طور کامل مشخص شوند، اما Rust اجازه می‌دهد عمرها در بیشتر موارد با [چند قانون ساده](https://doc.rust-lang.org/nomicon/lifetime-elision.html) نادیده گرفته شوند. این مسئله استنتاج نیست -- بلکه تنها یک اصطلاح نوشتاری کوتاه است.
ja: 関数の引数や戻り値のライフタイムは完全に指定する必要がありますが、Rust ではほとんどの場合、[いくつかの簡単なルール](https://doc.rust-lang.org/nomicon/lifetime-elision.html)により、ライフタイムを省略できます。これは推論ではなく、構文の省略形にすぎません。
pt_br: Tempos de vida para argumentos de função e valores de retorno precisam ser completamente especificados, mas o Rust permite que eles sejam omitidos na maioria das vezes com [algumas regras simples](https://doc.rust-lang.org/nomicon/lifetime-elision.html). Isso não é inferência - é apenas uma abreviação sintática.
uk: Тривалість життя аргументів функції та значень, що повертаються, має бути повністю вказана, але Rust дозволяє у більшості випадків не вказувати тривалість життя за допомогою [кількох простих правил](https://doc.rust-lang.org/nomicon/lifetime-elision.html). Це не виведення - це просто синтаксичне скорочення.

source: Each argument which does not have a lifetime annotation is given one.
fa: هر آرگومان که فاقد یک lifetime annotation است، یک عمر به آن اختصاص داده می‌شود.
ja: ライフタイム アノテーションが付いていない各引数には、1 つのライフタイムが与えられます。
pt_br: Cada argumento que não tem uma anotação de tempo de vida é dado um.
uk: Кожному аргументу, який не має анотації тривалості життя, присвоюється одна.

source: If there is only one argument lifetime, it is given to all un-annotated return values.
fa: اگر تنها یک عمر برای آرگومان وجود داشته باشد، به تمام مقادیر بازگشتی که حاشیه‌نویسی نشده‌اند، اختصاص داده می‌شود.
ja: 引数のライフタイムが 1 つしかない場合、アノテーションのない戻り値すべてにそのライフタイムが与えられます。
pt_br: Se houver apenas um tempo de vida de argumento, ele é dado a todos os valores de retorno não anotados.
uk: Якщо існує лише одна тривалість життя аргументу, то вона надається всім неанотованим значенням, що повертаються.

source: If there are multiple argument lifetimes, but the first one is for `self`, that lifetime is given to all un-annotated return values.
fa: اگر چندین عمر آرگومان وجود داشته باشد و اولین آن برای `self` باشد، آن عمر به تمام مقادیر بازگشتی که حاشیه‌نویسی نشده‌اند، اختصاص داده می‌شود.
ja: 引数のライフタイムが複数あり、最初のライフタイムが `self` である場合、アノテーションのない戻り値すべてにそのライフタイムが与えられます。
pt_br: Se houver vários tempos de vida de argumento, mas o primeiro for para `self` (_self_), esse tempo de vida é dado a todos os valores de retorno não anotados.
uk: Якщо існує декілька тривалостей життя аргументів, але перша з них призначена для `self`, ця тривалість надається усім неанотованим значенням повернення.

source: In this example, `cab_distance` is trivially elided.
fa: در این مثال، `cab_distance` به طور خودکار حذف می‌شود.
ja: この例では、`cab_distance` に関するライフタイムの記述は省略されています。
pt_br: Neste exemplo, `cab_distance` é trivialmente omitido.
uk: У цьому прикладі `cab_distance` тривіально вилучено.

source: The `nearest` function provides another example of a function with multiple references in its arguments that requires explicit annotation.
fa: تابع `nearest` مثال دیگری از تابعی است که با ارجاعات متعدد در آرگومان‌هایش نیاز به حاشیه‌نویسی صریح دارد.
ja: `nearest` 関数は、明示的なアノテーションを必要とする複数の参照を引数に含む関数のもう一つの例です。
pt_br: A função `nearest` fornece outro exemplo de uma função com várias referências em seus argumentos que requer anotação explícita.
uk: Функція `nearest` є ще одним прикладом функції з декількома посиланнями в аргументах, яка потребує явної анотації.

source: Try adjusting the signature to "lie" about the lifetimes returned:
fa: امضا را طوری تنظیم کنید که "دروغ" بگوید درباره طول عمر مقادیری که برگشت داده می‌شوند:
ja: 返されるライフタイムについて嘘のアノテーションを付けるようにシグネチャを調整してみましょう。
pt_br: Tente ajustar a assinatura para "mentir" sobre os tempos de vida retornados:
uk: Спробуйте налаштувати сигнатуру на "брехню" про повернуту тривалість життя:

source: This won't compile, demonstrating that the annotations are checked for validity by the compiler. Note that this is not the case for raw pointers (unsafe), and this is a common source of errors with unsafe Rust.
fa: این کد کامپایل نخواهد شد، که نشان‌دهنده این است که برچسب‌های طول عمر توسط کامپایلر برای اعتبارسنجی بررسی می‌شوند. توجه داشته باشید که این وضعیت برای اشاره‌گرهای خام (ناامن) صدق نمی‌کند و این یکی از منابع رایج خطاها در Rust ناامن است.
ja: そうするとコンパイルが通らなくなります。これは、すなわち、コンパイラがアノテーションの妥当性をチェックしているということを示すものです。ただし、これは生のポインタ（安全ではない）には当てはまりません。アンセーフRustを使用する場合に、これはよくあるエラーの原因となっています。
pt_br: Isso não irá compilar, demonstrando que as anotações são verificadas quanto à validade pelo compilador. Observe que esse não é o caso dos ponteiros brutos (_raw pointers_) (inseguros), e essa é uma fonte comum de erros com Rust inseguro.
uk: Це не скомпілюється, демонструючи, що компілятор перевіряє анотації на валідність. Зауважте, що це не стосується сирих вказівників (небезпечних), і це є поширеним джерелом помилок у небезпечному Rust.

source: Students may ask when to use lifetimes. Rust borrows _always_ have lifetimes. Most of the time, elision and type inference mean these don't need to be written out. In more complicated cases, lifetime annotations can help resolve ambiguity. Often, especially when prototyping, it's easier to just work with owned data by cloning values where necessary.
fa: دانش‌آموزان ممکن است بپرسند که چه زمانی باید از طول عمرها استفاده کرد. در Rust، _همیشه_ برای قرض‌ها طول عمر وجود دارد. بیشتر مواقع، حذف و استنباط تایپ به این معنی است که نیازی به نوشتن این طول عمرها نیست. در موارد پیچیده‌تر، برچسب‌های طول عمر می‌توانند به حل ابهام کمک کنند. اغلب، به‌ویژه در هنگام پروتوتایپ‌سازی، راحت‌تر است که با داده‌های مالکیت‌شده کار کنید و مقادیر را در صورت لزوم کلون کنید.
ja: ライフタイムをどのような場合に使うべきか、受講者から質問を受けるかもしれません。Rust の借用では常にライフタイムを使用します。ほとんどの場合、省略や型推論 により、ライフタイムを記述する必要はありません。より複雑なケースでは、ライフタイム アノテーションを使用することであいまいさを解決できます。多くの場合、特にプロトタイピングでは、必要に応じて値をクローニングして所有データを処理する方が簡単です。
pt_br: Os alunos podem perguntar quando usar tempos de vida. Os empréstimos do Rust sempre têm tempos de vida. Na maioria das vezes, a omissão e a inferência de tipo significam que eles não precisam ser escritos. Em casos mais complicados, as anotações de tempo de vida podem ajudar a resolver a ambiguidade. Muitas vezes, especialmente ao prototipar, é mais fácil trabalhar com dados _owned_ (_owned data_) clonando valores quando necessário.
uk: Учні можуть запитати, коли слід використовувати тривалість життя. Rust запозичення _завжди_ мають тривалість життя. Здебільшого, опускання та виведення типу означають, що їх не потрібно прописувати. У більш складних випадках, анотації тривалості життя можуть допомогти вирішити неоднозначність. Часто, особливо при створенні прототипів, простіше просто працювати з данними якими володіють, клонуючи значення там, де це необхідно.

source: Lifetimes in Data Structures
es: Tiempos de vida en estructuras de datos
ja: データ構造とライフタイム
ko: 구조체에서의 수명
pt_br: Tempos de Vida em Estruturas de Dados
uk: Тривалість життя в структурах даних

source: If a data type stores borrowed data, it must be annotated with a lifetime:
es: Si un tipo de datos almacena datos prestados, se debe anotar con tiempo de vida:
fa: اگر یک تایپ داده داده‌های قرضی را ذخیره کند، باید با یک طول عمر مشخص شود:
ja: データ型が借用データを内部に保持する場合、ライフタイムアノテーションを付ける必要があります。
ko: 어떤 타입이 빌려온 데이터를 저장하고 있다면, 반드시 수명을 표시해야 합니다:
pt_br: Se um tipo de dados armazena dados emprestados, ele deve ser anotado com um tempo de vida:
uk: Якщо тип даних зберігає запозичені дані, він повинен мати анотацію із зазначенням тривалості життя:

source: In the above example, the annotation on `Highlight` enforces that the data underlying the contained `&str` lives at least as long as any instance of `Highlight` that uses that data.
es: En el ejemplo anterior, la anotación en `Highlight` hace que los datos subyacentes a la `&str` contenida tengan al menos la misma duración que cualquier instancia de `Highlight` que utilice esos datos.
fa: در مثال بالا، حاشیه‌نویسی بر روی `Highlight` تضمین می‌کند که داده‌های زیرین `str&` به مدت حداقل برابر با هر نمونه از `Highlight` که از آن داده استفاده می‌کند، زنده بماند.
ja: 上記の例では、`Highlight` のアノテーションにより、内包される`&str` の参照先のデータは、少なくともそのデータを使用する `Highlight` のインスタンスが存在する限り存続しなければならなくなります。
ko: 위의 예제에서 `Highlight`의 어노테이션(`<'doc>`)은 적어도 `Highlight` 인스턴스가 살아있는 동안에는 그 내부의 `&str`가 가리키는 데이터 역시 살아있어야 한다는 것을 의미합니다.
pt_br: No exemplo acima, a anotação em `Highlight` impõe que os dados subjacentes ao `&str` contido vivam pelo menos tanto quanto qualquer instância de `Highlight` que use esses dados.
uk: У наведеному вище прикладі анотація до `Highlight` гарантує, що дані, які лежать в основі `&str`, існують принаймні стільки, скільки існує будь-який екземпляр `Highlight`, який використовує ці дані.

source: If `text` is consumed before the end of the lifetime of `fox` (or `dog`), the borrow checker throws an error.
es: Si `text` se consume antes de que acabe el tiempo de vida de `fox` (o `dog`), el _borrow checker_ (verificador de préstamos) muestra un error.
fa: اگر `text` قبل از پایان عمر `fox` (یا `dog`) مصرف شود، بررسی‌کننده‌ی قرض (borrow checker) خطا می‌دهد.
ja: `fox`（または `dog`）のライフタイムが終了する前に `text` が使用されると、借用チェッカーはエラーをスローします。
ko: 만약 `text`가 `fox` (혹은 `dog`)의 수명이 다하기 전에 `erase`함수 호출 등으로 사라지게 된다면 빌림 검사기가 에러를 발생합니다.
pt_br: Se `text` for consumido antes do final do tempo de vida de `fox` (ou `dog`), o _borrow checker_ (verificador de empréstimo) lançará um erro.
uk: Якщо `text` буде спожито до закінчення життя `fox` (або `dog`), перевірка запозичень видасть помилку.

source: Types with borrowed data force users to hold on to the original data. This can be useful for creating lightweight views, but it generally makes them somewhat harder to use.
es: Los tipos con datos prestados (_borrowed_) obligan a los usuarios a conservar los datos originales. Esto puede ser útil para crear vistas ligeras aunque, por lo general, hace que sean un poco más difíciles de usar.
fa: تایپ‌های دارای داده‌های قرضی (borrowed data) کاربران را مجبور می‌کنند تا داده‌های اصلی را نگه دارند. این می‌تواند برای ایجاد نمایه‌های سبک مفید باشد، اما معمولاً استفاده از آنها را تا حدی دشوارتر می‌کند.
ja: 消費したデータが含まれる型では、ユーザーは元のデータを保持せざるを得なくなります。これは軽量のビューを作成する場合に便利ですが、一般的には使いにくくなります。
ko: 빌린 데이터를 가지고 있는 타입은 사용자로 하여금 원본 데이터를 유지하도록 강제합니다. 이런 타입은 경량 뷰(lightweight view)를 만드는데 유용하지만, 이 제약 조건 때문에 이런 타입을 사용하는 것이 쉽지만은 않습니다.
pt_br: Tipos com _borrowed data_ (dados emprestados) forçam os usuários a manter os dados originais. Isso pode ser útil para criar exibições leves, mas geralmente as tornam um pouco mais difíceis de usar.
uk: Типи з запозиченими даними змушують користувачів зберігати оригінальні дані. Це може бути корисно для створення полегшених представлень, але загалом робить їх дещо складнішими у використанні.

source: When possible, make data structures own their data directly.
es: Siempre que sea posible, haz que las estructuras de datos sean propietarias directas de sus datos.
fa: در صورت امکان، داده‌های ساختارها را به طور مستقیم مالکیت کنید.
ja: 可能であれば、データ構造がデータを直接所有できるようにします。
ko: 따라서, 가능하다면, 구조체가 자신의 데이터를 직접 소유하도록 하는 것이 좋습니다.
pt_br: Quando possível, faça com que as estruturas de dados possuam (_own_) seus dados diretamente.
uk: Якщо це можливо, зробіть так, щоб структури даних безпосередньо володіли своїми даними.

source: Some structs with multiple references inside can have more than one lifetime annotation. This can be necessary if there is a need to describe lifetime relationships between the references themselves, in addition to the lifetime of the struct itself. Those are very advanced use cases.
es: Algunas estructuras con varias referencias dentro pueden tener más de una anotación de tiempo de vida. Esto puede ser necesario si hay que describir las relaciones de tiempo de vida entre las propias referencias, además del tiempo de vida de la propia estructura. Estos son casos prácticos muy avanzados.
fa: برخی از ساختارهای داده که شامل چندین ارجاع هستند، ممکن است نیاز به چندین نشانه‌گذاری عمر داشته باشند. این امر می‌تواند ضروری باشد اگر بخواهید روابط عمری بین ارجاعات مختلف را به علاوه عمر ساختار خود توصیف کنید. این موارد بسیار پیشرفته هستند.
ja: 内部に複数の参照がある構造体には、複数のライフタイム アノテーションが含まれる場合があります。これが必要になるのは、構造体自体のライフタイムだけでなく、参照同士のライフタイムの関係を記述する必要がある場合です。これは非常に高度なユースケースです。
ko: 한 구조체안에 여러 참조가 있으면서, 이 참조들의 수명이 서로 다르게 지정되는 경우도 있습니다. 이는 참조와 그 구조체 간의 관계 뿐만이 아니라, 그 참조들 사이의 수명 관계를 설명해야 할 경우에 필요합니다. 매우 고급 기술입니다.
pt_br: Algumas _structs_ com múltiplas referências internas podem ter mais de uma anotação de tempo de vida. Isso pode ser necessário se houver a necessidade de descrever-se relacionamentos de tempo de vida entre as próprias referências, além do tempo de vida da própria _struct_. Esses são casos de uso bastante avançados.
uk: Деякі структури з декількома посиланнями всередині можуть мати більше ніж одну анотацію про тривалість життя. Це може знадобитися, якщо потрібно описати зв'язки між самими посиланнями впродовж тривалості життя, на додачу до тривалості життя самої структури. Це дуже просунуті випадки використання.
