Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Rust strings are UTF-8 encoded and can contain any Unicode character.
es: Las cadenas de Rust están codificadas en UTF-8 y pueden contener caracteres Unicode.
fa: رشته‌های Rust دارای انکودینگ UTF-8 هستند و می‌توانند شامل هر کاراکتر یونیکد باشند.
ja: Rustの文字列はUTF-8でエンコードされ、どんなUnicode文字でも含む事ができます。
ko: 러스트의 문자열은 UTF-8로 인코딩되며 이모지와 같은 유니코드 문자를 포함할 수 있습니다.
pt_br: As strings Rust são codificadas em UTF-8 e podem conter qualquer caractere Unicode.
uk: Рядки в Rust мають кодування UTF-8 і можуть містити будь-які символи Unicode.

source: This slide tries to make the students comfortable with Rust code. They will see a ton of it over the next four days so we start small with something familiar.
fa: این اسلاید سعی می کند دانشجویان با کد Rust احساس راحتی کنند. آنها در سه روز آینده خیلی از این کدها خواهند دید، بنابراین با یک چیز آشنا شروع می کنیم..
pt_br: Este slide tenta deixar os alunos familiarizados com o código em Rust. Eles irão ver bastante conteúdo nos próximos quatro dias, então começamos devagar com algo familiar.
uk: Цей слайд спрямований на те, щоб студенти звикли працювати з кодом Rust. Вони побачать масу цього протягом наступних чотирьох днів, тож ми починаємо з чогось малого та знайомого.

source: Rust is very much like other languages in the C/C++/Java tradition. It is imperative and it doesn't try to reinvent things unless absolutely necessary.
es: Rust es muy similar a otros lenguajes, como C, C++ o Java. Es imperativo y no intenta reinventar las cosas a menos que sea absolutamente necesario.
fa: زبان Rust, زبان بسیار شبیه به سایر زبان‌های خانواده C/<span dir=ltr>C++</span>/Java است.یک زبان امری است (imperative) و سعی نمی‌کند چیزی را مگر اینکه کاملاً ضروری باشد، دوباره اختراع کند.
ko: 러스트는 C/C++/Java와 같은 전통적인 다른 언어와 매우 유사합니다. 러스트는 절차적 언어입니다. 정말로 필요한 경우가 아니라면, 러스트는 이미 존재하는 것을 새로 구현하려고 하지 않습니다.
pt_br: Rust é muito parecido com outras linguagens na tradição C/C++/Java. É imperativo (não funcional) e não tenta reinventar as coisas, a menos que seja absolutamente necessário.
uk: Rust дуже схожий на інші традиціїні мови як C/C++/Java. Це навмисно, і він не намагається винайти щось заново, якщо це не є абсолютно необхідним.

source: Rust is modern with full support for things like Unicode.
es: Rust es moderno y totalmente compatible con sistemas como Unicode.
fa: زبان Rust, یک زبان مدرن با پشتیبانی کامل از چیزهایی مانند یونیکد است.
ko: 러스트는 유니코드 지원과 같은 현대 언어의 특징을 전부 지원합니다.
pt_br: Rust é moderno com suporte total para coisas como Unicode.
uk: Rust сучасний із повною підтримкою таких речей, як Unicode.

source: Rust uses macros for situations where you want to have a variable number of arguments (no function [overloading](../control-flow-basics/functions.md)).
fa: Rust از ماکروها برای موقعیت‌هایی استفاده می‌کند که می‌خواهید تعداد متغیری از آرگومان‌ها داشته باشید (بدون [اورلودینگ](../control-flow-basics/functions.md) تابع).
pt_br: Rust usa macros para situações em que você deseja ter um número variável de argumentos (sem [sobrecarga de função](../control-flow-basics/functions.md)).
uk: Rust використовує макроси для ситуацій, коли потрібно мати змінну кількість аргументів (немає [перевантаження](basic-syntax/functions-interlude.md) функцій).

source: Macros being 'hygienic' means they don't accidentally capture identifiers from the scope they are used in. Rust macros are actually only [partially hygienic](https://veykril.github.io/tlborm/decl-macros/minutiae/hygiene.html).
es: Que las macros sean 'higiénicas' significa que no capturan accidentalmenteidentificadores del ámbito en el que se utilizan. En realidad, las macros de Rust solo son [parcialmente higiénicas](https://veykril.github.io/tlborm/decl-macros/minutiae/hygiene.html).
fa: «هاجنیک» (`hygienic‍`) بودن ماکرو به این معنی است که آنها به طور تصادفی شناسه‌ها را از محدوده‌ای که در آن استفاده می‌شوند، ذخیره نمی‌کنند. ماکروهای Rust در واقع فقط [تا حدی هاجنیک](https://veykril.github.io/tlborm/decl-macros/minutiae/hygiene.html هستند.
ko: 똑똑한 매크로(hygienic macro)는 매크로가 사용되는 스코프에서 의도치 않게 변수를 가로채지 않습니다. 사실 러스트 매크로는 완전히 hygenic하지는 않습니다. [링크](https://veykril.github.io/tlborm/decl-macros/minutiae/hygiene.html)를 참고하세요.
pt_br: Macros "higiênicas" significam que elas não capturam acidentalmente identificadores do escopo em que são usadas. As macros em Rust são, na verdade, apenas [parcialmente "higiênicas"](https://veykril.github.io/tlborm/decl-macros/minutiae/hygiene.html).
uk: Макроси є «гігієнічними» що означає, що вони випадково не захоплюють ідентифікатори з області, у якій вони використовуються. Макроси Rust насправді лише [частково гігієнічні](https://veykril.github.io/tlborm/decl-macros/minutiae/hygiene .html).

source: Rust is multi-paradigm. For example, it has powerful [object-oriented programming features](https://doc.rust-lang.org/book/ch17-00-oop.html), and, while it is not a functional language, it includes a range of [functional concepts](https://doc.rust-lang.org/book/ch13-00-functional-features.html).
es: Rust es un lenguaje multiparadigma. Por ejemplo, cuenta con [funciones de programación orientadas a objetos](https://doc.rust-lang.org/book/ch17-00-oop.html) y, aunque no es un lenguaje funcional, incluye una serie de [conceptos funcionales](https://doc.rust-lang.org/book/ch13-00-functional-features.html).
fa: زبان Rust, یک زبان چند پارادایمی است. به عنوان مثال، دارای ویژگی‌های قدرتمند [برنامه نویسی شی‌گرا](https://doc.rust-lang.org/book/ch17-00-oop.html) است و در حالی که یک زبان فانکشنال(`functional‍`) نیست، شامل طیف وسیعی از [مفاهیم فانکشنال](https://doc.rust-lang.org/book/ch13-00-functional-features.html) است.
ja: Rust はマルチパラダイムです。たとえば、強力な [オブジェクト指向プログラミング機能](https://doc.rust-lang.org/book/ch17-00-oop.html) を備えている一方、非関数型言語であるにもかかわらず、さまざまな [関数的概念](https://doc.rust-lang.org/book/ch13-00-functional-features.html) を内包しています。
ko: 러스트는 멀티 패러다임 언어입니다. 예를 들어 강력한 [객체 지향 프로그래밍 기능](https://doc.rust-lang.org/book/ch17-00-oop.html)을 지원하기도 하며, 함수형 언어로 분류되지는 않지만 폭넓은 범위의 [함수형 컨셉](https://doc.rust-lang.org/book/ch13-00-functional-features.html)을 지원합니다.
pt_br: Rust é multi-paradigma. Por exemplo, ele possui [funcionalidades de programação orientada à objetos](https://doc.rust-lang.org/book/ch17-00-oop.html) poderosas, e, embora não seja uma linguagem _funcional_, inclui uma série de [conceitos _funcionais_](https://doc.rust-lang.org/book/ch13-00-functional-features.html).
uk: Rust є мультипарадигмою. Наприклад, він має потужні [функції об’єктно-орієнтованого програмування](https://doc.rust-lang.org/book/ch17-00-oop.html), і, хоча це не функціональна мова, він включає діапазон [функціональних понять](https://doc.rust-lang.org/book/ch13-00-functional-features.html).

source: Rust provides type safety via static typing. Variable bindings are made with `let`:
fa: زبان Rust از طریق سیستم تایپ استاتیک, ایمینی نوع را فراهم می‌کند. به صورت پیشفرض تعریف متغییر ها از نوع «غیر قابل تغییر» (immutable) است:
ja: Rust は静的型付けによって型安全性を提供します。変数のバインディングは `let` を使用して行います。
pt_br: Rust fornece segurança de tipo por meio de tipagem estática. Variáveis são vinculadas com `let` (_let bindings_):
uk: Rust забезпечує безпеку типів за допомогою статичної типізації. Прив'язки змінних створюються за допомогою `let`:

source: Uncomment the `x = 20` to demonstrate that variables are immutable by default. Add the `mut` keyword to allow changes.
fa: برای نشان دادن اینکه متغیرها به طور پیش‌فرض تغییرناپذیر هستند، کامنت "x = 20" را حذف کنید. برای اجازه دادن به تغییرات، کلمه کلیدی «mut» را اضافه کنید.
ja: `x = 20` のコメント化を解除して、変数がデフォルトで不変であることを示します。変更を許可するには、`mut` キーワードを追加します。
pt_br: Remova o comentário em `x = 20` para demonstrar que as variáveis são imutáveis por padrão. Adicione a palavra-chave `mut` para permitir alterações.
uk: Відкоментуйте `x = 20`, щоб продемонструвати, що змінні за замовчуванням є незмінними. Додайте ключове слово `mut`, щоб дозволити зміну.

source: The `i32` here is the type of the variable. This must be known at compile time, but type inference (covered later) allows the programmer to omit it in many cases.
fa: «i32» در اینجا نوع متغیر است. این باید در زمان کامپایل شناخته شود، اما استنتاج نوع (که بعداً پوشش داده می شود) به برنامه نویس اجازه می دهد تا در بسیاری از موارد آن را حذف کند.
ja: ここでの `i32` は変数の型です。これはコンパイル時に指定する必要がありますが、多くの場合、プログラマーは型推論（後述）を使用することでこれを省略できます。
pt_br: O `i32` aqui é o tipo da variável. Isso deve ser conhecido em tempo de compilação, mas a inferência de tipo (abordada posteriormente) permite que o programador o omita em muitos casos.
uk: Тут `i32` - це тип змінної. Він має бути відомий під час компіляції, але виведення типів (розглядається пізніше) дозволяє програмісту у багатьох випадках не вказувати його.

source: Here are some basic built-in types, and the syntax for literal values of each type.
fa: در اینجا چند نوع پایه داخلی و نحو برای مقادیر تحت اللفظی هر نوع آورده شده است.
ja: 基本的な組み込み型と、各型のリテラル値の構文を以下に示します。
pt_br: Aqui estão alguns tipos básicos integrados, e a sintaxe para valores literais de cada tipo.
uk: Нижче наведено деякі основні вбудовані типи та синтаксис для літеральних значень кожного типу.

source: Types
es: Tipos
fa: انواع
ja: 型
ko: 타입
pt_br: Tipos
uk: Типи

source: Literals
es: Literales
fa: مقادیر ثابت
ja: リテラル
ko: 리터럴 값
pt_br: Literais
uk: Літерали

source: Signed integers
es: Enteros con signo
fa: اعداد صحیح علامت‌دار
ja: 符号付き整数
ko: 부호있는 정수
pt_br: Inteiros com sinal
uk: Цілі числа зі знаком

source: Unsigned integers
es: Enteros sin signo
fa: اعداد صحیح مثبت
ja: 符号なし整数
ko: 부호없는 정수
pt_br: Inteiros sem sinal
uk: Беззнакові цілі числа

source: Floating point numbers
es: Números de coma flotante
fa: اعداد با ممیز شناور
ja: 浮動小数点数
ko: 부동소수
pt_br: Números de ponto flutuante
uk: Числа з плаваючою комою

source: Unicode scalar values
es: Valores escalares Unicode
fa: مقادیر عددی یونیکد
ja: Unicode スカラー値
ko: 유니코드 문자
pt_br: Valores escalares Unicode
uk: Скалярні значення Unicode

source: Booleans
es: Booleanos
fa: بولین‌ها
ja: ブール値
ko: 불리언
pt_br: Booleanos
uk: Логічні значення

source: The types have widths as follows:
es: Los tipos tienen la siguiente anchura:
fa: اندازه تایپ‌ها به شرح زیر است:
ja: 各型の幅は次のとおりです。
ko: 각 타입의 크기는 다음과 같습니다:
pt_br: Os tipos têm os seguintes tamanhos:
uk: Типи мають наступну ширину:

source: `iN`, `uN`, and `fN` are _N_ bits wide,
es: `iN`, `uN`, and `fN` son _N_ bits de capacidad,
fa: `iN`, `uN`و `fN` به اندازه _N_ حافظه اشغال می‌کنند.,
ja: `iN`、`uN`、`fN` は _N_ ビット幅です。
ko: `iN`, `uN`, `fN`은 모두 _N_비트 입니다.
pt_br: `iN`, `uN` e `fN` têm _N_ bits,
uk: `iN`, `uN` і `fN` мають ширину _N_ біт,

source: `isize` and `usize` are the width of a pointer,
es: `isize` y `usize` tienen el ancho de un puntero,
fa: `isize` و `usize` به اندازه یک اشاره‌گر حافظه اشغال می‌کنند,
ja: `isize` と `usize` はポインタの幅です。
ko: `isize` 와 `usize` 는 포인터와 같은 크기입니다,
pt_br: `isize` e `usize` são do tamanho de um ponteiro,
uk: `isize` і `usize` – це ширина вказівника,

source: `char` is 32 bits wide,
es: `char` tiene un tamaño de 32 bits,
fa: `char` به اندازه 32 بیت حافظه اشغال می‌کنند.,
ja: `char` は 32 ビット幅です。
ko: `char` 32 비트 입니다,
pt_br: `char` tem 32 bits,
uk: `char` має ширину 32 біти,

source: `bool` is 8 bits wide.
es: `bool` tiene 8 bits de ancho.
fa: `bool` به اندازه 8 بیت حافظه اشغال می‌کنند.
ja: `bool` は 8 ビット幅です。
ko: `bool`은 8 비트 입니다.
pt_br: `bool` tem 8 bits.
uk: `bool` має ширину 8 біт.

source: There are a few syntaxes which are not shown above:
es: Hay algunas sintaxis que no se han mostrado anteriormente:
fa: موارد اندکی وجود دارند که در بالا نشان داده نشده است:
ja: 上記には示されていない構文もあります。
ko: 위에 표시되지 않은 몇 가지 문법이 있습니다:
pt_br: Há algumas sintaxes que não são mostradas acima:
uk: Є кілька синтаксисів, які не показано вище:

source: All underscores in numbers can be left out, they are for legibility only. So `1_000` can be written as `1000` (or `10_00`), and `123_i64` can be written as `123i64`.
es: Todos guiones bajos en los números pueden no utilizarse, ya que solo sirven para facilitar la lectura. Por lo tanto, `1_000` se puede escribir como `1000` (o `10_00`), y `123_i64` se puede escribir como `123i64`.
fa: می‌توان همه خطوط زیرین `_` را در اعداد حذف کرد، آنها فقط برای خوانایی هستند. «<span dir=ltr>`1_000`</span> می‌تواند به صورت <span dir=ltr>`1000`</span> (یا <span dir=ltr>`10_00`</span>) نوشته شود و <span dir=ltr>`123_i64`</span> می‌تواند به صورت <span dir=ltr>`123i64`</span> نوشته شود».
ja: 数字のアンダースコアはすべて省略できます。アンダースコアは読みやすくするためにのみ使用します。そのため、`1_000` は `1000`（または `10_00`）、`123_i64` は `123i64` と記述できます。
pt_br: Todos os sublinhados em números podem ser omitidos, eles são apenas para legibilidade. Por exemplo, `1_000` pode ser escrito como `1000` (ou `10_00`), e `123_i64` pode ser escrito como `123i64`.
uk: Усі підкреслення у числах можна опускати, вони призначені лише для розбірливості. Отже, `1_000` можна записати як `1000` (або `10_00`), а `123_i64` можна записати як `123i64`.

source: "result: {}"
uk: "результат: {}"

source: This is the first time we've seen a function other than `main`, but the meaning should be clear: it takes three integers, and returns an integer. Functions will be covered in more detail later.
fa: این اولین بار است که تابعی غیر از "main" می بینیم، اما معنی آن باید واضح باشد: سه عدد صحیح می گیرد و یک عدد صحیح برمی گرداند. توابع بعداً با جزئیات بیشتر پوشش داده خواهد شد.
ja: `main` 以外の関数が出てきたのは今回が初めてですが、その意味は明確です。つまり、3 つの整数を取り、1 つの整数を返します。関数については、後で詳しく説明します。
pt_br: Esta é a primeira vez que vemos uma função diferente de `main`, mas o significado deve ser claro: ela recebe três inteiros e retorna um inteiro. Funções serão abordadas com mais detalhes posteriormente.
uk: Це перший раз, коли ми бачимо функцію, відмінну від `main`, але її значення повинно бути зрозумілим: вона отримує три цілих числа і повертає ціле число. Функції буде розглянуто більш детально пізніше.

source: Arithmetic is very similar to other languages, with similar precedence.
fa: حسابی بسیار شبیه به زبان های دیگر است، با تقدم مشابه.
ja: 算術は他の言語とよく似ており、優先順位も類似しています。
pt_br: Aritmética é muito semelhante a outras linguagens, com precedência semelhante.
uk: Арифметика дуже схожа на інші мови, зі схожими пріоритетами.

source: What about integer overflow? In C and C++ overflow of _signed_ integers is actually undefined, and might do unknown things at runtime. In Rust, it's defined.
uk: Як бути з переповненням цілих чисел? У мовах C та C++ переповнення цілих чисел _зі знаком_ фактично не визначено, і може робити невідомі речі під час виконання. У Rust воно визначене.

source: Change the `i32`'s to `i16` to see an integer overflow, which panics (checked) in a debug build and wraps in a release build. There are other options, such as overflowing, saturating, and carrying. These are accessed with method syntax, e.g., `(a * b).saturating_add(b * c).saturating_add(c * a)`.
fa: «i32» را به «i16» تغییر دهید تا یک سرریز عدد صحیح را ببینید، که در یک ساخت اشکال‌زدایی وحشت می‌کند (بررسی می‌شود) و در یک نسخه انتشار می‌پیچد. گزینه های دیگری مانند سرریز، اشباع و حمل وجود دارد. اینها با نحو متد قابل دسترسی هستند، به عنوان مثال، `(a * b).saturating_add(b * c).saturating_add(c *a)`.
ja: `i32` を `i16` に変更して、整数オーバーフローを確認します。これは、デバッグビルドではパニックになり（チェックされ）、リリースビルドではラップされます。オーバーフロー、飽和、キャリーなどのオプションもあり、メソッド構文を使用してこれらのオプションにアクセスします（例: `(a * b).saturating_add(b * c).saturating_add(c * a)`）。
pt_br: Altere os `i32` para `i16` para ver um estouro de inteiro, que causa um pânico (verificado) em uma compilação de debug e um _wrap-around_ em uma compilação de release. Existem outras opções, como _overflowing_, saturação e _carrying_. Estes são acessados com sintaxe de método, por exemplo, `(a * b).saturating_add(b * c).saturating_add(c * a)`.
uk: Замініть `i32` на `i16`, щоб побачити цілочисельне переповнення, яке панікує (перевіряється) у налагоджувальній збірці і загортається у релізній збірці. Існують і інші варіанти, такі як переповнення, перенасичення і перенесення. Доступ до них здійснюється за допомогою синтаксису методу, наприклад, `(a * b).saturating_add(b * c).saturating_add(c * a)`.

source: In fact, the compiler will detect overflow of constant expressions, which is why the example requires a separate function.
fa: در واقع، کامپایلر سرریز عبارات ثابت را تشخیص می دهد، به همین دلیل است که مثال به یک تابع جداگانه نیاز دارد.
ja: 実際には、コンパイラは定数式のオーバーフローを検出します。この例で別の関数が必要になるのはそのためです。
pt_br: Na verdade, o compilador detectará o estouro de expressões constantes, é por isso que o exemplo requer uma função separada.
uk: Насправді, компілятор виявить переповнення константних виразів, тому приклад вимагає окремої функції.

source: Rust will look at how the variable is _used_ to determine the type:
es: Rust consultará cómo se _usa_ la variable para determinar el tipo:
fa: زبان Rust برای تعیین نوع متغیر به نحوه استفاده از آن نگاه می‌کند:
ja: Rust は、どのように変数が _使用されているか_ を確認することで、型を判別します。
ko: 러스트는 변수가 어떻게 사용되는지를 보고 그 변수의 타입을 추론합니다:
pt_br: Rust verá como a variável é _usada_ para determinar o tipo:
uk: Rust перевірить, як _використовується_ змінна для визначення типу:

source: This slide demonstrates how the Rust compiler infers types based on constraints given by variable declarations and usages.
es: Esta diapositiva muestra cómo el compilador de Rust infiere tipos basándose en restricciones proporcionadas por declaraciones y usos de variables.
fa: این اسلاید نشان می‌دهد که چگونه کامپایلر Rust با توجه به اعلان‌ها و استفاده‌های متغیر، انواع را استنتاج می‌کند.
ja: このスライドは、変数の宣言と使用方法による制約に基づいて、Rust コンパイラが型を推測する仕組みを示しています。
ko: 이 슬라이드는, 러스트 컴파일러가 변수가 어떻게 선언되어 있고, 어떻게 사용되는지를 제약 조건으로 삼아서 변수의 타입을 추론하는 모습을 보여줍니다.
pt_br: Este slide demonstra como o compilador Rust infere tipos com base em restrições dadas por declarações e usos de variáveis.
uk: На цьому слайді показано, як компілятор Rust виводить типи на основі обмежень, заданих оголошеннями змінних та їх використанням.

source: It is very important to emphasize that variables declared like this are not of some sort of dynamic "any type" that can hold any data. The machine code generated by such declaration is identical to the explicit declaration of a type. The compiler does the job for us and helps us write more concise code.
es: Es muy importante subrayar que las variables que se declaran así no son de un "tipo cualquiera" dinámico que pueda contener cualquier dato. El código máquina generado por tal declaración es idéntico a la declaración explícita de un tipo. El compilador hace el trabajo por nosotros y nos ayuda a escribir código más conciso.
fa: بسیار مهم است که تاکید کنیم متغیرهایی که به این صورت تعریف می‌شوند از «نوع داده پویای `any`» نیستند که بتواند هر نوعی باشند. وقتی که ما از **تعیین تایپ ضمنی** استفاده می‌کنیم در واقع مشابه زمانی هست که نوع داده را به صورت صریح اعلام میکنیم و کد های ماشین آنها دقیقا یکسان هستند. فقط با استفاده از تعیین تایپ ضمنی میتوانید کد ها رو به صورت مختصرتر بنویسیم.
ja: このように宣言された変数は、どのようなデータも保持できる動的な「任意の型」ではない、という点を強調することが非常に重要です。このような宣言によって生成されたマシンコードは、型の明示的な宣言と同一です。コンパイラが代わりに作業を行い、より簡潔なコードの作成を支援します。
ko: 여기서 중요한 것은, 이렇게 명시적인 타입을 생략하고 선언되었다고 해서 "어떤 타입"이라도 다 담을 수 있는 타입이 되는 것은 아니라는 점입니다. 명시적인 타입 선언이 있던 없던, 컴파일러가 생성한 머신코드는 동일합니다. 컴파일러는 단지 타입 선언을 생략할 수 있도록 해서 프로그래머가 더 간결한 코드를 쓸 수 있도록 도와줄 뿐입니다.
pt_br: É muito importante enfatizar que variáveis declaradas assim não são de um tipo dinâmico "qualquer tipo" que possa armazenar quaisquer dados. O código de máquina gerado por tal declaração é idêntico à declaração explícita de um tipo. O compilador faz o trabalho para nós e nos ajuda a escrever um código mais conciso.
uk: Дуже важливо підкреслити, що змінні, оголошені таким чином, не належать до якогось динамічного «будь-якого типу», який може містити будь-які дані. Машинний код, згенерований такою декларацією, ідентичний явному оголошенню типу. Компілятор виконує роботу за нас і допомагає нам писати більш стислий код.

source: When nothing constrains the type of an integer literal, Rust defaults to `i32`. This sometimes appears as `{integer}` in error messages. Similarly, floating-point literals default to `f64`.
fa: هنگامی که هیچ چیز نوع یک عدد صحیح را محدود نمی کند، Rust به طور پیش فرض روی «i32» قرار می گیرد. گاهی اوقات در پیام های خطا به صورت «{integer}» نشان داده می شود. به طور مشابه، تایپ ممیز شناور پیش‌فرض «f64» است.
ja: 整数リテラルの型に制約がない場合、Rust はデフォルトで `i32` を使用します。これは、エラー メッセージに `{integer}` として表示されることがあります。同様に、浮動小数点リテラルはデフォルトで `f64` になります。
pt_br: Quando nada restringe o tipo de um literal inteiro, Rust assume `i32`. Isso às vezes aparece como `{integer}` nas mensagens de erro. Da mesma forma, os literais de ponto flutuante assumem `f64`.
uk: Якщо тип цілочисельного літерала не обмежено, Rust за замовчуванням використовує тип `i32`. Іноді у повідомленнях про помилки це позначається як `{integer}`. Подібно до цього, літерали з плаваючою комою за замовчуванням мають тип `f64`.

source: // ERROR: no implementation for `{float} == {integer}`
ja: // エラー: `{float} == {integer}` の実装がありません
pt_br: // ERRO: nenhuma implementação para `{float} == {integer}`
uk: // ПОМИЛКА: немає реалізації для `{float} == {integer}`

source: minutes: 15
uk: хвилин: 15

source: The Fibonacci sequence begins with `[0,1]`. For n>1, the n'th Fibonacci number is calculated recursively as the sum of the n-1'th and n-2'th Fibonacci numbers.
fa: دنباله فیبوناچی با «[0،1]» شروع می شود. برای n>1، عدد فیبوناچی n به صورت بازگشتی به عنوان مجموع اعداد فیبوناچی n-1 و n-2 محاسبه می شود.
uk: Послідовність Фібоначчі починається з `[0,1]`. Для n>1 n-те число Фібоначчі обчислюється рекурсивно як сума n-1-го та n-2-го чисел Фібоначчі.

source: Write a function `fib(n)` that calculates the n'th Fibonacci number. When will this function panic?
fa: یک تابع fib(n) بنویسید که عدد فیبوناچی n را محاسبه کند. چه زمانی این عملکرد panic می شود؟
ja: n 番目のフィボナッチ数を計算する関数 `fib(n)` を記述します。この関数はいつパニックするでしょうか。
pt_br: Escreva uma função `fib(n)` que calcula o n-ésimo número de Fibonacci. Quando esta função causará um pânico?
uk: Напишіть функцію `fib(n)`, яка обчислює n-те число Фібоначчі. Коли ця функція запанікує?

source: // The base case.
fa: //حالت پایه
ja: // ベースケース。
pt_br: // O caso base.
uk: // Базовий випадок.

source: "Implement this"
fa: "این را پیاده‌سازی کن"
ja: "ここを実装してください"
pt_br: "Implemente isso"
uk: "Реалізуйте це"

source: // The recursive case.
fa: // حالت بازگشتی
ja: // 再帰的なケース。
pt_br: // O caso recursivo.
uk: // Рекурсивний випадок.

source: minutes: 4
uk: хвилин: 4

source: `if` expressions
es: Expresiones `if`
fa: عبارات `if`
ja: `if` 式
ko: `if` 표현식
pt_br: Expressões `if`
uk: Вирази `if`

source: You use [`if` expressions](https://doc.rust-lang.org/reference/expressions/if-expr.html#if-expressions) exactly like `if` statements in other languages:
es: Puedes usar [expresiones `if`](https://doc.rust-lang.org/reference/expressions/if-expr.html#if-expressions) de la misma forma que en otros lenguajes:
fa: شما [عبارت `if`](https://doc.rust-lang.org/reference/expressions/if-expr.html#if-expressions) رو به مانند دیگر زبان‌ها استفاده می‌کنید:
ja: Rust の [`if` 式](https://doc.rust-lang.org/reference/expressions/if-expr.html#if-expressions) は、他の言語における `if` 文と全く同じように使えます。
ko: 다른 언어의 `if` 문과 똑같이 [`if` 표현식](https://doc.rust-lang.org/reference/expressions/if-expr.html#if-expressions)을 사용합니다:
pt_br: Você usa [expressões `if` ](https://doc.rust-lang.org/reference/expressions/if-expr.html#if-expressions) exatamente como declarações `if` em outras linguagens:
uk: Ви використовуєте вирази [`if`](https://doc.rust-lang.org/reference/expressions/if-expr.html#if-expressions) так само, як і вирази `if` в інших мовах:

source: "zero!"
fa: "صفر!"
uk: "нуль!"

source: "biggish"
pt_br: "grande"
uk: "великий"

source: "huge"
pt_br: "enorme"
uk: "величезний"
