Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: `std::sync::Mutex` and the other synchronisation primitives from `std::sync` are not available in `core` or `alloc`. How can we manage synchronisation or interior mutability, such as for sharing state between different CPUs?
es: `std::sync::Mutex` y el resto de los primitivos de sincronización de `std::sync` no están disponibles en `core` o `alloc`. ¿Cómo podemos gestionar la sincronización o la mutabilidad interior para, por ejemplo, compartir el estado entre diferentes CPUs?
fa: ‏ `std::sync::Mutex` و دیگر موارد اولیه همگام‌سازی از `std::sync` در `core` یا `alloc` موجود نیستند. چگونه می‌توانیم هماهنگ‌سازی یا تغییرپذیری داخلی، مانند اشتراک‌گذاری وضعیت بین CPU‌های مختلف را مدیریت کنیم؟
ja: `std::sync`が提供する`std::sync::Mutex` とその他の同期プリミティブは`core`または`alloc`では利用できません。となると、例えば異なるCPU間での状態共有のための、同期や内部可変性はどのように実現したら良いのでしょうか？
ko: `std::sync::Mutex` 및 `std::sync`의 기타 동기화 프리미티브는 `core` 또는 `alloc`에서 사용할 수 없습니다. 그러면 어떻게 동기화 또는 interior mutability와 같은 기능이 필요할 경우 어떻게 해야 할까요?
pt_br: `std::sync::Mutex` e os outros primitivos de sincronização de `std::sync` não estão disponíveis em `core` ou `alloc`. Como podemos gerenciar a sincronização ou mutabilidade interna, como para compartilhar estado entre diferentes CPUs?
uk: `std::sync::Mutex` та інші примітиви синхронізації з `std::sync` недоступні в `core` або `alloc`. Як ми можемо керувати синхронізацією або внутрішньою мутабельністю, наприклад, для обміну станом між різними CPU?

source: The [`spin`](https://crates.io/crates/spin) crate provides spinlock-based equivalents of many of these primitives.
es: El crate [`spin`](https://crates.io/crates/spin) proporciona equivalentes basados en spinlocks de muchos de estos primitivos.
fa: این crate [`spin`](https://crates.io/crates/spin) معادل‌های مبتنی بر spinlock، بسیاری از این موارد اولیه را ارائه می‌کند.
ja: [`spin`](https://crates.io/crates/spin) クレートはこれらの多くのプリミティブと等価なスピンロックベースのものを提供します。
ko: [`spin`](https://crates.io/crates/spin) 크레이트는 이러한 동기화 프리미티브들을 스핀록으로 구현하고 있습니다.
pt_br: O _crate_ [`spin`](https://crates.io/crates/spin) fornece equivalentes baseados em _spinlock_ para muitos dessas primitivas.
uk: Крейт [`spin`](https://crates.io/crates/spin) надає еквіваленти багатьох із цих примітивів на основі спін-блокування.

source: Be careful to avoid deadlock if you take locks in interrupt handlers.
es: Intenta evitar interbloqueos si usas bloqueos en los controladores de las interrupciones.
fa: اگر در handlerهای وقفه قفل می‌کنید مراقب باشید که از بن بست(deadlock) جلوگیری کنید.
ja: 割り込みハンドラでロックを取得する場合にはデッドロックを引き起こさないように気をつけてください。
ko: 인터럽트 핸들러에서 락을 걸 경우, 교착 상태가 발생하지 않도록 주의하세요.
pt_br: Tome cuidado para evitar _deadlock_ se você tomar _locks_ em manipuladores de interrupção.
uk: Будьте обережні, щоб уникнути взаємоблокувань, якщо ви використовуєте блокування в обробниках переривань.

source: `spin` also has a ticket lock mutex implementation; equivalents of `RwLock`, `Barrier` and `Once` from `std::sync`; and `Lazy` for lazy initialisation.
fa: ‏ `spin` همچنین دارای اجرای ticket lock mutex است. معادل‌های `RwLock`, `Barrier` و `Once` از `std::sync`. و `Lazy` برای مقداردهی اولیه lazy.
pt_br: `spin` também possui uma implementação de _mutex_ de _ticket lock_; equivalentes de `RwLock`, `Barrier` e `Once` de `std::sync`; e `Lazy` para inicialização _lazy_ ("preguiçosa").
uk: `spin` також має реалізацію квиткового м'ютексу блокування; еквіваленти `RwLock`, `Barrier` і `Once` з `std::sync`; і `Lazy` для ледачої ініціалізації.

source: The [`once_cell`](https://crates.io/crates/once_cell) crate also has some useful types for late initialisation with a slightly different approach to `spin::once::Once`.
es: El crate [`once_cell`](https://crates.io/crates/once_cell) también tiene algunos tipos útiles de inicialización tardía con un enfoque ligeramente distinto al de `spin::once::Once`.
fa: این crate ['once_cell'](https://crates.io/crates/once_cell) همچنین دارای تایپ‌های مفیدی برای مقداردهی اولیه دیرهنگام با رویکرد کمی متفاوت به `spin::once::Once` است.
ja: [`once_cell`](https://crates.io/crates/once_cell) クレートも`spin::once::Once`とは少し異なるアプローチの遅延初期化のための有用な型をいくつか持っています。
ko: [`once_cell`](https://crates.io/crates/once_cell) 크레이트에는 지연된 초기화를 위한 몇 가지 유용한 타입이 있는데 `spin::once::Once`와는 약간 다른 접근 방식을 사용합니다.
pt_br: O _crate_ [`once_cell`](https://crates.io/crates/once_cell) também possui alguns tipos úteis para inicialização tardia com uma abordagem um pouco diferente de `spin::once::Once`.
uk: Крейт [`once_cell`](https://crates.io/crates/once_cell) також має кілька корисних типів для пізньої ініціалізації з дещо іншим підходом до `spin::once::Once`.

source: The Rust Playground includes `spin`, so this example will run fine inline.
es: El playground de Rust incluye `spin`, por lo que este ejemplo se ejecutará bien aunque está insertado.
fa: ‏ Playground Rust شامل `spin` است، بنابراین این مثال به خوبی به صورت داخلی اجرا می‌شود.
ja: Rust Playgroundは`spin`を内包しているので、この例はオンラインで実行できます。
ko: Rust 플레이그라운드에는 `spin`이 포함되어 있으므로 이 예시는 인라인으로 실행됩니다.
pt_br: O Rust Playground inclui `spin`, portanto, este exemplo será executado corretamente inline.
uk: Rust Playground містить `spin`, тож цей приклад добре працюватиме вбудовано.

source: To build a bare-metal Rust binary in AOSP, you need to use a `rust_ffi_static` Soong rule to build your Rust code, then a `cc_binary` with a linker script to produce the binary itself, and then a `raw_binary` to convert the ELF to a raw binary ready to be run.
es: Para compilar un binario de Rust bare-metal en AOSP, tienes que usar una regla `rust_ffi_static` de Soong para crear tu código Rust y, seguidamente, un `cc_binary` con una secuencia de comandos de enlazador para producir el binario en sí. Por último, un `raw_binary` para convertir el ELF en un binario sin formato que pueda ejecutarse.
fa: برای ساختن یک bare-metal Rust binary در AOSP، باید از یک `rust_ffi_static` Soong برای ساخت کد Rust خود استفاده کنید، سپس از یک `cc_binary` با یک linker script برای تولید binary استفاده کرده و سپس از یک `raw_binary` برای تبدیل ELF به یک raw binary آماده اجرا استفاده کنید.
ja: AOSPにおいてベアメタルRustバイナリをビルドするためには、Rustコードをビルドするための`rust_ffi_static`というSoongルール、リンカスクリプトとそれを使ってバイナリを生成するための`cc_binary`というルール、さらにELFを実行可能な形式の生バイナリに変換する`raw_binary`というルールが必要です。
ko: AOSP에서 bare-metal Rust 바이너리를 빌드하려면 `rust_ffi_static` 을 사용하여 Rust 코드를 빌드하고, 링커 스크립트가 포함된 `cc_binary`를 사용하여 ELF 바이너리를 생성하고, `raw_binary`를 사용해 ELF를 곧바로 수행될 수 있는 원시(raw) 바이너리로 변환합니다.
pt_br: Para compilar um binário Rust _bare-metal_ no AOSP, você precisa usar uma regra Soong `rust_ffi_static` para compilar seu código Rust, depois um `cc_binary` com um _linker script_ para produzir o próprio binário e, finalmente, um `raw_binary` para converter o ELF em um binário bruto pronto para ser executado.
uk: Щоб зібрати бінарник Rust в AOSP для голого заліза, вам потрібно використати правило `rust_ffi_static` Soong для створення коду Rust, потім `cc_binary` зі сценарієм компонування, щоб створити сам бінарний файл, а потім `raw_binary` для перетворення ELF у необроблений бінарний файл, готовий до запуску.

source: For VMs running under crosvm on aarch64, the [vmbase](https://android.googlesource.com/platform/packages/modules/Virtualization/+/refs/heads/main/libs/libvmbase/) library provides a linker script and useful defaults for the build rules, along with an entry point, UART console logging and more.
uk: Для віртуальних машин, що працюють під керуванням crosvm на aarch64, бібліотека [vmbase](googlesource.com/platform/packages/modules/Virtualization/+/refs/heads/main/libs/libvmbase/) надає сценарій компонування та корисні параметри за замовчуванням для правил збірки разом із точкою входу, журналювання консолі UART тощо.

source: The `main!` macro marks your main function, to be called from the `vmbase` entry point.
es: La macro `main!` indica tu función principal, que se llama desde el punto de entrada `vmbase`.
fa: این ماکرو `main!`عملکرد اصلی شما را مشخص می‌کند تا از نقطه ورودی `vmbase` فراخوانی شود.
ja: `main!`というマクロはメイン関数を指定するもので、指定された関数は`vmbase`のエントリポイントから呼び出されることになります。
ko: `main!` 매크로는 `vmbase` 진입점에서 호출될 main 함수를 표시합니다.
pt_br: A macro `main!` marca sua função principal, para ser chamada a partir do ponto de entrada `vmbase`.
uk: Макрос `main!` позначає вашу основну функцію, яку потрібно викликати з точки входу `vmbase`.

source: The `vmbase` entry point handles console initialisation, and issues a PSCI_SYSTEM_OFF to shutdown the VM if your main function returns.
es: El punto de entrada `vmbase` gestiona la inicialización de la consola y emite PSCI_SYSTEM_OFF para apagar la máquina virtual si tu función principal devuelve un resultado.
fa: نقطه ورودی `vmbase` مقدار دهی اولیه کنسول را کنترل می‌کند و در صورت بازگشت main function، یک PSCI_SYSTEM_OFF برای خاموش کردن VM صادر می‌کند.
ja: `vmbase`のエントリポイントはコンソールの初期化を行い、メイン関数がリターンした場合にはPSCI_SYSTEM_OFF を発行しVMをシャットダウンします。
ko: `vmbase`가 제공하는 진입점은 콘솔을 초기화 하며, main 함수가 리턴하면 PSCI_SYSTEM_OFF 메시지를 PSCI를 통해 보내어서 VM을 종료시킵니다.
pt_br: O ponto de entrada `vmbase` lida com a inicialização do console e emite um PSCI_SYSTEM_OFF para desligar a VM se sua função principal retornar.
uk: Точка входу `vmbase` обробляє ініціалізацію консолі та видає PSCI_SYSTEM_OFF для завершення роботи віртуальної машини, якщо основна функція повертається.

source: We will write a driver for the PL031 real-time clock device.
es: Escribiremos un controlador para el dispositivo de reloj en tiempo real PL031.
fa: ما یک درایور برای دستگاه PL031 real-time clock خواهیم نوشت.
pt_br: Vamos escrever um driver para o dispositivo de relógio em tempo real PL031.
uk: Напишемо драйвер для пристрою годин реального часу PL031.

source: After looking at the exercises, you can look at the [solutions](solutions-afternoon.md) provided.
es: Luego de ver los ejercicios, puedes ver las [soluciones](solutions-afternoon.md) que se brindan.
fa: پس از بررسی تمرین‌ها، می‌توانید به [راه‌حل ها](solutions-afternoon.md) ارائه شده نگاهی بیندازید.
pt_br: Depois de ver os exercícios, você pode ver as [soluções](solutions-afternoon.md) fornecidas.
uk: Переглянувши вправи, ви можете переглянути надані [рішення](solutions-afternoon.md).

source: RTC driver
es: Controlador RTC
pt_br: Driver RTC
uk: RTC драйвер

source: The QEMU aarch64 virt machine has a [PL031](https://developer.arm.com/documentation/ddi0224/c) real-time clock at 0x9010000. For this exercise, you should write a driver for it.
es: La máquina virtual aarch64 de QEMU tiene un reloj en tiempo real [PL031](https://developer.arm.com/documentation/ddi0224/c) en 0x9010000. En este ejercicio, debes escribir un controlador para el reloj.
pt_br: A máquina QEMU aarch64 virt tem um relógio em tempo real [PL031](https://developer.arm.com/documentation/ddi0224/c) em 0x9010000. Para este exercício, você deve escrever um driver para ele.
uk: Віртуальна машина QEMU aarch64 має [PL031](https://developer.arm.com/documentation/ddi0224/c) годинник реального часу за адресою 0x9010000. Для цієї вправи ви повинні написати для неї драйвер.

source: Use it to print the current time to the serial console. You can use the [`chrono`](https://crates.io/crates/chrono) crate for date/time formatting.
es: Úsalo para imprimir la hora en la consola serie. Puedes usar el crate [`chrono`](https://crates.io/crates/chrono) para dar formato a la fecha y la hora.
fa: از آن برای چاپ زمان جاری در کنسول سریال استفاده کنید. می‌توانید از crate [`chrono`](https://crates.io/crates/chrono) برای قالب‌بندی date/time استفاده کنید.
pt_br: Use-o para imprimir a hora atual no console serial. Você pode usar o _crate_ [`chrono`](https://crates.io/crates/chrono) para formatação de data/hora.
uk: Використовуйте його для друку поточного часу на послідовній консолі. Ви можете використовувати крейт [`chrono`](https://crates.io/crates/chrono) для форматування дати/часу.

source: Use the match register and raw interrupt status to busy-wait until a given time, e.g. 3 seconds in the future. (Call [`core::hint::spin_loop`](https://doc.rust-lang.org/core/hint/fn.spin_loop.html) inside the loop.)
es: Utiliza el registro de coincidencias y el estado de interrupción sin formato para esperar hasta un momento dado, por ejemplo, un adelanto de 3 segundos. (Llama a [`core::hint::spin_loop`](https://doc.rust-lang.org/core/hint/fn.spin_loop.html) dentro d+el bucle).
pt_br: Use o registrador de comparação e o status de interrupção bruto para aguardar ocupado até um determinado horário, por exemplo, 3 segundos no futuro. (Chame [`core::hint::spin_loop`](https://doc.rust-lang.org/core/hint/fn.spin_loop.html) dentro do _loop_).
uk: Використовуйте регістр збігу та необроблений стан переривання для очікування зайнятості до заданого часу, наприклад 3 секунди в майбутньому. (Викличте [`core::hint::spin_loop`](https://doc.rust-lang.org/core/hint/fn.spin_loop.html) усередині циклу.)

source: _Extension if you have time:_ Enable and handle the interrupt generated by the RTC match. You can use the driver provided in the [`arm-gic`](https://docs.rs/arm-gic/) crate to configure the Arm Generic Interrupt Controller.
es: _Ampliación si hay tiempo:_ habilita y gestiona la interrupción que genera la coincidencia de RTC. Puedes usar el controlador que se proporciona con el crate [`arm-gic`](https://docs.rs/arm-gic/) para configurar el controlador de interrupciones genérico (GIC) de Arm.
fa: ‏ _افزونه‌ها اگر زمان دارید:_ وقفه ایجاد شده توسط تطبیق RTC را فعال کرده و آن را مدیریت کنید. می‌توانید از درایور ارائه شده در crate [`arm-gic`](https://docs.rs/arm-gic/) برای پیکربندی Arm Generic Interrupt Controller استفاده کنید.
pt_br: _Extensão se você tiver tempo:_ Ative e manipule a interrupção gerada pela correspondência RTC. Você pode usar o driver fornecido no _crate_ [`arm-gic`](https://docs.rs/arm-gic/) para configurar o Controlador de Interrupção
uk: _Розширення, якщо у вас є час:_ Увімкніть і обробіть переривання, створене збігом RTC. Ви можете використовувати драйвер, наданий у крейті [`arm-gic`](https://docs.rs/arm-gic/), щоб налаштувати загальний контролер переривань Arm.

source: Use the RTC interrupt, which is wired to the GIC as `IntId::spi(2)`.
es: Utiliza la interrupción de RTC, que está conectada al GIC como `IntId::spi(2)`.
fa: از وقفه RTC استفاده کنید که به عنوان `IntId::spi(2)` به GIC متصل است.
pt_br: Use a interrupção RTC, que está conectada ao GIC como `IntId::spi(2)`.
uk: Використовуйте переривання RTC, яке підключено до GIC як `IntId::spi(2)`.

source: Once the interrupt is enabled, you can put the core to sleep via `arm_gic::wfi()`, which will cause the core to sleep until it receives an interrupt.
es: Después de habilitar la interrupción, puedes poner el núcleo en suspensión mediante `arm_gic::wfi()`, lo que hará que entre en suspensión hasta que reciba una interrupción.
fa: هنگامی که وقفه (interrupt) فعال شد، می‌توانید هسته را از طریق `arm_gic::wfi()` به حالت Sleep درآورید، که باعث می‌شود هسته تا زمانی که وقفه دریافت کند به خواب برود.
pt_br: Depois que a interrupção for ativada, você poderá colocar o core para dormir via `arm_gic::wfi()`, o que fará com que o core durma até receber uma interrupção.
uk: Коли переривання ввімкнено, ви можете перевести ядро ​​в режим сну за допомогою `arm_gic::wfi()`, що призведе до того, що ядро ​​буде спати, доки воно не отримає переривання.

source: Download the [exercise template](../../comprehensive-rust-exercises.zip) and look in the `rtc` directory for the following files.
es: Descarga la [plantilla de ejercicio](../../comprehensive-rust-exercises.zip) y busca en el directorio `rtc` los siguientes archivos.
fa: دانلود از [exercise template](../../comprehensive-rust-exercises.zip) و فایل‌های زیر را در دایرکتوری `rtc` جستجو کنید.
pt_br: Baixe o [modelo de exercício](../../comprehensive-rust-exercises.zip) e procure os seguintes arquivos no diretório `rtc`.
uk: Завантажте [шаблон вправи](../../comprehensive-rust-exercises.zip) і знайдіть у каталозі `rtc` наступні файли.

source: _src/exceptions.rs_ (you should only need to change this for the 3rd part of the exercise):
fa: ‏ _src/exceptions.rs_ (شما فقط باید این را برای بخش سوم تمرین تغییر دهید):
pt_br: _src/exceptions.rs_ (você só precisará alterar isso para a 3ª parte do exercício):
uk: `src/exceptions.rs` (вам потрібно буде змінити його лише для 3-ї частини вправи):

source: _src/logger.rs_ (you shouldn't need to change this):
fa: ‏ _src/logger.rs_ (نیازی نیست این مورد را تغییر دهید):
pt_br: _src/logger.rs_ (você não deverá precisar alterar isso):
uk: _src/logger.rs_ (вам не потрібно це змінювати):

source: _src/pl011.rs_ (you shouldn't need to change this):
fa: _src/pl011.rs_ (نیازی نیست این مورد را تغییر دهید):
pt_br: _src/pl011.rs_ (você não deverá precisar alterar isso):
uk: _src/pl011.rs_ (вам не потрібно це змінювати):

source: _build.rs_ (you shouldn't need to change this):
fa: _build.rs_ (نیازی نیست این مورد رو تغییر دهید):
pt_br: _build.rs_ (você não deverá precisar alterar isso):
uk: _build.rs_ (вам не потрібно це змінювати):

source: _entry.S_ (you shouldn't need to change this):
fa: _entry.S_ ( نیازی نیست این مورد را تغییر دهید):
pt_br: _entry.S_ (você não deverá precisar alterar isso):
uk: _entry.S_ (вам не потрібно це змінювати):

source: _exceptions.S_ (you shouldn't need to change this):
fa: _exceptions.S_ ( نیازی نیست این مورد را تغییر دهید):
pt_br: _exceptions.S_ (você não deverá precisar alterar isso):
uk: _exceptions.S_ (вам не потрібно це змінювати):

source: _idmap.S_ (you shouldn't need to change this):
fa: _idmap.S_ (نیازی نیست این مورد را تغییر دهید):
pt_br: _idmap.S_ (você não deverá precisar alterar isso):
uk: _idmap.S_ (вам не потрібно це змінювати):

source: _image.ld_ (you shouldn't need to change this):
fa: _image.ld_ (نیازی نیست این مورد را تغییر دهید):
pt_br: _image.ld_ (você não deverá precisar alterar isso):
uk: _image.ld_ (вам не потрібно це змінювати):

source: _Makefile_ (you shouldn't need to change this):
fa: _Makefile_ (نیازی نیست این مورد را تغییر دهید):
pt_br: _Makefile_ (você não deverá precisar alterar isso):
uk: _Makefile_ (вам не потрібно це змінювати):

source: Run the code in QEMU with `make qemu`.
es: Ejecuta el código en QEMU con `make qemu`.
fa: کد را در QEMU با `make qemu` اجرا کنید.
pt_br: Execute o código no QEMU com `make qemu`.
uk: Запустіть код у QEMU за допомогою `make qemu`.

source: Bare Metal Rust Afternoon
es: Rust Bare Metal: tarde
fa: بعدازظهربا Bare Metal Rust
ja: ベアメタルRust PM
ko: 전Bare Metal 오후
pt_br: Bare Metal Rust Tarde
uk: Rust на голому залізі. Полудень.

source: ([back to exercise](rtc.md))
es: ([volver al ejercicio](rtc.md))
pt_br: ([voltar ao exercício](rtc.md))
uk: ([назад до вправи](rtc.md))

source: /// Base addresses of the GICv3.
pt_br: /// Endereços base do GICv3.
uk: /// Базові адреси GICv3.

source: /// Base address of the PL031 RTC.
pt_br: /// Endereço base do RTC PL031.
uk: /// Базова адреса PL031 RTC.

source: /// The IRQ used by the PL031 RTC.
pt_br: /// O IRQ usado pelo RTC PL031.
uk: /// IRQ, що використовується PL031 RTC.

source: // SAFETY: `GICD_BASE_ADDRESS` and `GICR_BASE_ADDRESS` are the base // addresses of a GICv3 distributor and redistributor respectively, and // nothing else accesses those address ranges.
uk: // БЕЗПЕКА: `GICD_BASE_ADDRESS` і `GICR_BASE_ADDRESS` є базовими // адресами дистриб'ютора і редистриб'ютора GICv3 відповідно, і ніщо // інше не має доступу до цих адресних діапазонів.

source: // SAFETY: `PL031_BASE_ADDRESS` is the base address of a PL031 device, and // nothing else accesses that address range.
uk: // БЕЗПЕКА: `PL031_BASE_ADDRESS` є базовою адресою пристрою PL031, // і ніщо інше не має доступу до цього діапазону адресації.

source: // Wait for 3 seconds, without interrupts.
pt_br: // Espere por 3 segundos, sem interrupções.
uk: // Чекаємо 3 секунди, без переривань.

source: "Waiting for {}"
pt_br: "Esperando por {}"
uk: "Чекаємо на {}"

source: "Finished waiting"
pt_br: "Espera finalizada"
uk: "Дочекалися"

source: // Wait another 3 seconds for an interrupt.
pt_br: // Espere mais 3 segundos por uma interrupção.
uk: // Чекаємо ще 3 секунди на переривання.

source: /// Data register
pt_br: /// Registrador de dados
uk: /// Регістр даних

source: /// Match register
pt_br: /// Registrador de comparação
uk: /// Регістр збігів

source: /// Load register
pt_br: /// Registrador de carga
uk: /// Регістр завантаження

source: /// Control register
pt_br: /// Registrador de controle
uk: /// Регістр управління

source: /// Interrupt Mask Set or Clear register
pt_br: /// Registrador de máscara de interrupção ou registrador de limpeza
uk: /// Регістр установки або очищення маски переривання

source: /// Raw Interrupt Status
pt_br: /// Status de interrupção bruto
uk: /// Необроблений стан переривання

source: /// Masked Interrupt Status
pt_br: /// Status de interrupção mascarado
uk: /// Маскований статус переривання

source: /// Interrupt Clear Register
pt_br: /// Registrador de limpeza de interrupção
uk: /// Регістр очищення переривання

source: /// Driver for a PL031 real-time clock.
pt_br: /// Driver para um relógio de tempo real PL031.
uk: /// Драйвер для годинника реального часу PL031.

source: /// Constructs a new instance of the RTC driver for a PL031 device at the /// given base address. /// /// # Safety /// /// The given base address must point to the MMIO control registers of a /// PL031 device, which must be mapped into the address space of the process /// as device memory and not have any other aliases.
pt_br: /// Constrói uma nova instância do driver RTC para um dispositivo PL031 no endereço /// base fornecido. /// /// # Segurança /// /// O endereço base fornecido deve apontar para os registradores de controle MMIO de um /// dispositivo PL031, que deve ser mapeado no espaço de endereços do processo /// como memória de dispositivo e não ter nenhum outro alias.
uk: /// Створює новий екземпляр драйвера RTC для пристрою PL031 за заданою /// базовою адресою. /// /// # Безпека /// /// Вказана базова адреса має вказувати на регістри керування MMIO /// пристрою PL031, які мають бути відображені у адресному просторі процесу /// як пам'ять пристрою і не мати інших псевдонімів.

source: /// Reads the current RTC value.
pt_br: /// Lê o valor atual do RTC.
uk: /// Зчитує поточне значення RTC.

source: // SAFETY: We know that self.registers points to the control registers // of a PL031 device which is appropriately mapped.
uk: // БЕЗПЕКА: ми знаємо, що self.registers вказує на керуючі // регістри пристрою PL031, який відповідним чином відображено.

source: /// Writes a match value. When the RTC value matches this then an interrupt /// will be generated (if it is enabled).
pt_br: /// Escreve um valor de comparação. Quando o valor do RTC corresponde a este, então uma interrupção /// será gerada (se estiver habilitada).
uk: /// Записує значення збігу. Коли значення RTC збігається з цим, буде /// згенеровано переривання (якщо його увімкнено).

source: /// Returns whether the match register matches the RTC value, whether or not /// the interrupt is enabled.
pt_br: /// Retorna se o registrador de comparação corresponde ao valor do RTC, habilitada ou não /// a interrupção.
uk: /// Повертає, чи відповідає регістр збігу значенню RTC, незалежно від того, /// увімкнено переривання чи ні.

source: /// Returns whether there is currently an interrupt pending. /// /// This should be true if and only if `matched` returns true and the /// interrupt is masked.
pt_br: /// Retorna se há uma interrupção pendente no momento. /// /// Isso deve ser verdadeiro se e somente se `matched` retornar verdadeiro e a /// interrupção está mascarada.
uk: /// Повертає, чи є переривання в очікуванні. /// /// Це значення має бути істинним тоді і тільки тоді, коли `matched` /// повертає істину і переривання замасковане.
