Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Test the above code on the [Rust Playground](https://play.rust-lang.org/?version=stable&mode=debug&edition=2021&gist=3ce2ad13ea1302f6572cb15cd96becf0).
es: Prueba el código anterior en el [playground de Rust](https://play.rust-lang.org/?version=stable&mode=debug&edition=2021&gist=3ce2ad13ea1302f6572cb15cd96becf0).
fa: کد بالا را در [Rust Playground](https://play.rust-lang.org/?version=stable&mode=debug&edition=2021&gist=3ce2ad13ea1302f6572cb15cd96becf0) تست کنید.
ja: [Rust プレイグラウンド](https://play.rust-lang.org/?version=stable&mode=debug&edition=2021&gist=3ce2ad13ea1302f6572cb15cd96becf0) で上記のコードをテストします。
ko: 위 코드를 [Rust Playground](https://play.rust-lang.org/?version=stable&mode=debug&edition=2021&gist=3ce2ad13ea1302f6572cb15cd96becf0)에서 테스트 해 보시기 바랍니다.
pt_br: Teste o código acima no [Rust Playground](https://play.rust-lang.org/?version=stable&mode=debug&edition=2021&gist=3ce2ad13ea1302f6572cb15cd96becf0).
uk: Перевірте наведений вище код на [Rust Playground](https://play.rust-lang.org/?version=stable&mode=debug&edition=2021&gist=3ce2ad13ea1302f6572cb15cd96becf0).

source: The Rust compiler produces fantastic error messages, as well as helpful built-in lints. [Clippy](https://doc.rust-lang.org/clippy/) provides even more lints, organized into groups that can be enabled per-project.
fa: کامپایلر Rust پیام‌های خطای جالب و همچنین built-in lint مناسبی تولید می‌کند. [Clippy](https://doc.rust-lang.org/clippy/) که lintهای بیشتری را ارائه می‌دهد، که در گروه‌هایی سازماندهی شده‌اند که می‌توانند در هر پروژه فعال شوند.
ja: Rust コンパイラは、読みやすいエラーおよびlintメッセージを生成します。[Clippy](https://doc.rust-lang.org/clippy/) では、さらに多くの lint がグループにまとめられており、プロジェクトごとに有効にできます。
pt_br: O compilador Rust produz mensagens de erro fantásticas, bem como alertas/lints úteis embutidos. [Clippy](https://doc.rust-lang.org/clippy/) fornece ainda mais lints, organizados em grupos que podem ser habilitados por projeto.
uk: Компілятор Rust видає фантастичні повідомлення про помилки, а також корисні вбудовані лінти. [Clippy](https://doc.rust-lang.org/clippy/) надає ще більше лінтів, організованих у групи, які можна вмикати для кожного проекту.

source: "X probably fits in a u16, right? {}"
fa: ""X احتمالاً در یک u16 مناسب است، درست است؟ {}"X احتمالاً در یک u16 مناسب است، درست است؟ {}"
pt_br: "X provavelmente cabe em um u16, certo? {}"
uk: "X, напевно, поміститься в u16, так? {}"

source: Run the code sample and examine the error message. There are also lints visible here, but those will not be shown once the code compiles. Switch to the Playground site to show those lints.
fa: نمونه کد را اجرا کنید و پیام خطا را بررسی کنید. lintهایی نیز در اینجا قابل مشاهده هستند، اما پس از کامپایل شدن کد، آن‌ها نشان‌داده نمی‌شوند. برای نمایش آن lintها به سایت Playground بروید.
ja: コードサンプルを実行してエラー メッセージを確認します。ここにも lint が表示されていますが、コードのコンパイルが一度コンパイル出来ると表示されなくなります。これらの lint を表示するには、プレイグラウンド サイトに切り替えます。
pt_br: Execute o exemplo de código e examine a mensagem de erro. Existem também alertas/lints visíveis aqui, mas esses não serão mostrados uma vez que o código seja compilado. Mude para o site do _Playground_ para mostrar esses lints.
uk: Запустіть приклад коду і вивчіть повідомлення про помилку. Тут також видно лінти, але вони не будуть показані після компіляції коду. Перейдіть на сайт майданчика, щоб показати ці лінти.

source: After resolving the lints, run `clippy` on the playground site to show clippy warnings. Clippy has extensive documentation of its lints, and adds new lints (including default-deny lints) all the time.
fa: پس از رفع lintها، `clippy` را در سایت playground اجرا کنید تا هشدارهای clippy نشان داده شود. Clippy مستندات گسترده‌ای از lintهای خود دارد و همیشه lintهای جدید (از جمله default-deny lint) را اضافه می‌کند.
ja: lint を解決した後、プレイグラウンド サイトで `clippy` を実行して、Clippy の警告を表示します。Clippy には、lint に関する広範なドキュメントがあり、新しい lint（デフォルトでエラーになるリント を含む）が常に追加されています。
pt_br: Depois de resolver os lints, execute `clippy` no site do _playground_ para mostrar alertas/lints do clippy. Clippy tem uma extensa documentação de seus lints, e adiciona novos lints (incluindo lints de negação padrão) o tempo todo.
uk: Після усунення лінтів запустіть `clippy` на сайті майданчика, щоб показати попередження clippy. Clippy має вичерпну документацію щодо своїх лінтів і постійно додає нові лінти (включно з лінтами, які заборонено за замовчуванням).

source: Note that errors or warnings with `help: ...` can be fixed with `cargo fix` or via your editor.
fa: توجه داشته باشید که خطاها یا هشدارهای مربوط به `help: ...` را می‌توان با `cargo fix` یا از طریق ویرایشگر خود برطرف کرد.
ja: `help: ...` が付くエラーや警告は、`cargo fix` またはエディタを使用して修正できます。
pt_br: Observe que erros ou alertas/lints com `help: ...` podem ser corrigidos com `cargo fix` ou via seu editor.
uk: Зауважте, що помилки або попередження з `help: ...` можна виправити за допомогою `cargo fix` або за допомогою вашого редактора.

source: Luhn Algorithm
es: Algoritmo de Luhn
fa: الگوریتم Luhn
ja: Luhnアルゴリズム
ko: 룬 알고리즘
pt_br: Algoritmo de Luhn
uk: Алгоритм Луна

source: The [Luhn algorithm](https://en.wikipedia.org/wiki/Luhn_algorithm) is used to validate credit card numbers. The algorithm takes a string as input and does the following to validate the credit card number:
es: El [algoritmo de Luhn](https://es.wikipedia.org/wiki/Luhn_algorithm) se usa para validar números de tarjetas de crédito. El algoritmo toma una cadena como entrada y hace lo siguiente para validar el número de la tarjeta de crédito:
fa: [الگوریتم Luhn](https://en.wikipedia.org/wiki/Luhn_algorithm) برای اعتبارسنجی شماره‌های کارت اعتباری استفاده می‌شود. این الگوریتم یک رشته را به عنوان ورودی دریافت می‌کند و برای اعتبارسنجی شماره کارت اعتباری مراحل زیر را انجام می‌دهد:
ja: [Luhn アルゴリズム](https://en.wikipedia.org/wiki/Luhn_algorithm) は、クレジット カード番号の検証に使用されます。このアルゴリズムは文字列を入力として受け取り、以下の処理を行ってクレジット カード番号を検証します。
ko: [룬(Luhn) 알고리즘](https://ko.wikipedia.org/wiki/%EB%A3%AC_%EC%95%8C%EA%B3%A0%EB%A6%AC%EC%A6%98)은 신용카드 번호 검증에 사용되는 알고리즘 입니다. 이 알고리즘은 신용카드 번호를 `문자열`로 입력받고, 아래의 순서에 따라 신용카드 번호의 유효성을 확인합니다:
pt_br: O [algoritmo de Luhn](https://en.wikipedia.org/wiki/Luhn_algorithm) é usado para validar números de cartão de crédito. O algoritmo recebe uma string como entrada e faz o seguinte para validar o número do cartão de crédito:
uk: [Алгоритм Луна](https://en.wikipedia.org/wiki/Luhn_algorithm) використовується для перевірки номерів кредитних карток. Алгоритм приймає рядок як вхідні дані та виконує наступне, щоб перевірити номер кредитної картки:

source: Ignore all spaces. Reject numbers with fewer than two digits.
uk: Ігноруємо всі пробіли. Відхиляємо числа із менш ніж двома цифрами.

source: Moving from **right to left**, double every second digit: for the number `1234`, we double `3` and `1`. For the number `98765`, we double `6` and `8`.
es: De derecha a izquierda, duplica cada dos cifras: en el caso del número `1234`, se duplica el `3` y el `1`. En el caso del número `98765`, se duplica el `6` y el `8`.
fa: با حرکت از سمت راست رشته به چپ، هر دومین رقم را دوبل کنید: برای شماره `1234`، `3` و `1` را دوبل می‌کنیم. برای شماره `98765`، `6` و `8` را دوبل می‌کنیم.
ja: **右から左に**見ていきながら、それぞれ2桁目の数字を 2 倍にします。数値 `1234` の場合、`3` と `1` を 2 倍にします。数値 `98765` の場合、`6` と `8` を 2 倍にします。
ko: **오른쪽에서 왼쪽으로** 이동하며 2번째 자리마다 숫자를 2배 증가시킵니다. 예를 들어 `1234`에서 `3`과 `1`에 각각 2를 곱합니다.
pt_br: Movendo-se da **direita para a esquerda**, dobre cada segundo dígito: para o número `1234`, dobramos `3` e `1`. Para o número `98765`, dobramos `6` e `8`.
uk: Рухаючись **справа наліво**, подвоює кожну другу цифру: для числа `1234` ми подвоюємо `3` і `1`. Для числа `98765` ми подвоюємо `6` і `8`.

source: After doubling a digit, sum the digits if the result is greater than 9. So doubling `7` becomes `14` which becomes `1 + 4 = 5`.
fa: پس از دوبل کردن یک عدد، اگر اون جفت خروجی بیش از 9 باشد، ارقام را جمع کنید. بنابراین، دوبل کردن `7` به `14` تبدیل می‌شود که به <span dir=ltr>`1 + 4 = 5`</span> تبدیل می‌شود.
ja: 桁を 2 倍にした後、結果が 9 より大きい場合はその桁を合計します。したがって、`7` を 2 倍すると `14` になり、`1 + 4 = 5` になります。
pt_br: Depois de dobrar um dígito, some os dígitos se o resultado for maior que 9. Então, dobrar `7` se torna `14` que se torna `1 + 4 = 5`.
uk: Після подвоєння цифри підсумовує цифри, якщо результат більший за 9. Таким чином, подвоєння `7` перетворюється на `14`, яке стає `1 + 4 = 5`.

source: Sum all the undoubled and doubled digits.
es: Suma todos los dígitos, no duplicados y duplicados.
fa: تمام ارقام دو برابر نشده و دو برابر شده را جمع کنید.
ja: 2 倍にしていない数字と 2 倍にした数字をすべて合計します。
ko: 모든 자리의 숫자를 더합니다.
pt_br: Some todos os dígitos, dobrados ou não.
uk: Підсумовує всі неподвоєні та подвоєні цифри.

source: The credit card number is valid if the sum ends with `0`.
es: El número de la tarjeta de crédito es válido si la suma termina en `0`.
fa: اگر مجموع با ‍`0` خاتمه یابد، شماره کارت اعتباری معتبر است.
ja: クレジット カード番号は、合計が `0` で終わる場合に有効です。
ko: 합계의 끝자리가 `0`인 경우 유효한 신용카드 번호입니다.
pt_br: O número do cartão de crédito é válido se a soma terminar em `0`.
uk: Номер кредитної картки дійсний, якщо сума закінчується на `0`.

source: The provided code provides a buggy implementation of the luhn algorithm, along with two basic unit tests that confirm that most of the algorithm is implemented correctly.
fa: کد ارائه شده یک پیاده‌سازی باگ از الگوریتم luhn را به همراه دو unit test پایه ارائه می‌کند که تأیید می‌کند بیشتر الگوریتم به درستی پیاده‌سازی شده است.
uk: Наданий код містить реалізацію алгоритму Луна з помилками, разом з двома базовими модульними тестами, які підтверджують, що більша частина алгоритму реалізована коректно.

source: Copy the code below to <https://play.rust-lang.org/> and write additional tests to uncover bugs in the provided implementation, fixing any bugs you find.
ja: 以下のコードを <https://play.rust-lang.org/> にコピーし、提供された実装のバグを発見するための追加のテストを記述し、見つけたバグを修正してください。
uk: Скопіюйте наведений нижче код на <https://play.rust-lang.org/> і напишіть додаткові тести для виявлення помилок у наданій реалізації, виправивши всі знайдені помилки.

source: // This is the buggy version that appears in the problem.
ja: // これは問題に記述されているバグのあるバージョンです。
pt_br: // Esta é a versão com bugs que aparece no problema.
uk: // Це версія з помилками, яка з'являється у проблемі.

source: // This is the solution and passes all of the tests below.
ja: // これは解答で、以下のすべてのテストに合格します。
pt_br: // Esta é a solução e passa em todos os testes abaixo.
uk: // Це рішення, яке проходить усі наведені нижче тести.

source: "Is {cc_number} a valid credit card number? {}"
fa: "آیا {cc_number} یک شماره کارت اعتباری معتبر است؟ {}"
pt_br: "O número do cartão de crédito {cc_number} é válido? {}"
uk: "Чи є {cc_number} дійсним номером кредитної картки? {}"

source: "yes"
fa: "بله"
pt_br: "sim"
uk: "так"

source: "no"
fa: "نه"
pt_br: "não"
uk: "ні"

source: Rust handles fatal errors with a "panic".
fa: Rust خطاهای مهلک را با "panic" کنترل می‌کند.
ja: Rust は「パニック」を使用して致命的なエラーを処理します。
pt_br: Rust lida com erros fatais com um "pânico".
uk: Rust обробляє фатальні помилки з "panic".

source: Rust will trigger a panic if a fatal error happens at runtime:
es: Rust activará un _panic_ si se produce un error grave en _runtime_:
fa: اگر یک خطای مرگبار در زمان اجرا رخ دهد، Rust باعث panic می‌شود:
ja: 実行時に致命的なエラーが発生すると、Rust はパニックをトリガーします。
ko: 러스트는 수행 중 치명적인 오류를 만나면 패닉을 발생할 것입니다:
pt_br: O Rust irá disparar um _panic_ (pânico) se um erro fatal ocorrer em tempo de execução:
uk: Rust викличе паніку, якщо під час виконання станеться фатальна помилка:

source: Panics are for unrecoverable and unexpected errors.
es: Los _panics_ se usan para errores irrecuperables e inesperados.
fa: استفاده از Panicها برای خطاهای غیر قابل جبران و غیرمنتظره است.
ja: パニックは、回復不能なエラーや予期しないエラーに使用するためのものです。
ko: 패닉은 복구할 수 없고 예상치 못한 오류입니다.
pt_br: _Pânicos_ são para erros irrecuperáveis e inesperados.
uk: Паніки – це невиправні та несподівані помилки.

source: Panics are symptoms of bugs in the program.
es: Los _panics_ son un síntoma de que hay fallos en el programa.
fa: پانیک‌ها علائم باگ در برنامه هستند.
ja: パニックはプログラムにバグがあることの兆候です。
ko: 패닉은 프로그램에 버그가 있다는 것을 나타냅니다.
pt_br: Pânicos são sintomas de bugs no programa.
uk: Паніки є ознакою помилок у програмі.

source: Runtime failures like failed bounds checks can panic
fa: خرابی‌های زمان اجرا مانند failed bounds checkها می‌تواند باعث panic شود
ja: ランタイム エラー（境界チェックの失敗など）は、パニックになる場合があります。
pt_br: Falhas em tempo de execução como verificações de limites falhadas podem disparar um pânico
uk: Збої у виконанні, такі як невдалі перевірки меж, можуть викликати паніку

source: Assertions (such as `assert!`) panic on failure
ja: アサーション（`assert!` など）は失敗時にパニックになります。
pt_br: Asserções (como `assert!`) disparam um pânico em caso de falha
uk: Твердження (наприклад, `assert!`) панікують у разі невдачі

source: Purpose-specific panics can use the `panic!` macro.
fa: پنیک‌های خاص می‌توانند از ماکرو `panic!` استفاده کنند.
ja: 特定の目的でパニックさせてあい場合には、`panic!` マクロを使用できます。
pt_br: Pânicos com moticos específicos podem usar a macro `panic!`.
uk: Для спеціальних панік можна використовувати макрос `panic!`.

source: A panic will "unwind" the stack, dropping values just as if the functions had returned.
fa: یک panic را "باز" ​​می‌کند و مقادیر را حذف می‌کند درست مثل اینکه توابع برگشته باشند.
ja: パニックが発生すると、スタックが「アンワインド」され、関数がリターンされたかのように値がドロップされます。
pt_br: Um pânico irá "desenrolar" a pilha, descartando valores como se as funções tivessem retornado.
uk: Паніка "розмотує" стек, відкидаючи значення так, як якщо б функції повернулися.

source: Use non-panicking APIs (such as `Vec::get`) if crashing is not acceptable.
es: Utiliza API que no activen _panics_ (como `Vec::get`) si no se admiten fallos.
fa: اگر خرابی قابل قبول نیست، از APIهای بدون panic (مانند `Vec::get`) استفاده کنید.
ja: クラッシュが許容されない場合は、パニックが発生しない API（`Vec::get` など）を使用します。
ko: 충돌(크래시)을 허용하지 않아야 하는 경우, 패닉을 유발하지 않는 API(`Vec::get`등)를 사용하면 됩니다.
pt_br: Use APIs que não disparam erros do tipo _pânico_ (como `Vec::get`) se não for aceitável o travamento do programa.
uk: Використовуйте API, що не викликають паніки (такі як `Vec::get`), якщо збій неприйнятний.

source: By default, a panic will cause the stack to unwind. The unwinding can be caught:
es: De forma predeterminada, el _panic_ hará que la _stack_ se desenrolle. El proceso de desenrrollado se puede detectar:
fa: به طور پیش‌فرض، panic باعث unwind شدن stack می‌شود. unwinding را می‌توان گرفت( در واقع منظور این است که می‌توان آن را caught کرد):
ja: デフォルトでは、パニックが発生するとスタックはアンワインドされます。アンワインドは以下のようにキャッチできます。
ko: 기본적으로, 패닉이 발생하면 스택 되감기를 합니다. 스택 되감기는 다음과 같이 캐치가 가능합니다:
pt_br: Por padrão, um pânico causará a _resolução_ da pilha. A resolução pode ser capturada:
uk: За замовчуванням паніка призведе до розмотування стека. Розмотування можна зловити:

source: "No problem here!"
fa: "اینجا مشکلی نیست!"
pt_br: "Nenhum problema aqui!"
uk: "Ніяких проблем!"

source: "oh no!"
pt_br: "ah não!"
uk: "о, ні!"

source: Catching is unusual; do not attempt to implement exceptions with `catch_unwind`!
fa: گرفتن (Catching) غیر معمول است. سعی نکنید exceptionها را با `catch_unwind` پیاده‌سازی کنید!
ja: キャッチは一般的ではないため、`catch_unwind` を使用して例外処理を実装しようとしないでください。
pt_br: Capturar é incomum; não tente implementar exceções com `catch_unwind`!
uk: Перехоплення є незвичайним; не намагайтеся реалізувати виключення за допомогою `catch_unwind`!

source: This can be useful in servers which should keep running even if a single request crashes.
es: Esto puede ser útil en los servidores que deben seguir ejecutándose aunque una sola solicitud falle.
fa: این کار می‌تواند در سرورهایی مفید باشد که حتی در صورت خراب شدن یک درخواست، باید به کار خود ادامه دهند.
ja: これは、1 つのリクエストがクラッシュした場合でも実行し続ける必要があるサーバーで有用です。
ko: 이것은 단일 요청이 크래시 되더라도 프로그램이 계속 실행되야 하는 서버에 유용합니다.
pt_br: Isso pode ser útil em servidores que devem continuar rodando mesmo se uma requisição tenha falhado.
uk: Це може бути корисним на серверах, які повинні продовжувати працювати навіть у разі збою одного запиту.

source: This does not work if `panic = 'abort'` is set in your `Cargo.toml`.
es: No funciona si `panic = 'abort'` está definido en `Cargo.toml`.
fa: اگر `panic = 'abort'` در `Cargo.toml`» شما تنظیم شده باشد، این مورد کار نمی‌کند.
ja: これは、`Cargo.toml` で `panic = 'abort'` が設定されている場合は機能しません。
ko: 만약 `Cargo.toml`설정파일에 `panic = abort`을 설정했다면 크래시를 캐치할 수 없습니다.
pt_br: Isso não funciona se `panic = 'abort'` estiver definido em seu `Cargo.toml`.
uk: Це не працює, якщо у вашому `Cargo.toml` встановлено `panic = 'abort'`.

source: Our primary mechanism for error handling in Rust is the [`Result`](https://doc.rust-lang.org/stable/std/result/enum.Result.html) enum, which we briefly saw when discussing standard library types.
fa: مکانیسم اصلی ما برای مدیریت خطا در Rust، فهرست [`Result`](https://doc.rust-lang.org/stable/std/result/enum.Result.html) است، که به طور خلاصه هنگام بحث در مورد تایپ‌های کتابخانه استاندارد مشاهده کردیم.
uk: Основним механізмом обробки помилок у Rust є перелік [`Result`](https://doc.rust-lang.org/stable/std/result/enum.Result.html), який ми коротко розглядали під час обговорення стандартних бібліотечних типів.

source: `Result` has two variants: `Ok` which contains the success value, and `Err` which contains an error value of some kind.
uk: `Result` має два варіанти: `Ok`, який містить значення успіху, і `Err`, який містить деяке значення помилки.

source: Whether or not a function can produce an error is encoded in the function's type signature by having the function return a `Result` value.
fa: اینکه آیا یک تابع می‌تواند خطا ایجاد کند یا نه، در signature نوع تابع با برگرداندن تابع مقدار `Result` کدگذاری می‌شود.
uk: Чи може функція спричинити помилку, кодується у сигнатурі типу функції, яка повертає значення `Result`.

source: Like with `Option`, there is no way to forget to handle an error: You cannot access either the success value or the error value without first pattern matching on the `Result` to check which variant you have. Methods like `unwrap` make it easier to write quick-and-dirty code that doesn't do robust error handling, but means that you can always see in your source code where proper error handling is being skipped.
fa: مانند `Option`، هیچ راهی برای فراموش کردن خطا وجود ندارد: شما نمی‌توانید به مقدار موفقیت یا مقدار خطا بدون تطبیق الگوی اولیه در `Result` دسترسی پیدا کنید تا بررسی کنید کدام نوع را دارید. روش‌هایی مانند`unwrap` نوشتن کدهای سریع و کثیف را آسان‌تر می‌کنند که مدیریت خطا را به خوبی انجام نمی‌دهد، اما به این معنی است که همیشه می‌توانید در کد منبع خود ببینید که در کجا مدیریت صحیح خطا نادیده گرفته می‌شود.
uk: Як і у випадку з `Option`, ви не можете забути обробити помилку: Ви не можете отримати доступ ні до значення успіху, ні до значення помилки без попередньої обробки шаблону на `Result`, щоб перевірити, який саме варіант ви отримали. Методи на кшталт `unwrap` полегшують написання швидкого і брудного коду, який не забезпечує надійну обробку помилок, але означає, що ви завжди можете побачити у вихідному коді, де було пропущено належну обробку помилок.

source: It may be helpful to compare error handling in Rust to error handling conventions that students may be familiar with from other programming languages.
fa: مقایسه مدیریت خطا در Rust با قراردادهای مدیریت خطا که دانش‌آموزان ممکن است با سایر زبان‌های برنامه‌نویسی آشنا باشند، ممکن است مفید باشد.
uk: Може бути корисно порівняти обробку помилок у Rust зі стандартами обробки помилок, з якими студенти можуть бути знайомі з інших мов програмування.

source: Many languages use exceptions, e.g. C++, Java, Python.
fa: بسیاری از زبان‌ها از exceptionها استفاده می‌کنند، به عنوان مثال. ++C، جاوا، پایتون.
uk: Багато мов використовують виключення, наприклад, C++, Java, Python.

source: In most languages with exceptions, whether or not a function can throw an exception is not visible as part of its type signature. This generally means that you can't tell when calling a function if it may throw an exception or not.
fa: در اکثر زبان‌های دارای exception، این که آیا یک تابع می‌تواند استثنا ایجاد کند یا نه، به عنوان بخشی از نوع امضای(signature) آن قابل مشاهده نیست. این به طور کلی به این معنی است که هنگام فراخوانی یک تابع نمی‌توانید بگویید که آیا ممکن است یک exception ایجاد کند یا خیر.
uk: У більшості мов з виключеннями інформація про те, чи може функція згенерувати виключення, не відображається у сигнатурі її типу. Це зазвичай означає, що при виклику функції ви не можете визначити, чи може вона згенерувати виключення.

source: Exceptions generally unwind the call stack, propagating upward until a `try` block is reached. An error originating deep in the call stack may impact an unrelated function further up.
fa: استثناها معمولاً call stack را باز می‌کنند و تا رسیدن به بلوک `try` به سمت بالا منتشر می‌شوند. خطایی که در اعماق call stack ایجاد می‌شود ممکن است بر عملکرد نامرتبط بیشتر تأثیر بگذارد.
uk: Виключення, як правило, розмотують стек викликів, поширюючись вгору, поки не буде досягнуто блоку `try`. Помилка, що виникла глибоко у стеку викликів, може вплинути на не пов'язану з нею функцію, розташовану вище.

source: Error Numbers
fa: شماره‌های خطا
uk: Коди помилок

source: Some languages have functions return an error number (or some other error value) separately from the successful return value of the function. Examples include C and Go.
fa: برخی از زبان‌ها دارای توابعی هستند که یک عدد خطا (یا مقداری خطای دیگر) را جدا از مقدار بازگشت موفقیت‌آمیز تابع برمی‌گردانند. به عنوان مثال می توان به C و Go اشاره کرد.
uk: У деяких мовах функції повертають код помилки (або інше значення помилки) окремо від успішного значення, яке повертає функція. Приклади включають C та Go.

source: Depending on the language it may be possible to forget to check the error value, in which case you may be accessing an uninitialized or otherwise invalid success value.
fa: بسته به زبان ممکن است فراموش کنید مقدار خطا را بررسی کنید، در این صورت ممکن است به یک مقدار موفقیت نامعتبر یا نامعتبر دسترسی داشته باشید.
uk: Залежно від мови можна забути перевірити значення помилки, і в цьому випадку ви можете отримати доступ до неініціалізованого або іншим чином недійсного значення успішного завершення.

source: Runtime errors like connection-refused or file-not-found are handled with the `Result` type, but matching this type on every call can be cumbersome. The try-operator `?` is used to return errors to the caller. It lets you turn the common
fa: خطاهای زمان اجرا مانند connection-refused یا file-not-found با نوع «نتیجه» مدیریت می‌شوند، اما تطبیق این نوع در هر تماس می‌تواند دشوار باشد. اپراتور `?` برای برگرداندن خطاها به تماس گیرنده استفاده می‌شود. این به شما امکان می‌دهد تا موارد مشترک را بازگردانید.
ja: connection-refused や file-not-found などのランタイム エラーは `Result` 型で処理されますが、すべての呼び出しでこの型を照合するのは面倒な場合があります。try 演算子 `?` は、呼び出し元にエラーを返すのに使用されます。これにより、一般的な以下のコードを、はるかにシンプルなコードに変換できます。
pt_br: Erros em tempo de execução como conexão recusada ou arquivo não encontrado são tratados com o tipo `Result`, mas combinar esse tipo em cada chamada pode ser complicado. O operador `?` é usado para retornar erros ao chamador. Ele permite que você transforme o comum
uk: Помилки виконання, такі як відмова у з'єднанні або не знайдено файл, обробляються за допомогою типу `Result`, але зіставлення цього типу для кожного виклику може бути громіздким. Оператор спроби `?` використовується для повернення помилок користувачеві. Він дозволяє перетворити звичайний оператор

source: into the much simpler
es: en algo mucho más sencillo:
fa: بسیار ساده‌تر
ja: 変換後のコード:
ko: 이렇게 짧게 쓸 수 있습니다
pt_br: no muito mais simples
uk: у набагато простіше

source: We can use this to simplify our error handling code:
es: Podemos utilizarlo para simplificar el código de gestión de errores:
fa: می‌توانیم از این برای ساده‌سازی کد رسیدگی به خطا استفاده کنیم:
ja: この演算子を使用することで、エラー処理コードを簡素化できます。
ko: 이제 우리 예제에 적용해 보겠습니다:
pt_br: Podemos usar isso para simplificar nosso código de tratamento de erros:
uk: Ми можемо використовувати це, щоб спростити наш код обробки помилок:
