Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Rust uses macros for situations where you want to have a variable number of arguments (no function [overloading](basic-syntax/functions-interlude.md)).
es: Rust utiliza macros en situaciones en las que se desea tener un número variable de argumentos (sin [sobrecarga](basic-syntax/functions-interlude.md) de funciones).
ko: 러스트는 인자의 개수를 사전에 지정할 수 없는 상황에서 함수 [오버로딩](basic-syntax/functions-interlude.md)대신 매크로를 사용합니다.

source: Here is a small example program in Rust:
es: A continuación, se muestra un pequeño programa de ejemplo de Rust:
ko: 러스트로 작성된 작은 예제입니다:

source: ```rust,editable fn main() { // Program entry point let mut x: i32 = 6; // Mutable variable binding print!("{x}"); // Macro for printing, like printf while x != 1 { // No parenthesis around expression if x % 2 == 0 { // Math like in other languages x = x / 2; } else { x = 3 * x + 1; } print!(" -> {x}"); } println!(); } ```
es: ```rust,editable fn main() { // Punto de entrada del programa let mut x: i32 = 6; // Variable mutable vinculante print!("{x}"); // Macro para printing, como printf while x != 1 { // Sin paréntesis alrededor de las expresiones if x % 2 == 0 { // Operaciones matemáticas como en otros lenguajes x = x / 2; } else { x = 3 * x + 1; } print!(" -> {x}"); } println!(); } ```
ko: ```rust,editable fn main() { // 프로그램 진입점입니다. let mut x: i32 = 6; // 가변 변수 할당(binding)입니다. print!("{x}"); // printf와 같은 출력을 위한 매크로 입니다. while x != 1 { // 표현식에 괄호는 없습니다. if x % 2 == 0 { // 다른 언어와 같은 수학연산식이 사용됩니다. x = x / 2; } else { x = 3 * x + 1; } print!(" -> {x}"); } println!(); } ```

source: The code implements the Collatz conjecture: it is believed that the loop will always end, but this is not yet proved. Edit the code and play with different inputs.
es: El código implementa la conjetura de Collatz: se cree que el bucle terminará siempre, pero aún no se ha demostrado. Edita el código y prueba con diferentes entradas.
ko: 이 코드는 콜라츠 추측(Collatz conjecture)으로 구현됩니다: 반복문이 언제나 종료될 것이라고 믿지만 증명된 것은 아닙니다. 코드를 수정하고 실행해 보시기 바랍니다.

source: Explain that all variables are statically typed. Try removing `i32` to trigger type inference. Try with `i8` instead and trigger a runtime integer overflow.
es: Explica que todas las variables están tipadas estáticamente. Prueba a quitar `i32` para activar la inferencia de tipos. Prueba con `i8` y provoca un desbordamiento de enteros en _runtime_.
ko: 모든 변수가 컴파일 시 정해진 타입을 가짐을 설명합니다. `i32`를 삭제하여 컴파일러가 타입 추론을 하도록 해 봅니다. `i32`을 `i8`로 변경하여 런타임 오버플로를 유발해 볼 수 있습니다.

source: Change `let mut x` to `let x`, discuss the compiler error.
es: Cambia `let mut x` por `let x` y discute el error del compilador.
ko: `let mut x`를 `let x`로 수정하여 컴파일 오류에 대해 토론합니다.

source: Show how `print!` gives a compilation error if the arguments don't match the format string.
es: Muestra cómo `print!` da un error de compilación si los argumentos no coinciden con la cadena de formato.
ko: 인자가 포맷 문자열과 일치하지 않는 경우 `print!`에서 컴파일 오류가 발생함을 언급하는 것도 좋습니다.

source: Show how you need to use `{}` as a placeholder if you want to print an expression which is more complex than just a single variable.
es: Muestra cómo se debe usar `{}` como marcador de posición para poder imprimir una expresión más compleja que una sola variable.
ko: 단일 변수보다 복잡한 식을 출려하려면 `{}`을 자리 표시자로 사용하는 방법을 보여 줍니다.

source: Show the students the standard library, show them how to search for `std::fmt` which has the rules of the formatting mini-language. It's important that the students become familiar with searching in the standard library.
es: Muestra a los alumnos la biblioteca estándar y cómo buscar `std::fmt`, que tiene las reglas del mini-lenguaje de formato. Es importante que los alumnos se familiaricen con la búsqueda en la biblioteca estándar.
ko: 학생들에게 표준 라이브러리가 어디 있는지 알려 주고는, `print!`가 지원하는 포맷팅 언어의 문법을 알기 위해 `std::fmt`를 검색해야 한다는 것을 가르치세요.학생들이 표준 라이브러리의 검색 기능에 익숙해 지도록 하는 것이 중요합니다.

source: In a shell `rustup doc std::fmt` will open a browser on the local std::fmt documentation
es: En un shell, `rustup doc std::fmt` abrirá un navegador en la documentación local de std::fmt.
ko: 쉘에서 `rustup doc std::fmt`를 수행하면 로컬 브라우저로 `std:fmt`에 대한 문서를 보여줍니다

source: Compile time memory safety.
es: Seguridad de la memoria en tiempo de compilación.
ko: 컴파일 시 메모리 안전이 보장됨.

source: Lack of undefined runtime behavior.
es: Ausencia de comportamientos indefinidos en _runtime_.
ko: 정의되지 않은 런타임 동작이 없음.

source: Modern language features.
es: Características de lenguajes modernos.
ko: 현대적인 언어 기능.

source: Static memory management at compile time:
es: Gestión estática de la memoria en tiempo de compilación:
ko: 컴파일 시 정적 메모리 관리:

source: No memory leaks (_mostly_, see notes).
es: No hay pérdidas de memoria (_casi siempre_, consulta las notas).
ko: 메모리 누출 없음(_거의_. 강의참조노트 참고.)

source: It is possible to produce memory leaks in (safe) Rust. Some examples are:
es: Es posible producir pérdidas de memoria en (_safe_) Rust. Estos son algunos ejemplos:
ko: (안전한) 러스트에서도 메모리 누출이 발생할 수 있는 몇 가지 경우가 있습니다:

source: You can use [`Box::leak`](https://doc.rust-lang.org/std/boxed/struct.Box.html#method.leak) to leak a pointer. A use of this could be to get runtime-initialized and runtime-sized static variables
es: Puedes usar [`Box::leak`](https://doc.rust-lang.org/std/boxed/struct.Box.html#method.leak) para perder un puntero. Esto podría usarse para obtener variables estáticas iniciadas y medidas en _runtime_.
ko: [`Box::leak`](https://doc.rust-lang.org/std/boxed/struct.Box.html#method.leak)을 이용하여 포인터를 의도적으로 누출시킬 수 있습니다. 이를 이용해서 런타임이 생성하고 런타임이 크기를 정한 정적 변수를 가져올 수 있습니다

source: You can use [`std::mem::forget`](https://doc.rust-lang.org/std/mem/fn.forget.html) to make the compiler "forget" about a value (meaning the destructor is never run).
es: Puedes usar [`std::mem::forget`](https://doc.rust-lang.org/std/mem/fn.forget.html) para que el compilador "olvide" un valor (lo que significa que el destructor nunca se ejecuta).
ko: [`std::mem::forget`](https://doc.rust-lang.org/std/mem/fn.forget.html)을 사용하여 컴파일러가 값에 대해 "잊도록" 만들 수 있습니다(소멸자가 실행되지 않음을 의미합니다).

source: You can also accidentally create a [reference cycle](https://doc.rust-lang.org/book/ch15-06-reference-cycles.html) with `Rc` or `Arc`.
es: También puedes crear por accidente una [referencia circular](https://doc.rust-lang.org/book/ch15-06-reference-cycles.html) con `Rc` o `Arc`.
ko: `Rc` 또는 `Arc`를 사용하여 실수로 [순환참조](https://doc.rust-lang.org/book/ch15-06-reference-cycles.html)를 생성할 수도 있습니다.

source: In fact, some will consider infinitely populating a collection a memory leak and Rust does not protect from those.
es: De hecho, algunos consideran que poblar de forma infinita una colección es una fuga de memoria y Rust no protege de ellas.
ko: 컬렉션을 무한정 채우는 것을 메모리 누출로 간주할 수도 있지만, 러스트는 이를 보호하진 못합니다.

source: For the purpose of this course, "No memory leaks" should be understood as "Pretty much no _accidental_ memory leaks".
es: En este curso, "sin pérdidas de memoria" debe entenderse como "casi ninguna pérdida de memoria _accidental_".
ko: 본 강의에서는 "메모리 누출 없음"을 "우발적인 메모리 누출 없음"으로 이해해야 합니다.

source: No undefined behavior at runtime:
es: No hay comportamientos indefinidos en _runtime_:
ko: 런타임 시 정의되지 않음(undefined) 동작 없음:

source: Integer overflow is defined via the [`overflow-checks`](https://doc.rust-lang.org/rustc/codegen-options/index.html#overflow-checks) compile-time flag. If enabled, the program will panic (a controlled crash of the program), otherwise you get wrap-around semantics. By default, you get panics in debug mode (`cargo build`) and wrap-around in release mode (`cargo build --release`).
es: El overflow en Integer es definido vía un _flag_ en tiempo de compilación. Las opciones son alertas panic (un crash controlado del programa) o una semántica de _wrap-around_. Por defecto, obtienes el alerta en modo depuración (`cargo build`) y _wrap-around_ en el modo release (`cargo build —
ko: 정수형 오버플로우는 [`overflow-checks`](https://doc.rust-lang.org/rustc/codegen-options/index.html#overflow-checks) 컴파일 타임 플래그를 통해 정의됩니다. 이 플래그가 켜지면, 프로그램은 정수형 오버플로우 발생시 panic (프로그램을 크래시 시키는 잘 정의된 방법) 합니다. 이 플래그가 꺼지면, 오버플로우는 wrap-around 가 됩니다. 기본적으로 디버그 모드(`cargo build`)에서는 패닉이, 릴리즈 모드(`cargo build --release`)에서는 wrap-around가 발생합니다.

source: Bounds checking cannot be disabled with a compiler flag. It can also not be disabled directly with the `unsafe` keyword. However, `unsafe` allows you to call functions such as `slice::get_unchecked` which does not do bounds checking.
es: La comprobación de límites no se puede deshabilitar con una bandera de compilador. Tampoco se puede inhabilitar directamente con la palabra clave `unsafe`. Sin embargo, `unsafe` te permite llamar a funciones como `slice::get_unchecked`, que no realiza comprobaciones de límites.
ko: 컴파일 플래그를 사용하여 경계체크를 무력화 할 수 없습니다. `unsafe`를 사용하더라도 마찬가지입니다. 하지만 `unsafe`에서 호출 가능한 `slice::get_unchecked`같은 함수는 경계 검사를 수행하지 않습니다.

source: Rust is built with all the experience gained in the last decades.
es: Rust se ha creado a partir de toda la experiencia obtenida en las últimas décadas.
ko: 러스트는 지난 수십년간의 모든 (프로그래밍 언어들의) 경험으로 만들어졌습니다.

source: Language Features
es: Características del Lenguaje
ko: 언어적 특징

source: Tooling
es: Herramientas
ko: 도구들

source: Zero-cost abstractions, similar to C++, means that you don't have to 'pay' for higher-level programming constructs with memory or CPU. For example, writing a loop using `for` should result in roughly the same low level instructions as using the `.iter().fold()` construct.
es: Las abstracciones sin coste, similares a las de C++, significan que no tienes que 'pagar' por construcciones de programación de alto nivel con memoria o CPU. Por ejemplo, escribir un bucle utilizando `for` debería dar como resultado prácticamente las mismas instrucciones de bajo nivel que con la construcción `.iter().fold()`.
ko: C++ 와 유사하게 제로 코스트 추상화는 CPU나 메모리를 사용하여 상위레벨 프로그래밍 구조를 만드는데 '비용'을 지불할 필요가 없습니다. 예를 들어 `for` 루프와와 `iter().fold()` 구조를 사용하는 것과 거의 동일한 낮은 수준의 명령어가 생성될 것 입니다.

source: It may be worth mentioning that Rust enums are 'Algebraic Data Types', also known as 'sum types', which allow the type system to express things like `Option<T>` and `Result<T, E>`.
es: Merece la pena mencionar que los enums de Rust son tipos de datos algebraicos, también denominados 'tipos suma', que permiten al sistema de tipos expresar cosas como `Option<T>` y `Result<T, E>`.
ko: 러스트의 열거형(enum)은 합계 타입(sum type)으로 알려진 대수학적 데이터형(Algebraic Data Type)으로, 타입 시스템이 `Option<T>`와 `Result<T, E>`등을 표현할 수 있게 해줍니다.

source: Remind people to read the errors --- many developers have gotten used to ignore lengthy compiler output. The Rust compiler is significantly more talkative than other compilers. It will often provide you with _actionable_ feedback, ready to copy-paste into your code.
es: Recuerda a los alumnos que lean los errores, ya que muchos desarrolladores se han acostumbrado a ignorar los largos resultados del compilador. El compilador de Rust es mucho más comunicativo que otros. A menudo, te proporcionará sugerencias _prácticas_, que puedes copiar y pegar en tu código.
ko: 오류를 읽어보시기 바랍니다 --- 오랜기간 많은 개발자들이 컴파일러 출력을 무시하는데 익숙해져 있습니다. 러스트 컴파일러는 다른 컴파일러보다 더 수다스럽고, 복사-붙여넣기 할 수 있는 정도의 코드 피드백을 제공하는 경우가 많습니다.

source: The Rust standard library is small compared to languages like Java, Python, and Go. Rust does not come with several things you might consider standard and essential:
es: La biblioteca estándar de Rust es pequeña en comparación con la de lenguajes como Java, Python o Go. Rust no incluye elementos que se podrían considerar estándar o esenciales:
ko: 러스트 표준 라이브러리는 Java, Python이나 Go와 같은 언어에 비해서 규모가 작습니다. 당연히 포함되어야 한다고 생각할 수도 있는 아래와 같은 것들이 러스트의 표준 라이브러리에 없습니다:

source: a random number generator, but see [rand](https://docs.rs/rand/).
es: un generador de números aleatorios, pero consulta [rand](https://docs.rs/rand/).
ko: 난수 생성기, 하지만 [rand](https://docs.rs/rand/)문서를 참조하시기 바랍니다.

source: support for SSL or TLS, but see [rusttls](https://docs.rs/rustls/).
es: compatibilidad con SSL o TLS, pero consulta [rusttls](https://docs.rs/rustls/).
ko: SSL 또는 TLS지원, 하지만 [rusttls](https://docs.rs/rustls/)문서를 참조하시기 바랍니다.

source: support for JSON, but see [serde_json](https://docs.rs/serde_json/).
es: Compatibilidad con JSON, pero consulta [serde_json](https://docs.rs/serde_json/).
ko: JSON 지원, 하지만 [serde_json](https://docs.rs/serde_json/) 문서를 참조하시기 바랍니다.

source: The reasoning behind this is that functionality in the standard library cannot go away, so it has to be very stable. For the examples above, the Rust community is still working on finding the best solution --- and perhaps there isn't a single "best solution" for some of these things.
es: La razón es que la funcionalidad de la biblioteca estándar no puede desaparecer, por lo que tiene que ser muy estable. En los ejemplos anteriores, la comunidad de Rust todavía está trabajando para encontrar la mejor solución, y puede que no exista una única "mejor solución" para algunas de estas cuestiones.
ko: 그 이유는 표준 라이브러리에서 한 번 어떤 기능을 제공하면 뺄 수 없으며, 매우 안정적이어야 하기 때문입니다. 위에 언급한 기능들은 아직 러스트 커뮤니티가 최고의 솔루션을 찾지 못했기 때문에 표준 라이브러리에 포함되지 않았습니다. 어쩌면 이들 중 몇 개는 '최고의 솔루션'이 아예 존재할 수 없을 지도 모릅니다.

source: Rust comes with a built-in package manager in the form of Cargo and this makes it trivial to download and compile third-party crates. A consequence of this is that the standard library can be smaller.
es: Rust incluye un gestor de paquetes integrado con la forma de Cargo, lo que hace que resulte sencillo descargar y compilar crates de terceros. Como consecuencia, la biblioteca estándar puede ser más pequeña.
ko: 러스트는 카고라는 패키지 관리자가 내장되어 있고, 서드파티 크레이트를 다운로드, 컴파일 하기 매우 쉽습니다. 이 또한 표준 라이브러리가 작은 이유입니다.

source: Discovering good third-party crates can be a problem. Sites like <https://lib.rs/> help with this by letting you compare health metrics for crates to find a good and trusted one.
es: Encontrar buenos crates de terceros puede ser un problema. Sitios como <https://lib.rs/> te ayudan a comparar métricas de salud de crates para encontrar uno bueno y fiable.
ko: 좋은 서드파티 크레이트를 찾는 것은 어렵습니다. <https://lib.rs> 와 같은 사이트가 신뢰할수 있는 좋은 크레이트를 비교하여 찾는데 좋습니다.

source: [rust-analyzer](https://rust-analyzer.github.io/) is a well supported LSP implementation used in major IDEs and text editors.
es: [rust-analyzer](https://rust-analyzer.github.io/) es una implementación de LSP bien respaldada y utilizada en los principales IDE y editores de texto.
ko: [rust-analyzer](https://rust-analyzer.github.io/)는 주요 IDE나 텍스트 에디터에서 사용되는 러스트용 LSP서버 입니다.

source: Blocks and scopes are delimited by curly braces.
es: Los bloques y ámbitos están delimitados por llaves.
ko: 블록과 범위는 중괄호`{}`로 표현합니다.

source: Byte strings allow you to create a `&[u8]` value directly:
es: Las cadenas de bytes te permiten crear un valor `&[u8]` directamente:

source: A value of the array type `[T; N]` holds `N` (a compile-time constant) elements of the same type `T`. Note that the length of the array is _part of its type_, which means that `[u8; 3]` and `[u8; 4]` are considered two different types.
es: Un valor del tipo array `[T; N]` contiene `N` (una constante en tiempo de compilación) elementos del mismo tipo `T`. Ten en cuenta que la longitud del array es *parte de su tipo*, lo que significa que `[u8; 3]` y `[u8; 4]` se consideran dos tipos diferentes.
ko: 배열은, 같은 타입 `T`의 값이 `N`개 있는 것입니다. 여기서 `N`은 컴파일 타임에 결정된 값이어야 합니다. 이 길이도 타입의 일부입니다. 따라서, `[u8; 3]`와 `[u8; 4]`은 서로 다른 타입입니다.

source: In the main function, the print statement asks for the debug implementation with the `?` format parameter: `{}` gives the default output, `{:?}` gives the debug output. We could also have used `{a}` and `{a:?}` without specifying the value after the format string.
es: En la función _main_, la instrucción de impresión solicita la implementación de depuración con el parámetro de formato `?`: `{}` ofrece la salida predeterminada y `{:?}` ofrece la salida de depuración. También se podría haber usado `{a}` y `{a:?}` sin especificar el valor después de la cadena de formato.
ko: 포매팅 문자열에서 `?`는 디버깅 출력을 의미합니다. `{}`는 기본 출력이며, `{:?}`는 디버깅 출력입니다. `{a}`, `{a:?}`와 같이 출력할 변수 이름을 포매팅 문자열에 포함시킬 수도 있으며, 이 경우 인자 `a`는 별도의 인자로 추가하지 않습니다.

source: The empty tuple `()` is also known as the "unit type". It is both a type, and the only valid value of that type - that is to say both the type and its value are expressed as `()`. It is used to indicate, for example, that a function or expression has no return value, as we'll see in a future slide.
es: La tupla vacía `()` también se conoce como "tipo unitario". Es a la vez un tipo y el único valor válido de ese tipo, es decir, tanto el tipo como su valor se expresan como `()`. Se usa para indicar, por ejemplo, que una función o expresión no tiene valor de retorno, como veremos en una diapositiva posterior.
ko: 비어있는 튜플`()`은 단위 타입(unit type)이라고도 합니다. 이는 타입이면서 해당 타입의 유일하며 유효한 값입니다. 즉 타입과 값이 모두 `()`입니다. 예를 들어 함수나 식에서 반환 값이 없음을 나타낼 때 사용합니다.

source: You can think of it as `void` that can be familiar to you from other programming languages.
es: Podríamos pensar en ello como `void`, que quizá resulte familiar de otros lenguajes de programación.
ko: 다른 언어에서 익숙한 `void` 개념으로 생각할 수 있습니다.

source: Like C++, Rust has references:
es: Al igual que C++, Rust tiene referencias:
ko: C++와 마찬가지로 러스트도 참조형을 갖습니다:

source: Some notes:
es: Algunas notas:
ko: 참고사항:

source: We must dereference `ref_x` when assigning to it, similar to C and C++ pointers.
es: Debemos desreferenciar `ref_x` al asignarle un valor, de forma similar a los punteros de C y C++.
ko: `ref_x`에 값을 할당할 때, C/C++의 포인터와 유사하게 `*`를 이용해서 참조를 따라가야(역참조) 합니다.

source: Rust will auto-dereference in some cases, in particular when invoking methods (try `ref_x.count_ones()`).
es: Rust realizará una desreferencia automática en algunos casos, en especial al invocar métodos (prueba `ref_x.count_ones()`).
ko: 러스트는 특정한 경우(메서드 호출)에 자동으로 역참조를 합니다.(`ref_x.count_one()`을 하면 `*ref_x`가 `count_one`의 인자로 전달됩니다.)

source: References that are declared as `mut` can be bound to different values over their lifetime.
es: Las referencias que se declaran como `mut` se pueden vincular a distintos valores durante su tiempo de vida.
ko: `mut`로 선언된 참조는 그 변수가 살아있는 동안 다른 값을 가질 수 있습니다.

source: Be sure to note the difference between `let mut ref_x: &i32` and `let ref_x: &mut i32`. The first one represents a mutable reference which can be bound to different values, while the second represents a reference to a mutable value.
es: Ten en cuenta la diferencia entre `let mut ref_x: &i32` y `let ref_x: &mut i32`. La primera representa una referencia mutable que se puede vincular a distintos valores, mientras que la segunda representa una referencia a un valor mutable.
ko: `let mut ref_x: &i32`와 `let ref_x: &mut i32`의 차이점에 주의 하시기 바랍니다. 첫번째 값은 다른 값에 바인딩 될 수 있는 가변 참조이고, 두번째 값은 가변 값에 대한 참조입니다.

source: A reference is said to "borrow" the value it refers to.
es: Se dice que una referencia "toma prestado" el valor al que hace referencia.
ko: 참조는 어떤 값을 "빌리는" 것입니다.

source: Rust is tracking the lifetimes of all references to ensure they live long enough.
es: Rust hace un seguimiento del tiempo de vida de todas las referencias para asegurarse de que duran lo suficiente.
ko: 러스트는 참조 대상의 값이, 그 값에 대한 모든 참조들보다 더 오래 살아있음을 추적합니다.

source: Slices always borrow from another object. In this example, `a` has to remain 'alive' (in scope) for at least as long as our slice.
es: Los slices siempre tienen préstamos de otros objetos. En este ejemplo, `a` tiene que permanecer "con vida" (en el ámbito) al menos durante el tiempo que dure el slice.
ko: 슬라이스는 항상 다른 객체로부터 '빌려' 옵니다. 이 예시에서 객체 `a`는 슬라이스 `s`보다 더 오래 살아 있어야만 합니다.

source: The question about modifying `a[3]` can spark an interesting discussion, but the answer is that for memory safety reasons you cannot do it through `a` at this point in the execution, but you can read the data from both `a` and `s` safely. It works before you created the slice, and again after the `println`, when the slice is no longer used. More details will be explained in the borrow checker section.
es: La cuestión sobre la modificación de `a[3]` puede suscitar un debate interesante, pero la respuesta es que, por razones de seguridad de memoria, no se puede hacer mediante `a` en este punto de la ejecución, pero sí se pueden leer los datos de `a` y `s` de forma segura. Funciona antes de crear el slice y después de `println`, cuando el slice ya no se utiliza. En la sección que trata sobre el _borrow checker_ se dará más información.
ko: `a[3]`의 값을 바꿀 수 있냐는 질문은 좋은 질문입니다. 여기에 대한 답은 `a`와 `s`를 통해 데이터를 읽을 수는 있지만 수정할 수는 없으며, 이는 메모리 안전을 위해서라는 것입니다. 그런데, 슬라이스가 사용되지 않을 때, 즉 슬라이스를 만들기 전이나, 혹은 `println`이후에는 `a[3]`을 바꿀 수 있습니다. 왜 그런지에 대한 좀더 구체적인 답은 빌림 검사 부분에서 자세히 설명합니다.

source: `String` vs `str`
es: `String` o `str`
ko: `String`과 `str`

source: `&str` introduces a string slice, which is an immutable reference to UTF-8 encoded string data stored in a block of memory. String literals (`”Hello”`), are stored in the program’s binary.
es: `&str` introduce un slice de cadena, que es una referencia inmutable a los datos de cadena codificados en UTF-8 y almacenados en un bloque de memoria. Los literales de cadena (`"Hello"`) se almacenan en el binario del programa.
ko: `&str`은 문자열 슬라이스입니다. 문자열 슬라이스는 UTF-8로 인코딩된 문자열 데이터를 의미합니다. 문자열 리터럴(`"Hello"`)은 프로그램 바이너리에 저장됩니다.

source: As with many other types `String::from()` creates a string from a string literal; `String::new()` creates a new empty string, to which string data can be added using the `push()` and `push_str()` methods.
es: Al igual que ocurre con muchos otros tipos, `String::from()` crea una cadena a partir de un literal de cadena. `String::new()` crea una cadena vacía a la que se pueden añadir los datos de la cadena mediante los métodos `push()` y `push_str()`.
ko: 다른 많은 타입들처럼 `String::from`는 문자열 리터럴로부터 문자열을 생성합니다. `String::new()`는 새로운 빈 문자열을 생성합니다. `push()`와 `push_str()`메서드를 사용하여 문자열 데이터를 추가 할 수 있습니다.

source: The `format!()` macro is a convenient way to generate an owned string from dynamic values. It accepts the same format specification as `println!()`.
es: La macro `format!()` es una forma práctica de generar una cadena propia a partir de valores dinámicos. Acepta la misma especificación de formato que `println!()`.
ko: `format!()` 매크로는 변수의 값을 문자열로 변환하는 편리한 방법입니다. 이 매크로는 `println!()` 매크로와 동일한 포맷팅 형식을 지원합니다.

source: You can borrow `&str` slices from `String` via `&` and optionally range selection.
es: Puedes tomar prestados slices `&str` desde `String` mediante `&` y, si quieres, puedes seleccionar intervalos.
ko: `&`와 범위 연산자를 이용하여 `String`에서 `&str`슬라이스를 빌려올 수 있습니다.

source: For C++ programmers: think of `&str` as `const char*` from C++, but the one that always points to a valid string in memory. Rust `String` is a rough equivalent of `std::string` from C++ (main difference: it can only contain UTF-8 encoded bytes and will never use a small-string optimization).
es: Para los programadores de C++: piensa en `&str` como el `const char*` de C++, pero el que siempre apunta a una cadena válida en la memoria. `String` de Rust es parecido a `std::string` de C++ (la diferencia principal es que solo puede contener bytes codificados en UTF-8 y nunca utilizará una optimización de cadena pequeña).
ko: 당신이 C++ 프로그래머 라면: `&str`는 C++의 `const char*`와 유사하지만 항상 유효한 문자열을 가리킨다는 점이 다릅니다. 러스트의 `String`은 C++의 `std::string` 과 대략 거의 동일합니다. (주요 차이점: 러스트의 `String`은 UTF-8 인코딩 바이트만 포함할 수 있으며 작은 문자열 최적화(small-string optimization)는 구현하지 않습니다.

source: A Rust version of the famous [FizzBuzz](https://en.wikipedia.org/wiki/Fizz_buzz) interview question:
es: Una versión de Rust de la famosa pregunta de la entrevista de [FizzBuzz](https://es.wikipedia.org/wiki/Fizz_buzz):
ko: 러스트 버전의 [FizzBuzz](https://en.wikipedia.org/wiki/Fizz_buzz) 함수입니다:
