Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Use this to model a library's book collection. Copy the code below to <https://play.rust-lang.org/> and update the types to make it compile:
es: Crea un modelo de la colección de libros de una biblioteca con esta opción. Copia el código que aparece abajo en <https://play.rust-lang.org/> y actualiza los tipos para que compile:
ko: 아래 코드는 도서관에 있는 도서 컬랙션을 모델링 합니다. 아래 코드를 <https://play.rust-lang.org/>에 복사한 후, 컴파일 되도록 수정해 봅시다:

source: [Solution](solutions-afternoon.md#designing-a-library)
es: [Soluciones](solutions-afternoon.md#designing-a-library)
ko: [해답](solutions-afternoon.md#designing-a-library)

source: You'll start with some stubbed functions in an `impl` block as well as a `User` struct definition. Your goal is to implement the stubbed out methods on the `User` `struct` defined in the `impl` block.
es: Comenzarás con algunas funciones stub en un bloque `impl`, así como con una definición de estructura `User`. Tu objetivo es implementar métodos con stubs en la `struct` `User` definida en el bloque `impl`.
ko: 당신의 목표는 `User` 구조체의 `impl` 블록의 빈 함수를 구현하는 것입니다.

source: Copy the code below to <https://play.rust-lang.org/> and fill in the missing methods:
es: Copia el fragmento de código que aparece más abajo en la página <https://play.rust-lang.org/> y rellena los métodos que faltan:
ko: 아래 코드를 <https://play.rust-lang.org/>에 복사해서 빠진 메서드를 구현하면 됩니다:

source: Rust comes with a standard library which helps establish a set of common types used by Rust library and programs. This way, two libraries can work together smoothly because they both use the same `String` type.
es: Rust viene con una biblioteca estándar que ayuda a establecer un conjunto de tipos comunes que se usan en la biblioteca y los programas de Rust. De esta forma, dos bibliotecas pueden funcionar juntas sin problemas, puesto que ambas utilizan el mismo tipo `String`.
ko: 러스트에서 제공하는 표준 라이브러리는 러스트로 라이브러리나 프로그램을 작성할 때 공통적으로 사용할 수 있는 여러 타입들을 포함하고 있습니다. 이를 통해 서로 다른 두 라이브러리라 하더라도 함께 사용하는데 큰 어려움이 없게 됩니다. 예를 들면 두 라이브러리 모두 같은 `String` 타입을 사용하기 때문입니다.

source: The common vocabulary types include:
es: Entre los tipos de vocabulario más habituales se incluyen los siguientes:
ko: 일반적인 타입은 아래와 같습니다:

source: [`Option` and `Result`](std/option-result.md) types: used for optional values and [error handling](error-handling.md).
es: Tipos [`Option` y `Result`](std/option-result.md): se utilizan para valores opcionales y [gestión de errores](error-handling.md).
ko: [`Option`과 `Result`](std/option-result.md) : 어떤 값이 있거나 없거나 하는 경우, 그리고 [오류 처리](error-handling.md)에 사용합니다.

source: [`String`](std/string.md): the default string type used for owned data.
es: [`String`](std/string.md): el tipo de cadena predeterminado que se usa para los datos propios.
ko: [`String`](std/string.md): 기본적인 문자열 타입으로, 문자열 데이터를 소유하는 경우에 사용합니다.

source: [`Vec`](std/vec.md): a standard extensible vector.
es: [`Vec`](std/vec.md): un vector estándar extensible.
ko: [`Vec`](std/vec.md): 가변 크기의 표준 벡터 타입입니다.

source: [`HashMap`](std/hashmap.md): a hash map type with a configurable hashing algorithm.
es: [`HashMap`](std/hashmap.md): un mapa hash con un algoritmo hash configurable.
ko: [`HashMap`](std/hashmap.md): 해시 알고리즘을 따로 지정할 수도 있는 해시맵 타입입니다.

source: [`Box`](std/box.md): an owned pointer for heap-allocated data.
es: [`Box`](std/box.md): un puntero propio para datos ubicados en el _heap_.
ko: [`Box`](std/box.md): 힙 데이터에 대한 소유 포인터입니다.

source: [`Rc`](std/rc.md): a shared reference-counted pointer for heap-allocated data.
es: [`Rc`](std/rc.md): un puntero compartido de conteo de referencias para datos asignados a _heap_.
ko: [`Rc`](std/rc.md): 힙에 할당된 데이터에 대한 참조 카운팅 공유 포인터입니다.

source: In fact, Rust contains several layers of the Standard Library: `core`, `alloc` and `std`.
es: De hecho, Rust contiene varias capas de la biblioteca estándar: `core`, `alloc` y `std`.
ko: 사실, 러스트의 표준 라이브러리는 `core`, `alloc`, `std`와 같이 계층(layer)으로 나눠집니다.

source: `core` includes the most basic types and functions that don't depend on `libc`, allocator or even the presence of an operating system.
es: `core` incluye los tipos y funciones más básicos que no dependen de `libc`, de un _allocator_ (asignador de memoria) ni de la presencia de un sistema operativo.
ko: `core`는 `libc`나 할당자(allocator), 심지어 OS에도 의존하지 않는 가장 기본적인 함수와 타입을 포함합니다.

source: `Option` and `Result`
es: `Option` y `Result`
ko: `Option`과 `Result`

source: The types represent optional data:
es: Los tipos representan datos opcionales:
ko: 이 타입은 선택적 데이터를 나타냅니다:

source: `Option` and `Result` are widely used not just in the standard library.
es: `Option` y `Result` se usan mucho, no solo en la biblioteca estándar.
ko: `Option`과 `Result`는 표준 라이브러리뿐만아니라 매우 광범위하게 사용되는 타입입니다.

source: `Option<&T>` has zero space overhead compared to `&T`.
es: `Option<&T>` no usa espacio adicional en comparación con `&T`.
ko: `Option<&T>` 는 `&T`에 비해 공간 오버헤드가 없습니다.

source: `binary_search` returns `Result<usize, usize>`.
es: `binary_search` devuelve `Result<usize, usize>`.
ko: `binary_search`는 `Result<usize, usize>`를 반환합니다.

source: If found, `Result::Ok` holds the index where the element is found.
es: Si se encuentra, `Result::Ok` contiene el índice donde se halla el elemento.
ko: 요소가 발견된다면, `Result::Ok`는 발견된 요소의 인덱스를 보유합니다.

source: Otherwise, `Result::Err` contains the index where such an element should be inserted.
es: De lo contrario, `Result::Err` contendrá el índice donde se debe insertar dicho elemento.
ko: 아니면, `Result::Err`에는 요소가 삽입되야 하는 인덱스가 포함되어 있습니다.

source: Write and compare `let s3 = s1.deref();` and `let s3 = &*s1`;.
es: Escribe y compara `let s3 = s1.deref();` y `let s3 = &*s1`;.
ko: `let s3 = s1.deref();`와 `let s3 = &*s1;`을 비교해보세요.

source: `Vec` is a type of collection, along with `String` and `HashMap`. The data it contains is stored on the heap. This means the amount of data doesn't need to be known at compile time. It can grow or shrink at runtime.
es: `Vec` es un tipo de colección, junto con `String` y `HashMap`. Los datos que contiene se almacenan en el _heap_. Esto significa que no es necesario conocer la cantidad de datos durante la compilación. Puede aumentar o disminuir durante la ejecución.
ko: `Vec`은 `String`이나 `HashMap`과 같은 컬렉션 타입입니다. 벡터는 데이터를 힙에 저장합니다. 이는 컴파일 시점에 데이터 크기를 알 필요가 없다는 의미고, 런타임에 더 커질 수도 작아질 수도 있습니다.

source: Show iterating over a vector and mutating the value: `for e in &mut v { *e += 50; }`
es: Muestra la iteración sobre un vector y la mutación del valor: `for e in &mut v { *e += 50; }`.
ko: 벡터를 순회하면서 값을 변경할 수도 있음을 보여주세요: `for e in &mut v { *e += 50; }`

source: `Box` is like `std::unique_ptr` in C++, except that it's guaranteed to be not null.
es: `Box` es igual que `std::unique_ptr` en C++, salvo que está asegurado que no será nulo.
ko: `Box`는 C++의 `std::unique_ptr`과 비슷합니다. 차이라면 `Box`는 널이 아님을 보장한다는 점입니다.

source: In the above example, you can even leave out the `*` in the `println!` statement thanks to `Deref`.
es: En el ejemplo anterior, incluso puedes omitir `*` en la instrucción `println!` gracias a `Deref`.
ko: `Deref` 덕분에 위 예제의 `println!`문에 사용된 `*`를 빼도 문제가 없습니다.

source: Box with Recursive Data Structures
es: Box con Estructuras de Datos Recursivos
ko: 재귀자료 구조에서의 `Box`

source: If `Box` was not used and we attempted to embed a `List` directly into the `List`, the compiler would not compute a fixed size of the struct in memory (`List` would be of infinite size).
es: Si no se utiliza `Box` e intentamos insertar un `List` directamente dentro de `List`, el compilador no calcularía un tamaño fijo de la estructura en la memoria (`List` tendría un tamaño infinito).
ko: 만일 `Box`를 사용하지 않고 `List`에 직접 `List`를 포함하려고 시도한다면, 컴파일러는 구조체의 고정 크기를 계산할 수 없습니다. 컴파일러가 보기에 무한대의 크기로 보일 것입니다.

source: `Rc::downgrade` gives you a _weakly reference-counted_ object to create cycles that will be dropped properly (likely in combination with `RefCell`, on the next slide).
es: `Rc::downgrade` ofrece un objeto _de referencia contada baja_ para crear `Rc::downgrade` ofrece un objeto de _referencia contada débil_ para crear `RefCell`).
ko: `Rc`는 `downgrade()`로 다운그레이드하여 _약하게 참조 카운트되는(weekly reference-counted)_ 객체가 될 있습니다. 그러면 순환구조라 하더라도 drop이 가능합니다. (아마도 `RefCell` 을 함께 사용해야 할 것입니다.)

source: `Cell` and `RefCell`
es: `Cell` y `RefCell`
ko: `Cell`과 `RefCell`

source: [`Cell`](https://doc.rust-lang.org/std/cell/struct.Cell.html) and [`RefCell`](https://doc.rust-lang.org/std/cell/struct.RefCell.html) implement what Rust calls _interior mutability:_ mutation of values in an immutable context.
es: [`Cell`](https://doc.rust-lang.org/std/cell/struct.Cell.html) y [`RefCell`](https://doc.rust-lang.org/std/cell/struct.RefCell.html) implementan lo que Rust llama _mutabilidad interna_: mutación de valores en un contexto inmutable.

source: `Cell` is typically used for simple types, as it requires copying or moving values. More complex interior types typically use `RefCell`, which tracks shared and exclusive references at runtime and panics if they are misused.
es: Normalmente, `Cell` se utiliza para tipos simples, ya que requiere copiar o mover valores. Los tipos internos más complejos normalmente utilizan `RefCell`, que realiza un seguimiento de las referencias compartidas y exclusivas en tiempo de ejecución y entra en pánico si se utilizan de forma incorrecta.
ko: `Cell`은 간단한 타입에 대해서 주로 사용됩니다. 왜냐하면 `Cell`에 있는 값을 읽거나 쓸때에는 복사 혹은 이동을 해야만 하기 때문입니다. 복잡한 타입이라면 `RefCell`이 더 보편적입니다. 이를 이용하면 참조를 통해 값을 읽거나 쓰게 해 주는 대신, 그 참조들이 올바른지를 런타임에 체크하고, 제대로 사용되지 않을 경우 패닉을 발생시킵니다.

source: If we were using `Cell` instead of `RefCell` in this example, we would have to move the `Node` out of the `Rc` to push children, then move it back in. This is safe because there's always one, un-referenced value in the cell, but it's not ergonomic.
es: Si estuviéramos utilizando `Cell` en lugar de `RefCell` en este ejemplo, tendríamos que mover el `Node` fuera del `Rc` para insertar hijos y luego volver a moverlo. Esto es seguro porque siempre hay un valor sin referenciar en la celda, pero no es ergonómico.
ko: 이 예제에서 `RefCell`대신 `Cell`을 썼었다면, `Node`에 자식 노느를 추가하기 위해서, `Node`를 `Rc`밖으로 이동시킨 다음, 자식 노드를 추가하고, 다시 `Rc`안으로 이동시켜야 했을 겁니다. 이렇게 해야만 하는 이유는 안전 때문입니다. Cell 내부의 그 값이 오직 하나 존재하며, 그 값에 대한 참조가 없다는 것이 보장되기 때문입니다. 물론 편리하지는 않습니다.

source: To do anything with a Node, you must call a `RefCell` method, usually `borrow` or `borrow_mut`.
es: Para hacer cualquier cosa con un Node, debes llamar a un método de `RefCell`, normalmente `borrow` o `borrow_mut`.
ko: 노드를 이동하거나 복사하지 않고 그대로 사용하기 위해서는 `RefCell`로 감싼다음 `borrow`나 `borrow_mut`메서드를 이용해야 합니다.

source: Demonstrate that reference loops can be created by adding `root` to `subtree.children` (don't try to print it!).
es: Demuestra que se pueden crear bucles de referencia añadiendo `root` a `subtree.children` (¡no intentes imprimirlo!).
ko: `root`를 `subtree.children`에 추가해서 순환 참조가 생길 수 있음을 보여주세요 (그래프를 출력하지는 마세요!).

source: Day 2: Afternoon Exercises
es: Día 2: Ejercicios de la Tarde
ko: 2일차 오후 연습문제

source: The exercises for this afternoon will focus on strings and iterators.
es: Los ejercicios de esta tarde se centrarán en las cadenas y los iteradores.
ko: 이번 연습문제는 문자열과 반복자에 초점을 맞출 것입니다.

source: The ownership model of Rust affects many APIs. An example of this is the [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html) and [`IntoIterator`](https://doc.rust-lang.org/std/iter/trait.IntoIterator.html) traits.
es: El modelo de _ownership_ de Rust afecta a muchas APIs. Un ejemplo serían los traits [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html) y [`IntoIterator`](https://doc.rust-lang.org/std/iter/trait.IntoIterator.html).
ko: 러스트의 소유권 모델은 많은 API에 반영이 되어 있습니다. 예를들어 [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html) 와 [`IntoIterator`](https://doc.rust-lang.org/std/iter/trait.IntoIterator.html) 같은 트레잇이 있습니다.

source: Traits are like interfaces: they describe behavior (methods) for a type. The `Iterator` trait simply says that you can call `next` until you get `None` back:
es: Los _traits_ son como las interfaces: describen el comportamiento (métodos) de un tipo. El trait `Iterator` indica que se puede llamar a `next` hasta que se obtenga `None`:
ko: 트레잇은 타입에 대한 행동(메서드)를 설명한다는 점에서 인터페이스와 유사합니다. `Iterator`는 단순히 `None`이 나올때까지 `next`를 호출하는 것이 가능하다는 것을 나타내는 트레잇입니다:

source: You use this trait like this:
es: Utiliza este trait de la siguiente forma:
ko: `Iterator` 트레잇은 이렇게 사용합니다:

source: What is the type returned by the iterator? Test your answer here:
es: ¿Qué tipo devuelve el iterador? Prueba tu respuesta aquí:
ko: 반복자가 반환하는 값들은 타입이 뭘까요? 여기서 답을 테스트 해 보세요:

source: Why is this type used?
es: ¿Por qué se usa este tipo?
ko: 왜 이런 타입이 사용되는 것일까요?

source: The `Iterator` trait tells you how to _iterate_ once you have created an iterator. The related trait `IntoIterator` tells you how to create the iterator:
es: El trait `Iterator` te indica cómo _iterar_ una vez que has creado un iterador. El trait relacionado `IntoIterator` indica cómo crear el iterador:
ko: `Iterator` 트레잇은 생성된 반복자를 _사용_하는 방법을 알려줍니다. 반면 `IntoIterator` 트레잇은 반복자를 _생성_하는 방법을 알려줍니다:

source: The syntax here means that every implementation of `IntoIterator` must declare two types:
es: La sintaxis aquí significa que cada implementación de `IntoIterator` debe declarar dos tipos:
ko: `IntoIterator`의 모든 구현은 반드시 다음의 두 타입을 선언해야합니다:

source: `Item`: the type we iterate over, such as `i8`,
es: `Item`: el tipo sobre el que iteramos, como `i8`,
ko: `Item`: `i8`과 같이 반복되는 값의 타입,

source: Like before, what is the type returned by the iterator?
es: Al igual que antes, ¿qué tipo devuelve el iterador?
ko: 이전과 마찬가지로, 반복자가 반환하는 타입은 무엇입니까?

source: `for` Loops
es: Bucles `for`
ko: 배열과 `for` 반복문

source: Now that we know both `Iterator` and `IntoIterator`, we can build `for` loops. They call `into_iter()` on an expression and iterates over the resulting iterator:
es: Ahora que conocemos `Iterator` e `IntoIterator`, podemos crear bucles `for`. Llaman a `into_iter()` sobre una expresión e iteran sobre el iterador resultante:
ko: 자, 이제 우리는 `Iterator`와 `IntoIterator`를 알았으므로 `for` 루프를 만들 수 있습니다. `for` 루프는 `into_iter()`를 호출하여 반복자를 만든 다음 그 반복자를 이용하여 요소들을 반복해서 접근합니다:

source: What is the type of `word` in each loop?
es: ¿Cuál es el tipo de `word` en cada bucle?
ko: 매 루프에서 `word`의 타입은 무엇입니까?

source: Experiment with the code above and then consult the documentation for [`impl IntoIterator for &Vec<T>`](https://doc.rust-lang.org/std/vec/struct.Vec.html#impl-IntoIterator-for-%26'a+Vec%3CT,+A%3E) and [`impl IntoIterator for Vec<T>`](https://doc.rust-lang.org/std/vec/struct.Vec.html#impl-IntoIterator-for-Vec%3CT,+A%3E) to check your answers.
es: Experimenta con el código anterior y consulta la documentación sobre [`impl IntoIterator for &Vec<T>`](https://doc.rust-lang.org/std/vec/struct.Vec.html#impl-IntoIterator-for-%26'a+Vec%3CT,+A%3E) y sobre [`impl IntoIterator for Vec<T>`](https://doc.rust-lang.org/std/vec/struct.Vec.html#impl-IntoIterator-for-Vec%3CT,+A%3E) para comprobar las respuestas.
ko: 위 코드에서 실험 해 본 후, 다음 문서를 참조해서 답변을 확인하시기 바랍니다:[`impl IntoIterator for &Vec<T>`](https://doc.rust-lang.org/std/vec/struct.Vec.html#impl-IntoIterator-for-%26'a+Vec%3CT,+A%3E), [`impl IntoIterator for Vec<T>`](https://doc.rust-lang.org/std/vec/struct.Vec.html#impl-IntoIterator-for-Vec%3CT%2C%20A%3E)

source: In this exercise, you are implementing a routing component of a web server. The server is configured with a number of _path prefixes_ which are matched against _request paths_. The path prefixes can contain a wildcard character which matches a full segment. See the unit tests below.
es: En este ejercicio se va a implementar un componente de enrutamiento de un servidor web. El servidor está configurado con un número de _prefijos de ruta_ que se comparan con las _rutas de solicitud_. Los prefijos de ruta pueden contener un carácter comodín que coincida con un segmento completo. Consulta las pruebas unitarias más abajo.
ko: 이번 훈련은 웹 서버의 라우팅 컴포넌트를 구현합니다. 서버는 _요청 경로(request path)_ 를 처리할 수 있는 여러 개의 _경로 접두사(path prefix)_ 로 구성됩니다. 경로 접두사는 와일드카드문자를 포함할 수 있습니다. 아래 단위 테스트 코드를 참조하세요.

source: Copy the following code to <https://play.rust-lang.org/> and make the tests pass. Try avoiding allocating a `Vec` for your intermediate results:
es: Copia el siguiente fragmento de código en la página <https://play.rust-lang.org/> para hacer la prueba. Prueba a no asignar un `Vec` a los resultados intermedios:
ko: 아래 코드를 <https://play.rust-lang.org/>에 복사하고 테스트를 통과해 보시기 바랍니다. 중간 결과값을 `Vec`에 할당하지 않도록 주의 하시기 바랍니다:

source: Today, we will cover some more advanced topics of Rust:
es: Hoy vamos a tratar algunos temas más avanzados de Rust:
ko: 오늘은 몇 가지 고급 주제를 다룹니다:

source: Traits: deriving traits, default methods, and important standard library traits.
es: _Traits_: derivación de _traits_, métodos predeterminados y _traits_ importantes de la _standard library_ (biblioteca estándar).
ko: 트레잇: 트레잇 상속(derive), 디폴트 메서드, 표준 라이브러에 있는 중요한 트레잇들.

source: Generics: generic data types, generic methods, monomorphization, and trait objects.
es: _Generics_ (Genéricos): tipos de datos genéricos, métodos genéricos, monomorfización y objetos de _traits_.
ko: 제네릭: 제네릭 데이터 타입, 제네릭 메서드, 단형화(monomorphization), 트레잇 객체.

source: Testing: unit tests, documentation tests, and integration tests.
es: Pruebas: pruebas unitarias, pruebas de documentación y pruebas de integración.
ko: 테스트: 단위 테스트, 문서 테스트 및 통합 테스트.

source: Unsafe Rust: raw pointers, static variables, unsafe functions, and extern functions.
es: Rust inseguro: punteros sin formato, variables estáticas, funciones no seguras y funciones externas.
ko: 안전하지 않은 러스트: 원시(raw) 포인터, 정적 변수, 안전하지 않은 함수, 외부 함수.

source: Rust support generics, which lets you abstract algorithms or data structures (such as sorting or a binary tree) over the types used or stored.
es: Rust admite el uso de genéricos, lo que permite abstraer los algoritmos o las estructuras de datos (como el orden o un árbol binario) sobre los tipos utilizados o almacenados.
ko: 러스트는 제네릭을 지원합니다. 이를 이용하면 알고리즘(정렬과 같은)이나 데이터 구조(이진 트리 같은)를 추상화 하여 특정 타입에 의존하지 않도록 할 수 있습니다.

source: Try declaring a new variable `let p = Point { x: 5, y: 10.0 };`.
es: Prueba a declarar una nueva variable `let p = Point { x: 5, y: 10.0 };`.
ko: 새 변수 `let p = Point { x: 5, y: 10.0 };`를 선언해 보세요.

source: Fix the code to allow points that have elements of different types.
es: Corrige el código para permitir puntos que tengan elementos de distintos tipos.
ko: `Point`가 서로 다른 타입의 값들으로 이루어져도 컴파일 되도록 코드를 수정해 보세요.

source: You can declare a generic type on your `impl` block:
es: Puedes declarar un tipo genérico en tu bloque `impl`:
ko: `impl` 블록에서도 제네릭 타입을 선언할 수 있습니다:

source: It is possible to write `impl Point<u32> { .. }`.
es: Es posible escribir `impl Point<u32> { .. }`.
ko: `impl Point<u32> { .. }`와 같이 작성하는 것도 가능합니다.

source: Generic code is turned into non-generic code based on the call sites:
es: El código genérico se convierte en código no genérico en función de los sitios de llamada:
ko: 제네릭 코드는 호출부에서 비 제네릭 코드로 전환됩니다:

source: behaves as if you wrote
es: se comporta como si se hubiera escrito
ko: 위 코드는 아래와 같이 동작합니다

source: This is a zero-cost abstraction: you get exactly the same result as if you had hand-coded the data structures without the abstraction.
es: Se trata de una abstracción sin coste: se obtiene exactamente el mismo resultado que si se hubiesen programado de forma manual las estructuras de datos sin la abstracción.
ko: 이것이 바로 비용이 들지 않는 (zero-cost) 추상화 입니다: 러스트의 제네릭은 추상화를 거치지 않고 직접 구체적인 타입을 써서 코딩한 것과 정확히 동일한 결과를 보여줍니다.

source: Types that implement a given trait may be of different sizes. This makes it impossible to have things like `Vec<Pet>` in the example above.
es: Los tipos que implementan un trait determinado pueden tener diferentes tamaños. Esto hace imposible tener elementos como `Vec<Pet>` en el ejemplo anterior.
ko: 여러 타입이 같은 트레잇을 구현하더라도 그 크기는 서로 다를 수 있습니다. 그래서 `Vec<Greeet>`같은 것은 불가능합니다.

source: In the example, `pets` holds _fat pointers_ to objects that implement `Pet`. The fat pointer consists of two components, a pointer to the actual object and a pointer to the virtual method table for the `Pet` implementation of that particular object.
es: En el ejemplo, `pets` contiene _punteros grandes_ en los objetos que implementan `Pet`. El puntero grande consta de dos componentes: un puntero al objeto real y un puntero a la tabla de métodos virtuales para la implementación de `Pet` en ese objeto concreto.
ko: 예제에서 `pets`는 `Pet`을 구현하는 객체들의 _Fat 포인터_를 담고 있습니다. Fat 포인터는 실제 객체에 대한 포인터와 그 객체가 `Pet`을 구현하고 있는 가상 함수 테이블에 대한 포인터를 가집니다.

source: Rust derive macros work by automatically generating code that implements the specified traits for a data structure.
es: Las macros de derivación de Rust funcionan generando automáticamente código que implementa los _traits_ especificados para una estructura de datos.
ko: 러스트의 derive 매크로는 데이터 구조체가 특정 트레잇을 구현하는 코드를 자동으로 만들어 줍니다.

source: You can let the compiler derive a number of traits as follows:
es: Puedes dejar que el compilador derive una serie de _traits_ de la siguiente manera:
ko: 컴파일러가 여러가지 트레잇을 상속(derive)하도록 할 수 있습니다. 이 경우 컴파일러가 트레잇을 자동으로 구현합니다:

source: Traits can implement behavior in terms of other trait methods:
es: Los _traits_ pueden implementar comportamientos en función de otros métodos de _traits_:
ko: 트레잇의 디폴트 메서드에서 다른(구현되지 않은) 메소드를 이용할 수 있습니다:

source: Traits may specify pre-implemented (default) methods and methods that users are required to implement themselves. Methods with default implementations can rely on required methods.
es: Los _traits_ pueden especificar los métodos implementados previamente (predeterminados) y los métodos que los usuarios deben implementar ellos mismos. Los métodos con implementaciones predeterminadas pueden basarse en métodos obligatorios.
ko: 트레잇은, 그 트레잇이 정의된 위치에서 직접 구현되는 디폴트 메서드와, 거기에서는 선언만 존재하고 그 트레잇을 구현하는 타입에서 구현해야 하는, 두 종류의 메서드를 가질 수 있습니다. 디폴트 메서드를 구현할 때에는, 두 종류의 메서드 모두 사용(호출)할 수 있습니다.

source: Move method `not_equals` to a new trait `NotEquals`.
es: Mueve el método `not_equals` a un nuevo trait `NotEquals`.
ko: `not_equal` 메서드를 새로운 트레잇인 `NotEqual`로 이동합니다.

source: Make `Equals` a super trait for `NotEquals`.
es: Haz que `Equals` sea un supertrait para `NotEquals`.
ko: `NotEqual`을 `Equal`의 슈퍼 트레잇으로 만듭니다.

source: Provide a blanket implementation of `NotEquals` for `Equals`.
es: Proporciona una implementación general de `NotEquals` para `Equals`.
ko: `Equal`에 `NotEqual`의 포괄적 구현을 제공합니다.

source: With the blanket implementation, you no longer need `Equals` as a super trait for `NotEqual`.
es: Con la implementación general, ya no necesitas `Equals` como supertrait para `NotEqual`.
ko: 포괄적 구현을 사용하면 더 이상 `NotEqual`이 `Equal`의 슈퍼 트레잇으로 필요하지 않습니다.

source: `impl Trait` allows you to work with types which you cannot name.
es: `impl Trait` permite trabajar con tipos a los que no se les puede asignar un nombre.
ko: `impl Trait`를 이용하면 이름이 없는 타입을 다룰 수 있습니다.

source: The meaning of `impl Trait` is a bit different in the different positions.
es: La naturaleza de `impl Trait` varía ligeramente según la posición.
ko: `impl Trait`는 어디에 사용되었느냐에 따라 의미가 조금씩 다릅니다.
