Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: // SAFETY: `abs` doesn't deal with pointers and doesn't have any safety // requirements.
uk: // БЕЗПЕКА: `abs` не працює з покажчиками і не має жодних вимог до // безпеки.

source: "Absolute value of -3 according to C: {}"
fa: "مقدار مطلق ۳- طبق C: {}"
pt_br: "Valor absoluto de -3 de acordo com C: {}"
uk: "Абсолютне значення -3 згідно з C: {}"

source: // Not upholding the UTF-8 encoding requirement breaks memory safety! // println!("emoji: {}", unsafe { emojis.get_unchecked(0..3) }); // println!("char count: {}", count_chars(unsafe { // emojis.get_unchecked(0..3) }));
ja: // UTF-8 エンコード要件を満たさない場合、メモリの安全性が損なわれます。 // println!("emoji: {}", unsafe { emojis.get_unchecked(0..3) }); // println!("char count: {}", count_chars(unsafe { // emojis.get_unchecked(0..3) }));
pt_br: // Não manter o requerimento de codificação UTF-8 viola segurança de memória! // println!("emoji: {}", unsafe { emojis.get_unchecked(0..3) }); // println!("contador caracter: {}", count_chars(unsafe { // emojis.get_unchecked(0..3) }));
uk: // Недотримання вимог кодування UTF-8 порушує безпеку пам’яті! // println!("смайлик: {}", unsafe { emojis.get_unchecked(0..3) }); // println!("кількість символів: {}", count_chars(unsafe { // emojis.get_unchecked(0..3) }));

source: Writing Unsafe Functions
es: Escribir Funciones Unsafe (Inseguras)
fa: نوشتن متدهای ناامن
ja: Unsafe関数の書き方
ko: 안전하지 않은 함수 작성하기
pt_br: Escrevendo Funções Inseguras
uk: Написання небезпечних функцій

source: You can mark your own functions as `unsafe` if they require particular conditions to avoid undefined behaviour.
es: Puedes marcar tus propias funciones como `unsafe` si requieren condiciones concretas para evitar un comportamiento indefinido.
fa: اگر عملکردهای خود را برای جلوگیری از رفتار نامشخص به شرایط خاصی نیاز دارند، می‌توانید به‌عنوان`unsafe` علامت‌گذاری کنید.
ja: 未定義の動作を回避するために特定の条件が必要な場合は、独自の関数を `unsafe` とマークできます。
ko: 여러분이 작성한 함수를 사용할 때 어떤 특별한 조건을 만족해야 한다면, `unsafe`로 마킹할 수 있습니다.
pt_br: Você pode marcar suas próprias funções como _inseguras_ (`unsafe`) se elas exigirem condições específicas para evitar comportamentos indefinidos.
uk: Ви можете позначити власні функції як `unsafe`, якщо вони вимагають певних умов, щоб уникнути невизначеної поведінки.

source: /// Swaps the values pointed to by the given pointers. /// /// # Safety /// /// The pointers must be valid and properly aligned.
ja: /// 指定されたポインタが指す値をスワップします。 /// /// # Safety /// /// ポインタが有効で、適切にアラインされている必要があります。
pt_br: /// Troca os valores apontadoes pelos ponteiros fornecidos. /// /// # Segurança /// /// Os ponteiros precisam ser válidos e corretamente alinhados.
uk: /// Міняє місцями значення, на які вказують задані покажчики. /// /// # Безпека /// /// Покажчики повинні бути дійсними і правильно вирівняними.

source: // SAFETY: ...
uk: // БЕЗПЕКА: ...

source: `get_unchecked`, like most `_unchecked` functions, is unsafe, because it can create UB if the range is incorrect. `abs` is incorrect for a different reason: it is an external function (FFI). Calling external functions is usually only a problem when those functions do things with pointers which might violate Rust's memory model, but in general any C function might have undefined behaviour under any arbitrary circumstances.
fa: تابع `get_unchecked`، مانند اکثر توابع `_unchecked`، ناامن است، زیرا اگر در محدوده نادرست باشد، می‌تواند یک UB ایجاد کند. `abs` به دلیل دیگری نادرست است: این یک تابع خارجی (FFI) است. فراخوانی توابع خارجی معمولاً زمانی مشکل‌ساز است که آن توابع کارهایی را با اشاره‌گرهایی انجام می‌دهند که ممکن است مدل حافظه Rust را نقض کنند، اما به طور کلی هر تابع C ممکن است تحت هر شرایط دلخواه رفتار نامشخصی داشته باشد.
ja: `get_unchecked` は多くの`_unchecked` 関数と同様に、範囲が正しくない場合に UB となる可能性があるため、安全ではありません。また、`abs`が安全でないのは、外部関数（FFI）であるからです。通常、外部関数の呼び出しが問題になるのポインタを使用してRustのメモリモデルに違反する処理を行う場合のみです。しかし、一般的に C 関数には任意の状況下で未定義の動作が含まれる可能性があります。
pt_br: `get_unchecked`, como a maioria das funções `_unchecked`, é insegura, porque pode criar UB se o intervalo estiver incorreto. `abs` está incorreto por um motivo diferente: é uma função externa (FFI). Chamar funções externas é geralmente um problema apenas quando essas funções fazem coisas com ponteiros que podem violar o modelo de memória do Rust, mas, em geral, qualquer função C pode ter comportamento indefinido sob quaisquer circunstâncias arbitrárias.
uk: `get_unchecked`, як і більшість функцій `_unchecked`, небезпечна, оскільки може створити UB, якщо діапазон невірний. Функція `abs` некоректна з іншої причини: вона є зовнішньою функцією (FFI). Виклик зовнішніх функцій зазвичай є проблемою лише тоді, коли ці функції роблять щось із вказівниками, що може порушити модель пам'яті Rust, але загалом будь-яка функція C може мати невизначену поведінку за довільних обставин.

source: The `"C"` in this example is the ABI; [other ABIs are available too](https://doc.rust-lang.org/reference/items/external-blocks.html).
es: En este ejemplo, `"C"` es la ABI.; [también hay otras ABI disponibles](https://doc.rust-lang.org/reference/items/external-blocks.html).
fa: زبان برنامه‌نویسی `"C"` در این مثال ABI است. [ABIهای دیگر نیز در دسترس هستند](https://doc.rust-lang.org/reference/items/external-blocks.html).
ja: この例の `"C"` は ABI です（[他の ABI も使用できます](https://doc.rust-lang.org/reference/items/external-blocks.html)）。
ko: 위 예제 코드에서 `"C"`는 ABI를 의미합니다. [다른 ABI도 있습니다.](https://doc.rust-lang.org/reference/items/external-blocks.html)
pt_br: O `"C"` neste exemplo é o ABI; [outros ABIs também estão disponíveis](https://doc.rust-lang.org/reference/items/external-blocks.html).
uk: У цьому прикладі `"C"` - це ABI; [інші ABI також доступні](https://doc.rust-lang.org/reference/items/external-blocks.html).

source: We wouldn't actually use pointers for a `swap` function - it can be done safely with references.
fa: ما در واقع از pointerها برای یک تابع`swap` استفاده نمی‌کنیم - این کار را می‌توان به‌طور ایمن با referenceها انجام داد.
ja: 実際には、`swap` 関数ではポインタは使用しません。これは参照を使用することで安全に実行できます。
pt_br: Na verdade, não usaríamos ponteiros para uma função `swap` - isto pode ser feito com referências com segurança.
uk: Насправді ми не будемо використовувати вказівники для функції `swap` - це можна безпечно зробити за допомогою посилань.

source: Note that unsafe code is allowed within an unsafe function without an `unsafe` block. We can prohibit this with `#[deny(unsafe_op_in_unsafe_fn)]`. Try adding it and see what happens. This will likely change in a future Rust edition.
fa: توجه داشته باشید که کد ناامن در یک تابع ناامن بدون بلوک `unsafe` مجاز است. ما می‌توانیم این کار را با `#[deny(unsafe_op_in_unsafe_fn)]` غیرمجاز کنیم. سعی کنید آن را اضافه کنید و ببینید چه اتفاقی می افتد. این احتمالاً در نسخه بعدی Rust تغییر خواهد کرد.
ja: アンセーフな関数内では、アンセーフなコードを`unsafe`ブロックなしに記述することができます。これは `#[deny(unsafe_op_in_unsafe_fn)]` で禁止できます。追加するとどうなるか見てみましょう。これは、今後の Rust エディションで変更される可能性があります。
pt_br: Observe que o código inseguro é permitido dentro de uma função insegura sem um bloco `unsafe`. Podemos proibir isso com `#[deny(unsafe_op_in_unsafe_fn)]`. Tente adicioná-lo e veja o que acontece. Isso provavelmente mudará em uma edição futura do Rust.
uk: Зверніть увагу, що небезпечний код дозволяється всередині небезпечної функції без блоку `unsafe`. Ми можемо заборонити це за допомогою `#[deny(unsafe_op_in_unsafe_fn)]`. Спробуйте додати його і подивіться, що станеться. Ймовірно, це буде змінено у майбутньому виданні Rust..

source: Implementing Unsafe Traits
es: Implementación de Traits Unsafe (Inseguras)
fa: پیاده سازی صفات (Traits) ناامن
ja: Unsafeなトレイトの実装
ko: 안전하지 않은 트레잇 구현하기
pt_br: Implementando Traits Inseguros
uk: Реалізація небезпечних трейтів

source: Like with functions, you can mark a trait as `unsafe` if the implementation must guarantee particular conditions to avoid undefined behaviour.
es: Al igual que con las funciones, puedes marcar un trait como `unsafe` si la implementación debe asegurar condiciones concretas para evitar un comportamiento indefinido.
fa: مانند توابع، اگر پیاده‌سازی باید شرایط خاصی را تضمین کند تا از رفتار نامشخص جلوگیری شود، می‌توانید یک ویژگی را به‌عنوان `unsafe` علامت‌گذاری کنید.
ja: 関数と同様に、未定義の動作を回避するために実装で特定の条件を保証する必要がある場合は、トレイトを `unsafe` としてマークできます。
ko: 함수에서와 마찬가지로 트레잇도 `unsafe`로 마킹 가능합니다. 만약 그 트레잇을 구현할 때 정의되지 않은 동작을 피하기 위해 특별한 조건이 필요하다면 말이지요.
pt_br: Assim como nas funções, você pode marcar um `trait` como `unsafe` se a implementação precisa garantir condições particulares para evitar comportamento indefinido.
uk: Як і у випадку з функціями, ви можете позначити трейт `unsafe`, якщо реалізація повинна гарантувати певні умови, щоб уникнути невизначеної поведінки.

source: For example, the `zerocopy` crate has an unsafe trait that looks [something like this](https://docs.rs/zerocopy/latest/zerocopy/trait.AsBytes.html):
es: Por ejemplo, el crate `zerocopy` tiene un trait inseguro, [que se parece a esto](https://docs.rs/zerocopy/latest/zerocopy/trait.AsBytes.html):
fa: برای مثال، `zerocopy` crate یک ویژگی ناامن دارد که [چیزی شبیه به این](https://docs.rs/zerocopy/latest/zerocopy/trait.AsBytes.html) است:
ja: たとえば、`zerocopy` クレートには [このような](https://docs.rs/zerocopy/latest/zerocopy/trait.AsBytes.html) 安全でないトレイトがあります。
ko: 예를 들어 `zerocopy` 크레이트에는 [안전하지 않은 트레잇](https://docs.rs/zerocopy/latest/zerocopy/trait.AsBytes.html)이 있습니다:
pt_br: Por exemplo, o _crate_ `zerocopy` tem um _trait_ inseguro que parece [algo assim](https://docs.rs/zerocopy/latest/zerocopy/trait.AsBytes.html):
uk: Наприклад, крейт `zerocopy` має небезпечний трейт, який виглядає [приблизно так](https://docs.rs/zerocopy/latest/zerocopy/trait.AsBytes.html):

source: /// ... /// # Safety /// The type must have a defined representation and no padding.
ja: /// ... /// # Safety /// 型には定義された表現が必要で、パディングがあってはなりません。
pt_br: /// ... /// # Segurança /// O tipo precisa ter uma representação definida e nenhum preenchimento.
uk: /// ... /// # Безпека /// Тип повинен мати визначене представлення і не мати заповнень.

source: // SAFETY: `u32` has a defined representation and no padding.
uk: // БЕЗПЕКА: `u32` має визначене представлення і не має заповнення.

source: There should be a `# Safety` section on the Rustdoc for the trait explaining the requirements for the trait to be safely implemented.
es: Debería haber una sección `# Safety` en el Rustdoc para el trait explicando los requisitos para que el trait pueda implementarse de forma segura.
fa: باید یک بخش `# Safety` در Rustdoc برای این صفت (trait) وجود داشته باشد که شرایط لازم برای اجرای ایمن این trait را توضیح دهد.
ja: Rustdoc には、トレイトを安全に実装するための要件について説明した `# Safety` セクションが必要です。
ko: 안전하지 않은 트레잇을 만들 때에는 주석에 `# Safety` 항목이 있어서 이 트레잇을 안전하게 구현하려면 어떤 요구사항들을 만족해야 하는지를 설명해야 합니다.
pt_br: Deve haver uma seção `# Safety` no Rustdoc para o `trait` explicando os requisitos para ser implementado com segurança.
uk: У Rustdoc має бути розділ `# Safety` для трейту, що пояснює вимоги до безпечної реалізації функції.

source: The actual safety section for `AsBytes` is rather longer and more complicated.
es: La sección de seguridad actual de `AsBytes` es bastante más larga y complicada.
fa: بخش ایمنی واقعی برای `AsBytes` نسبتا طولانی‌تر و پیچیده‌تر است.
ja: `AsBytes` の実際の安全性セクションはより長く、複雑です。
ko: `AsBytes`에서 지켜야 할 안전성에 대한 실제 설명은 좀 더 길고 복잡합니다.
pt_br: Na verdade, a seção de segurança para `AsBytes` é bem mais longa e complicada.
uk: Фактичний розділ безпеки для `AsBytes` довший і складніший.

source: The built-in `Send` and `Sync` traits are unsafe.
es: Los traits integrados `Send` y `Sync` no son seguros.
fa: ویژگی‌های داخلی`Send` و `Sync` ناامن (unsafe) هستند.
ja: 組み込みの `Send` トレイトと `Sync` トレイトはアンセーフです。
ko: 빌트인 트레잇인 `Send`와 `Sync`는 안전하지 않은 트레잇 입니다.
pt_br: Os _traits_ integrados `Send` e `Sync` são inseguros.
uk: Вбудовані `Send` та `Sync` трейти є небезпечними.

source: Safe FFI Wrapper
es: Envoltorio de FFI Seguro
fa: امن بودن FFI Wrapper
ja: 安全なFFIラッパ
ko: FFI래퍼
pt_br: Wrapper FFI seguro
uk: Безпечна обгортка інтерфейсу зовнішньої функції (FFI)

source: Rust has great support for calling functions through a _foreign function interface_ (FFI). We will use this to build a safe wrapper for the `libc` functions you would use from C to read the names of files in a directory.
fa: زبان Rust پشتیبانی بسیار خوبی برای فراخوانی توابع از طریق رابط تابع خارجی _foreign function interface_ (FFI) دارد. ما از آن برای ساختن یک پوشش امن برای توابع `libc` استفاده می‌کنیم که از C برای خواندن نام فایل ها در یک فهرست استفاده می کنید.
ja: Rust は、外部関数インターフェース（FFI）を介した関数呼び出しを強力にサポートしています。これを使用して、ディレクトリ内のファイル名を読み取るために Cプログラムで使用する `libc` 関数の安全なラッパーを作成します。
pt_br: Rust tem ótimo suporte para chamar funções por meio de uma interface para funções externas (_Function Foreign Interface_ - FFI). Usaremos isso para construir um _wrapper_ (invólucro) seguro para as funções da `libc` de C que você usaria para ler os nomes dos arquivos de um diretório.
uk: Rust має чудову підтримку виклику функцій через _інтерфейс зовнішніх функцій_ (FFI). Ми скористаємося цим, щоб створити безпечну оболонку для функцій `libc`, які ви використовуєте у C для читання імен файлів у директорії.

source: You will want to consult the manual pages:
es: Consulta las páginas del manual:
fa: شما می‌خواهید به صفحات راهنما مراجعه کنید:
ja: 以下のマニュアル ページをご覧ください。
ko: 아래 리눅스 메뉴얼 문서들을 참조하시기 바랍니다:
pt_br: Você vai querer consultar as páginas do manual:
uk: Ви захочете переглянути сторінки посібника:

source: You will also want to browse the [`std::ffi`](https://doc.rust-lang.org/std/ffi/) module. There you find a number of string types which you need for the exercise:
es: También te recomendamos que consultes el módulo [`std::ffi`](https://doc.rust-lang.org/std/ffi/). Ahí encontrarás una serie de tipos de cadena que necesitas para el ejercicio:
fa: همچنین می‌خواهید [`std::ffi`](https://doc.rust-lang.or) را مرور کنید
ja: [`std::ffi`](https://doc.rust-lang.org/std/ffi/) モジュールも参照してください。ここには、この演習で必要な文字列型が多数掲載されています。
ko: 아마 [`std::ffi`](https://doc.rust-lang.org/std/ffi/)모듈을 참조할 필요가 있을 것입니다. 거기에는 이번 예제를 수행하는데 필요한 다양한 종류의 문자열 타입들이 소개되어 있습니다:
pt_br: Você também vai querer navegar pelo módulo [`std::ffi`](https://doc.rust-lang.org/std/ffi/). Lá você encontrará um número de tipos de string que você precisará para o exercício:
uk: Ви також захочете переглянути модуль [`std::ffi`](https://doc.rust-lang.org/std/ffi/). Там ви знайдете ряд типів рядків, які вам знадобляться для вправи:

source: Encoding
es: Codificación
fa: رمزگذاری
ja: エンコード
ko: 인코딩
pt_br: Codificação
uk: Кодування

source: Use
es: Uso
fa: استفاده
ja: 使う
ko: 사용
pt_br: Uso
uk: Використання

source: [`str`](https://doc.rust-lang.org/std/primitive.str.html) and [`String`](https://doc.rust-lang.org/std/string/struct.String.html)
es: [`str`](https://doc.rust-lang.org/std/primitive.str.html) y [`String`](https://doc.rust-lang.org/std/string/struct.String.html)
fa: [`str`](https://doc.rust-lang.org/std/primitive.str.html) و [`String`](https://doc.rust-lang.org/std/string/struct.String.html)
ja: [`str`](https://doc.rust-lang.org/std/primitive.str.html) と [`String`](https://doc.rust-lang.org/std/string/struct.String.html)
ko: [`str`](https://doc.rust-lang.org/std/primitive.str.html)과 [`String`](https://doc.rust-lang.org/std/string/struct.String.html)
pt_br: [`str`](https://doc.rust-lang.org/std/primitive.str.html) e [`String`](https://doc.rust-lang.org/std/string/struct.String.html)
uk: [`str`](https://doc.rust-lang.org/std/primitive.str.html) і [`String`](https://doc.rust-lang.org/std/string/struct.String.html)

source: Text processing in Rust
es: Procesar textos en Rust
fa: پردازش متن در Rust
ja: Rust でのテキスト処理
ko: 러스트에서의 문자열 처리
pt_br: Processamento de texto em Rust
uk: Обробка тексту в Rust

source: [`CStr`](https://doc.rust-lang.org/std/ffi/struct.CStr.html) and [`CString`](https://doc.rust-lang.org/std/ffi/struct.CString.html)
es: [`CStr`](https://doc.rust-lang.org/std/ffi/struct.CStr.html) y [`CString`](https://doc.rust-lang.org/std/ffi/struct.CString.html)
ja: [`CStr`](https://doc.rust-lang.org/std/ffi/struct.CStr.html) と [`CString`](https://doc.rust-lang.org/std/ffi/struct.CString.html)
ko: [`CStr`](https://doc.rust-lang.org/std/ffi/struct.CStr.html)과 [`CString`](https://doc.rust-lang.org/std/ffi/struct.CString.html)
pt_br: [`CStr`](https://doc.rust-lang.org/std/ffi/struct.CStr.html) e [`CString`](https://doc.rust-lang.org/std/ffi/struct.CString.html)
uk: [`CStr`](https://doc.rust-lang.org/std/ffi/struct.CStr.html) і [`CString`](https://doc.rust-lang.org/std/ffi/struct.CString.html)

source: NUL-terminated
es: Terminado en NUL
ja: NUL終端文字列
ko: 널(NUL)로 끝남
pt_br: terminado em NUL
uk: NUL-термінований

source: Communicating with C functions
es: Comunicarse con funciones C
fa: ارتباط با توابع C
ja: C 関数との通信
ko: C함수와 연동하기
pt_br: Comunicação com funções em C
uk: Спілкування з функціями C

source: [`OsStr`](https://doc.rust-lang.org/std/ffi/struct.OsStr.html) and [`OsString`](https://doc.rust-lang.org/std/ffi/struct.OsString.html)
es: [`OsStr`](https://doc.rust-lang.org/std/ffi/struct.OsStr.html) y [`OsString`](https://doc.rust-lang.org/std/ffi/struct.OsString.html)
fa: [`OsStr`](https://doc.rust-lang.org/std/ffi/struct.OsStr.html) و [`OsString`](https://doc.rust-lang.org/std/ffi/struct.OsString.html)
ja: [`OsStr`](https://doc.rust-lang.org/std/ffi/struct.OsStr.html) と [`OsString`](https://doc.rust-lang.org/std/ffi/struct.OsString.html)
ko: [`OsStr`](https://doc.rust-lang.org/std/ffi/struct.OsStr.html)와 [`OsString`](https://doc.rust-lang.org/std/ffi/struct.OsString.html)
pt_br: [`OsStr`](https://doc.rust-lang.org/std/ffi/struct.OsStr.html) e [`OsString`](https://doc.rust-lang.org/std/ffi/struct.OsString.html)
uk: [`OsStr`](https://doc.rust-lang.org/std/ffi/struct.OsStr.html) і [`OsString`](https://doc.rust-lang.org/std/ffi/struct.OsString.html)

source: OS-specific
es: Específico del SO
fa: مخصوص سیستم‌عامل
ja: OS 固有
ko: OS가 정의함
pt_br: específico ao SO
uk: Специфічні для ОС

source: Communicating with the OS
es: Comunicarse con el SO
fa: برقراری ارتباط با سیستم‌عامل
ja: OS との通信
ko: OS와 연동하기 위한 문자열
pt_br: Comunicação com o SO
uk: Спілкування з ОС

source: You will convert between all these types:
es: Realizarás conversiones entre todos estos tipos:
fa: شما بین تمام این typeها تبدیل خواهید کرد:
ja: 以下のすべての型間で変換を行います。
ko: 이 타입들 간의 변환은 다음과 같습니다:
pt_br: Você irá converter entre todos estes tipos:
uk: Ви будете конвертувати між усіма цими типами:

source: `&str` to `CString`: you need to allocate space for a trailing `\0` character,
es: De `&str` a `CString`: debes asignar espacio para un carácter final `\0`,
ja: `&str` から `CString`: 末尾の `\0` 文字にも領域を割り当てる必要があります。
ko: `&str`에서 `CString`으로의 변환: 맨 마지막의 `\0` 문자를 저장하기 위한 공간을 할당해야 합니다,
pt_br: `&str` para `CString`: você precisa alocar espaço para o caracter terminador `\0`,
uk: `&str` до `CString`: вам потрібно виділити місце для кінцевого символу `\0`,

source: `CString` to `*const i8`: you need a pointer to call C functions,
es: De `CString` a `*const i8`: necesitas un puntero para llamar a funciones C,
fa: `CString` به `*const i8`: برای فراخوانی توابع C به یک اشاره‌گر نیاز دارید,
ja: `CString` から `*const i8`: C 関数を呼び出すためのポインタが必要です。
ko: `CString`에서 `*const i8`로의 변환: C함수를 호출하기 위해서는 포인터가 필요합니다,
pt_br: `CString` para `*const i8`: você precisa de um ponteiro para chamar funções em C,
uk: `CString` до `*const i8`: вам потрібен покажчик для виклику функцій C,

source: `*const i8` to `&CStr`: you need something which can find the trailing `\0` character,
es: De `*const i8` a `&CStr`: necesitas algo que pueda encontrar el carácter final `\0`,
fa: از `*const i8` به `&CStr`: به چیزی نیاز دارید که بتواند کاراکتر `\0` را پیدا کند,
ja: `*const i8` から `&CStr`: 末尾の `\0` 文字を検出できるものが必要です。
ko: `*const i8`에서 `&CStr`로의 변환: 주어진 바이트 시퀀스가 `\0`로 끝나는지 확인하고 싶은 경우,
pt_br: `*const i8` para `&CStr`: você você precisa de algo que pode encontrar o caracter terminador `\0`,
uk: `*const i8` до `&CStr`: вам потрібно щось, що може знайти кінцевий символ `\0`,

source: `&CStr` to `&[u8]`: a slice of bytes is the universal interface for "some unknown data",
fa: `&CStr` به `&[u8]`: یک slice بایت universal interface برای «برخی داده‌های ناشناخته» است،
ja: `&CStr` から `&[u8]`: バイトのスライスは「不明なデータ」用の汎用的な インターフェースです。
pt_br: `&CStr` para `&[u8]`: um _slice_ de bytes é a interface universal para "algum dado desconhecido",
uk: `&CStr` до `&[u8]`: зріз байт є універсальним інтерфейсом для "деяких невідомих даних",

source: `&[u8]` to `&OsStr`: `&OsStr` is a step towards `OsString`, use [`OsStrExt`](https://doc.rust-lang.org/std/os/unix/ffi/trait.OsStrExt.html) to create it,
es: De `&[u8]` a `&OsStr`: `&OsStr` es un paso hacia `OsString`, usa [`OsStrExt`](https://doc.rust-lang.org/std/os/unix/ffi/trait.OsStrExt.html) para crearlo.
fa: از `&[u8]` به `&OsStr`: `&OsStr` گامی به سوی `OsString` است، از [`OsStrExt`](https://doc.rust-lang.org/std/os/unix/ffi/trait.OsStrExt.html) برای ایجاد آن استفاده کنید،
ja: `&[u8]` から `&OsStr`: `&OsStr` は `OsString` に変換するための中間ステップであり、[`OsStrExt`](https://doc.rust-lang.org/std/os/unix/ffi/trait.OsStrExt.html) を使用して作成します。
ko: `&[u8]`에서 `&OsStr`로의 변환: `&OsStr`는 `OsString`으로 가기 위한 중간 단계 입니다. [`OsStrExt`](https://doc.rust-lang.org/std/os/unix/ffi/trait.OsStrExt.html)를 사용해서 `OsStr`를 생성하세요,
pt_br: `&[u8]` para `&OsStr`: `&OsStr` é um passo em direção a `OsString`, use [`OsStrExt`](https://doc.rust-lang.org/std/os/unix/ffi/trait.OsStrExt.html) para criá-lo,
uk: `&[u8]` до `&OsStr`: `&OsStr` є кроком до `OsString`, використовуйте [`OsStrExt`](https://doc.rust-lang.org/std/os/unix/ffi/trait.OsStrExt.html), щоб створити його,

source: `&OsStr` to `OsString`: you need to clone the data in `&OsStr` to be able to return it and call `readdir` again.
es: De `OsStr` a `OsString`: debes clonar los datos en `&OsStr` para poder devolverlo y llamar a `readdir` de nuevo.
ja: `&OsStr`内のデータを返し、さらに再びreaddirを呼び出せるようにするためには`&OsStr`内のデータをクローンする必要があります。
ko: `&OsStr`에서 `OsString`으로의 변환: `&OsStr`이 가리키고 있는 데이터를 복사함으로써, 이 데이터를 리턴하고, `readdir`함수를 호출할 때 사용할 수 있게 해 줍니다.
pt_br: `&OsStr` para `OsString`: você precisa clonar os dados em `&OsStr` para poder retorná-lo e chamar `readdir` novamente.
uk: `&OsStr` до `OsString`: вам потрібно клонувати дані в `&OsStr`, щоб мати можливість повернути їх і знову викликати `readdir`.

source: The [Nomicon](https://doc.rust-lang.org/nomicon/ffi.html) also has a very useful chapter about FFI.
es: El [Nomicon](https://doc.rust-lang.org/nomicon/ffi.html) también tiene un capítulo muy útil sobre FFI.
fa: مورد [Nomicon](https://doc.rust-lang.org/nomicon/ffi.html) همچنین یک فصل بسیار مفید در مورد FFI دارد.
ja: [Nomicon](https://doc.rust-lang.org/nomicon/ffi.html) にも、FFI に関する有益な章があります。
ko: [Nomicon](https://doc.rust-lang.org/nomicon/ffi.html)에 FFI와 관련한 아주 유용한 챕터가 있습니다.
pt_br: O [Nomicon](https://doc.rust-lang.org/nomicon/ffi.html) também tem um capítulo bastante útil sobre FFI.
uk: У [Nomicon](https://doc.rust-lang.org/nomicon/ffi.html) також є дуже корисний розділ про FFI.

source: Copy the code below to <https://play.rust-lang.org/> and fill in the missing functions and methods:
es: Copia el fragmento de código que aparece más abajo en la página <https://play.rust-lang.org/> y rellena los métodos y funciones que faltan:
fa: کد زیر را در <https://play.rust-lang.org/> کپی کنید و توابع و متدهای از مفقود شده را پر کنید:
ja: 以下のコードを <https://play.rust-lang.org/> にコピーし、不足している関数とメソッドを記入します。
ko: 아래 코드를 <https://play.rust-lang.org/>에 복사하고 빠진 함수와 메서드를 채워봅니다:
pt_br: Copie o código abaixo para <https://play.rust-lang.org/> e implemente as funções e métodos que faltam:
uk: Скопіюйте код нижче на <https://play.rust-lang.org/> і заповніть відсутні функції та методи:

source: // Opaque type. See https://doc.rust-lang.org/nomicon/ffi.html.
ja: // オペーク型。https://doc.rust-lang.org/nomicon/ffi.html をご覧ください。
pt_br: // Tipo opaco. Veja https://doc.rust-lang.org/nomicon/ffi.html.
uk: //Прозорий тип. Дивіться https://doc.rust-lang.org/nomicon/ffi.html.
