Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: As noted in the [Rust RFC Book](https://rust-lang.github.io/rfcs/0246-const-vs-static.html), these are not inlined upon use and have an actual associated memory location. This is useful for unsafe and embedded code, and the variable lives through the entirety of the program execution. When a globally-scoped value does not have a reason to need object identity, `const` is generally preferred.
es: Tal y como se indica en el libro [Rust RFC Book](https://rust-lang.github.io/rfcs/0246-const-vs-static.html), no están insertadas y tienen una ubicación de memoria real asociada. Esto resulta útil para código insertado y no seguro. Además, la variable continúa durante toda la ejecución del programa. Cuando un valor de ámbito global no tiene ningún motivo para necesitar identidad de objeto, se suele preferir `const`.
ko: [Rust RFC Book](https://rust-lang.github.io/rfcs/0246-const-vs-static.html)에서 언급한 바와 같이, 정적 변수는 별도의 메모리 공간을 가지며, 인라인 되지 않습니다. 정적 변수는 안전하지 않은(unsafe) 러스트와 임베디드 시스템용 코드에서 유용합니다. 이들의 수명은 프로그램이 수행되는 전체 시간과 동일합니다. 전역 스코프를 가진 어떤 값이, 메모리 상에 단 하나만 존재해야 한다는 요구조건이 없다면, 정적 변수 대신 `const`를 쓰는 것이 옳습니다.

source: Because `static` variables are accessible from any thread, they must be `Sync`. Interior mutability is possible through a [`Mutex`](https://doc.rust-lang.org/std/sync/struct.Mutex.html), atomic or similar. It is also possible to have mutable statics, but they require manual synchronisation so any access to them requires `unsafe` code. We will look at [mutable statics](../unsafe/mutable-static-variables.md) in the chapter on Unsafe Rust.
es: Dado que se puede acceder a las variables `static` desde cualquier hilo, es necesario protegerlas, por ejemplo, mediante un comando [`Mutex`](https://doc.rust-lang.org/std/sync/struct.Mutex.html), o que sean accesibles usando código `unsafe`. Veremos la [mutación de datos estáticos](../unsafe/mutable-static-variables.md) en el capítulo sobre Rust inseguro.
ko: `static`변수들은 어떤 스레드에서도 접근 가능하기 때문에, `Sync`트레잇을 구현해야 합니다. 이 변수를 읽고 쓰려면 [`Mutex`](https://doc.rust-lang.org/std/sync/struct.Mutex.html)로 감싸거나, atomic 연산을 써야 합니다. `static` 변수를 mutable하게 선언할 수도 있지만, 이 경우 동기화 작업을 수동으로 해 주어야 합니다. 그래서 그러한 변수를 접근하는 코드는`unsafe`로 명시적으로 표시가 되어야 합니다. "안전하지 않은 러스트"를 배울 때 [mutable statics](../unsafe/mutable-static-variables.md) 부분에서 좀 더 자세히 다루겠습니다.

source: `thread_local` data can be created with the macro `std::thread_local`.
es: Datos del `thread_local` se pueden crear con la macro `std::thread_local`.
ko: `thread_local` 데이터는 `std::thread_local` 매크로를 이용하여 생성할 수 있습니다.

source: Lives for the entire duration of the program
es: Vive durante toda la ejecución del programa
ko: 프로그램이 수행되는 동안 계속 살아 있는가

source: Definition: Shadowing is different from mutation, because after shadowing both variable's memory locations exist at the same time. Both are available under the same name, depending where you use it in the code.
es: Definición: _Shadowing_ (sombreado) es distinto de la mutación, ya que, después de sombrear la memoria de las dos variables, las ubicaciones existen al mismo tiempo. Ambas están disponibles bajo el mismo nombre, en función de dónde se utiliza en el código.
ko: 쉐도잉은 기존 변수에 새로운 값을 할당하는 것이 아닙니다. 쉐도잉을 하면 새로운 변수가 생기며, 이전 변수와 새 변수는 메모리의 서로 다른 위치에 존재합니다. 그 두 변수는 단지 이름이 같은 뿐이며, 코드 중 어디에서 그 이름이 사용되었느냐에 따라 어떤 변수를 지칭하는 지가 결정됩니다.

source: A shadowing variable can have a different type.
es: Una variable sombreada puede tener un tipo diferente.
ko: 쉐도잉 시 타입을 바꿀 수 있습니다.

source: The following code demonstrates why the compiler can't simply reuse memory locations when shadowing an immutable variable in a scope, even if the type does not change.
es: El siguiente fragmento de código demuestra por qué el compilador no puede reutilizar ubicaciones de memoria cuando sombrea una variable inmutable en un ámbito, incluso si el tipo no cambia.
ko: 아래 코드는 불변 변수를 쉐도잉할 때 타입이 동일하더라도 새 변수가 원래 변수의 메모리 위치를 재사용 할 수 없는지 그 이유를 보여줍니다.

source: Enumerations allow you to collect a set of values under one type
es: Las enumeraciones te permiten recoger un conjunto de valores en un solo tipo.
ko: 열거형은 값들의 집합을 하나의 타입으로 표현할 수 있게 합니다

source: This page offers an enum type `CoinFlip` with two variants `Heads` and `Tails`. You might note the namespace when using variants.
es: En esta página se ofrece el tipo de enumeración `CoinFlip` (tirar moneda) con dos variantes: `Heads` (cara) y `Tails` (cruz). Puede que veas el espacio de nombres cuando utilices variantes.
ko: 위의 `CoinFlip` 열거형 타입은 `Heads`와 `Tail` 두 가지 variant를 가집니다. 열거형 타입의 variant는 네임스페이스를 붙여서 사용합니다.

source: This might be a good time to compare Structs and Enums:
es: Este es un buen momento para comparar las estructuras y las enumeraciones:
ko: 구조체와 열거형을 비교해 보겠습니다:

source: In both, you can have a simple version without fields (unit struct) or one with different types of fields (variant payloads).
es: En ambas puedes tener una versión sencilla sin campos (estructura unitaria) o una versión con distintos tipos de campos (variantes con carga útil).
ko: 구조체나 열거형 모두, 필드가 하나도 없는 단순한 형태도 가능 하고, 여러 타입의 필드를 가질 수도 있습니다.

source: In both, associated functions are defined within an `impl` block.
es: En ambos casos, las funciones asociadas se definen en un bloque `impl`.
ko: 둘 다 연관함수를 `impl`블록으로 정의 할 수 있습니다.

source: You could even implement the different variants of an enum with separate structs but then they wouldn’t be the same type as they would if they were all defined in an enum.
es: Incluso podrías implementar las distintas variantes de una enumeración con estructuras diferentes, pero entonces no serían del mismo tipo como lo serían si estuvieran todas definidas en una enumeración.
ko: 열거형 타입의 각 variant를 별도의 구조체로 정의할 수도 있지만, 그러면 열거형을 사용했을 때처럼 하나의 타입으로 취급할 수 없습니다.

source: You can define richer enums where the variants carry data. You can then use the `match` statement to extract the data from each variant:
es: Puedes definir enumeraciones más completas en las que las variantes contienen datos. Después, puedes usar la instrucción `match` para extraer los datos de cada variante:
ko: 좀더 복잡한 열거형의 경우 variant에 데이터(payload)를 포함시키도 합니다. 각 variant에 담긴 데이터는 `match`문을 이용해 추출합니다:

source: The values in the enum variants can only be accessed after being pattern matched. The pattern binds references to the fields in the "match arm" after the `=>`.
es: Solo se puede acceder a los valores de las variantes de enumeración una vez que coincidan con el patrón. El patrón vincula referencias a los campos del "brazo de coincidencias" después de `=>`.
ko: 열거형 안의 값은 패턴 매칭이 되고 난 이후에만 접근 가능합니다. 그 값에 대한 레퍼런스는 `=>` 이후에 사용가능합니다.

source: The expression is matched against the patterns from top to bottom. There is no fall-through like in C or C++.
es: La expresión se coteja con los patrones de arriba abajo. No hay ningún sistema de respaldo, como en C o C++.
ko: 매치 패턴들은 위에서 아래로 순서에 따라 검사합니다. C나 C++에서와 같은 fall-through는 없습니다.

source: The match expression has a value. The value is the last expression in the match arm which was executed.
es: La expresión de coincidencia tiene un valor. El valor es la última expresión en el brazo de coincidencia que se ha ejecutado.
ko: 매치 표현식 자체는 값을 가집니다. 그 값은 매칭이 된 패턴에서 가장 마지막에 수행된 표현식이 됩니다.

source: Starting from the top we look for what pattern matches the value then run the code following the arrow. Once we find a match, we stop.
es: Empezando por la parte superior, buscaremos el patrón que coincide con el valor y, a continuación, ejecutaremos el fragmento de código que sigue a la flecha. Cuando encontremos una coincidencia, pararemos.
ko: 가장 위에서 부터 어떤 패턴이 주어진 값과 매칭하는지 검사한 다음, 매칭된 것이 발견되면 화살표를 따라 코드를 수행합니다. 한 번 매칭이 되고 코드가 수행이 되면, 더이상의 매칭은 없습니다.

source: Demonstrate what happens when the search is inexhaustive. Note the advantage the Rust compiler provides by confirming when all cases are handled.
es: Demuestra lo que pasa cuando la búsqueda no es exhaustiva. Ten en cuenta la ventaja que ofrece el compilador de Rust al confirmar cuándo se gestionan todos los casos.
ko: 매칭 패턴들이 불충분 하다면 어떤 일이 일어나는지 설명하세요. 러스트 컴파일러는 모든 가능한 케이스들이 핸들링 되는지 체크한다는 점을 상기시키세요.

source: `match` inspects a hidden discriminant field in the `enum`.
es: `match` inspecciona un campo discriminante oculto en `enum`.
ko: `match`는 주어진 열거형 값이 실제로 어떤 variant인지 판단하기 위해, 그 variant의 종류가 기록된, 숨겨진 필드(식별자)의 값을 검사합니다.

source: It is possible to retrieve the discriminant by calling `std::mem::discriminant()`
es: Se puede obtener el discriminante llamando a `std::mem::discriminant()`.
ko: `std::mem::discriminant()`를 이용하여 식별자를 얻을 수도 있습니다

source: This is useful, for example, if implementing `PartialEq` for structs where comparing field values doesn't affect equality.
es: Esto resulta útil si, por ejemplo, se implementa `PartialEq` en estructuras en las que la comparación de valores de campos no afecta a la igualdad.
ko: 이는 각 필드 값을 굳이 비교할 필요 없는 구조체에 대해 `PartialEq` 트레잇을 구현할 때 유용합니다.

source: `WebEvent::Click { ... }` is not exactly the same as `WebEvent::Click(Click)` with a top level `struct Click { ... }`. The inlined version cannot implement traits, for example.
es: `WebEvent::Click { ... }` no es exactamente lo mismo que `WebEvent::Click(Click)` con un nivel superior `struct Click { ... }`. La versión insertada no puede implementar traits, por ejemplo.
ko: `WebEvent::Click { ... }`은 최상위 레벨 구조체 `struct Click {...}`를 따로 정의하고 `WebEvent::Click(Click)`처럼 튜플 형태로 정의한 것과 정확히 같진 않습니다. 예를 들어 `WebEvent::Click { ... }` 로 정의한 경우, 구조체 형태와 유사하지만 트레잇을 구현 할 수 없습니다.

source: Rust enums are packed tightly, taking constraints due to alignment into account:
es: Las enumeraciones de Rust son densamente empaquetadas, ya que tienen en cuenta las restricciones debidas a la alineación:
ko: 러스트의 열거형은 정렬(alignment)로 인한 제약을 고려하여 크기를 빽빽하게 잡습니다:

source: See the [Rust Reference](https://doc.rust-lang.org/reference/type-layout.html).
es: Consulta el libro [Rust Reference](https://doc.rust-lang.org/reference/type-layout.html).
ko: 자세한 사항은 [공식문서](https://doc.rust-lang.org/reference/type-layout.html)를 확인하세요.

source: Internally Rust is using a field (discriminant) to keep track of the enum variant.
es: Rust utiliza un campo (discriminante) de forma interna para hacer un seguimiento de la variante de enumeración.
ko: 러스트는 열거형 variant를 구분하기 위해 내부적으로 식별자(discriminant) 필드를 사용합니다.

source: Try out other types such as
es: Prueba otros tipos, como
ko: 다른 타입들도 확인해보세요

source: `dbg_size!(bool)`: size 1 bytes, align: 1 bytes,
es: `dbg_size!(bool)`: tamaño de 1 byte, alineación de 1 byte,
ko: `dbg_size!(bool)`: 크기 1 바이트, 정렬: 1 바이트,

source: `dbg_size!(Option<bool>)`: size 1 bytes, align: 1 bytes (niche optimization, see below),
es: `dbg_size!(Option<bool>)`: tamaño de 1 byte, alineación de 1 byte (optimización de nichos, consulta más abajo),
ko: `dbg_size!(Option<bool>)`: 크기 1 바이트, 정렬: 1 바이트 (니치 최적화, 아래 설명 참조)

source: `dbg_size!(&i32)`: size 8 bytes, align: 8 bytes (on a 64-bit machine),
es: `dbg_size!(&i32)`: tamaño de 8 bytes, alineación de 8 bytes (en una máquina de 64 bits),
ko: `dbg_size!(&i32)`: 크기 8 바이트, 정렬: 8 바이트 (64비트 머신인 경우)

source: `dbg_size!(Option<&i32>)`: size 8 bytes, align: 8 bytes (null pointer optimization, see below).
es: `dbg_size!(Option<&i32>)`: tamaño de 8 bytes, alineación de 8 bytes (optimización del puntero nulo, consulta más abajo).
ko: `dbg_size!(Option<&i32>)`: 크기 8 바이트, 정렬: 8 바이트 (널포인터 최적화, 아래 설명 참조)

source: Niche optimization: Rust will merge unused bit patterns for the enum discriminant.
es: Optimización de nichos: Rust combina los patrones de bits no utilizados para el discriminante de enumeración.
ko: 니치 최적화: 러스트는 열거형 식별자를 사용되지 않은 비트 패턴과 병합합니다.

source: More complex example if you want to discuss what happens when we chain more than 256 `Option`s together.
es: Ejemplo más complejo si quieres hablar de lo que pasa cuando encadenamos más de 256 `Option`.
ko: 아래는 좀 더 복잡한 예제입니다. 256개 이상의 `Option`이 중첩되어 연결되어 있을 경우 어떻게 되는지 보여줍니다.

source: See [pattern matching](../pattern-matching.md) for more details on patterns in Rust.
es: Consulta de nuevo la sección de [coincidencia de patrones](../pattern-matching.md) para obtener más información sobre los patrones de Rust.
ko: 패턴에 관한 설명은 [패턴 매칭](../pattern-matching.md)을 참조하세요.

source: Since 1.65, a similar [let-else](https://doc.rust-lang.org/rust-by-example/flow_control/let_else.html) construct allows to do a destructuring assignment, or if it fails, execute a block which is required to abort normal control flow (with `panic`/`return`/`break`/`continue`):
es: A partir de la versión 1.65, una construcción [let-else](https://doc.rust-lang.org/rust-by-example/flow_control/let_else.html) similar permite realizar una tarea de desestructuración o, si falla, ejecutar un bloque necesario para anular el flujo de control normal (con `panic`/`return`/`break`/`continue`)::
ko: 1.65부터 유사한 [let-else](https://doc.rust-lang.org/rust-by-example/flow_control/let_else.html) 구성은 디스트럭처링 할당을 실행하거나 실패할 경우 반환되지 않는 블록 브랜치(panic/return/break/continue)를 보유하도록 허용합니다:

source: `while let` loops
es: Bucles `while let`
ko: `while let` 반복문

source: Here the iterator returned by `v.into_iter()` will return a `Option<i32>` on every call to `next()`. It returns `Some(x)` until it is done, after which it will return `None`. The `while let` lets us keep iterating through all items.
es: Aquí, el iterador devuelto por `v.into_iter()` devolverá `Option<i32>` en cada llamada a `next()`. Devuelve `Some(x)` hasta que finaliza y, a continuación, devuelve `None`. `while let` nos permite seguir iterando a través de todos los elementos.
ko: `v.into_iter()`가 반환한 반복자는 `next()`가 호출될 때마다 `Option<i32>`를 반환합니다. 반복자가 완료될 때까지는 `Some(x)`를 반환하고 마지막엔 `None`을 반환합니다. `while let`을 통해 반복자의 모든 아이템을 확인할 수 있습니다.

source: You could rewrite the `while let` loop as an infinite loop with an if statement that breaks when there is no value to unwrap for `iter.next()`. The `while let` provides syntactic sugar for the above scenario.
es: Puedes reescribir el bucle `while let` como un ciclo infinito con una instrucción if que deje de funcionar si `iter.next()` no tienen ningún valor que desenvolver. `while let` proporciona azúcar sintáctico en la situación anterior.
ko: `while let` 루프 대신 무한 루프를 사용하고 `iter.next()`가 빈 값을 반환할 때 루프를 빠져나오도록 작성할수도 있습니다. `while let`은 그러한 경우를 위한 문법적 편의를 제공합니다.

source: The [`match` keyword](https://doc.rust-lang.org/reference/expressions/match-expr.html) is used to match a value against one or more patterns. In that sense, it works like a series of `if let` expressions:
es: La \[palabra clave `match`\][`match` keyword](https://doc.rust-lang.org/reference/expressions/match-expr.html) se usa para comparar un valor con uno o varios patrones. En ese sentido, funciona como una serie de expresiones `if let`:
ko: `match`키워드는 어떤 값을 하나 이상의 패턴에 대해 매치하는데 사용합니다. 그런 면에서 `if let` 표현식을 여러개 이어 놓은 것과 같습니다:

source: Like `if let`, each match arm must have the same type. The type is the last expression of the block, if any. In the example above, the type is `()`.
es: Al igual que con `if let`, cada brazo de coincidencia debe ser del mismo tipo. El tipo es la última expresión del bloque, si la hay. En el ejemplo anterior, el tipo es `()`.
ko: `if let`과 마찬가지로 매치의 모든 팔(arm)은 같은 타입이어야 합니다. 팔이 블록이라면 블록의 마지막 표현식이 그 타입이 됩니다. 위의 예제에서 매치 표현식의 타입은 `()`입니다.

source: Save the match expression to a variable and print it out.
es: Guarda la expresión de coincidencia en una variable e imprímela.
ko: `match` 표현식을 변수에 할당하고 그 값을 출력해보세요.

source: Remove `.as_deref()` and explain the error.
es: Elimina `.as_deref()` y explica el error.
ko: `.as_deref()`를 지워보고, 이 때 나오는 에러를 설명해주세요.

source: `std::env::args().next()` returns an `Option<String>`, but we cannot match against `String`.
es: `std::env::args().next()` devuelve `Option<String>`, pero no podemos encontrar coincidencias con `String`.
ko: `std::env::args().next()`는 `Option<String>` 값을 반환하는데, `String`은 직접 매치할 수 없습니다.

source: `as_deref()` transforms an `Option<T>` to `Option<&T::Target>`. In our case, this turns `Option<String>` into `Option<&str>`.
es: `as_deref()` transforma `Option<T>` en `Option<&T::Target>`. En nuestro caso, esto convierte `Option<String>` en `Option<&str>`.
ko: `as_deref()`는 `Option<T>`를 `Option<&T::Target>`으로 바꿔줍니다. 이 경우는 `Option<String>`에서 `Option<&str>`로 바뀝니다.

source: We can now use pattern matching to match against the `&str` inside `Option`.
es: Ahora podemos usar la coincidencia de patrones para encontrar coincidencias con `&str` dentro de `Option`.
ko: 이제는 패턴 매칭으로 `Option` 안의 `&str`을 매치할 수 있습니다.

source: The `match` keyword let you match a value against one or more _patterns_. The comparisons are done from top to bottom and the first match wins.
es: La palabra clave `match` te permite comparar un valor con uno o varios _patrones_. Las comparaciones se hacen de arriba abajo y el primero que coincida gana.
ko: `match`키워드는 값을 여러 형태의 패턴과 매치시킬 수 있습니다. 맨 위 패턴부터 하나씩 매치되는지 검사하며, 처음으로 매치되는 패턴이 선택됩니다.

source: The `_` pattern is a wildcard pattern which matches any value.
es: `_` es un patrón comodín que coincide con cualquier valor.
ko: `_`패턴은 어떤 값과도 매칭되는 와일드카드입니다.

source: It can be useful to show how binding works, by for instance replacing a wildcard character with a variable, or removing the quotes around `q`.
es: Puede ser útil para mostrar cómo funciona un enlace, por ejemplo, cambiando un carácter comodín por una variable o quitando las comillas alrededor de `q`.
ko: 와일드카드 문자를 변수로 바꾸거나 `q`의 따옴표를 제거하는 식으로 수정하면서 바인딩이 어떻게 작동하는지 보여주는 것도 유용할 수 있습니다.

source: You can demonstrate matching on a reference.
es: Puedes mostrar la coincidencia con una referencia.
ko: 참조를 매칭하는 것도 시연할 수 있습니다.

source: This might be a good time to bring up the concept of irrefutable patterns, as the term can show up in error messages.
es: Este puede ser un buen momento para mencionar el concepto de patrones irrefutables, ya que el término puede aparecer en mensajes de error.
ko: 에러 메시지에 "반박 불가능 패턴(irrefutable pattern)"이란 용어가 등장하기도 합니다. 지금 그 의미를 소개하는 것도 좋을 것 같습니다.

source: You can also destructure `structs`:
es: También puedes desestructurar `structs`:
ko: `struct` 구조체 역시 분해할 수 있습니다:

source: You can destructure arrays, tuples, and slices by matching on their elements:
es: Puedes desestructurar arrays, tuplas y slices haciendo coincidir sus elementos:
ko: 배열이나 튜플, 슬라이스도 그 요소들에 대해 패턴 매칭으로 분해할 수 있습니다:

source: Destructuring of slices of unknown length also works with patterns of fixed length.
es: La desestructuración de slices de longitud desconocida también funciona con patrones de longitud fija.
ko: 길이를 알 수 없는 슬라이스에 대해서도 고정 길이 패턴으로 분해할 수 있습니다.

source: Create a new pattern using `_` to represent an element.
es: Crea un patrón con `_` para representar un elemento.
ko: `_`를 사용하여 요소를 매칭하는 패턴을 추가해보세요.

source: When matching, you can add a _guard_ to a pattern. This is an arbitrary Boolean expression which will be executed if the pattern matches:
es: Al establecer coincidencias, puedes añadir un _guardia_ a un patrón. Se trata de una expresión booleana arbitraria que se ejecutará si el patrón coincide:
ko: 패턴 뒤에 가드(guard, 조건식)를 덧붙일 수 있습니다. 가드는 패턴이 매치되면 추가로 따져보는 불리언 표현식입니다:

source: You can use the variables defined in the pattern in your if expression.
es: Puedes usar las variables definidas en el patrón en tu expresión if.
ko: 패턴에 정의된 변수를 가드의 표현식에서 사용할 수 있습니다.

source: Day 1: Afternoon Exercises
es: Día 1: Ejercicios de la Tarde
ko: 1일차 오후 연습문제

source: We will look at two things:
es: Veremos todas estas cosas:
ko: 이번 연습문제는 아래 두가지입니다:

source: The Luhn algorithm,
es: Algoritmo de Luhn

source: An exercise on pattern matching.
es: Un ejercicio sobre coincidencia de patrones.

source: Copy the code below to <https://play.rust-lang.org/> and implement the function.
es: Copia el siguiente fragmento de código en <https://play.rust-lang.org/> e implementa la función:
ko: 아래 코드를 <https://play.rust-lang.org/>에 복사해서 구현하시면 됩니다.

source: Try to solve the problem the "simple" way first, using `for` loops and integers. Then, revisit the solution and try to implement it with iterators.
es: Intenta resolver el problema de la forma "sencilla" primero, usando bucles `for` e enteros. Luego, vuelve a la solución e intenta implementarla con iteradores.
ko: `for`반복문과 인덱스를 이용하는 "쉬운"방법으로 먼저 풀어 보세요. 그런 다음 반복자를 이용해서 다시 풀어 보세요.

source: Now that we have seen a fair amount of Rust, we will continue with:
es: Ahora que ya sabemos bastante sobre Rust, continuaremos con lo siguiente:
ko: 상당한 분량의 러스트에 대해 보았고, 이어서 오늘 강의를 진행하겠습니다:

source: Memory management: stack vs heap, manual memory management, scope-based memory management, and garbage collection.
es: Gestión de la memoria: _stack_ (pila) vs _heap_ (montículo), gestión manual de la memoria, gestión de la memoria basada en ámbitos y _garbage collector_ (recolección de memoria residual).
ko: 메모리 관리: 스택과 힙, 수동 메모리 관리, 스코프(범위)기반 메모리 관리, 가비지 컬렉션(GC)

source: Ownership: move semantics, copying and cloning, borrowing, and lifetimes.
es: _Ownership_ (Propiedad): semántica de movimiento, copiar, clonar, _borrowing_ (préstamos) y _lifetimes_ (tiempos de vida).
ko: 소유권: Move 문법, 복사와 복제, 빌림, 수명.

source: Structs and methods.
es: Estructuras (_Structs_) y métodos.

source: The Standard Library: `String`, `Option` and `Result`, `Vec`, `HashMap`, `Rc` and `Arc`.
es: La Biblioteca Estándar (_Standard Library_): `String`, `Option` y `Result`, `Vec`, `HashMap`, `Rc` y `Arc`.
ko: 표준 라이브러리: `String`, `Option` 과 `Result`, `Vec`, `HashMap`, `Rc` 그리고 `Arc`.

source: Modules: visibility, paths, and filesystem hierarchy.
es: Módulos: visibilidad, rutas y jerarquía del sistema de archivos.
ko: 모듈: 가시성, 경로 및 파일 시스템 계층.

source: First, let's refresh how memory management works.
es: En primer lugar, veamos cómo funciona la gestión de la memoria.
ko: 우선 메모리 관리가 이뤄지는 방식을 다시 살펴 보겠습니다.

source: The Stack vs The Heap
es: _Stack_ (Pila) vs _Heap_ (Montículo)
ko: 스택(Stack)과 힙(Heap)

source: Stack and Heap Example
es: Ejemplo de _Stack_ y de _Heap_
ko: 스택과 힙에 관한 예제

source: We can inspect the memory layout with `unsafe` code. However, you should point out that this is rightfully unsafe!
es: Podemos inspeccionar la disposición de la memoria con código `unsafe`. Sin embargo, debes señalar que esto no es seguro.
ko: 아래와 같은 `unsafe` 코드로 메모리 레이아웃을 살펴볼 수 있습니다. 물론 이 코드가 안전하지 않다는 점을 알려주세요!

source: You allocate and deallocate heap memory yourself.
es: Eres tú quien asigna y desasigna la memoria del _heap_.
ko: 사용자가 직접 메모리를 할당, 해제 합니다.

source: If not done with care, this can lead to crashes, bugs, security vulnerabilities, and memory leaks.
es: Si no lo haces con cuidado, podrían producirse fallos, errores, vulnerabilidades de seguridad y pérdidas de memoria.
ko: 조심하지 않으면, 충돌(crash), 버그, 보안취약성 및 메모리 누출이 발생할 수 있습니다.

source: C Example
es: Ejemplo en C
ko: C 언어 예제

source: You must call `free` on every pointer you allocate with `malloc`:
es: Debes llamar a `free` en cada puntero que asignes con `malloc`:
ko: `malloc`으로 할당하는 포인터마다 `free`를 호출해야 합니다:

source: Memory is leaked if the function returns early between `malloc` and `free`: the pointer is lost and we cannot deallocate the memory. Worse, freeing the pointer twice, or accessing a freed pointer can lead to exploitable security vulnerabilities.
es: La memoria se pierde si la función devuelve un resultado antes de tiempo entre `malloc` y `free`: el puntero se pierde y no podemos anular la asignación de la memoria. Peor aún, si se libera el puntero dos veces o si se accede a uno liberado, pueden producirse vulnerabilidades de seguridad de las que otros podrían aprovecharse.
ko: 만약 `malloc` 과 `free` 사이에서 함수가 일찍 반환되면 메모리 누출이 일어납니다: 포인터를 잃어버리게 되어 메모리를 반환할 수 없게 됩니다. 같은 포인터를 두 번 반환하거나, 이미 반환된 포인터를 접근하는 것은 심각한 보안 문제를 일으킬 수 있습니다.

source: Constructors and destructors let you hook into the lifetime of an object.
es: Los constructores y destructores permiten acceder al tiempo de vida de un objeto.
ko: 생성자와 소멸자를 사용하여 객체의 생명주기에 따라 메모리 할당/해제가 일어나도록 할 수 있습니다.
