Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Adding Rust code to Chromium
fa: افزودن کد Rust به Chromium
pt_br: Adicionando código Rust ao Chromium
uk: Додавання коду Rust до Chromium

source: In some existing Chromium `BUILD.gn` file, declare a `rust_static_library`:
fa: در برخی از فایل‌های موجود `BUILD.gn` یک `rust_static_library` را اعلام کنید:
pt_br: Em algum arquivo `BUILD.gn` existente do Chromium, declare um `rust_static_library`:
uk: У деякому існуючому файлі Chromium `BUILD.gn` оголосіть `rust_static_library`:

source: You can also add `deps` on other Rust targets. Later we'll use this to depend upon third party code.
fa: همچنین می‌توانید `deps` را روی سایر اهداف Rust اضافه کنید. بعداً از این برای وابستگی به کد شخص ثالث استفاده خواهیم کرد.
pt_br: Você também pode adicionar `deps` em outros módulos Rust. Mais tarde, usaremos isso para depender de código de terceiros.
uk: Ви також можете додати `deps` на інших цілях Rust. Пізніше ми будемо використовувати це для залежності від стороннього коду.

source: You must specify _both_ the crate root, _and_ a full list of sources. The `crate_root` is the file given to the Rust compiler representing the root file of the compilation unit --- typically `lib.rs`. `sources` is a complete list of all source files which `ninja` needs in order to determine when rebuilds are necessary.
fa: شما باید هر دوی crate root و فهرست کامل منابع را مشخص کنید. `crate_root` فایلی است که به کامپایلر Rust داده می‌شود که نشان‌دهنده فایل ریشه واحد کامپایل است --- معمولاً به‌نام `lib.rs` است. همینطور `sources` فهرست کاملی از تمام فایل‌های منبعی است که `ninja` برای تعیین زمان لازم برای بازسازی به آن‌ها نیاز دارد.
pt_br: Você deve especificar _ambos_ o _crate root_ e uma lista completa de fontes. O `crate_root` é o arquivo fornecido ao compilador Rust que representa o arquivo raiz da unidade de compilação --- normalmente `lib.rs`. `sources` é uma lista completa de todos os arquivos de código que o `ninja` precisa para determinar quando as recompilações são necessárias.
uk: Ви маєте вказати _одночасно_ і корінь крейту, _і_ повний список вхідних кодів. `crate_root` - це файл, який передається компілятору Rust, що представляє собою кореневий файл блоку компіляції --- зазвичай це `lib.rs`. `sources` - це повний список усіх вхідних файлів, який потрібен `ninja` для того, щоб визначити, коли потрібна перезбірка.

source: (There's no such thing as a Rust `source_set`, because in Rust, an entire crate is a compilation unit. A `static_library` is the smallest unit.)
fa: (چیزی به نام Rust `source_set` وجود ندارد، زیرا در Rust، تمامی crate یک واحد جمع‌آوری است. `static_library` کوچک‌ترین واحد است.)
pt_br: (Não existe um `source_set` Rust, porque em Rust, um _crate_ inteiro é uma unidade de compilação. Uma `static_library` é a menor unidade.)
uk: (У Rust не існує такого поняття, як `source_set`, оскільки у Rust одиницею компіляції є цілий крейт. Найменшою одиницею є `static_library`).

source: Students might be wondering why we need a gn template, rather than using [gn's built-in support for Rust static libraries](https://gn.googlesource.com/gn/+/main/docs/reference.md#func_static_library). The answer is that this template provides support for CXX interop, Rust features, and unit tests, some of which we'll use later.
fa: دانش‌آموزان ممکن است تعجب کنند که چرا به جای استفاده از [پشتیبانی داخلی gn برای کتابخانه‌های استاتیک Rust](https://gn.googlesource.com/gn/+/main/docs/reference.md#func_static_library) به یک الگوی gn نیاز داریم. پاسخ این است که این الگو از CXX interop، ویژگی‌های Rust و تست‌های واحد پشتیبانی می‌کند که بعداً از برخی از آنها استفاده خواهیم کرد.
pt_br: Os alunos podem estar se perguntando por que precisamos de um template gn, em vez de usar [o suporte integrado do gn para bibliotecas estáticas Rust](https://gn.googlesource.com/gn/+/main/docs/reference.md#func_static_library). A resposta é que este template fornece suporte para interoperabilidade CXX, recursos Rust e testes unitários, alguns dos quais usaremos mais tarde.
uk: Студентам може бути цікаво, навіщо нам потрібен шаблон gn, а не використання [вбудованої підтримки статичних бібліотек Rust у gn](https://gn.googlesource.com/gn/+/main/docs/reference.md#func_static_library). Відповідь полягає у тому, що цей шаблон надає підтримку взаємодії CXX, функцій Rust та модульних тестів, деякі з яких ми використаємо пізніше.

source: Including `unsafe` Rust Code
fa: شامل کد `unsafe` Rust
pt_br: Incluindo código Rust `unsafe` (inseguro)
uk: Включаючи `unsafe` код Rust

source: Unsafe Rust code is forbidden in `rust_static_library` by default --- it won't compile. If you need unsafe Rust code, add `allow_unsafe = true` to the gn target. (Later in the course we'll see circumstances where this is necessary.)
fa: کد ناامن Rust به طور پیش‌فرض در `rust_static_library` غیرمجاز است --- کامپایل نمی‌شود. اگر به کد unsafe Rust نیاز دارید، `allow_unsafe = true` را به هدف gn اضافه کنید. (بعداً در دوره ما شرایطی را خواهیم دید که در آن لازم است.)
pt_br: O código Rust inseguro é proibido em `rust_static_library` por padrão --- não será compilado. Se você precisar de código Rust inseguro, adicione `allow_unsafe = true` ao alvo gn. (Mais tarde no curso, veremos circunstâncias em que isso é necessário).
uk: Небезпечний Rust-код заборонено у `rust_static_library` за замовчуванням --- він не буде скомпільований. Якщо вам потрібен небезпечний Rust-код, додайте `allow_unsafe = true` до цілі gn. (Пізніше у курсі ми побачимо обставини, за яких це необхідно).

source: Simply add the above target to the `deps` of some Chromium C++ target.
fa: به سادگی هدف بالا را به `deps` برخی از اهداف Chromium C++ اضافه کنید.
pt_br: Basta adicionar o alvo acima às `deps` de algum alvo C++ do Chromium.
uk: Просто додайте наведену вище ціль до `deps` деякої цілі Chromium C++.

source: Types are elided in Rust code, which makes a good IDE even more useful than for C++. Visual Studio code works well for Rust in Chromium. To use it,
fa: تایپ‌ها در کد Rust حذف شده اند که باعث می‌شود یک IDE خوب حتی مفیدتر از++C باشد. کد ویژوال استودیو برای Rust در Chromium به خوبی کار می کند و برای استفاده از آن،
pt_br: Os tipos são omitidos no código Rust, o que torna um bom IDE ainda mais útil do que para C++. O Visual Studio Code funciona bem para Rust no Chromium. Para usá-lo,
uk: Типи в Rust коді усуваються, що робить хорошу IDE ще більш корисною, ніж для C++. Код Visual Studio добре працює для Rust у Chromium. Щоб скористатися ним,

source: Ensure your VSCode has the `rust-analyzer` extension, not earlier forms of Rust support
fa: اطمینان حاصل کنید که VSCode شما دارای extension `rust-analyzer` است، نه فرم‌های قبلی پشتیبانی از Rust
pt_br: Verifique se o seu VSCode tem a extensão `rust-analyzer`, não as formas anteriores de suporte ao Rust
uk: Переконайтеся, що ваш VSCode має розширення `rust-analyzer`, а не більш ранні форми підтримки Rust

source: `gn gen out/Debug --export-rust-project` (or equivalent for your output directory)
fa: ‏ `gn gen out/Debug --export-rust-project` (یا معادل آن برای دایرکتوری خروجی شما)
pt_br: `gn gen out/Debug --export-rust-project` (ou equivalente para seu diretório de saída)
uk: `gn gen out/Debug --export-rust-project` (або еквівалент для вашого вихідного каталогу)

source: A demo of some of the code annotation and exploration features of rust-analyzer might be beneficial if the audience are naturally skeptical of IDEs.
fa: اگر مخاطب به طور طبیعی نسبت به IDE‌ها علاقه نداشته باشد، نمایش برخی از ویژگی‌های code annotation و کاوش در rust-analyzer می‌تواند مفید باشد.
pt_br: Uma demonstração de alguns dos recursos de anotação e exploração de código do rust-analyzer pode ser benéfica se o público for naturalmente cético em relação aos IDEs.
uk: Демонстрація деяких можливостей rust-analyzer з анотування та дослідження коду може бути корисною, якщо аудиторія скептично ставиться до IDE.

source: The following steps may help with the demo (but feel free to instead use a piece of Chromium-related Rust that you are most familiar with):
fa: مراحل زیر ممکن است به نسخه نمایشی کمک کند (اما در عوض از یک قطعه Rust مربوط به Chromium که بیشتر با آن آشنا هستید استفاده کنید):
pt_br: Os seguintes passos podem ajudar na demonstração (mas sinta-se à vontade para usar um pedaço de Rust relacionado ao Chromium com o qual você esteja mais familiarizado):
uk: Наступні кроки можуть допомогти з демонстрацією (але не соромтеся використовувати частину Rust, пов'язану з Chromium, з якою ви найбільш знайомі):

source: Open `components/qr_code_generator/qr_code_generator_ffi_glue.rs`
fa: ‏ `components/qr_code_generator/qr_code_generator_ffi_glue.rs` را باز کنید
pt_br: Abra `components/qr_code_generator/qr_code_generator_ffi_glue.rs`
uk: Відкрийте `components/qr_code_generator/qr_code_generator_ffi_glue.rs`

source: Place the cursor over the `QrCode::new` call (around line 26) in \`qr_code_generator_ffi_glue.rs
fa: مکان نما را روی فراخوانی `QrCode::new` (حدود خط 26) در \`qr_code_generator_ffi_glue.rs قرار دهید
pt_br: Coloque o cursor sobre a chamada `QrCode::new` (por volta da linha 26) em `qr_code_generator_ffi_glue.rs`
uk: Наведіть курсор на виклик `QrCode::new` (біля рядка 26) у \`qr_code_generator_ffi_glue.rs

source: Demo **show documentation** (typical bindings: vscode = ctrl k i; vim/CoC = K).
fa: نسخه‌ی نمایشی **نمایش مستندات ** (typical bindings: vscode = ctrl k i; vim/CoC = K).
pt_br: Demonstre **mostrar documentação** (teclas de atalho típicas: vscode = ctrl k i; vim/CoC = K).
uk: Продемонструйте **show documentation** (типові прив'язки: vscode = ctrl k i; vim/CoC = K).

source: Demo **go to definition** (typical bindings: vscode = F12; vim/CoC = g d). (This will take you to `//third_party/rust/.../qr_code-.../src/lib.rs`.)
fa: نسخه‌ی Demo یا نمایشی **go to definition** (typical bindings: vscode = F12; vim/CoC = g d). (این شما را به `//third_party/rust/.../qr_code-.../src/lib.rs` می‌رساند.)
pt_br: Demonstre **ir para a definição** (teclas de atalho típicas: vscode = F12; vim/CoC = g d). (Isso o levará a `//third_party/rust/.../qr_code-.../src/lib.rs`).
uk: Продемонструйте **go to definition** (типові прив'язки: vscode = F12; vim/CoC = g d). (Звідси ви потрапите на `//third_party/rust/.../qr_code-.../src/lib.rs`.)

source: Demo **outline** and navigate to the `QrCode::with_bits` method (around line 164; the outline is in the file explorer pane in vscode; typical vim/CoC bindings = space o)
fa: نسخه آزمایشی **outline** و در ادامه به متد `QrCode::with_bits` بروید (حدود خط 164؛ طرح کلی در پنجره file explorer در vscode است؛ typical vim/CoC bindings = space o)
pt_br: Demonstre **esboço** e navegue até o método `QrCode::with_bits` (por volta da linha 164; o esboço está no painel do explorador de arquivos no vscode; teclas de atalho típicas do vim/CoC = space o)
uk: Продемонструйте **outline** і перейдіть до методу `QrCode::with_bits` (біля рядка 164; контур знаходиться на панелі провідника файлів у vscode; типові прив'язки vim/CoC = space o)

source: Demo **type annotations** (there are quite a few nice examples in the `QrCode::with_bits` method)
fa: نسخه‌ی نمایشی **type annotations** (مثال های بسیار خوبی در متد `QrCode::with_bits` وجود دارد)
uk: Продемонструйте **type annotations** (у методі `QrCode::with_bits` наведено декілька гарних прикладів)

source: It may be worth pointing out that `gn gen ... --export-rust-project` will need to be rerun after editing `BUILD.gn` files (which we will do a few times throughout the exercises in this session).
fa: ممکن است مهم باشد که `gn gen ... --export-rust-project` باید پس از ویرایش فایل‌های `BUILD.gn` (که در طول تمرین‌های این جلسه چند بار انجام می‌دهیم) دوباره اجرا شود.
pt_br: Pode valer a pena observar que `gn gen ... --export-rust-project` precisará ser executado novamente após a edição dos arquivos `BUILD.gn` (o que faremos algumas vezes ao longo dos exercícios desta sessão).
uk: Варто зазначити, що команду `gn gen ... --export-rust-project` потрібно буде виконати повторно після редагування файлів `BUILD.gn` (що ми будемо робити кілька разів під час виконання вправ у цій сесії).

source: Build rules exercise
fa: تمرین قواعد ساخت
pt_br: Exercício de regras de compilação
uk: Вправа правил побудови

source: In your Chromium build, add a new Rust target to `//ui/base/BUILD.gn` containing:
fa: در ساخت Chromium خود، یک Rust target جدید به `//ui/base/BUILD.gn` اضافه کنید که حاوی:
pt_br: Em sua compilação do Chromium, adicione um novo módulo Rust a `//ui/base/BUILD.gn` contendo:
uk: У вашій збірці Chromium додайте нову ціль Rust до файлу `//ui/base/BUILD.gn`, що містить:

source: **Important**: note that `no_mangle` here is considered a type of unsafety by the Rust compiler, so you'll need to allow unsafe code in your `gn` target.
fa: **مهم**: توجه داشته باشید که `no_mangle` در اینجا توسط کامپایلر Rust نوعی ناامنی (type of unsafety) در نظر گرفته می‌شود، بنابراین باید کد unsafe را در `gn` target خود مجاز کنید.
uk: **Важливо**: зауважте, що `no_mangle` тут розглядається компілятором Rust як тип небезпеки, тому вам потрібно буде дозволити небезпечний код у вашій цілі `gn`.

source: Add this new Rust target as a dependency of `//ui/base:base`. Declare this function at the top of `ui/base/resource/resource_bundle.cc` (later, we'll see how this can be automated by bindings generation tools):
fa: این هدف جدید Rust را به عنوان وابستگی به `//ui/base:base` اضافه کنید. این تابع را در بالای `ui/base/resource/resource_bundle.cc` اعلام کنید (بعداً خواهیم دید که چگونه می‌توان این کار را با ابزارهای تولید bindings خودکار کرد):
pt_br: Adicione este novo módulo Rust como uma dependência de `//ui/base:base`. Declare esta função no topo de `ui/base/resource/resource_bundle.cc` (mais tarde, veremos como isso pode ser automatizado por ferramentas de geração de _bindings_):
uk: Додайте цю нову ціль Rust як залежність від `//ui/base:base`. Оголосіть цю функцію у верхній частині файлу `ui/base/resource/resource_bundle.cc` (пізніше ми побачимо, як це можна автоматизувати за допомогою інструментів генерації прив'язок):

source: Call this function from somewhere in `ui/base/resource/resource_bundle.cc` - we suggest the top of `ResourceBundle::MaybeMangleLocalizedString`. Build and run Chromium, and ensure that "Hello from Rust!" is printed lots of times.
fa: این تابع را از جایی در `ui/base/resource/resource_bundle.cc` فراخوانی کنید - ما قسمت بالای `ResourceBundle::MaybeMangleLocalizedString` را پیشنهاد می‌کنیم. Chromium را Build و اجرا کنید و مطمئن شوید که "Hello from Rust!" بارها چاپ می‌شود.
pt_br: Chame esta função de algum lugar em `ui/base/resource/resource_bundle.cc` - sugerimos o topo de `ResourceBundle::MaybeMangleLocalizedString`. Compile e execute o Chromium e verifique se "Hello from Rust!" é impresso muitas vezes.
uk: Викличте цю функцію звідкись з `ui/base/resource/resource_bundle.cc` - радимо зверху `ResourceBundle::MaybeMangleLocalizedString`. Зберіть і запустіть Chromium, і переконайтеся, що "Hello from Rust!" виводиться багато разів.

source: If you use VSCode, now set up Rust to work well in VSCode. It will be useful in subsequent exercises. If you've succeeded, you will be able to use right-click "Go to definition" on `println!`.
fa: اگر از VSCode استفاده می‌کنید، اکنون Rust را تنظیم کنید تا در VSCode به خوبی کار کند. این کار در تمرین‌های بعدی مفید خواهد بود. اگر موفق شده‌اید، می‌توانید از کلیک راست روی"Go to definition" در`println!` استفاده کنید.
pt_br: Se você usar o VSCode, agora configure o Rust para funcionar bem no VSCode. Isto será útil nos exercícios subsequentes. Se você tiver sucesso, poderá usar o botão direito do mouse em "Ir para definição" em `println!`.
uk: Якщо ви використовуєте VSCode, налаштуйте Rust для роботи у VSCode. Це стане у нагоді у наступних вправах. Якщо вам це вдалося, ви зможете скористатися командою "Go to definition" правою кнопкою миші на `println!`.

source: Where to find help
fa: کجا می‌توان help پیدا کرد
pt_br: Onde encontrar ajuda
uk: Де знайти допомогу

source: The options available to the [`rust_static_library` gn template](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/rust_static_library.gni;l=16)
fa: گزینه‌های موجود برای [`rust_static_library` gn template](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/rust_static_library.gni;l=16)
pt_br: As opções disponíveis para o [`rust_static_library` gn template](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/rust_static_library.gni;l=16)
uk: Опції, доступні для [`rust_static_library`шаблону gn](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/rust_static_library.gni;l=16)

source: Information about [`#[no_mangle]`](https://doc.rust-lang.org/beta/reference/abi.html#the-no_mangle-attribute)
fa: اطلاعات درباره [`#[no_mangle]`](https://doc.rust-lang.org/beta/reference/abi.html#the-no_mangle-attribute)
pt_br: Informações sobre [`#[no_mangle]`](https://doc.rust-lang.org/beta/reference/abi.html#the-no_mangle-attribute)
uk: Інформація про [`#[no_mangle]`](https://doc.rust-lang.org/beta/reference/abi.html#the-no_mangle-attribute)

source: Information about [`extern "C"`](https://doc.rust-lang.org/std/keyword.extern.html)
fa: اطلاعات درباره [`extern "C"`](https://doc.rust-lang.org/std/keyword.extern.html)
pt_br: Informações sobre [`extern "C"`](https://doc.rust-lang.org/std/keyword.extern.html)
uk: Інформація про [`extern "C"`](https://doc.rust-lang.org/std/keyword.extern.html)

source: Information about gn's [`--export-rust-project`](https://gn.googlesource.com/gn/+/main/docs/reference.md#compilation-database) switch
fa: اطلاعاتی درباره gnهای [`--export-rust-project`](https://gn.googlesource.com/gn/+/main/docs/reference.md#compilation-database) switch
pt_br: Informações sobre o [`--export-rust-project`](https://gn.googlesource.com/gn/+/main/docs/reference.md#compilation-database) do gn
uk: Інформація про перемикач [`--export-rust-project`](https://gn.googlesource.com/gn/+/main/docs/reference.md#compilation-database) gn

source: [How to install rust-analyzer in VSCode](https://code.visualstudio.com/docs/languages/rust)
pt_br: [Como instalar o rust-analyzer no VSCode](https://code.visualstudio.com/docs/languages/rust)
uk: [Як встановити rust-analyzer у VSCode](https://code.visualstudio.com/docs/languages/rust)

source: This example is unusual because it boils down to the lowest-common-denominator interop language, C. Both C++ and Rust can natively declare and call C ABI functions. Later in the course, we'll connect C++ directly to Rust.
fa: این مثال غیرعادی است زیرا به زبان متقابل با کمترین مخرج مشترک، C خلاصه می‌شود. بعداً در دوره، ++C آن را مستقیماً به Rust وصل خواهیم کرد.
pt_br: Este exemplo é incomum porque se resume à linguagem de interoperabilidade de menor denominador comum, C. Tanto C++ quanto Rust podem declarar e chamar nativamente funções C ABI. Mais tarde no curso, conectaremos C++ diretamente ao Rust.
uk: Цей приклад є незвичайним, тому що він зводиться до мови взаємодії з найменшим спільним знаменником - C. І C++, і Rust можуть оголошувати та викликати функції C ABI на мові C. Пізніше у курсі ми підключимо C++ безпосередньо до Rust.

source: `allow_unsafe = true` is required here because `#[no_mangle]` might allow Rust to generate two functions with the same name, and Rust can no longer guarantee that the right one is called.
fa: ‏ `allow_unsafe = true` در اینجا مورد نیاز است زیرا `#[no_mangle]` ممکن است به Rust اجازه دهد دو تابع با نام یکسان تولید کند و Rust دیگر نمی‌تواند تضمین کند که تابع مورد نظر فراخوانی شده است.
pt_br: `allow_unsafe = true` é necessário aqui porque `#[no_mangle]` pode permitir que o Rust gere duas funções com o mesmo nome, e o Rust não pode mais garantir que a correta seja chamada.
uk: Тут потрібен `allow_unsafe = true`, оскільки `#[no_mangle]` може дозволити Rust згенерувати дві функції з однаковими іменами, і Rust більше не зможе гарантувати, що буде викликано правильну функцію.

source: If you need a pure Rust executable, you can also do that using the `rust_executable` gn template.
fa: اگر به یک فایل اجرایی Rust خالص نیاز دارید، می‌توانید این کار را با استفاده از الگوی`rust_executable` gn نیز انجام دهید.
pt_br: Se você precisar de um executável Rust puro, também poderá fazer isso usando o template gn `rust_executable`.
uk: Якщо вам потрібен чистий виконуваний файл Rust, ви також можете зробити це за допомогою шаблону gn `rust_executable`.

source: Rust community typically authors unit tests in a module placed in the same source file as the code being tested. This was covered [earlier](../testing.md) in the course and looks like this:
fa: جامعه Rust معمولاً unit testهای را در یک ماژول قرار می‌دهد که در همان فایل منبع کد مورد آزمایش قرار می‌گیرد. این مورد [قبل‌تر](../testing.md) در دوره پوشش داده شده بود و به این صورت است:
pt_br: A comunidade Rust normalmente escreve testes unitários em um módulo colocado no mesmo arquivo de código sendo testado. Isso foi abordado [anteriormente](../testing.md) no curso e se parece com isso:
uk: Учасники спільноти Rust зазвичай пишуть модульні тести у модулі, розміщеному у тому самому вхідному файлі, що й код, який тестується. Це було розглянуто [раніше](../testing.md) у курсі і має такий вигляд:

source: In Chromium we place unit tests in a separate source file and we continue to follow this practice for Rust --- this makes tests consistently discoverable and helps to avoid rebuilding `.rs` files a second time (in the `test` configuration).
fa: در Chromium باید unit testها را در یک فایل منبع جداگانه قرار دهیم و همچنان این روش را برای Rust دنبال می‌کنیم --- این باعث می‌شود تست‌ها به طور مداوم قابل کشف باشند و کمک می‌کند از بازسازی فایل‌های `.rs` برای بار دوم (در پیکربندی `test`) جلوگیری شود.
pt_br: No Chromium, colocamos os testes unitários em um arquivo de código separado e continuamos a seguir essa prática para o Rust --- isso torna os testes consistentemente descobríveis e ajuda a evitar a reconstrução de arquivos `.rs` uma segunda vez (na configuração `test`).
uk: У Chromium ми розміщуємо модульні тести в окремому вхідному файлі і продовжуємо дотримуватися цієї практики для Rust --- це робить тести стабільно доступними для виявлення і допомагає уникнути повторної збірки `.rs`-файлів (у конфігурації `test`).

source: This results in the following options for testing Rust code in Chromium:
fa: این منجر به گزینه‌های زیر برای تست کد Rust در Chromium می‌شود:
pt_br: Isto resulta nas seguintes opções para testar código Rust no Chromium:
uk: Це призводить до наступних варіантів тестування Rust-коду в Chromium:

source: Native Rust tests (i.e. `#[test]`). Discouraged outside of `//third_party/rust`.
fa: تست‌های Native Rust (یعنی `#[test]`). خارج از `//third_party/rust` مناسب نیست.
pt_br: Testes nativos Rust (ou seja, `#[test]`). Desencorajado fora de `//third_party/rust`.
uk: Нативні тести Rust (тобто `#[test]`). Не рекомендується використовувати поза `//third_party/rust`.

source: `gtest` tests authored in C++ and exercising Rust via FFI calls. Sufficient when Rust code is just a thin FFI layer and the existing unit tests provide sufficient coverage for the feature.
fa: تست‌های `gtest` که در C++ نوشته شده‌اند و Rust را از طریق تماس‌های FFI انجام می‌دهند. زمانی که کد Rust فقط یک لایه نازکی از FFI است و unit testها موجود، پوشش کافی برای ویژگی‌هایی که ارائه می‌کنند کافی است.
pt_br: Testes `gtest` escritos em C++ e exercitando Rust via chamadas FFI. Suficiente quando o código Rust é apenas uma camada FFI fina e os testes unitários existentes fornecem cobertura suficiente para o recurso.
uk: Тести `gtest`, написані на C++, які виконують Rust за допомогою викликів FFI. Достатньо, коли код Rust є лише тонким прошарком FFI, а наявні модульні тести забезпечують достатнє покриття для функції.
