Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: In addition, you can use `if` as an expression. The last expression of each block becomes the value of the `if` expression:
es: Además, puedes utilizar `if` como expresión. La última expresión de cada bloque se convierte en el valor de la expresión `if`:
fa: در کنار این موضوع, می‌توانید از if به عنوان یک عبارت با قابلیت بازگشت مقدار هم استفاده کنید. آخرین عبارت توی هر بلاک if اون مقدار و نوع بازگشتی است:
ja: さらに、`if` を式としても用いることができます。それぞれのブロックにある最後の式が、`if` 式の値となります。
ko: 게다가 `if`는 표현식으로 사용할 수도 있습니다. 아래 코드는 위와 동일합니다:
pt_br: Além disso, você pode usá-lo como uma expressão. A última expressão de cada bloco se torna o valor da expressão `if`
uk: Крім того, ви можете використовувати `if` як вираз. Останній вираз кожного блоку стає значенням виразу `if`:

source: "small"
fa: "کوچک"
pt_br: "pequeno"
uk: "маленький"

source: "large"
fa: "بزرگ"
pt_br: "grande"
uk: "великий"

source: "number size: {}"
fa: "اندازه عدد: {}"
pt_br: "tamanho do número: {}"
uk: "розмір числа: {}"

source: Because `if` is an expression and must have a particular type, both of its branch blocks must have the same type. Show what happens if you add `;` after `"small"` in the second example.
fa: از آنجایی که ‍`if` یک عبارت است و باید نوع خاصی داشته باشد، هر دو بلاک (`if` و `else`) باید از نوع یکسانی را باز گردانند. در نظر بگیرید که اگر بعد از `x / 2` در مثال دوم `;` اضافه کنید، چه اتفاقی می افتد.
pt_br: Como `if` é uma expressão e deve ter um tipo específico, ambos os blocos de ramificação devem ter o mesmo tipo. Considere mostrar o que acontece se você adicionar um `;` depois de `"pequeno"` no segundo exemplo.
uk: Оскільки `if` є виразом і повинен мати певний тип, обидва його блоки розгалужень повинні мати той самий тип. Покажіть, що станеться, якщо додати `;` після `"маленький"` у другому прикладі.

source: An `if` expression should be used in the same way as the other expressions. For example, when it is used in a `let` statement, the statement must be terminated with a `;` as well. Remove the `;` before `println!` to see the compiler error.
uk: Вираз `if` слід використовувати так само, як і інші вирази. Наприклад, якщо він використовується в операторі `let`, цей оператор також має завершуватися символом `;`. Видаліть `;` перед `println!`, щоб побачити помилку компілятора.

source: There are three looping keywords in Rust: `while`, `loop`, and `for`:
fa: سه کلمه کلیدی حلقه ای در Rust وجود دارد: "while"، "loop" و "for":
ja: Rust には、`while`、`loop`、`for` の 3 つのループ キーワードがあります。
pt_br: Há três palavras-chave de loop em Rust: `while`, `loop` e `for`:
uk: У Rust є три ключові слова циклу: `while`, `loop` і `for`:

source: The [`while` keyword](https://doc.rust-lang.org/reference/expressions/loop-expr.html#predicate-loops) works much like in other languages, executing the loop body as long as the condition is true.
fa: [کلمه‌کلیدی`while` ](https://doc.rust-lang.org/reference/expressions/loop-expr.html#predicate-loops) بسیار شبیه به سایر زبان‌ها عمل می‌کند.
ja: [`while` キーワード](https://doc.rust-lang.org/reference/expressions/loop-expr.html#predicate-loops) は、他の言語における `while` と非常によく似た働きをします。
pt_br: A [palavra-chave `while`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#predicate-loops) funciona de maneira muito similar a outras linguagens, executando o corpo do loop enquanto a condição for verdadeira.
uk: Ключове слово [`while`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#predicate-loops) працює так само, як і в інших мовах, виконуючи тіло циклу доти, доки умова виконується.

source: The [`for` loop](https://doc.rust-lang.org/std/keyword.for.html) iterates over ranges of values or the items in a collection:
fa: حلقه [`for`](https://doc.rust-lang.org/std/keyword.for.html) در محدوده‌ای از مقادیر یا موارد موجود در یک مجموعه تکرار می‌شود:
uk: Цикл [`for`](https://doc.rust-lang.org/std/keyword.for.html) виконує ітерації над діапазонами значень або елементами колекції:

source: Under the hood `for` loops use a concept called "iterators" to handle iterating over different kinds of ranges/collections. Iterators will be discussed in more detail later.
fa: حلقه‌های «for» در از مفهومی به نام «تکرارکننده‌ها» برای مدیریت تکرار در انواع مختلف محدوده/مجموعه استفاده می‌کنند. Iterators بعداً با جزئیات بیشتر مورد بحث قرار خواهند گرفت.
uk: Під капотом циклів `for` використовується концепція, яка називається "ітератори", для обробки ітерацій над різними типами діапазонів/колекцій. Ітератори буде розглянуто більш детально пізніше.

source: Note that the first `for` loop only iterates to `4`. Show the `1..=5` syntax for an inclusive range.
fa: توجه داشته باشید که حلقه `for` فقط تا `4` تکرار می شود. نحو `1..=5` را برای یک محدوده فراگیر نشان دهید.
uk: Зверніть увагу, що перший цикл `for` виконує ітерацію тільки до `4`. Покажіть синтаксис `1..=5` для включеного діапазону.

source: The [`loop` statement](https://doc.rust-lang.org/std/keyword.loop.html) just loops forever, until a `break`.
fa: [`loop`](https://doc.rust-lang.org/std/keyword.loop.html) برای همیشه، تا زمانی که یک «break» ایجاد شود، حلقه می‌شود.
ja: [`loop` ステートメント](https://doc.rust-lang.org/std/keyword.loop.html) は、`break` まで永久にループするだけです。
pt_br: O [loop `loop`](https://doc.rust-lang.org/std/keyword.loop.html) apenas executa um loop para sempre, até um `break`.
uk: Оператор [`loop`](https://doc.rust-lang.org/std/keyword.loop.html) просто повторюється до нескінченності, поки не трапиться `break`.

source: If you want to immediately start the next iteration use [`continue`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#continue-expressions).
es: Si quieres iniciar inmediatamente la siguiente iteración, usa [`continue`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#continue-expressions).
fa: اگر می‌خواهید بلافاصله تکرار بعدی را شروع کنید، از [`continue`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#continue-expressions) استفاده کنید.
ja: 次のイテレーションをすぐさま開始したい場合は [`continue`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#continue-expressions) を使用してください。
ko: 다음 반복을 즉시 시작하려면 [`continue`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#continue-expressions)를 사용합니다.
pt_br: Se você quiser iniciar imediatamente a próxima iteração use [`continue`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#continue-expressions).
uk: Якщо ви хочете негайно почати наступну ітерацію, використовуйте [`continue`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#continue-expressions).

source: If you want to exit any kind of loop early, use [`break`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#break-expressions). With `loop`, this can take an optional expression that becomes the value of the `loop` expression.
uk: Якщо ви хочете достроково вийти з будь-якого типу циклу, використовуйте [`break`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#break-expressions). З `loop` це може бути необов'язковий вираз, який стане значенням виразу `loop`.

source: Note that `loop` is the only looping construct which can return a non-trivial value. This is because it's guaranteed to only return at a `break` statement (unlike `while` and `for` loops, which can also return when the condition fails).
uk: Зверніть увагу, що `loop` - це єдина циклічна конструкція, яка може повертати нетривіальне значення. Це пов'язано з тим, що вона гарантовано повертає значення лише при виконанні оператора `break` (на відміну від циклів `while` і `for`, які також можуть повертати значення при невиконанні умови).

source: Both `continue` and `break` can optionally take a label argument which is used to break out of nested loops:
es: De forma opcional, tanto `continue` como `break` pueden utilizar un argumento de etiqueta para interrumpir los bucles anidados:
fa: کلیدواژه‌های `continue` و `break` هر دو می‌توانند به صورت اختیاری یک آرگومان برچسب (label) بگیرند که میتوان برای خروج از حلقه‌های تو در تو استفاده می‌کرد:
ja: `continue` と `break` はオプションでラベル引数を取ることができます。ラベルはネストしたループから抜け出すために使われます。
ko: 루프를 빠져나가려면 `break`를, 다음 반복으로 넘어가기 위해서는 `continue`를 사용합니다. 중첩 루프에서는 레이블과 함께 사용할 수 있습니다:
pt_br: Ambos `continue` e `break` podem opcionalmente receber um _label_ (rótulo) como argumento que é usado para sair de loops aninhados:
uk: І `continue`, і `break` можуть додатково приймати аргумент мітки, який використовується для виходу з вкладених циклів:

source: "elements searched: {elements_searched}"
uk: "елементів переглянуто: {elements_searched}"

source: Labeled break also works on arbitrary blocks, e.g.
uk: Позначене переривання також працює на довільних блоках, наприклад

source: "This line gets skipped"
uk: "Цей рядок пропускається"

source: Blocks
es: Bloques
fa: بلوک‌ها
ja: コードブロック
ko: 블록
pt_br: Blocos
uk: Блоки

source: A block in Rust contains a sequence of expressions, enclosed by braces `{}`. Each block has a value and a type, which are those of the last expression of the block:
fa: یک بلوک در Rust حاوی دنباله ای از عبارات است که با پرانتزهای «{}» محصور شده است. هر بلوک دارای یک مقدار و یک نوع است که آخرین عبارت بلوک است:
uk: Блок у Rust містить послідовність виразів, взятих у фігурні дужки `{}`. Кожен блок має значення і тип, які відповідають значенню і типу останнього виразу в блоці:

source: If the last expression ends with `;`, then the resulting value and type is `()`.
es: Si la última expresión termina con `;`, el tipo y el valor resultante será `()`.
fa: اگر آخرین عبارت با `;` پایان یابد، مقدار و نوع بازگشتی `()` است.
ja: 最後の式が `;` で終了した場合、ブロック全体の値と型は `()` になります。
ko: 위의 `main` 함수는 마지막 표현식이 `;`로 끝나기 때문에 반환되는 값과 타입이 `()`입니다.
pt_br: Se a última expressão terminar com `;`, o valor resultante e o tipo será `()`.
uk: Якщо останній вираз закінчується символом `;`, то результуюче значення і тип буде `()`.

source: You can show how the value of the block changes by changing the last line in the block. For instance, adding/removing a semicolon or using a `return`.
es: Puedes mostrar cómo cambia el valor del bloque cambiando su última línea. Por ejemplo, añade o quita un punto y coma, o utiliza la expresión `return`.
fa: می‌توانید نشان دهید که چگونه با تغییر خط آخر بلاک مقدار و نوع بازگشتی تغییر می‌کند. به عنوان مثال با اضافه کردن یا حذف کردن یک `;` یا با استفاده از کلید واژه `return` تغییرات را اعمال کنید.
ja: ブロック内にある最後の行を変更することによって、ブロック全体の値が変わることが分かります。例えば、行末のセミコロンを追加/削除したり、`return` を使用したりすることで、ブロックの値は変化します。
ko: 블록 마지막 줄을 수정하면서 블록의 값이 어떻게 바뀌는지 보여주세요. 예를 들어, 세미콜론을 넣거나 뺀다든지, 아니면 `return`을 사용해 보세요.
pt_br: Você pode mostrar como o valor do bloco muda alterando a última linha do bloco. Por exemplo, adicionar/remover um ponto e vírgula (`;`) ou usar um `return`.
uk: Ви можете показати, як змінюється значення блоку, змінивши останній рядок у блоці. Наприклад, додаванням/видаленням крапки з комою або використанням `return`.

source: A variable's scope is limited to the enclosing block.
fa: ‏محدوده (scope) یک متغیر محدود به بلاک محاصره‌کننده آن است.
ja: 変数のスコープは、囲まれたブロック内に限定されます。
pt_br: O escopo de uma variável é limitado ao bloco que a contém.
uk: Область видимості змінної обмежується блоком, що її охоплює.

source: You can shadow variables, both those from outer scopes and variables from the same scope:
es: Puedes sombrear variables, tanto las de ámbitos externos como las del propio ámbito:
fa: شما می توانید متغیرها را سایه بزنید، هم آنهایی که از اسکوپ‌های بیرونی هستند و هم متغیرهایی که از اسکوپ یکسان هستند:
ja: 外側のスコープの変数と、同じスコープの変数の両方をシャドーイングできます。
ko: 현재 범위에 있는 변수와, 바깥 범위에 있는 변수 모두 가릴(쉐도잉)수 있습니다:
pt_br: Você pode sobrepor (_shadow_) variáveis, tanto aquelas de escopos externos quanto variáveis do mesmo escopo:
uk: Ви можете затіняти змінні, як із зовнішніх областей, так і змінні з тієї ж області:

source: "before: {a}"
pt_br: "antes: {a}"
uk: "до: {a}"

source: "hello"
pt_br: "olá"
uk: "привіт"

source: "inner scope: {a}"
pt_br: "escopo interno: {a}"
uk: "внутрішня область видимості: {a}"

source: "shadowed in inner scope: {a}"
pt_br: "sobreposto no escopo interno: {a}"
uk: "затінений у внутрішній області видимості: {a}"

source: "after: {a}"
pt_br: "depois: {a}"
uk: "після: {a}"

source: Show that a variable's scope is limited by adding a `b` in the inner block in the last example, and then trying to access it outside that block.
fa: با افزودن یک «b» در بلوک داخلی در آخرین مثال، و سپس تلاش برای دسترسی به آن در خارج از بلوک، نشان دهید که دامنه یک متغیر محدود است.
ja: 最後の例の内側のブロックに `b` を追加し、そのブロックの外側でアクセスを試みることで、変数のスコープが制限されていることを示します。
pt_br: Mostre que o escopo de uma variável é limitado adicionando um `b` no bloco interno no último exemplo e, em seguida, tentando acessá-lo fora desse bloco.
uk: Покажіть, що область видимості змінної обмежена, додавши `b` у внутрішньому блоці в останньому прикладі, а потім спробувавши отримати доступ до неї за межами цього блоку.

source: Shadowing is different from mutation, because after shadowing both variables' memory locations exist at the same time. Both are available under the same name, depending where you use it in the code.
uk: Затінення відрізняється від мутації тим, що після затінення обидві ділянки пам'яті змінних існують одночасно. Обидві змінні доступні під одним і тим же ім'ям, залежно від того, де ви їх використовуєте у коді.

source: A shadowing variable can have a different type.
fa: یک متغیر سایه‌دار می تواند انواع داده‌ای متفاوتی داشته باشد.
ja: シャドーイング変数の型はさまざまです。
pt_br: Uma variável sobreposta pode ter um tipo diferente.
uk: Змінна затінення може мати інший тип.

source: Shadowing looks obscure at first, but is convenient for holding on to values after `.unwrap()`.
es: Al principio, el sombreado no es fácil, pero resulta útil para conservar valores después de `.unwrap()`.
fa: سایه زدن در ابتدا مبهم به نظر می رسد، اما برای نگه داشتن مقادیر پس از <span dir=ltr>`.unwrap()`</span> مناسب است.
ja: シャドーイングは一見わかりにくいように見えますが、`.unwrap()` の後の値を保持する場合に便利です。
ko: 처음에 쉐도잉을 보면 코드를 더 모호하게 만든다고 생각할 수 도 있습니다. 그러나 실제로 쉐도잉을 이용하면, 어떤 변수에서 `.unwrap()` 된 값을 새로운 변수에 담을 경우 새로운 이름을 지을 필요 없이 기존 이름을 유지할 수 있어서 편리합니다.
pt_br: Shadowing (sobreposição) parece obscura a princípio, mas é conveniente para manter os valores após `.unwrap()`.
uk: Затінення спочатку виглядає незрозумілим, але є зручним для збереження значень після `.unwrap()`.

source: Declaration parameters are followed by a type (the reverse of some programming languages), then a return type.
es: Los parámetros de declaración van seguidos de un tipo (al contrario que en algunos lenguajes de programación) y, a continuación, de un tipo de resultado devuelto.
fa: بعد اعلان تابع پارامترهای ورودی و نوع آن و سپس یک نوع برگشتی هستند (برخلاف برخی از زبان‌های برنامه‌نویسی).
ja: 宣言パラメータの後には型（一部のプログラミング言語と逆）、戻り値の型が続きます。
ko: 매개변수를 선언할 때에는 이름을 먼저 쓰고, 타입을 나중에 씁니다. 이름과 타입은 `:` 로 구분합니다. 이는 일부 언어(예를 들어 C)와 반대임에 유의하시기 바랍니다. 마찬가지로, 리턴 타입도 함수의 시작이 아닌 가장 뒷부분에 선언합니다.
pt_br: Os parâmetros de declaração são seguidos por um tipo (o inverso de algumas linguagens de programação) e, em seguida, um tipo de retorno.
uk: Параметри оголошення супроводжуються типом (у зворотному порядку порівняно з деякими мовами програмування), а потім типом повернення.

source: The last expression in a function body (or any block) becomes the return value. Simply omit the `;` at the end of the expression. The `return` keyword can be used for early return, but the "bare value" form is idiomatic at the end of a function (refactor `gcd` to use a `return`).
fa: آخرین عبارت در بدنه تابع (یا هر بلوک دیگری) به عنوان مقدار برگشتی در نظر گرفته می‌شود. به همین سادگی <span dir=ltr>`;`</span> را میتوان در انتهای عبارت حذف کنید.
ja: 関数本体（または任意のブロック）内の最後の式が戻り値になります。式の末尾の `;` を省略します。`return` キーワードは早期リターンに使用できますが、関数の最後は「裸の値」の形式にするのが慣用的です（`return` を使用するには `gcd` をリファクタリングします）。
pt_br: A última expressão em um corpo de uma função (ou qualquer bloco) torna-se o valor de retorno. Simplesmente omita o `;` no final da expressão. A palavra-chave `return` pode ser usada para retorno antecipado, mas a forma "valor nu" é idiomática no final de uma função (refatore `gcd` para usar um `return`).
uk: Останній вираз у тілі функції (або будь-якого блоку) стає значенням, що повертається. Просто опустіть `;` в кінці виразу. Ключове слово `return` можна використовувати для дострокового повернення, але форма "голого значення" є ідіоматичною у кінці функції (рефактор `gcd` щоб використовувати `return`).

source: Some functions have no return value, and return the 'unit type', `()`. The compiler will infer this if the return type is omitted.
uk: Деякі функції не мають значення, що повертається, і повертають 'тип агрегату', `()`. Компілятор визначить це, якщо тип повернення пропущено.

source: Overloading is not supported -- each function has a single implementation.
fa: بارگذاری مجدد (overloading) پشتیبانی نمی‌شود -- هر تابع فقط یک پیاده‌سازی دارد.
ja: オーバーロードはサポートされていません。各関数の実装は 1 つです。
pt_br: Sobrecarga não é suportada - cada função tem uma única implementação.
uk: Перевантаження не підтримується - кожна функція має єдину реалізацію.

source: Always takes a fixed number of parameters. Default arguments are not supported. Macros can be used to support variadic functions.
fa: همیشه تعداد ثابتی از پارامترها را می گیرد. آرگومان های پیش فرض پشتیبانی نمی شوند. ماکروها را می توان برای پشتیبانی از توابع متغیر استفاده کرد.
ja: 常に固定数のパラメータを受け取ります。デフォルトの引数はサポートされていません。マクロを使用して可変関数をサポートできます。
pt_br: Sempre usa um número fixo de parâmetros. Argumentos padrão não são suportados. Macros podem ser usadas para suportar funções variádicas.
uk: Завжди приймає фіксовану кількість параметрів. Аргументи за замовчуванням не підтримуються. Для підтримки варіаційних функцій можна використовувати макроси.

source: Always takes a single set of parameter types. These types can be generic, which will be covered later.
fa: همیشه یک مجموعه واحد از انواع آرگومان‌ها را می‌گیرد.
ja: 常に 1 つのパラメータ型セットを受け取ります。これらの型は汎用にすることもできますが、これについては後で説明します。
pt_br: Sempre usa um único conjunto de tipos de parâmetros. Estes tipos podem ser genéricos, o que será abordado mais tarde.
uk: Завжди приймає єдиний набір типів параметрів. Ці типи можуть бути загальними, що буде розглянуто пізніше.

source: Macros are expanded into Rust code during compilation, and can take a variable number of arguments. They are distinguished by a `!` at the end. The Rust standard library includes an assortment of useful macros.
fa: ماکروها در طول کامپایل به کد Rust گسترش می‌یابند و می‌توانند تعداد متغیری از آرگومان‌ها را بگیرند. آنها در پایان با یک «!» متمایز می شوند. کتابخانه استاندارد Rust شامل مجموعه ای از ماکروهای مفید است.
ja: マクロはコンパイル時に Rust コードに展開され、可変長引数を取ることができます。これらは末尾の `!` で区別されます。Rust 標準ライブラリには、各種の便利なマクロが含まれています。
pt_br: Macros são expandidas em código Rust durante a compilação e podem receber um número variável de argumentos. Elas são distinguidas por um `!` no final. A biblioteca padrão do Rust inclui uma variedade de macros úteis.
uk: Макроси розгортаються у код Rust під час компіляції і можуть приймати змінну кількість аргументів. Вони відрізняються символом `!` у кінці. До стандартної бібліотеки Rust входить набір корисних макросів.

source: `println!(format, ..)` prints a line to standard output, applying formatting described in [`std::fmt`](https://doc.rust-lang.org/std/fmt/index.html).
fa: `println!(format, ..)` یک خط را در خروجی استاندارد چاپ می کند و قالب بندی شرح داده شده در [`std::fmt`] (https://doc.rust-lang.org/std/fmt/index.html) را اعمال می کند. .
ja: `println!(format, ..)`: [`std::fmt`](https://doc.rust-lang.org/std/fmt/index.html) で説明されている書式を適用して、1 行を標準出力に出力します。
pt_br: `println!(format, ..)` imprime uma linha na saída padrão, aplicando a formatação descrita em [`std::fmt`](https://doc.rust-lang.org/std/fmt/index.html).
uk: `println!(format, ..)` виводить рядок у стандартний вивід, застосовуючи форматування, описане у [`std::fmt`](https://doc.rust-lang.org/std/fmt/index.html).

source: `format!(format, ..)` works just like `println!` but returns the result as a string.
fa: `format!(format, ..)` درست مانند `println!` کار می کند، اما نتیجه را به صورت یک رشته برمی گرداند.
ja: `format!(format, ..)`: `println!` と同様に機能しますが、結果を文字列として返します。
pt_br: `format!(format, ..)` funciona exatamente como `println!`, mas retorna o resultado como uma string.
uk: `format!(format, ..)` працює так само, як `println!`, але повертає результат у вигляді рядка.

source: `dbg!(expression)` logs the value of the expression and returns it.
fa: `dbg!(expression)` مقدار عبارت را ثبت کرده و آن را برمی گرداند.
ja: `dbg!(expression)`: 式の値をログに記録して返します。
pt_br: dbg!(expressão) registra o valor da expressão e o retorna.
uk: `dbg!(вираз)` записує значення виразу і повертає його.

source: `todo!()` marks a bit of code as not-yet-implemented. If executed, it will panic.
fa: `todo!()` مقداری از کد را به عنوان هنوز پیاده‌سازی نشده علامت‌گذاری می‌کند. panic می کند.
ja: `todo!()`: 一部のコードに未実装のマークを付けます。実行するとパニックが発生します。
pt_br: `todo!()` marca um trecho de código como não implementado. Se executado, gerará um pânico.
uk: `todo!()` позначає частину коду як таку, що ще не виконана. Якщо цей код буде виконано, він викличе паніку.

source: `unreachable!()` marks a bit of code as unreachable. If executed, it will panic.
fa: `unreachable!()` مقداری از کد را غیرقابل دسترسی علامت گذاری می کند. اگر اعدام شود وحشت می کند.
ja: `unreachable!()`: コードの一部をアクセス不能としてマークします。実行するとパニックが発生します。
pt_br: `unreachable!()` marca um trecho de código como inalcançável. Se executado, gerará um pânico.
uk: `unreachable!()` позначає ділянку коду як недосяжну. Якщо цей код буде виконано, він викличе паніку.

source: The takeaway from this section is that these common conveniences exist, and how to use them. Why they are defined as macros, and what they expand to, is not especially critical.
fa: نکته مهم این بخش این است که این امکانات مشترک و نحوه استفاده از آنها وجود دارد. اینکه چرا آنها به عنوان ماکرو تعریف می شوند و به چه چیزی گسترش می یابند، بسیار مهم نیست.
ja: このセクションの要点は、マクロの一般的な利便性と、その使用方法を示すことにあります。マクロとして定義されている理由と、展開先は特に重要ではありません。
pt_br: A lição desta seção é que essas conveniências comuns existem e como usá-las. Por que elas são definidas como macros e no que elas se expandem não é especialmente crítico.
uk: Висновок з цього розділу полягає в тому, що ці загальні зручності існують, і те, як ними користуватися. Чому вони визначені як макроси і на що вони поширюються, не є особливо важливим.

source: The course does not cover defining macros, but a later section will describe use of derive macros.
fa: این دوره شامل تعریف ماکروها نمی شود، اما در بخش بعدی استفاده از ماکروهای مشتق شده توضیح داده خواهد شد.
ja: マクロの定義についてはコースでは説明しませんが、後のセクションで導出マクロの使用について説明します。
pt_br: O curso não cobre a definição de macros, mas uma seção posterior descreverá o uso de macros _derive_ (derivadas).
uk: У цьому курсі не розглядається визначення макросів, але в наступному розділі буде описано використання похідних макросів.

source: The [Collatz Sequence](https://en.wikipedia.org/wiki/Collatz_conjecture) is defined as follows, for an arbitrary n<sub>1</sub> greater than zero:
uk: [Послідовність Коллатца](https://en.wikipedia.org/wiki/Collatz_conjecture) визначається наступним чином, для довільного n<sub>1</sub> більшого за нуль:

source: If _n<sub>i</sub>_ is 1, then the sequence terminates at _n<sub>i</sub>_.
fa: اگر _n<sub>i</sub>_ = ۱ باشد، دنباله (sequence) در _n<sub>i</sub>_ پایان می‌یابد.
uk: Якщо _n<sub>i</sub>_ є 1, то послідовність завершується при _n<sub>i</sub>_.

source: If _n<sub>i</sub>_ is even, then _n<sub>i+1</sub> = n<sub>i</sub> / 2_.
fa: اگر _n<sub>i</sub>_ زوج باشد، آنگاه _n<sub>i+۱</sub>_ = _n<sub>i</sub>_/۲.
uk: Якщо _n<sub>i</sub>_ є парним, то _n<sub>i+1</sub> = n<sub>i</sub> / 2_.

source: If _n<sub>i</sub>_ is odd, then _n<sub>i+1</sub> = 3 * n<sub>i</sub> + 1_.
fa: اگر _n<sub>i</sub>_ فرد باشد، آنگاه _n<sub>i+۱</sub>_ = ۳ * _n<sub>i</sub>_ + ۱.
uk: Якщо _n<sub>i</sub>_ є непарним, то _n<sub>i+1</sub> = 3 * n<sub>i</sub> + 1_.
