Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: In other words, if an item is visible in module `foo`, it's visible in all the descendants of `foo`.
es: Es decir, si un elemento está visible en el módulo `foo`, se verá en todos los elementos descendientes de `foo`.
fa: به عبارت دیگر، اگر یک مورد در ماژول `foo` قابل مشاهده باشد، در همه فرزندان`foo` قابل مشاهده است.
ja: 言い換えれば、あるアイテムがモジュール `foo` から見える場合、そのアイテムは `foo` のすべての子孫から見えます。
ko: 즉, 모듈 `foo`에서 접근 가능한 항목이라면 `foo` 아래의 모든 모듈에서 접근가능합니다.
pt_br: Em outras palavras, se um item é visível no módulo `foo`, ele é visível em todos os descendentes de `foo`.
uk: Іншими словами, якщо елемент видимий у модулі `foo`, він видимий у всіх нащадках `foo`.

source: Use the `pub` keyword to make modules public.
es: Haz que los módulos sean públicos con la palabra clave `pub`.
fa: از کلمه کلیدی `pub` برای public کردن ماژول‌ها استفاده کنید.
ja: モジュールを公開するには `pub` キーワードを使用します。
ko: `pub` 키워드는 모듈에도 사용할 수 있습니다.
pt_br: Use a palavra reservada `pub` para tornar módulos públicos.
uk: Використовуйте ключове слово `pub`, щоб зробити модулі загальнодоступними.

source: Additionally, there are advanced `pub(...)` specifiers to restrict the scope of public visibility.
es: Además, hay especificadores `pub(...)` avanzados para restringir el ámbito de la visibilidad pública.
fa: علاوه بر این، مشخص‌کننده‌های پیشرفته `pub(...)` برای محدود کردن دامنه دید عمومی وجود دارد.
ja: また、高度な `pub(...)` 指定子を使用して、公開範囲を制限することもできます。
ko: 또한, 고급 기능으로 `pub(...)` 지정자를 사용하여 공개 범위를 제한할 수 있습니다.
pt_br: Adicionamente, existem especificadores `pub(...)` avançados para restringir o escopo de visibilidade pública.
uk: Крім того, існують розширені специфікатори `pub(...)` для обмеження обсягу публічної видимості.

source: See the [Rust Reference](https://doc.rust-lang.org/reference/visibility-and-privacy.html#pubin-path-pubcrate-pubsuper-and-pubself).
es: Consulta el libro [Rust Reference](https://doc.rust-lang.org/reference/visibility-and-privacy.html#pubin-path-pubcrate-pubsuper-and-pubself).
fa: این آدرس با ببینید [Rust Reference](https://doc.rust-lang.org/reference/visibility-and-privacy.html#pubin-path-pubcrate-pubsuper-and-pubself).
ja: [Rust リファレンス](https://doc.rust-lang.org/reference/visibility-and-privacy.html#pubin-path-pubcrate-pubsuper-and-pubself) をご覧ください。
ko: [공식 문서](https://doc.rust-lang.org/reference/visibility-and-privacy.html#pubin-path-pubcrate-pubsuper-and-pubself)를 참고하세요.
pt_br: Veja a [Referência Rust](https://doc.rust-lang.org/reference/visibility-and-privacy.html#pubin-path-pubcrate-pubsuper-and-pubself).
uk: Перегляньте [довідник Rust](https://doc.rust-lang.org/reference/visibility-and-privacy.html#pubin-path-pubcrate-pubsuper-and-pubself).

source: Configuring `pub(crate)` visibility is a common pattern.
es: Configurar la visibilidad de `pub(crate)` es un patrón común.
fa: پیکربندی قابل نمایش بودن `pub(crate)` یک الگوی رایج است.
ja: `pub(crate)` の可視性を設定するのは一般的なパターンです。
ko: `pub(crate)`로 가시성을 지정하는 것이 자주 쓰입니다.
pt_br: A configuração de visibilidade `pub(crate)` é um padrão comum.
uk: Налаштування видимості `pub(crate)` є типовим шаблоном.

source: Less commonly, you can give visibility to a specific path.
es: Aunque es menos frecuente, se puede dar visibilidad a una ruta específica.
fa: این مورد کمتر متداول است، شما می‌توانید به یک مسیر خاص دید بدهید.
ja: それほど一般的ではありませんが、特定のパスに対して可視性を指定することが出来ます。
ko: 자주 쓰이진 않지만 특정 경로에 대해서만 가시성을 부여할 수 있습니다.
pt_br: Menos comum, você pode dar visibilidade para um caminho específico.
uk: Рідше ви можете надати видимість певному шляху.

source: In any case, visibility must be granted to an ancestor module (and all of its descendants).
es: En cualquier caso, se debe dar visibilidad a un módulo antecedente (y a todos sus descendientes).
fa: در هر صورت، قابلیت دیدن باید به یک ماژول والد (و همه فرزندان آن) داده شود.
ja: どのような場合も、祖先モジュール（およびそのすべての子孫）に可視性を与える必要があります。
ko: 어떤 경우이든 가시성이 부여되면 해당 모듈을 포함하여 하위의 모든 모듈이 적용받습니다.
pt_br: Em todo caso, a visibilidade deve ser concedida a um módulo ancestral (e a todos os seus descendentes).
uk: У будь-якому випадку видимість повинна бути надана модулю-предпопереднику (і всім його нащадкам).

source: A module can bring symbols from another module into scope with `use`. You will typically see something like this at the top of each module:
es: Un módulo puede incluir símbolos de otro módulo en el ámbito con `use`. Normalmente, se ve algo como esto en la parte superior de cada módulo:
fa: یک ماژول می‌تواند نمادها را از ماژول دیگری با `use` وارد محدوده کند. شما معمولاً چیزی شبیه به این را در بالای هر ماژول خواهید دید:
ja: モジュールは、`use` を使用して別のモジュールのシンボルをスコープに取り込むことができます。次のような記述はモジュールの先頭においてよく見られます。
ko: 모듈은 `use`를 사용하여 다른 모듈의 심볼을 내 스코프로 가져올 수 있습니다. 일반적으로 각 모듈의 상단에 다음과 같은 내용이 옵니다:
pt_br: Um módulo pode trazer símbolos de outro módulo para o escopo com `use`. Normalmente, você verá algo assim na parte superior de cada módulo:
uk: Модуль може залучати символи з іншого модуля до області видимості за допомогою `use`. Зазвичай ви бачите щось подібне у верхній частині кожного модуля:

source: Paths
es: Rutas
fa: مسیر
ja: パス
ko: 경로
pt_br: Caminhos (_Paths_)
uk: Шляхи

source: Paths are resolved as follows:
es: Las rutas se resuelven de la siguiente manera:
fa: مسیرها (Paths) به شرح زیر حل می‌شوند:
ja: パスは次のように解決されます。
ko: 경로는 아래와 같이 구분합니다:
pt_br: Caminhos são resolvidos da seguinte forma:
uk: Шляхи вирішуються таким чином:

source: As a relative path:
es: Como ruta relativa:
fa: به عنوان یک path نسبی:
ja: 相対パスの場合:
ko: 상대 경로:
pt_br: Como um caminho relativo:
uk: Як відносний шлях:

source: `foo` or `self::foo` refers to `foo` in the current module,
es: `foo` o `self::foo` hacen referencia a `foo` en el módulo.
fa: در واقع `foo` یا `self::foo` به `foo` در ماژول فعلی اشاره دارد،
ja: `foo` または `self::foo` は、現在のモジュール内の `foo` を参照します。
ko: `foo` 또는 `self::foo`는 현재 모듈 내부의 `foo`를 가리킵니다,
pt_br: `foo` ou `self::foo` referem-se à `foo` no módulo atual,
uk: `foo` або `self::foo` посилається на `foo` в поточному модулі,

source: `super::foo` refers to `foo` in the parent module.
es: `super::foo` hace referencia a `foo` en el módulo superior.
ja: `super::foo` は、親モジュール内の `foo` を参照します。
ko: `super::foo`는 부모 모듈의 `foo`를 가리킵니다.
pt_br: `super::foo` refere-se à `foo` no módulo pai.
uk: `super::foo` посилається на `foo` у батьківському модулі.

source: As an absolute path:
es: Como ruta absoluta:
fa: به عنوان یک path مطلق:
ja: 絶対パスの場合:
ko: 절대 경로:
pt_br: Como um caminho absoluto:
uk: Як абсолютний шлях:

source: `crate::foo` refers to `foo` in the root of the current crate,
es: `crate::foo` hace referencia a `foo` en la raíz del crate.
fa: `crate::foo` به `foo` در ریشه جعبه فعلی اشاره دارد,
ja: `crate::foo` は、現在のクレートのルート内の `foo` を参照します。
ko: `crate::foo`는 현재 크레이트 루트의 `foo`를 가리킵니다,
pt_br: `crate::foo` refere-se à `foo` na raiz do _crate_ atual,
uk: `crate::foo` посилається на `foo` в корені поточного крейту,

source: `bar::foo` refers to `foo` in the `bar` crate.
es: `bar::foo` hace referencia a `foo` en el crate `bar`.
fa: یک `bar::foo` به `foo` در `bar` crate اشاره دارد.
ja: `bar::foo` は、`bar` クレート内の `foo` を参照します。
ko: `bar::foo`는 `bar`크레이트의 `foo`를 가리킵니다.
pt_br: `bar::foo` refere-se a `foo` no _crate_ `bar`.
uk: `bar::foo` посилається на `foo` в крейті `bar`.

source: It is common to "re-export" symbols at a shorter path. For example, the top-level `lib.rs` in a crate might have
fa: این"re-export" نمادها در مسیر کوتاه‌تری معمول است. برای مثال، `lib.rs` سطح بالا در یک crate ممکن است داشته باشد
ja: シンボルは、より短いパスで「再エクスポート」するのが一般的です。たとえば、クレート内の最上位の `lib.rs` に、以下のように記述します。
pt_br: É comum "re-exportar" símbolos em um caminho mais curto. Por exemplo, o nível superior `lib.rs` em um _crate_ pode ter
uk: Зазвичай символи "реекспортуються" коротшим шляхом. Наприклад, файл `lib.rs` верхнього рівня у крейті може мати

source: making `DiskStorage` and `NetworkStorage` available to other crates with a convenient, short path.
fa: در دسترس قرار دادن `DiskStorage` و `NetworkStorage` برای سایر crateها با یک مسیر راحت و کوتاه.
ja: これにより、短く使いやすいパスを使用して、`DiskStorage` と `NetworkStorage` を他のクレートで使用できるようになります。
pt_br: tornando `DiskStorage` e `NetworkStorage` disponíveis para outros _crates_ com um caminho conveniente e curto.
uk: зробити `DiskStorage` і `NetworkStorage` доступними для інших крейтів зручним і коротким шляхом.

source: For the most part, only items that appear in a module need to be `use`'d. However, a trait must be in scope to call any methods on that trait, even if a type implementing that trait is already in scope. For example, to use the `read_to_string` method on a type implementing the `Read` trait, you need to `use std::io::Read`.
fa: در بیشتر موارد، فقط مواردی که در یک ماژول ظاهر می‌شوند باید `use` شوند. با‌ این‌حال، یک ویژگی (trait) باید در محدوده باشد تا بتوان هر method ای را روی آن ویژگی فراخوانی کرد، حتی اگر نوعی که آن ویژگی را اجرا می کند قبلاً در محدوده باشد. به عنوان مثال، برای استفاده از متد `read_to_string` در نوعی که ویژگی `Read` را اجرا می‌کند، باید از `use std::io::Read` استفاده کنید.
ja: ほとんどの場合、`use` を指定する必要があるのはモジュール内で実際に直接使用されるアイテムのみです。ただし、あるトレイトを実装する型がすでにスコープに含まれている場合でも、そのトレイトのメソッドを呼び出すには、そのトレイトがスコープに含まれている必要があります。たとえば、`Read` トレイトを実装する型で `read_to_string` メソッドを使用するには、`use std::io::Read` という記述が必要になります。
pt_br: Na maior parte, apenas itens que aparecem em um módulo precisam ser `use`. No entanto, um _trait_ deve estar no escopo para chamar quaisquer métodos nesse _trait_, mesmo que um tipo que implemente esse _trait_ já esteja no escopo. Por exemplo, para usar o método `read_to_string` em um tipo que implementa o _trait_ `Read`, você precisa `use std::io::Read`.
uk: Здебільшого використовувати `use` потрібно лише з тими елементами, які з'являються в модулі. Однак, щоб викликати будь-які методи, трейт повинен бути в області видимості, навіть якщо тип, що реалізує цей трейт, вже знаходиться в області видимості. Наприклад, для використання методу `read_to_string` на типі, що реалізує трейт`Read`, вам потрібно `use std::io::Read`.

source: The `use` statement can have a wildcard: `use std::io::*`. This is discouraged because it is not clear which items are imported, and those might change over time.
fa: عبارت `use` می‌تواند دارای علامت عام باشد: `use std::io::*`. از این کار منع شده است زیرا مشخص نیست کدام موارد import می‌شوند و ممکن است در طول زمان تغییر کنند.
ja: `use` ステートメントには `use std::io::*` というようにワイルドカードを含めることができます。この方法は、どのアイテムがインポートされるのかが明確ではなく、時間の経過とともに変化する可能性があるため、おすすめしません。
pt_br: A instrução `use` pode ter um curinga: `use std::io::*`. Isso é desencorajado porque não está claro quais itens são importados, e eles podem mudar ao longo do tempo.
uk: Оператор `use` може мати символ підстановки: `use std::io::*`. Це не рекомендується, оскільки незрозуміло, які саме елементи імпортуються, а вони можуть змінюватися з часом.

source: In this exercise, you will reorganize a small GUI Library implementation. This library defines a `Widget` trait and a few implementations of that trait, as well as a `main` function.
fa: در این تمرین، یک پیاده‌سازی کتابخانه GUI کوچک را دوباره سازماندهی خواهید کرد. این کتابخانه یک ویژگی`Widget` و چند پیاده‌سازی از آن ویژگی و همچنین یک تابع `main` را تعریف می‌کند.
ja: この演習では、小規模な GUI ライブラリ実装を再編成します。このライブラリでは、`Widget` トレイト、そのトレイトのいくつかの実装、`main` 関数を定義しています。
uk: У цій вправі ви реорганізуєте невелику реалізацію бібліотеки графічного інтерфейсу. У цій бібліотеці визначено трейт `Widget` та декілька реалізацій цього трейту, а також функцію `main`.

source: It is typical to put each type or set of closely-related types into its own module, so each widget type should get its own module.
fa: معمول است که هر نوع یا مجموعه‌ای از انواع مرتبط نزدیک را در ماژول خود قرار دهید، بنابراین هر نوع ویجت باید ماژول خاص خود را داشته باشد.
ja: 通常は、各型または密接に関連する型のセットを個別のモジュールに配置するので、ウィジェット タイプごとに独自のモジュールを用意する必要があります。
uk: Зазвичай кожен тип або групу тісно пов'язаних між собою типів розміщують у власному модулі, тому кожен тип віджету має отримати свій власний модуль.

source: Cargo Setup
pt_br: Configuração do Cargo
uk: Установка Cargo

source: The Rust playground only supports one file, so you will need to make a Cargo project on your local filesystem:
fa: یک Rust playground فقط از یک فایل پشتیبانی می‌کند، بنابراین باید یک پروژه Cargo را در سیستم فایل محلی خود ایجاد کنید:
ja: Rust プレイグラウンドは 1 つのファイルしかサポートしていないため、ローカル ファイル システムで Cargo プロジェクトを作成する必要があります。
pt_br: O _playground_ do Rust suporta apenas um arquivo, então você precisará criar um projeto Cargo em seu sistema de arquivos local:
uk: Ігрове середовище Rust підтримує лише один файл, тому вам потрібно створити проект Cargo у вашій локальній файловій системі:

source: Edit the resulting `src/main.rs` to add `mod` statements, and add additional files in the `src` directory.
fa: این `src/main.rs` حاصل را ویرایش کنید تا عبارات `mod` را اضافه کنید و فایل‌های اضافی را در دایرکتوری `src` اضافه کنید.
ja: 生成された `src/main.rs` を編集して `mod` ステートメントを追加し、`src` ディレクトリにファイルを追加します。
uk: Відредагуйте отриманий файл `src/main.rs`, додавши оператори `mod`, та додайте додаткові файли до каталогу `src`.

source: Source
fa: منبع
ja: ソース
uk: Джерело

source: Here's the single-module implementation of the GUI library:
fa: در اینجا اجرای تک ماژول کتابخانه GUI آمده است:
ja: GUI ライブラリの単一モジュール実装は次のとおりです。
uk: Ось одномодульна реалізація бібліотеки графічного інтерфейсу:

source: /// Natural width of `self`.
ja: /// `self` の自然な幅。
pt_br: /// Largura natural de `self`.
uk: /// Натуральна ширина `self`.

source: /// Draw the widget into a buffer.
ja: /// ウィジェットをバッファに描画します。
pt_br: /// Desenha o _widget_ em um buffer.
uk: /// Малює віджету у буфер.

source: /// Draw the widget on standard output.
ja: /// ウィジェットを標準出力に描画します。
pt_br: /// Desenha o _widget_ na saída padrão.
uk: /// Малює віджет на стандартному виводі.

source: // Add 4 paddings for borders
ja: // 枠線用に 4 つのパディングを追加します。
pt_br: // Adiciona 4 preenchimentos para as bordas
uk: // Додати 4 відступи для країв

source: // TODO: Change draw_into to return Result<(), std::fmt::Error>. Then use the // ?-operator here instead of .unwrap().
ja: // TODO: Result<(), std::fmt::Error> を返すように draw_into を変更します。次に、.unwrap() の代わりに // ? 演算子を使用します。
uk: // TODO: Змініть draw_into на return Result<(), std::fmt::Error>. Тоді використовуйте // ?-оператор тут замість .unwrap().

source: // add a bit of padding
ja: // パディングを少し追加します。
pt_br: // adicione um pouco de preenchimento
uk: // додати трохи відступів

source: "This is a small text GUI demo."
fa: "این یک نسخه نمایشی GUI برای متنی کوچک است."
pt_br: "Este é um pequeno demo de GUI em texto."
uk: "Це невелика текстова демонстрація графічного інтерфейсу."

source: "Click me!"
pt_br: "Clique em mim!"
uk: "Клацни на мене!"

source: Encourage students to divide the code in a way that feels natural for them, and get accustomed to the required `mod`, `use`, and `pub` declarations. Afterward, discuss what organizations are most idiomatic.
fa: دانش‌آموزان را تشویق کنید تا کد را به‌گونه‌ای تقسیم کنند که برایشان طبیعی است و به اعلان‌های `mod`, `use` و `pub`عادت کنند. پس از آن، در مورد اینکه چه organizationهایی idiomatic هستند بحث کنید.
ja: 自分にとって自然な方法でコードを分割し、必要な `mod`、`use`、`pub` 宣言に慣れるよう受講者に促します。その後、どの構成が最も慣用的であるかについて話し合います。
pt_br: Incentive os alunos a dividir o código de uma maneira que pareça natural para eles, e se acostumem com as declarações `mod`, `use` e `pub` necessárias. Depois, discuta quais organizações são mais idiomáticas.
uk: Заохочуйте студентів розділити код так, як вони вважають за потрібне, і звикнути до необхідних декларацій `mod`, `use` і `pub`. Після цього обговоріть, які організації є найбільш ідіоматичними.

source: // TODO: after learning about error handling, you can change // draw_into to return Result<(), std::fmt::Error>. Then use // the ?-operator here instead of .unwrap().
ja: // TODO: エラー処理について学習した後で、 // Result<(), std::fmt::Error> を返すように draw_into を変更できます。次に、ここで // .unwrap() の代わりに ? 演算子を使用します。
pt_br: // TODO: depois de aprender sobre tratamento de erros, você pode alterar // draw_into para retornar Result<(), std::fmt::Error>. Então use // o operador ? aqui em vez de .unwrap().
uk: // TODO: після вивчення обробки помилок можна змінити // draw_into щоб повертати Result<(), std::fmt::Error>. Тоді // використовуйте тут оператор ? замість .unwrap().

source: Unit Tests
es: Pruebas Unitarias
fa: تست‌های واحد (Unit Tests)
ja: ユニットテスト
ko: 단위 테스트
pt_br: Testes Unitários
uk: Модульні тести

source: Rust and Cargo come with a simple unit test framework:
es: Rust y Cargo incluyen un sencillo framework para pruebas unitarias:
fa: Rust and Cargo با یک چارچوب تست واحد ساده ارائه می شود:
ja: Rust と Cargo には、シンプルな単体テスト フレームワークが付属しています。
ko: 러스트와 카고(cargo)는 간단한 단위 테스트 프레임워크와 함께 제공됩니다:
pt_br: Rust e Cargo vêm com uma estrutura de testes unitários simples:
uk: Rust і Cargo постачаються з простим фреймворком для модульного тестування:

source: Unit tests are supported throughout your code.
es: Las pruebas unitarias se admiten en todo el código.
ja: 単体テストはコードのあらゆる場所に記述可能です。
ko: 단위 테스트는 코드 전반에서 지원됩니다.
pt_br: Testes unitários são suportados em todo o seu código.
uk: Модульні тести підтримуються у всьому коді.

source: Integration tests are supported via the `tests/` directory.
es: Las pruebas de integración se admiten a través del directorio `tests/`.
fa: تست‌های یکپارچه‌سازی از طریق دایرکتوری `tests/` پشتیبانی می‌شوند.
ja: 統合テストは`tests/`ディレクトリ内に記述します。
ko: 통합 테스트는 `tests/` 디렉터리를 통해 지원됩니다.
pt_br: Testes de integração são suportados através do diretório `tests/`.
uk: Тести інтеграції підтримуються через каталог `tests/`.

source: Tests are marked with `#[test]`. Unit tests are often put in a nested `tests` module, using `#[cfg(test)]` to conditionally compile them only when building tests.
fa: تست‌ها با `#[test]`علامت‌گذاری شده‌اند. تست‌های واحد اغلب در یک ماژول `tests` تودرتو قرار می‌گیرند و از `#[cfg(test)]` استفاده می‌کنند تا آنها را به صورت مشروط تنها در هنگام build تست‌ها کامپایل کنند.
ja: テストには `#[test]` のマークが付きます。多くの場合、単体テストは通常ネストされた`tests`モジュールに配置され、`#[cfg(test)]`によりテストのビルド時にのみコンパイルされるようになります。
pt_br: Testes são marcados com `#[test]`. Testes unitários são frequentemente colocados em um módulo aninhado `tests`, usando `#[cfg(test)]` para compilá-los condicionalmente apenas ao construir testes.
uk: Тести позначаються `#[test]`. Модульні тести часто розміщують у вкладеному модулі `tests`, використовуючи `#[cfg(test)]` для їх умовної компіляції лише під час збирання тестів.

source: "Hello World"
fa: "سلام دنیا!"
uk: "Привіт, світ!"

source: This lets you unit test private helpers.
es: Esto permite realizar pruebas unitarias de los ayudantes privados.
fa: این به شما امکان می‌دهد تا private helper را آزمایش کنید.
ja: これにより、プライベート ヘルパーの単体テストを行えます。
ko: 이렇게 서브 모듈로 테스트를 만들면 private한 헬퍼 함수에 대한 단위 테스트도 가능합니다.
pt_br: Isso permite que você tenha testes unitários auxiliares privados.
uk: Це дозволяє тестувати приватних помічників.

source: The `#[cfg(test)]` attribute is only active when you run `cargo test`.
es: El atributo `#[cfg(test)]` solo está activo cuando se ejecuta `cargo test`.
fa: ویژگی `#[cfg(test)]` تنها زمانی فعال است که `cargo test` را اجرا کنید.
ja: `#[cfg(test)]` 属性が付与されたコードは `cargo test` の実行時にのみ有効になります。
ko: `#[cfg(test)]` 어트리뷰트가 추가된 항목은 `cargo test`를 수행했을 경우에만 동작합니다.
pt_br: O atributo `#[cfg(test)]` somente fica ativo quando você executa `cargo test`.
uk: Атрибут `#[cfg(test)]` активний лише тоді, коли ви запускаєте `cargo test`.

source: Run the tests in the playground in order to show their results.
fa: تست‌ها را در playground اجرا کنید تا نتیجه‌های آن‌ها را نشان‌دهید.
ja: 結果を表示するには、プレイグラウンドでテストを実行します。
pt_br: Execute os testes no _playground_ para mostrar seus resultados.
uk: Запустіть тести на майданчику, щоб показати їхні результати.

source: Integration Tests
es: Pruebas de Integración
ja: インテグレーションテスト
ko: 통합 테스트
pt_br: Testes de Integração
uk: Інтеграційні тести

source: If you want to test your library as a client, use an integration test.
es: Si quieres probar tu biblioteca como cliente, haz una prueba de integración.
fa: اگر می‌خواهید کتابخانه خود را به عنوان یک سرویس‌گیرنده آزمایش کنید، از تست یکپارچه‌سازی (integration test) استفاده کنید.
ja: ライブラリをクライアントとしてテストする場合は、統合テストを使用します。
ko: 라이브러리를 사용자 입장에서 테스트 하려면, 통합 테스트를 해야 합니다.
pt_br: Se quiser testar sua biblioteca como um cliente, use um teste de integração.
uk: Якщо ви хочете перевірити свою бібліотеку як клієнт, скористайтеся інтеграційним тестом.

source: Create a `.rs` file under `tests/`:
es: Crea un archivo `.rs` en `tests/`:
fa: یک فایل `.rs` در زیر `tests/` بسازید:
ja: `tests/` の下に `.rs` ファイルを作成します。
ko: `test/`디렉터리 아래에 `.rs`파일을 하나 만드세요:
pt_br: Crie um arquivo `.rs` em `tests/`:
uk: Створіть файл `.rs` у `tests/`:

source: These tests only have access to the public API of your crate.
es: Estas pruebas solo tienen acceso a la API pública de tu crate.
fa: این آزمایش‌ها فقط به public API مربوط به crate شما دسترسی دارند.
ja: これらのテストでは、クレートの公開 API にのみアクセスできます。
ko: 이 테스트는 크레이트의 공개 API에만 접근할 수 있습니다.
pt_br: Esses testes têm acesso somente à API pública do seu crate.
uk: Ці тести мають доступ лише до публічного API вашого ящика.

source: Documentation Tests
es: Pruebas de Documentación
fa: تست‌ سندها
ja: ドキュメンテーションテスト
ko: 문서화주석 테스트
pt_br: Testes de Documentação
uk: Тести документації

source: Rust has built-in support for documentation tests:
es: Rust cuenta con asistencia integrada para pruebas de documentación:
fa: زبان Rust دارای پشتیبانی داخلی برای تست‌های مستندسازی است:
ja: Rust には、ドキュメントのテストに関する機能が組み込まれています。
ko: 러스트는 문서화주석에 대한 테스트를 내장하여 제공합니다:
pt_br: Rust tem suporte embutido para testes de documentação:
uk: Rust має вбудовану підтримку для тестування документації:

source: /// Shortens a string to the given length. /// /// ``` /// # use playground::shorten_string; /// assert_eq!(shorten_string("Hello World", 5), "Hello"); /// assert_eq!(shorten_string("Hello World", 20), "Hello World"); /// ```
ja: /// 指定した長さに文字列を短縮します。 /// /// ``` /// # use playground::shorten_string; /// assert_eq!(shorten_string("Hello World", 5), "Hello"); /// assert_eq!(shorten_string("Hello World", 20), "Hello World"); /// ```
pt_br: /// Reduz uma string para o comprimento fornecido. /// /// ``` /// # use playground::shorten_string; /// assert_eq!(shorten_string("Hello World", 5), "Hello"); /// assert_eq!(shorten_string("Hello World", 20), "Hello World"); /// ```
uk: /// Скорочує рядок до заданої довжини. /// /// ``` /// # use playground::shorten_string; /// assert_eq!(shorten_string("Привіт, світ", 5), "Привіт"); /// assert_eq!(shorten_string("Привіт, світ", 20), "Привіт, світ"); /// ```

source: Code blocks in `///` comments are automatically seen as Rust code.
es: Los bloques de código en los comentarios `///` se ven automáticamente como código de Rust.
fa: بلوک‌های کد در commentها `///` به طور خودکار به عنوان کد Rust دیده می‌شوند.
ja: `///` コメント内のコードブロックは、自動的に Rust コードとみなされます。
ko: `///` 주석안의 코드 블록은 자동으로 러스트 코드로 인식됩니다.
pt_br: Blocos de código em comentários `///` são vistos automaticamente como código Rust.
uk: Блоки коду в коментарях `///` автоматично сприймаються як код Rust.

source: The code will be compiled and executed as part of `cargo test`.
es: El código se compilará y ejecutará como parte de `cargo test`.
fa: این کد به عنوان بخشی از `cargo test` کامپایل و اجرا می‌شود.
ja: コードは `cargo test` の一環としてコンパイルされ、実行されます。
ko: 이 코드 블록은 `cargo test` 호출하면 자동으로 컴파일되고 실행됩니다.
pt_br: O código será compilado e executado como parte do `cargo test`.
uk: Код буде скомпільовано та виконано як частину `cargo test`.

source: Adding `#` in the code will hide it from the docs, but will still compile/run it.
fa: افزودن `#` به کد، آن را از مستندات پنهان می‌کند، اما همچنان آن را کامپایل/اجرا می‌کند.
ja: コードに `#` を追加すると、ドキュメントには表示されなくなりますが、コンパイルと実行は引き続き行われます。
pt_br: Adicionar `#` no código o ocultará da documentação, mas ainda o compilará/executará.
uk: Додавання `#` до коду приховає його з документації, але все одно скомпілює/запустить.
