Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: `Vec` implements [`Deref<Target = [T]>`](https://doc.rust-lang.org/std/vec/struct.Vec.html#deref-methods-%5BT%5D), which means that you can call slice methods on a `Vec`.
es: `Vec` implementa [`Deref<Target = [T]>`](https://doc.rust-lang.org/std/vec/struct.Vec.html#deref-methods-%5BT%5D), lo que significa que puedes llamar a métodos slice en un `Vec`.
fa: `Vec` پیاده‌سازی‌کننده [`Deref<Target = [T]>`](https://doc.rust-lang.org/std/vec/struct.Vec.html#deref-methods-%5BT%5D) است، به این معنی که می‌توانید متدهای برش را بر روی یک `Vec` فراخوانی کنید.
ja: `Vec` は [`Deref<Target = [T]>`](https://doc.rust-lang.org/std/vec/struct.Vec.html#deref-methods-%5BT%5D) を実装しているため、`Vec` でスライス メソッドを呼び出すことができます。
ko: `Vec`은 [`Deref<Target = [T]>`](https://doc.rust-lang.org/std/vec/struct.Vec.html#deref-methods-%5BT%5D)를 구현합니다. 이는 `Vec`에서 슬라이스 메서드를 호출 할 수 있다는 의미입니다.
pt_br: `Vec` implementa [`Deref<Target = [T]>`](https://doc.rust-lang.org/std/vec/struct.Vec.html#deref-methods-%5BT%5D), o que significa que você pode chamar métodos de _slice_ em um `Vec`.
uk: `Vec` реалізує [`Deref<Target = [T]>`](https://doc.rust-lang.org/std/vec/struct.Vec.html#deref-methods-%5BT%5D), який означає, що ви можете викликати методи зрізу на `Vec`.

source: `Vec` is a type of collection, along with `String` and `HashMap`. The data it contains is stored on the heap. This means the amount of data doesn't need to be known at compile time. It can grow or shrink at runtime.
fa: `Vec` نوعی مجموعه است، به همراه `String` و `HashMap`. داده‌های آن در حافظه heap ذخیره می‌شود. به این معنی که مقدار داده‌ها نیازی به دانستن در زمان کامپایل ندارد و می‌تواند در زمان اجرا رشد یا کوچک شود.
ja: `Vec` は、`String` および `HashMap` とともにコレクションの一種です。含まれているデータはヒープに格納されるため、コンパイル時にデータ量を把握する必要はありません。データ量は実行時に増加または減少する場合があります。
pt_br: `Vec` é um tipo de coleção, como `String` e `HashMap`. Os dados que ele contém são armazenados no heap. Isso significa que a quantidade de dados não precisa ser conhecida em tempo de compilação. Ela pode crescer ou encolher em tempo de execução.
uk: `Vec` — це тип колекції разом із `String` і `HashMap`. Дані, які він містить, зберігаються в купі. Це означає, що кількість даних не потрібно знати під час компіляції. Він може рости або зменшуватися під час виконання.

source: Notice how `Vec<T>` is a generic type too, but you don't have to specify `T` explicitly. As always with Rust type inference, the `T` was established during the first `push` call.
es: Ten en cuenta que `Vec<T>` también es un tipo genérico, pero no tienes que especificar `T` de forma explícita. Como siempre sucede con la inferencia de tipos de Rust, `T` se estableció durante la primera llamada a `push`.
fa: توجه داشته باشید که `<Vec<T` نیز یک تایپ generic است، اما نیازی به تعیین صریح `T` ندارید. همان‌طور که همیشه با استنتاج تایپ در Rust ، `T` در زمان اولین فراخوانی `push` مشخص شده است.
ja: `Vec<T>` もジェネリック型ですが、`T` を明示的に指定する必要はありません。Rust の型推論でいつも行われるように、最初の `push` 呼び出しで `T` が確立されています。
ko: `Vec<T>`는 제네릭 타입이기도 합니다. 하지만 `T`를 꼭 지정해줄 필요는 없습니다. 이 경우, 러스트 타입 추론이 벡터에 처음 `push`하는 데이터로 `T`를 알 수 있었습니다.
pt_br: Observe como `Vec<T>` também é um tipo genérico, mas você não precisa especificar `T` explicitamente. Como sempre, com a inferência de tipos do Rust, `T` foi estabelecido durante a primeira chamada de `push`.
uk: Зверніть увагу, що `Vec<T>` також є узагальненим типом, але вам не потрібно вказувати `T` явно. Як завжди з визначенням типу Rust, `T` було встановлено під час першого виклику `push`.

source: `vec![...]` is a canonical macro to use instead of `Vec::new()` and it supports adding initial elements to the vector.
es: `vec![...]` es una macro canónica para usarla en lugar de `Vec::new()` y admite que se añadan elementos iniciales al vector.
fa: `[...]!vec` یک ماکرو استاندارد برای استفاده به‌جای `()Vec::new` است و از افزودن عناصر اولیه به vector پشتیبانی می‌کند.
ja: `vec![...]` は `Vec::new()` の代わりに使用する正規のマクロで、ベクターへの初期要素の追加をサポートしています。
ko: `vec![...]`는 `Vec::new()` 대신 쓸 수 있는 표준 매크로로서, 초기 데이터를 추가한 벡터를 생성할 수 있습니다.
pt_br: `vec![...]` é uma macro canônica para usar em vez de `Vec::new()` e suporta a adição de elementos iniciais ao vetor.
uk: `vec![...]` — це канонічний макрос для використання замість `Vec::new()`, який підтримує додавання початкових елементів до вектора.

source: To index the vector you use `[` `]`, but they will panic if out of bounds. Alternatively, using `get` will return an `Option`. The `pop` function will remove the last element.
es: Para indexar el vector, se utiliza `[` `]`, pero entrará en pánico si se sale de los límites. También se puede usar `get` para obtener una `Option`. La función `pop` eliminará el último elemento.
fa: برای ایندکس‌گذاری vector از `[` `]` استفاده می‌کنید، اما اگر از محدوده خارج شود، باعث panic می‌شود. به‌طور جایگزین، استفاده از `get` یک `Option` را برمی‌گرداند. تابع `pop` آخرین عنصر را حذف می‌کند.
ja: ベクターにインデックスを付けるには `[` `]` を使用しますが、境界外の場合はパニックが発生します。または、`get` を使用すると `Option` が返されます。`pop` 関数は最後の要素を削除します。
ko: 벡터는 `[` `]`를 사용하여 인덱스로 접근할 수 있습니다. 하지만 범위를 벗어나면 패닉이 발생합니다. 대신 `get`을 사용하면 `Option`을 반환합니다. `pop` 함수는 마지막 요소를 제거합니다.
pt_br: Para indexar o vetor, você usa `[` `]`, mas uma exceção do tipo _pânico_ (`panic`) será gerada se o índice estiver fora dos limites. Alternativamente, usando `get` você obterá um `Option`. A função `pop` removerá o último elemento.
uk: Щоб індексувати вектор, ви використовуєте `[` `]`, але вони панікують, якщо вийдуть за межі. Крім того, використання `get` поверне `Option`. Функція `pop` видалить останній елемент.

source: Slices are covered on day 3. For now, students only need to know that a value of type `Vec` gives access to all of the documented slice methods, too.
fa: برش‌ها در روز سوم پوشش داده می‌شوند. در حال حاضر، دانش‌آموزان تنها باید بدانند که یک مقدار از تایپ `Vec` به تمام متدهای مستند شده برش‌ها نیز دسترسی دارد.
ja: スライスについては 3 日目に説明します。受講者は現時点では、型 `Vec` の値により、ドキュメントに記されたすべてのスライスメソッドにアクセスできることだけを知っていれば十分です。
pt_br: Os _slices_ são abordados no dia 3. Por enquanto, os alunos só precisam saber que um valor do tipo `Vec` dá acesso a todos os métodos de _slice_ documentados, também.
uk: Зрізи розглядаються на 3-й день. Наразі студентам потрібно лише знати, що значення типу `Vec` дає доступ до всіх задокументованих методів зрізів.

source: Standard hash map with protection against HashDoS attacks:
es: Mapa hash estándar con protección frente a ataques HashDoS:
fa: نقشه hash استاندارد با حفاظت در برابر حملات HashDoS:
ja: HashDoS 攻撃から保護する標準のハッシュマップ:
ko: HashDoS 공격으로부터 보호되는 표준 해시 맵입니다:
pt_br: _Hash map_ (Mapa de _hash_) padrão com proteção contra ataques _HashDoS_:
uk: Стандартна хеш-карта із захистом від HashDoS-атак:

source: "We know about {} books, but not Les Misérables."
fa: "ما درباره {} کتاب می دانیم، اما Les Misérables نه."
pt_br: "Nós sabemos sobre livros {}, mas não Les Misérables."
uk: "Ми знаємо про {} книги, але не Les Misérables."

source: "{book}: {count} pages"
fa: "{book}: {count} صفحه‌ها"
pt_br: "{book}: {count} páginas"
uk: "{book}: {count} сторінок"

source: "{book} is unknown."
fa: "{book} ناشناخته است."
pt_br: "{book} é desconhecido."
uk: "{book} невідома."

source: // Use the .entry() method to insert a value if nothing is found.
ja: // 何も見つからなかった場合は、.entry() メソッドを使用して値を挿入します。
pt_br: // Use o método .entry() para inserir um valor caso nada seja encontrado.
uk: // Використовуйте метод .entry(), щоб вставити значення, якщо нічого не знайдено.

source: `HashMap` is not defined in the prelude and needs to be brought into scope.
es: `HashMap` no se ha explicado en el preludio y debe conocerse.
fa: `HashMap` در prelude تعریف نشده و باید به scope وارد شود.
ja: `HashMap` はプレリュードで定義されていないため、スコープに含める必要があります。
ko: `HashMap`은 prelude에 정의되어 있지 않기 때문에 명시적으로 추가해줘야 합니다.
pt_br: `HashMap` não está definido no prelúdio e precisa ser incluído no escopo.
uk: `HashMap` не визначено в prelude, і ії потрібно включити в область.

source: Try the following lines of code. The first line will see if a book is in the hashmap and if not return an alternative value. The second line will insert the alternative value in the hashmap if the book is not found.
es: Prueba las siguientes líneas de código. La primera línea comprobará si un libro está incluido en el hashmap y, si no, devolverá un valor alternativo. La segunda línea insertará el valor alternativo en el hashmap si el libro no se encuentra.
fa: سطرهای کد زیر را امتحان کنید. سطر اول بررسی می‌کند که آیا یک کتاب در `HashMap` وجود دارد یا خیر و اگر وجود نداشت، یک مقدار جایگزین برمی‌گرداند. سطر دوم مقدار جایگزین را در `HashMap` وارد می‌کند اگر کتاب پیدا نشد.
ja: 次のコード行を試します。最初の行で、書籍がハッシュマップにあるかどうかを確認し、ない場合は代替値を返します。書籍が見つからなかった場合、2 行目でハッシュマップに代替値を挿入します。
ko: 아래 코드를 테스트해보세요. 첫 문장에서는 해시맵에 책이 있는지 검사하여, 없으면 디폴트 값을 반환합니다. 두번 째 문장에서는 해시맵에 해당 책이 없는 경우, 지정한 값을 해시맵에 추가한 뒤 그 값을 반환합니다.
pt_br: Tente as seguintes linhas de código. A primeira linha verá se um livro está no hash map e, caso não esteja, retorna um valor alternativo. A segunda linha irá inserir o valor alternativo no hash map se o livro não for encontrado.
uk: Спробуйте наступні рядки коду. У першому рядку буде показано, чи є книга в хеш-мапі, і якщо ні, повернеться альтернативне значення. У другому рядку буде вставлено альтернативне значення в хеш-мапу, якщо книга не знайдена.

source: Unlike `vec!`, there is unfortunately no standard `hashmap!` macro.
es: A diferencia de `vec!`, por desgracia no hay ninguna macro estándar de `hashmap!`.
fa: برخلاف `!vec`، متأسفانه ماکروی استاندارد `!hashmap` وجود ندارد.
ja: `vec!` とは異なり、標準の `hashmap!` マクロはありません。
ko: 안타깝지만 `hashmap!`같은 매크로가 없습니다.
pt_br: Ao contrário de `vec!`, infelizmente não existe uma macro `hashmap!` padrão.
uk: На відміну від `vec!`, на жаль, немає стандартного макросу `hashmap!`.

source: Although, since Rust 1.56, HashMap implements [`From<[(K, V); N]>`](https://doc.rust-lang.org/std/collections/hash_map/struct.HashMap.html#impl-From%3C%5B(K,+V);+N%5D%3E-for-HashMap%3CK,+V,+RandomState%3E), which allows us to easily initialize a hash map from a literal array:
es: Sin embargo, desde la versión 1.56 de Rust, HashMap implementa [`From<[(K, V); N]>`](https://doc.rust-lang.org/std/collections/hash_map/struct.HashMap.html#impl-From%3C%5B(K,+V);+N%5D%3E-for-HashMap%3CK,+V,+RandomState%, que nos permite inicializar fácilmente un mapa hash a partir de un _array_ literal:
fa: از نسخه 1.56 Rust به بعد، `HashMap` پیاده‌سازی‌کننده [`From<[(K, V); N]>`](https://doc.rust-lang.org/std/collections/hash_map/struct.HashMap.html#impl-From%3C%5B(K,+V);+N%5D%3E-for-HashMap%3CK,+V,+RandomState%3E) است که به ما اجازه می‌دهد به‌راحتی یک `HashMap` را از یک آرایه مقداردهی اولیه کنیم:
ja: しかし、Rust 1.56 以降では、HashMap は [`From<[(K, V); N]>`](https://doc.rust-lang.org/std/collections/hash_map/struct.HashMap.html#impl-From%3C%5B(K,+V);+N%5D%3E-for-HashMap%3CK,+V,+RandomState%3E) を実装しています。これにより、リテラル配列からハッシュマップを簡単に初期化できます。
ko: 러스트 1.56부터는 `HashMap`이 [`From<[(K, V); N]>`](https://doc.rust-lang.org/std/collections/hash_map/struct.HashMap.html#impl-From%3C%5B(K,+V);+N%5D%3E-for-HashMap%3CK,+V,+RandomState%3E)을 구현하기 때문에 배열 리터럴을 이용하여 쉽게 해시맵을 초기화할 수 있습니다:
pt_br: Entretanto, desde o Rust 1.56, o HashMap implementa [`From<[(K, V); N]>`](https://doc.rust-lang.org/std/collections/hash_map/struct.HashMap.html#impl-From%3C%5B(K,+V);+N%5D%3E-for-HashMap%3CK,+V,+RandomState%3E), o que nos permite inicializar facilmente um hash map a partir de uma matriz literal:
uk: Хоча, починаючи з Rust 1.56, в HashMap реалізовано [`From<[[(K, V); N]>`](https://doc.rust-lang.org/std/collections/hash_map/struct.HashMap.html#impl-From%3C%5B(K,+V);+N%5D%3E-for-HashMap%3CK,+V,+RandomState%3E), що дозволяє легко ініціалізувати хеш-карту з літерального масиву:

source: Alternatively HashMap can be built from any `Iterator` which yields key-value tuples.
es: HashMap también se puede crear a partir de cualquier `Iterator` que genere tuplas de pares clave-valor.
fa: به‌طور جایگزین، `HashMap` می‌تواند از هر `Iterator` که جفت‌های key-value را تولید می‌کند، ساخته شود.
ja: 別の方法として、HashMap は、Key-Value タプルを生成する任意の `Iterator` から作成することもできます。
ko: 키-값 쌍에 대한 `Iterator`로 해시맵을 만들 수도 있습니다.
pt_br: Alternativamente, o HashMap pode ser construído a partir de qualquer `Iterator` que produz tuplas de chave-valor.
uk: Крім того, HashMap можна створити з будь-якого `Iterator`, який видає кортежі ключ-значення.

source: This type has several "method-specific" return types, such as `std::collections::hash_map::Keys`. These types often appear in searches of the Rust docs. Show students the docs for this type, and the helpful link back to the `keys` method.
es: Este tipo tiene varios tipos de devolución "específicos del método", como `std::collections::hash_map::Keys`. Estos tipos a menudo aparecen en las búsquedas de la documentación de Rust. Muestra a los estudiantes la documentación de este tipo y el enlace útil de vuelta al método `keys`.
fa: این چندین تایپ "تایپ بازگشتی خاص متد" دارد، مانند `std::collections::hash_map::Keys`. این تایپ‌ها معمولاً در جستجوهای مستندات Rust ظاهر می‌شوند. مستندات این تایپ را به دانش‌آموزان نشان دهید و پیوند مفید بازگشتی به متد `keys` را نیز نمایش دهید.
ja: この型には、`std::collections::hash_map::Keys` などの「メソッド固有の」戻り値の型がいくつかあります。これらの型は、Rust ドキュメントの検索でよく使用されます。この型のドキュメントと、`keys` メソッドに戻るのに役立つリンクを受講者に示します。
ko: 해시맵의 몇 몇 메서드는 해시맵 내부의 특별한 타입(예를 들어 `std::collections::hash_map::Keys`)들을 리턴합니다. 이러한 타입들은 Rust 문서에서도 검색할 수 있습니다. 수강생들에게 이 타입들에 대한 문서를 보여주고, 이 문서에 `keys` 메서드로의 역 링크가 있음을 알려주세요.
pt_br: Este tipo tem vários tipos de retorno "específicos do método", como `std::collections::hash_map::Keys`. Esses tipos geralmente aparecem em pesquisas nos documentos do Rust. Mostre aos alunos os documentos para este tipo e o link útil de volta ao método `keys`.
uk: Цей тип має кілька "специфічних" типів повернення, таких як `std::collections::hash_map::Keys`. Ці типи часто з’являються під час пошуку в документації Rust. Покажіть учням документацію для цього типу та корисне посилання на метод `keys`.

source: In this exercise you will take a very simple data structure and make it generic. It uses a [`std::collections::HashMap`](https://doc.rust-lang.org/stable/std/collections/struct.HashMap.html) to keep track of which values have been seen and how many times each one has appeared.
fa: در این تمرین، شما یک ساختار داده بسیار ساده را به‌صورت generic خواهید کرد. این ساختار از [`std::collections::HashMap`](https://doc.rust-lang.org/stable/std/collections/struct.HashMap.html) برای پیگیری اینکه چه مقادیری مشاهده شده‌اند و هرکدام چند بار ظاهر شده‌اند، استفاده می‌کند.
ja: この演習では、非常にシンプルなデータ構造を汎用的なものにします。[`std::collections::HashMap`](https://doc.rust-lang.org/stable/std/collections/struct.HashMap.html) を使用して、どの値が確認され、各値が何回出現したかを追跡します。
pt_br: Neste exercício, você usará uma estrutura de dados muito simples e a tornará genérica. Ela usa um [`std::collections::HashMap`](https://doc.rust-lang.org/stable/std/collections/struct.HashMap.html) para acompanhar quais valores foram vistos e quantas vezes cada um apareceu.
uk: У цій вправі ви візьмете дуже просту структуру даних і зробите її узагальненою. Вона використовує [`std::collections::HashMap`](https://doc.rust-lang.org/stable/std/collections/struct.HashMap.html) для відстеження того, які значення було переглянуто і скільки разів кожне з них з'являлося.

source: The initial version of `Counter` is hard coded to only work for `u32` values. Make the struct and its methods generic over the type of value being tracked, that way `Counter` can track any type of value.
fa: نسخه اولیه `Counter` به‌طور سخت‌افزاری برای مقادیر `u32` کدگذاری شده است. ساختار و متدهای آن را به‌صورت generic بر اساس تایپ مقداری که در حال پیگیری است، تغییر دهید، به‌طوری که `Counter` بتواند هر تایپ مقداری را پیگیری کند.
ja: `Counter` の初期バージョンは、`u32` の値でのみ機能するようにハードコードされています。追跡する値の型に対して構造体とそのメソッドをジェネリック化します。これにより、`Counter` であらゆる型の値を追跡できます。
pt_br: A versão inicial de `Counter` é codificada para funcionar apenas para valores `u32`. Faça a estrutura e seus métodos genéricos sobre o tipo de valor sendo rastreado, dessa forma `Counter` pode rastrear qualquer tipo de valor.
uk: Початкова версія `Counter` жорстко налаштована на роботу лише зі значеннями `u32`. Зробіть структуру та її методи узагальненими щодо типу значення, яке відстежується, таким чином `Counter` зможе відстежувати будь-який тип значення.

source: If you finish early, try using the [`entry`](https://doc.rust-lang.org/stable/std/collections/struct.HashMap.html#method.entry) method to halve the number of hash lookups required to implement the `count` method.
fa: اگر زود تمام کردید، سعی کنید از متد [`entry`](https://doc.rust-lang.org/stable/std/collections/struct.HashMap.html#method.entry) استفاده کنید تا تعداد جستجوهای هش مورد نیاز برای پیاده‌سازی متد `count` را به نصف کاهش دهید.
ja: 早めに終わった場合は、[`entry`](https://doc.rust-lang.org/stable/std/collections/struct.HashMap.html#method.entry) メソッドを使用して、`count` メソッドの実装に必要なハッシュ ルックアップの回数を半分にしてみましょう。
pt_br: Se você terminar cedo, tente usar o método [`entry`](https://doc.rust-lang.org/stable/std/collections/struct.HashMap.html#method.entry) para reduzir pela metade o número de pesquisas de hash necessárias para implementar o método `count`.
uk: Якщо ви закінчите раніше, спробуйте використати метод [`entry`](https://doc.rust-lang.org/stable/std/collections/struct.HashMap.html#method.entry), щоб вдвічі зменшити кількість переглядів хешу, необхідних для реалізації методу `count`.

source: /// Counter counts the number of times each value of type T has been seen.
ja: /// カウンタは型 T の各値が確認された回数をカウントします。
pt_br: /// Counter conta o número de vezes que cada valor do tipo T foi visto.
uk: /// Counter підраховує кількість разів, коли кожне значення типу T було переглянуто.

source: /// Create a new Counter.
ja: /// 新しいカウンタを作成します。
pt_br: /// Cria um novo Counter.
uk: /// Створює новий Counter.

source: /// Count an occurrence of the given value.
ja: /// 指定された値の発生をカウントします。
pt_br: /// Conta uma ocorrência do valor fornecido.
uk: /// Підраховує входження заданого значення.

source: /// Return the number of times the given value has been seen.
ja: /// 指定された値が確認された回数を返します。
pt_br: /// Retorna o número de vezes que o valor fornecido foi visto.
uk: /// Повертає кількість разів, коли було побачено задане значення.

source: "saw {} values equal to {}"
fa: "مقادیر {} برابر با {} را دیده‌شده"
pt_br: "viu {} valores iguais a {}"
uk: "побачив {} значень рівних {}"

source: "apple"
fa: "سیب"
uk: "яблуко"

source: "orange"
uk: "апельсин"

source: "got {} apples"
fa: "داشتم {} سیب‌ها"
pt_br: "obteve {} maçãs"
uk: "отримав {} яблук"

source: As with the standard-library types, spend time reviewing the documentation for each trait.
fa: همانند تایپ‌ها موجود در کتابخانه استاندارد، زمانی را صرف مرور مستندات هرtrait کنید.
ja: 標準ライブラリ型と同様に、時間をかけて各トレイトのドキュメントを確認します。
pt_br: Como nos tipos da biblioteca padrão, reserve um tempo para revisar a documentação de cada `trait`.
uk: Як і у випадку з типами стандартної бібліотеки, витратьте час на ознайомлення з документацією для кожного трейта.

source: This section is long. Take a break midway through.
fa: این بخش طولانی است. در میانه‌ی آن یک استراحت کنید.
ja: このセクションは長いため、途中で休憩を取ってください。
pt_br: Esta seção é longa. Faça uma pausa no meio.
uk: Цей розділ довгий. Зробіть перерву на півдорозі.

source: These traits support comparisons between values. All traits can be derived for types containing fields that implement these traits.
fa: این trait‌ها از مقایسه بین مقادیر پشتیبانی می‌کنند. همه‌ی این trait‌ها را می‌توان برای تایپ‌هایی که شامل فیلدهایی هستند که این trait‌ها را پیاده‌سازی می‌کنند، به‌دست آورد.
ja: これらのトレイトは値の比較をサポートします。すべてのトレイトは、これらのトレイトを実装するフィールドを含む型用に導出できます。
pt_br: Esses `traits` suportam comparações entre valores. Todos os `traits` podem ser derivados para tipos que contêm campos que implementam esses `traits`.
uk: Ці трейти підтримують порівняння між значеннями. Усі трейти можуть бути визначені для типів, що містять поля, які реалізують ці трейти

source: `PartialEq` and `Eq`
ja: `PartialEq` と `Eq`
pt_br: `PartialEq` e `Eq`
uk: `PartialEq` та `Eq`

source: `PartialEq` is a partial equivalence relation, with required method `eq` and provided method `ne`. The `==` and `!=` operators will call these methods.
fa: `PartialEq` یک رابطه هم‌ارزی جزئی است که دارای متد الزامی `eq` و متد ارائه‌شده `ne` می‌باشد. عملگرهای `==` و `=!` این متدها را فراخوانی می‌کنند.
ja: `PartialEq` は、必須のメソッド `eq` と指定されたメソッド `ne` を持つ部分的な等価関係です。`==` 演算子と `!=` 演算子は、これらのメソッドを呼び出します。
pt_br: `PartialEq` é uma relação de equivalência parcial, com o método `eq` obrigatório e o método `ne` fornecido. Os operadores `==` e `!=` chamarão esses métodos.
uk: PartialEq` - це відношення часткової еквівалентності, з обов'язковим методом `eq` та наданим методом `ne`. Оператори `==` та `!=` викликають ці методи.

source: `Eq` is a full equivalence relation (reflexive, symmetric, and transitive) and implies `PartialEq`. Functions that require full equivalence will use `Eq` as a trait bound.
fa: `Eq` یک رابطه هم‌ارزی کامل است (بازتابی، متقارن، و transitive) و شامل `PartialEq` می‌شود. توابعی که به هم‌ارزی کامل نیاز دارند، از `Eq` به‌عنوان یک trait bound استفاده می‌کنند.
ja: `Eq` は完全な等価関係（反射的、対称的、推移的）であり、`PartialEq` を意味します。完全な等価関係を必要とする関数は、トレイト境界として `Eq` を使用します。
pt_br: `Eq` é uma relação de equivalência completa (reflexiva, simétrica e transitiva) e implica `PartialEq`. Funções que exigem equivalência completa usarão `Eq` como um limite de `trait`.
uk: `Eq` - це відношення повної еквівалентності (рефлексивне, симетричне та транзитивне) і передбачає `PartialEq`. Функції, які вимагають повної еквівалентності, використовуватимуть `Eq` як обмеження трейту.

source: `PartialOrd` and `Ord`
ja: `PartialOrd` と `Ord`
pt_br: `PartialOrd` e `Ord`
uk: `PartialOrd` та `Ord`

source: `PartialOrd` defines a partial ordering, with a `partial_cmp` method. It is used to implement the `<`, `<=`, `>=`, and `>` operators.
fa: `PartialOrd` یک ترتیب جزئی را تعریف می‌کند و دارای متد `partial_cmp` است. این ویژگی برای پیاده‌سازی عملگرهای `<`، `<=`، `>=` و `>` استفاده می‌شود.
ja: `PartialOrd` は `partial_cmp` メソッドを使って部分的な順序を定義します。これは、`<`、`<=`、`>=`、`>` 演算子を実装するために使用されます。
pt_br: `PartialOrd` define uma ordenação parcial, com um método `partial_cmp`. Ele é usado para implementar os operadores `<`, `<=`, `>=` e `>`.
uk: `PartialOrd` визначає часткове впорядкування за допомогою методу `partial_cmp`. Він використовується для реалізації операторів `<`, `<=`, `>=` та `>`.

source: `Ord` is a total ordering, with `cmp` returning `Ordering`.
fa: `Ord` یک ترتیب کامل است که در آن متد `cmp` مقدار `Ordering` را برمی‌گرداند.
ja: `Ord` は全順序を示し、`cmp` は `Ordering` を返します。
pt_br: `Ord` é uma ordenação total, com `cmp` retornando `Ordering`.
uk: `Ord` - це повне впорядкування, з `cmp` який повертає `Ordering`.

source: `PartialEq` can be implemented between different types, but `Eq` cannot, because it is reflexive:
fa: `PartialEq` می‌تواند بین تایپ‌های مختلف پیاده‌سازی شود، اما `Eq` نمی‌تواند، زیرا بازتابی است:
ja: `PartialEq` は異なる型の間で実装できますが、`Eq` は反射的であるため、実装できません。
pt_br: `PartialEq` pode ser implementado entre diferentes tipos, mas `Eq` não pode, porque é reflexivo:
uk: `PartialEq` може бути реалізовано між різними типами, але `Eq` не може, тому що є рефлексивним:

source: In practice, it's common to derive these traits, but uncommon to implement them.
fa: در عمل، معمولاً این trait‌ها به‌طور خودکار به‌دست می‌آیند، اما کمتر پیش می‌آید که آن‌ها به‌طور دستی پیاده‌سازی شوند.
ja: 実際には、これらのトレイトを導出することは一般的ですが、実装するのは一般的ではありません。
pt_br: Na prática, é comum derivar esses `traits`, mas incomum implementá-los.
uk: На практиці ці трейти часто виводяться, але рідко реалізуються.
