Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: Broadly speaking, microcontrollers don't have an MMU or multiple levels of privilege (exception levels on Arm CPUs, rings on x86), while application processors do.
es: En términos generales, los microcontroladores no tienen un MMU ni varios niveles de privilegio (niveles de excepción en las CPU de Arm, anillos en x86), mientras que los procesadores de aplicaciones sí los tienen.
fa: به طور کلی، میکروکنترلرها دارای MMU یا چندین سطح دسترسی (سطوح استثنا در پردازنده‌های Arm، حلقه‌ها در x86) نیستند، در حالی که پردازنده‌های برنامه دارای دسترسی هستند.
ja: 大まかに言って、マイクロコントローラがMMUや複数の特権レベル（Arm CPUにおける例外レベル、x86におけるリング）を持たないのに対し、アプリケーションプロセッサはこれらを持っています。
ko: 일반적으로 마이크로컨트롤러에는 MMU 또는 다중 레벨 권한(Arm CPU에서는 익셉션 레벨(exception level), x86에서는 링(ring))이 없습니다. 애플리케이션 프로세서는 이들을 가지고 있습니다.
pt_br: Em termos gerais, os microcontroladores não possuem MMU ou vários níveis de privilégio (níveis de exceção em CPUs Arm, anéis em x86), enquanto os processadores de aplicações possuem.
uk: Загалом кажучи, мікроконтролери не мають MMU або кількох рівнів привілеїв (рівні виключень на центральних процесорах Arm, кільця на x86), тоді як процесори прикладних програм мають.

source: QEMU supports emulating various different machines or board models for each architecture. The 'virt' board doesn't correspond to any particular real hardware, but is designed purely for virtual machines.
es: QEMU permite emular varias máquinas o modelos de placa diferentes para cada arquitectura. La placa "virt" no se corresponde con ningún hardware real concreto, pero está diseñada exclusivamente para máquinas virtuales.
fa: QEMU از شبیه‌سازی ماشین‌های مختلف یا مدل‌های برد مختلف برای هر معماری پشتیبانی می کند. برد 'virt' با هیچ سخت‌افزار واقعی خاصی مطابقت ندارد، اما صرفا برای ماشین‌های مجازی طراحی شده است.
ja: QEMU は個々のアーキテクチャに対して様々な異なるマシンやボードモデルをサポートしています。今回使う 'virt' ボードは特定の本物のハードウェアに対応したものではなく、純粋に仮想マシンとして設計されたものです。
ko: QEMU는 아키텍처별로 다양한 머신 또는 보드 모델을 에뮬레이션할 수 있습니다. 'virt' 보드는 특정 실제 하드웨어를 에뮬레이션 하지 않으며, 가상 머신용으로만 설계되었습니다.
pt_br: O QEMU suporta a emulação de vários modelos de máquinas ou placas diferentes para cada arquitetura. A placa 'virt' não corresponde a nenhum hardware real específico, mas é projetada exclusivamente para máquinas virtuais.
uk: QEMU підтримує емуляцію різних машин або моделей плат для кожної архітектури. Плата 'virt' не відповідає жодному конкретному реальному апаратному забезпеченню, а розроблена виключно для віртуальних машин.

source: Before we can start running Rust code, we need to do some initialisation.
es: Antes de que podamos empezar a ejecutar código de Rust, tenemos que hacer alguna inicialización.
fa: قبل از اینکه بتوانیم اجرای کد Rust را شروع کنیم، باید مقداری مقداردهی اولیه را انجام دهیم.
ja: Rustのコードを実行できるようになる前にいくつかの初期化が必要です。
pt_br: Antes de podermos começar a executar o código Rust, precisamos fazer alguma
uk: Перш ніж ми зможемо запускати код Rust, нам потрібно виконати деяку ініціалізацію.

source: ```armasm .section .init.entry, "ax" .global entry entry: /* * Load and apply the memory management configuration, ready to enable MMU and * caches. */ adrp x30, idmap msr ttbr0_el1, x30 mov_i x30, .Lmairval msr mair_el1, x30 mov_i x30, .Ltcrval /* Copy the supported PA range into TCR_EL1.IPS. */ mrs x29, id_aa64mmfr0_el1 bfi x30, x29, #32, #4 msr tcr_el1, x30 mov_i x30, .Lsctlrval /* * Ensure everything before this point has completed, then invalidate any * potentially stale local TLB entries before they start being used. */ isb tlbi vmalle1 ic iallu dsb nsh isb /* * Configure sctlr_el1 to enable MMU and cache and don't proceed until this * has completed. */ msr sctlr_el1, x30 isb /* Disable trapping floating point access in EL1. */ mrs x30, cpacr_el1 orr x30, x30, #(0x3 << 20) msr cpacr_el1, x30 isb /* Zero out the bss section. */ adr_l x29, bss_begin adr_l x30, bss_end 0: cmp x29, x30 b.hs 1f stp xzr, xzr, [x29], #16 b 0b 1: /* Prepare the stack. */ adr_l x30, boot_stack_end mov sp, x30 /* Set up exception vector. */ adr x30, vector_table_el1 msr vbar_el1, x30 /* Call into Rust code. */ bl main /* Loop forever waiting for interrupts. */ 2: wfi b 2b ```
pt_br: ```armasm .section .init.entry, "ax" .global entry entry: /* * Carregue e aplique a configuração de gerenciamento de memória, pronto para * habilitar MMU e caches. adrp x30, idmap msr ttbr0_el1, x30 mov_i x30, .Lmairval msr mair_el1, x30 mov_i x30, .Ltcrval /* Copie o intervalo de PA suportado para TCR_EL1.IPS. */ mrs x29, id_aa64mmfr0_el1 bfi x30, x29, #32, #4 msr tcr_el1, x30 mov_i x30, .Lsctlrval /* * Garanta que tudo antes deste ponto tenha sido concluído, então invalida * quaisquer entradas locais de TLB potencialmente obsoletas antes que elas */ isb tlbi vmalle1 ic iallu dsb nsh isb /* * Configure sctlr_el1 para habilitar MMU e cache e não prossiga até isto * tenha sido concluído. */ msr sctlr_el1, x30 isb /* Desative a captura de acesso de ponto flutuante em EL1. */ mrs x30, cpacr_el1 orr x30, x30, #(0x3 << 20) msr cpacr_el1, x30 isb /* Zere a seção bss. */ adr_l x29, bss_begin adr_l x30, bss_end 0: cmp x29, x30 b.hs 1f stp xzr, xzr, [x29], #16 b 0b 1: /* Prepare a pilha. */ adr_l x30, boot_stack_end mov sp, x30 /* Configure o vetor de exceção. */ adr x30, vector_table_el1 msr vbar_el1, x30 /* Chame o código Rust. */ bl main /* Loop infinito esperando por interrupções. */ 2: wfi b 2b ```
uk: ```armasm .section .init.entry, "ax" .global entry entry: /* * Завантаження та застосування конфігурації керування пам'яттю, готової * до ввімкнення MMU та кешів. */ adrp x30, idmap msr ttbr0_el1, x30 mov_i x30, .Lmairval msr mair_el1, x30 mov_i x30, .Ltcrval /* Скопіювати підтримуваний діапазон PA у TCR_EL1.IPS. */ mrs x29, id_aa64mmfr0_el1 bfi x30, x29, #32, #4 msr tcr_el1, x30 mov_i x30, .Lsctlrval /* * Перевірити все до завершення цього пункту, а потім зробити недійсними всі * потенційно застарілі локальні записи TLB до того, як вони почнуть використовуватися. */ isb tlbi vmalle1 ic iallu dsb nsh isb /* * Налаштувати sctlr_el1 на ввімкнення MMU та кешу і не продовжувати, доки це * не буде зроблено. */ msr sctlr_el1, x30 isb /* Вимкнути перехоплення доступу з плаваючою комою в EL1. */ mrs x30, cpacr_el1 orr x30, x30, #(0x3 << 20) msr cpacr_el1, x30 isb /* Обнуліть секцію bss. */ adr_l x29, bss_begin adr_l x30, bss_end 0: cmp x29, x30 b.hs 1f stp xzr, xzr, [x29], #16 b 0b 1: /* Підготувати стек. */ adr_l x30, boot_stack_end mov sp, x30 /* Налаштування вектора виключень. */ adr x30, vector_table_el1 msr vbar_el1, x30 /* Виклик коду Rust. */ bl main /* Постійно циклічно чекаємо на переривання. */ 2: wfi b 2b ```

source: This is the same as it would be for C: initialising the processor state, zeroing the BSS, and setting up the stack pointer.
es: Es lo mismo que en C: inicializar el estado del procesador, poner a cero el BSS y configurar el puntero de la _stack_.
fa: این همان چیزی است که برای C وجود دارد: مقداردهی اولیه وضعیت پردازنده، صفر کردن BSS و تنظیم stack pointer.
ja: この初期化内容はCの場合と同じになります。プロセッサ状態を初期化して、BSSをゼロ埋めして、スタックポインタを設定します。
pt_br: Isso é o mesmo que seria para C: inicializando o estado do processador, zerando o BSS e configurando o ponteiro da pilha.
uk: Це те саме, що було б для C: ініціалізація стану процесора, обнулення BSS і налаштування покажчика стека.

source: The BSS (block starting symbol, for historical reasons) is the part of the object file which containing statically allocated variables which are initialised to zero. They are omitted from the image, to avoid wasting space on zeroes. The compiler assumes that the loader will take care of zeroing them.
es: El BSS (símbolo de inicio del bloque, por motivos históricos) es la parte del objeto que contiene variables asignadas de forma estática que se inicializan a cero. Se omiten en la imagen para evitar malgastar espacio con ceros. El compilador asume que el cargador se encargará de ponerlos a cero.
fa: این BSS (نماد شروع بلوک، به دلایل تاریخی) بخشی از object file است که حاوی متغیرهای تخصیص یافته استاتیکی است که مقدار اولیه آنها صفر است. برای جلوگیری از اتلاف فضا روی صفر، آنها از تصویر حذف شده‌اند. کامپایلر فرض می‌کند که لودر از صفر کردن آنها مراقبت می‌کند.
ja: BSS（歴史的な理由によりblock starting symbolと呼ばれているもの）はオブジェクトファイルにおいてゼロ初期化される静的な変数を含む部分です。この部分はゼロによる領域の浪費を避けるためにイメージからは除外されています。コンパイラはローダがこの領域をゼロ初期化することを想定しているのです。
pt_br: O BSS (bloco de símbolo inicial, por razões históricas) é a parte do arquivo objeto que contém variáveis alocadas estaticamente que são inicializadas como zero. Eles são omitidos da imagem, para evitar desperdício de espaço em zeros. O compilador assume que o carregador cuidará de zerá-los.
uk: BSS (символ початку блоку, з історичних причин) — це частина об’єктного файлу, яка містить статично виділені змінні, які ініціалізуються нулем. Вони пропущені на зображенні, щоб не витрачати місце на зайві нулі. Компілятор припускає, що завантажувач подбає про їх обнулення.

source: The BSS may already be zeroed, depending on how memory is initialised and the image is loaded, but we zero it to be sure.
es: Es posible que el BSS ya esté a cero, dependiendo de cómo se inicialice la memoria y cómo se cargue la imagen, aunque se pone igualmente a cero para estar seguros.
fa: ممکن است BSS قبلاً صفر شده باشد، بسته به اینکه چگونه حافظه مقداردهی اولیه شده و تصویر بارگذاری شده است، اما برای اطمینان آن را صفر می‌کنیم.
ja: メモリの初期化方法やイメージのロード方法によってはBSSはすでにゼロ埋めされていることがありますが、ここでは念の為にゼロ埋めしています。
pt_br: O BSS pode já estar zerado, dependendo de como a memória é inicializada e a imagem é carregada, mas o zeramos para ter certeza.
uk: BSS може бути вже обнулено, залежно від того, як ініціалізовано пам’ять і завантажено зображення, але ми обнуляємо його, щоб бути впевненими.

source: We need to enable the MMU and cache before reading or writing any memory. If we don't:
es: Necesitamos habilitar la MMU y la caché antes de leer o escribir memoria. Si no lo hacemos, sucederá lo siguiente:
fa: قبل از خواندن یا نوشتن هر حافظه باید MMU و cache را فعال کنیم. اگر این کار را نکنیم:
ja: いかなるメモリのreadやwriteよりも前にMMUとキャッシュを有効化する必要があります。それをしないと：
pt_br: É necessário habilitar a MMU e o cache antes de ler ou gravar qualquer memória. Se não fizermos isso:
uk: Нам потрібно ввімкнути MMU та кеш перед читанням або записом пам’яті. Якщо ми цього не зробимо:

source: Unaligned accesses will fault. We build the Rust code for the `aarch64-unknown-none` target which sets `+strict-align` to prevent the compiler generating unaligned accesses, so it should be fine in this case, but this is not necessarily the case in general.
es: Los accesos no alineados fallarán. Compilamos el código Rust para el objetivo `aarch64-unknown-none`, que define `+strict-align` para evitar que el compilador genere accesos no alineados. En este caso debería estar bien, pero no tiene por qué ser así en general.
fa: دسترسی‌های بدون تراز خطا خواهند داشت. ما کد Rust را برای هدف`aarch64-unknown-none` می‌سازیم که `+strict-align` را تنظیم می‌کند تا از ایجاد دسترسی‌های بدون تراز توسط کامپایلر جلوگیری کند، بنابراین در این مورد باید خوب باشد، اما لزوماً اینطور نیست.
ja: アラインされていないアクセスがフォールトになります。我々はコンパイラがアラインされていないアクセスを生成しないように`+strict-align`オプション を設定する`aarch64-unknown-none` ターゲット向けにRustコードをビルドします。そのためここでは問題にはなりませんが、一般的にはそうとは言えません。
pt_br: Os acessos não alinhados falharão. Construímos o código Rust para o alvo `aarch64-unknown-none` que define `+strict-align` para evitar que o compilador gere acessos não alinhados, portanto, deve estar tudo bem neste caso, mas este não é necessariamente o caso em geral.
uk: Невирівняні доступи призведуть до помилки. Ми створюємо код Rust для цілі `aarch64-unknown-none`, яка встановлює `+strict-align`, щоб запобігти створенню компілятором невирівняних доступів, тому в цьому випадку це має бути гаразд, але це не обов’язково так загалом.

source: If it were running in a VM, this can lead to cache coherency issues. The problem is that the VM is accessing memory directly with the cache disabled, while the host has cacheable aliases to the same memory. Even if the host doesn't explicitly access the memory, speculative accesses can lead to cache fills, and then changes from one or the other will get lost when the cache is cleaned or the VM enables the cache. (Cache is keyed by physical address, not VA or IPA.)
es: Si se estuviera ejecutando en una máquina virtual, podría provocar problemas de coherencia en la caché. El problema es que la máquina virtual accede a la memoria directamente con la caché inhabilitada, mientras que el host cuenta con alias que se pueden almacenar en caché en la misma memoria. Incluso si el host no accede explícitamente a la memoria, los accesos especulativos pueden provocar que se llene la caché, haciendo que los cambios de uno u otro se pierdan cuando se borre la caché o cuando la máquina virtual la habilite. (La caché está codificada por dirección física, no por VA ni IPA).
fa: اگر در VM اجرا می‌شد، این کار می‌تواند منجر به مشکلات انسجام cache شود. مشکل این است که VM مستقیماً با حافظه cache غیرفعال شده به حافظه دسترسی پیدا می‌کند، در حالی که host دارای نام مستعار قابل cache برای همان حافظه است. حتی اگر cache به طور صریح به حافظه دسترسی نداشته باشد، دسترسی‌های گمانه‌زنی می‌تواند منجر به پر شدن حافظه cache شود، و پس از پاک شدن حافظه cache یا فعال کردن حافظه توسط VM، تغییرات از یک یا دیگری از بین می‌رود. (حافظه cache با آدرس فیزیکی کلید می‌خورد، نه VA یا IPA.)
ja: もしVM上で実行していたとすると、キャッシュコヒーレンシーの問題を起こすことがあります。問題なのはVMがキャッシュを無効化したまま直接メモリにアクセスしているのに対し、ホストは同じメモリに対してキャッシュ可能なエイリアスを持ってしまうということです。ホストが仮に明示的にメモリにアクセスしないとしても、投機的なアクセスによりキャッシュフィルが起きることがあります。そうなると、ホストがキャッシュをフラッシュするかVMがキャッシュを有効化したときに、VMかホストのどちらかによる変更が失われてしまいます。（キャッシュは仮想アドレスやIPAではなく物理アドレスをキーとしてアクセスされます）
pt_br: Se estivesse sendo executado em uma VM, isso pode levar a problemas de coerência de cache. O problema é que a VM está acessando a memória diretamente com o cache desabilitado, enquanto o host tem aliases cacheáveis ​​para a mesma memória. Mesmo que o host não acesse explicitamente a memória, acessos especulativos podem levar a preenchimentos de cache e, em seguida, alterações de um ou de outro serão perdidas quando o cache for limpo ou a VM habilitar o cache. (O cache é indexado pelo endereço físico, não VA ou IPA.)
uk: Якщо це було запущено у віртуальній машині, це може призвести до проблеми з узгодженістю кешу. Проблема полягає в тому, що віртуальна машина звертається до пам'яті безпосередньо з вимкненим кешем, в той час як хост має кешовані псевдоніми до тієї ж пам'яті. Навіть якщо хост не має явного доступу до пам’яті, спекулятивні доступи можуть призвести до заповнення кешу, а потім зміни з того чи іншого будуть втрачені, коли кеш буде очищено або віртуальна машина ввімкне кеш. (Кеш використовується за фізичною адресою, а не VA чи IPA.)

source: For simplicity, we just use a hardcoded pagetable (see `idmap.S`) which identity maps the first 1 GiB of address space for devices, the next 1 GiB for DRAM, and another 1 GiB higher up for more devices. This matches the memory layout that QEMU uses.
es: Para simplificar, solo se utiliza una tabla de páginas codificada (consulta `idmap.S`) que mapea la identidad del primer GiB de espacio de direcciones para dispositivos, el siguiente GiB para DRAM y otro GiB más para más dispositivos. Esto coincide con la disposición de memoria que utiliza QEMU.
fa: برای سادگی، ما فقط از یک pagetable کدگذاری شده استفاده می کنیم (به`idmap.S` مراجعه کنید) که ۱ گیگابایت اول فضای آدرس را برای دستگاه‌ها، ۱ گیگابایت بعدی را برای DRAM و ۱ گیگابایت دیگر را برای دستگاه‌های بیشتر نگاشت می‌کند. این با چیدمان حافظه‌ای که QEMU استفاده می‌کند مطابقت دارد.
ja: 単純化のために、ハードコードしたページテーブル（`idmap.S`参照）を利用します。このページテーブルは最初の1GiBをデバイス用に、次の1GiBをDRAM用に、次の1GiBをさらなるデバイス用に透過的にマップします。これはQEMUのメモリレイアウトに合致します。
pt_br: Para simplificar, usamos apenas uma tabela de páginas codificada (consulte `idmap.S`) que mapeia a identidade dos primeiros 1 GiB do espaço de endereços para dispositivos, os próximos 1 GiB para DRAM e mais 1 GiB mais acima para mais dispositivos. Isso corresponde ao layout de memória que o QEMU usa.
uk: Для спрощення ми просто використовуємо жорстко закодовану таблицю сторінок (дивиться `idmap.S`), яка ідентифікує перший 1 ГіБ адресного простору для пристроїв, наступний 1 ГіБ для DRAM і ще 1 ГіБ вище для інших пристроїв. Це відповідає розміщенню пам'яті, яке використовує QEMU.

source: We also set up the exception vector (`vbar_el1`), which we'll see more about later.
es: También configuramos el vector de excepción (`vbar_el1`), del que veremos más contenido en próximas dipositivas.
fa: ما همچنین exception vector (`vbar_el1`) را تنظیم کردیم که در ادامه بیشتر در مورد آن خواهیم دید.
ja: 例外ベクタ（`vbar_el1`）も設定します。これに関しては後ほど詳しく見ます。
pt_br: Também configuramos o vetor de exceção (`vbar_el1`), que veremos mais tarde.
uk: Ми також встановили вектор виключень (`vbar_el1`), про який ми розповімо більше пізніше.

source: All examples this afternoon assume we will be running at exception level 1 (EL1). If you need to run at a different exception level you'll need to modify `entry.S` accordingly.
es: Todos los ejemplos de esta tarde se ejecutarán en el nivel de excepción 1 (EL1). Si necesitas ejecutar en un nivel de excepción diferente, deberás modificar `entry.S` según corresponda.
fa: همه مثال‌ها امروز بعد از ظهر فرض می‌کنند که ما در سطح استثنا 1 (EL1) اجرا خواهیم کرد. اگر نیاز به اجرا در سطح استثنایی متفاوت دارید، باید `entry.S`را بر این اساس تغییر دهید.
ja: 今日の午後に扱うすべての例は例外レベル１（EL1）で実行されることを想定しています。もし、別の例外レベルで実行する必要がある場合には、`entry.S`をそれに合わせて変更する必要があります。
pt_br: Todos os exemplos desta tarde assumem que estaremos executando no nível de exceção 1 (EL1). Se você precisar executar em um nível de exceção diferente, você precisará modificar `entry.S` de acordo.
uk: Усі приклади цього дня припускають, що ми будемо працювати на рівні виключення 1 (EL1). Якщо вам потрібно запустити на іншому рівні виключення, вам потрібно буде відповідно змінити `entry.S`.

source: Inline assembly
es: Ensamblaje integrado
ja: インラインアセンブリ
ko: 인라인 어셈블리
pt_br: Assembly inline
uk: Вбудований асемблер

source: Sometimes we need to use assembly to do things that aren't possible with Rust code. For example, to make an HVC (hypervisor call) to tell the firmware to power off the system:
fa: گاهی اوقات برای انجام کارهایی که با کد Rust امکان پذیر نیست، باید از اسمبلی استفاده کنیم. به عنوان مثال، برای برقراری یک HVC (hypervisor call) نایز است که به firmware بگویید سیستم را خاموش کند:
ja: 時折Rustコードでは書けないことを行うためにアセンブリ言語を使う必要があります。例えば、電源を落とすためにファームウェアに対してHVC（ハイパーバイザコール）を発行する場合です：
pt_br: Às vezes, precisamos usar assembly para fazer coisas que não são possíveis com o código Rust. Por exemplo, para fazer uma chamada HVC (hypervisor call) para informar ao firmware para desligar o sistema:
uk: Іноді нам потрібно використовувати асемблер для того, щоб робити речі, які неможливо зробити за допомогою коду на Rust. Наприклад, зробити HVC (виклик гіпервізора), щоб сказати прошивці вимкнути систему:

source: // SAFETY: this only uses the declared registers and doesn't do anything // with memory.
uk: // БЕЗПЕКА: тут використовуються тільки оголошені регістри // і нічого не робиться з пам'яттю.

source: (If you actually want to do this, use the [`smccc`](https://crates.io/crates/smccc) crate which has wrappers for all these functions.)
es: (Si realmente quieres hacer esto, utiliza el crate [`smccc`](https://crates.io/crates/smccc) que tiene envoltorios para todas estas funciones).
fa: (اگر واقعاُ می‌خواهید این کار را انجام دهید، از crate مربوطه [`smccc`](https://crates.io/crates/smccc) استفاده کنید که دارای بسته‌بندی(wrapper) برای همه این عملکردها است.)
ja: （もし実際に電源を落とすプログラムを書きたい場合は、これらのすべての機能に対するラッパーを提供している[`smccc`](https://crates.io/crates/smccc)を使うと良いでしょう。）
ko: 실제로 이를 실행하려면 이러한 모든 함수를 위한 래퍼가 포함된 [`smccc`](https://crates.io/crates/smccc) 크레이트를 사용하세요.
pt_br: (Se você realmente quiser fazer isso, use o _crate_ [`smccc`](https://crates.io/crates/smccc) que possui wrappers para todas essas funções.)
uk: (Якщо ви справді хочете це зробити, скористайтеся крейтом [`smccc`](https://crates.io/crates/smccc), у якому є оболонки для всіх цих функцій.)

source: PSCI is the Arm Power State Coordination Interface, a standard set of functions to manage system and CPU power states, among other things. It is implemented by EL3 firmware and hypervisors on many systems.
es: PSCI es la interfaz de coordinación de estado de alimentación de Arm, un conjunto estándar de funciones para gestionar los estados de alimentación del sistema y de la CPU, entre otras cosas. Lo implementan el firmware EL3 y los hipervisores en muchos sistemas.
fa: ‏ PSCI یک رابط هدایت‌گر Arm Power State است که مجموعه‌ای استاندارد از توابع برای مدیریت وضعیت‌های power در سیستم و CPU بوده، از جمله موارد دیگری از این مورد توسط میان‌افزار EL3 و hypervisor در بسیاری از سیستم‌ها پیاده سازی شده است.
ja: PSCI はArmのPower State Coordination Interfaceのことであり、これはシステムやCPU電力状態管理の機能を含む標準的なセットです。これは多くのシステムでEL3ファームウェアとハイパーバイザにより実装されています。
ko: PSCI (Power State Coordination Interface)는 시스템 및 CPU 전원 상태를 관리하는 Arm의 표준 인터페이스입니다. 이 인터페이스는 EL3 펌웨어와 하이퍼바이저에 의해 구현됩니다.
pt_br: PSCI é a Interface de Coordenação de Estado de Energia Arm, um conjunto padrão de funções para gerenciar estados de energia do sistema e da CPU, entre outras coisas. É implementado pelo firmware EL3 e hipervisores em muitos sistemas.
uk: PSCI — це Arm Power State Coordination Interface, стандартний набір функцій для керування станами живлення системи та CPU, серед іншого. Він реалізований прошивкою EL3 і гіпервізорами на багатьох системах.

source: The `0 => _` syntax means initialise the register to 0 before running the inline assembly code, and ignore its contents afterwards. We need to use `inout` rather than `in` because the call could potentially clobber the contents of the registers.
es: La sintaxis `0 => _` significa inicializar el registro a 0 antes de ejecutar el código de ensamblaje integrado e ignorar su contenido después. Necesitamos utilizar `inout` en lugar de `in` porque la llamada podría alterar el contenido de los registros.
fa: یک `0 => _` syntax به این معنی است که رجیستر را قبل از اجرای کد اسمبلی درون خطی به 0 مقداردهی کنید و پس از آن محتوای آن را نادیده بگیرید. ما باید از `inout` به جای `in` استفاده کنیم زیرا این فراخوانی به طور بالقوه می‌تواند محتویات رجیسترها را مخدوش کند.
ja: `0 => _` というシンタックスは、インラインアセンブリを実行する前にレジスタをゼロで初期化し、実行後はその値は気にしないということを示しています。`in`ではなく`inout`を使う必要があるのは、この実行でレジスタの値を上書きしてしまう可能性があるからです。
ko: `0 => _` 문법은 인라인 어셈블리 코드를 실행하기 전에 레지스터를 0으로 초기화하고 그 후에는 그 레지스터의 값을 무시함을 의미합니다. 호출 시 레지스터의 값이 덮어 써질 수 있으므로 `in` 대신 `inout`을 사용해야 합니다.
pt_br: A sintaxe `0 => _` significa inicializar o registrador com 0 antes de executar o código de assembly inline e ignorar seu conteúdo posteriormente. É necessário usar `inout` em vez de `in` porque a chamada pode potencialmente destruir o conteúdo dos registradores.
uk: Синтаксис `0 => _` означає ініціалізацію реєстру до 0 перед виконанням вбудованого асемблеру та ігнорування його вмісту після цього. Нам потрібно використовувати `inout`, а не `in`, оскільки виклик потенційно може знищити вміст реєстрів.

source: This `main` function needs to be `#[no_mangle]` and `extern "C"` because it is called from our entry point in `entry.S`.
es: Esta función `main` debe ser `#[no_mangle]` y `extern "C"`, ya que se llama desde nuestro punto de entrada en `entry.S`.
fa: این تابع `main` باید به صورت`#[no_mangle]` و `extern "C"` باشد زیرا از نقطه ورودی (entry point) ما در `entry.S` فراخوانی می‌شود.
ja: この `main` 関数は`entry.S`にあるエントリポイントから呼ばれるため、`#[no_mangle]`と`extern "C"`を必要とします。
ko: 이 `main` 함수는 `#[no_mangle]` 및 `extern "C"`여야 합니다. 왜냐하면 이 함수는 Rust 코드가 아닌, 어셈블러로 작성된 `entry.S`에서 호출되기 때문입니다.
pt_br: Esta função `main` precisa ser `#[no_mangle]` e `extern "C"` porque é chamada de nosso ponto de entrada em `entry.S`.
uk: Ця `main` функція має бути `#[no_mangle]` і `extern "C"`, оскільки вона викликається з нашої точки входу в `entry.S`.
