Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: It is not possible to forget to acquire the mutex before accessing the protected data.
es: No es posible olvidarse de adquirir la exclusión mutua antes de acceder a los datos protegidos.
fa: نمی‌توان قبل از دسترسی به داده‌های محافظت شده یا protected، دسترسی mutex را فراموش کرد.
ja: 保護されたデータにアクセスする前に、ミューテックスを確保し忘れることはありません。
pt_br: Não é possível esquecer de adquirir o mutex antes de acessar os dados protegidos.
uk: Неможливо забути отримати м'ютекс перед доступом до захищених даних.

source: You can get an `&mut T` from an `&Mutex<T>` by taking the lock. The `MutexGuard` ensures that the `&mut T` doesn't outlive the lock being held.
es: Puedes obtener un `&mut T` de `Mutex<T>` mediante el bloqueo. El `MutexGuard` asegura que `&mut T` no dure más tiempo que el bloqueo que se ha aplicado.
fa: با گرفتن lock می‌توانید `&mut T` را از `&Mutex<T>` دریافت کنید.`MutexGuard` تضمین می‌کند که`&mut T` بیشتر از قفل نگه‌داشته شده، موجود نمی‌ماند.
ja: `&Mutex<T>` からロックを取得することで、`&mut T`を得ることができます。この`MutexGuard`は`&mut T`が保持されているロックよりも長く存続しないことを保証します。
pt_br: Você pode obter um `&mut T` de um `&Mutex<T>` obtendo um _lock_. O `MutexGuard` garante que o `&mut T` não sobrevive além do _lock_ obtido.
uk: Ви можете отримати `&mut T` від `&Mutex<T>`, взявши блокування. `MutexGuard` гарантує, що `&mut T` не переживе утримуване блокування.

source: `Mutex<T>` implements both `Send` and `Sync` iff (if and only if) `T` implements `Send`.
es: `Mutex<T>` implementa tanto `Send` como `Sync` únicamente si `T` implementa `Send`.
fa: ‏`Mutex<T>` هر دوی پیاده سازی `Send` و `Sync` iff (فقط و فقط) `T` از `Send` استفاده‌ می‌کنند.
ja: `T`が`Send`を実装している場合で、かつその場合に限り、`Mutex<T>` は`Send`と`Sync`の両方を実装します。
pt_br: `Mutex<T>` implementa ambos `Send` e `Sync` sse (se e somente se) `T` implementa `Send`.
uk: `Mutex<T>` реалізує як `Send`, так і `Sync` тоді (тоді і тільки тоді) коли `T` реалізує `Send`.

source: A read-write lock counterpart: `RwLock`.
fa: ‏ همتای قفل خواندن و نوشتن: `RwLock`.
ja: 読み書きのロックの場合に対応するものがあります： `RwLock`。
pt_br: Um _lock_ para leitura e gravação: `RwLock`.
uk: Аналог блокування читання-запису: `RwLock`.

source: Why does `lock()` return a `Result`?
fa: چرا `lock()` یک`Result` برمی‌گرداند؟
ja: なぜ`lock()`は`Result`を返すのでしょう？
pt_br: Por que `lock()` retorna um `Result`?
uk: Чому `lock()` повертає `Result`?

source: If the thread that held the `Mutex` panicked, the `Mutex` becomes "poisoned" to signal that the data it protected might be in an inconsistent state. Calling `lock()` on a poisoned mutex fails with a [`PoisonError`](https://doc.rust-lang.org/std/sync/struct.PoisonError.html). You can call `into_inner()` on the error to recover the data regardless.
es: Si el hilo que contiene `Mutex` entra en pánico, `Mutex` se "envenena" para indicar que los datos que protegía pueden estar en un estado incoherente. Llamar a `lock()` en una exclusión mutua envenenada da el error [`PoisonError`](https://doc.rust-lang.org/std/sync/struct.PoisonError.html). Puedes llamar a `into_inner()` en el error para recuperar los datos de todos modos.
fa: اگر threadای که `Mutex` را نگه می‌دارد دچار panic شود، `Mutex` «مسموم/poisoned» می‌شود تا نشان دهد که داده‌هایی که محافظت می‌کند ممکن است در وضعیت ناسازگاری باشند. فراخوانی `lock()` در یک mutex مسموم با یک [«PoisonError»] (https://doc.rust-lang.org/std/sync/struct.PoisonError.html) انجام نمی‌شود. می‌توانید `into_inner()` را در مورد خطا برای بازیابی داده‌ها بدون توجه به آن فراخوانی کنید.
ja: Mutex`を保持したスレッドがパニックを起こした場合、保護すべきデータが整合性の欠けた状態にある可能性を伝えるため、`Mutex`は「ポイゾンされた」（"poisoned"）状態になります。ポイゾンされたMutexに対して `lock()` をコールすると、[`PoisonError`](https://doc.rust-lang.org/std/sync/struct.PoisonError.html)とともに失敗します。`into_inner()` を用いることで、そのエラーにおいて、とりあえずデータを回復することはできます。
pt_br: Se o thread que manteve o `Mutex` entrou em pânico, o `Mutex` torna-se "envenenado" para sinalizar que os dados protegidos podem estar em um estado inconsistente. Chamar `lock()` em um mutex envenenado falha com um [`PoisonError`](https://doc.rust-lang.org/std/sync/struct.PoisonError.html). Você pode chamar `into_inner()` no erro para recuperar os dados de qualquer maneira.
uk: Якщо потік, який утримував `Mutex`, запанікував, `Mutex` стає "отруєним", сигналізуючи про те, що дані, які він захищає, можуть перебувати в неузгодженому стані. Виклик `lock()` для отруєнного м’ютексу зазнає невдачі з [`PoisonError`](https://doc.rust-lang.org/std/sync/struct.PoisonError.html). Ви можете викликати `into_inner()` для помилки, щоб відновити дані незалежно від цього.

source: Let us see `Arc` and `Mutex` in action:
es: Veamos cómo funcionan `Arc` y `Mutex`:
fa: اجازه دهید `Arc` و `Mutex` را در عمل ببینیم:
ja: `Arc` と `Mutex` の動作を見てみましょう：
ko: `Arc`와 `Mutex`의 동작을 살펴봅시다:
pt_br: Vamos ver `Arc` e `Mutex` em ação:
uk: Давайте подивимося на `Arc` і `Mutex` в дії:

source: Possible solution:
es: Solución posible:
fa: راه‌حل ممکن:
ja: 考えられる対処法：
ko: 가능한 해결책:
pt_br: Solução possível:
uk: Можливе рішення:

source: Notable parts:
es: Puntos a destacar:
fa: بخش‌های قابل توجه:
ja: 注目するとよい箇所：
ko: 눈여겨 볼 부분:
pt_br: Partes notáveis:
uk: Визначні частини:

source: `v` is wrapped in both `Arc` and `Mutex`, because their concerns are orthogonal.
es: `v` se envuelve tanto en `Arc` como en `Mutex`, porque sus preocupaciones son ortogonales.
fa: ‏ `v` در `Arc` و `Mutex` احاطه می‌شود، زیرا مسائل آنها شبیه به هم است.
ja: `v`は `Arc` と `Mutex`の両方でラップされています。なぜなら、それらの関心は互いに独立なものであるからです。
ko: `v`는 `Arc`와 `Mutex` 모두에 포함되어 있습니다. 이는 `Arc`와 `Mutex`가 서로 완전히 다른 문제를 위한 도구이기 때문입니다.
pt_br: `v` é agrupado em ambos `Arc` e `Mutex`, porque seus interesses são ortogonais.
uk: `v` обертається як в `Arc`, так і в `Mutex`, тому що їхні інтереси ортогональні.

source: Wrapping a `Mutex` in an `Arc` is a common pattern to share mutable state between threads.
es: Envolver un `Mutex` en un `Arc` es un patrón habitual para compartir el estado mutable entre hilos.
fa: قرار دادن یک `Mutex` در یک `Arc` یک الگوی رایج برای به اشتراک گذاشتن حالت قابل تغییر (mutable) بین threadها است.
ja: `Mutex`を`Arc`でラップすることは、スレッド間でミュータブルな状態を共有するためによく見られるパターンです。
ko: `Mutex`를 `Arc`로 래핑하는 것은 가변 상태를 스레드들 간에 공유할 때 흔히 사용하는 패턴입니다.
pt_br: Envolver um `Mutex` em um `Arc` é um padrão comum para compartilhar estado mutável entre threads.
uk: Обгортання `Mutex` в `Arc` є загальним шаблоном для обміну змінним станом між потоками.

source: `v: Arc<_>` needs to be cloned as `v2` before it can be moved into another thread. Note `move` was added to the lambda signature.
es: `v: Arc<_>` se debe clonar como `v2` antes de poder moverlo a otro hilo. Ten en cuenta que `move` se ha añadido a la firma lambda.
fa: ‏ `v: Arc<_>` باید به عنوان `v2` کلون شود تا بتوان آن را به thread دیگری منتقل کرد. نکته `move` به lambda signature اضافه شد.
ja: `v: Arc<_>`は別のスレッドにムーブされる前に、`v2`としてクローンされる必要があります。`move` がラムダ式に追加されたことに注意してください。
ko: `v: Arc<_>`를 다른 스레드에서 사용하려면, 먼저 `v2`로 복사를 하고 이를 그 스레드로 이동 해야 합니다. 그래서 람다의 시그니처에 `move`가 있는 것입니다.
uk: `v: Arc<_>` потрібно клонувати як `v2`, перш ніж це можна буде перемістити в інший потік. Зверніть увагу, що до сигнатури лямбда було додано `move`.

source: Blocks are introduced to narrow the scope of the `LockGuard` as much as possible.
es: Se introducen bloqueos para limitar al máximo el ámbito de `LockGuard`.
fa: بلوک‌ها برای محدود کردن دامنه `LockGuard` تا حد امکان معرفی شده‌اند.
ja: ブロックは`LockGuard`のスコープを可能な限り狭めるために導入されています。
ko: 블록은 `LockGuard`의 범위를 최대한 좁히기 위해 사용되었습니다.
pt_br: Os blocos são introduzidos para restringir o escopo do `LockGuard` tanto quanto possível.
uk: Блоки вводяться для того, щоб максимально звузити область використання `LockGuard`.

source: The dining philosophers problem is a classic problem in concurrency:
es: El problema de la cena de los filósofos es un problema clásico de concurrencia:
fa: مسئله ناهار خوردن فیلسوفان، در واقع یک مسئله کلاسیک concurrency است:
ja: 食事する哲学者の問題は、並行性に関する古典的な問題です。
ko: 식사하는 철학자 문제는 동시성에 있어서 고전적인 문제입니다:
pt_br: O problema do jantar dos filósofos é um problema clássico em concorrência:
uk: Проблема вечері філософів - це класична проблема одночасного виконання:

source: Five philosophers dine together at the same table. Each philosopher has their own place at the table. There is a fork between each plate. The dish served is a kind of spaghetti which has to be eaten with two forks. Each philosopher can only alternately think and eat. Moreover, a philosopher can only eat their spaghetti when they have both a left and right fork. Thus two forks will only be available when their two nearest neighbors are thinking, not eating. After an individual philosopher finishes eating, they will put down both forks.
es: Cinco filósofos cenan juntos en la misma mesa. Cada filósofo tiene su propio sitio en ella. Hay un tenedor entre cada plato. El plato que van a degustar es una especie de espaguetis que hay que comer con dos tenedores. Los filósofos solo pueden pensar y comer alternativamente. Además, solo pueden comer sus espaguetis cuando disponen de un tenedor a la izquierda y otro a la derecha. Por tanto, los dos tenedores solo estarán disponibles cuando su dos vecinos más cercanos estén pensando y no comiendo. Cuando un filósofo termina de comer, deja los dos tenedores en la mesa.
fa: پنج فیلسوف در کنار هم دور یک میز غذا می‌خورند. هر فیلسوف جایگاه خاص خود را در میز دارد. بین هر بشقاب یک چنگال قرار دارد. غذایی که سِرو می‌شود نوعی اسپاگتی است که باید با دو چنگال خورده شود. هر فیلسوف فقط می‌تواند به طور متناوب فکر کند و غذا بخورد. علاوه بر این، یک فیلسوف فقط می‌تواند اسپاگتی خود را زمانی بخورد که هم چنگال چپ و هم چنگال راست را داشته باشد؛ بنابراین دو چنگال فقط زمانی در دسترس خواهد بود که دو همسایه نزدیک آنها در حال فکرکردن باشند و نه در حال غذاخوردن. پس از اینکه یک فیلسوف غذاخوردن را تمام کرد، هر دو چنگال را پایین می‌گذارد.
ja: 5 人の哲学者が同じテーブルで食事をしています。それぞれの哲学者がテーブルの定位置に座り、皿の間にはフォークが 1 本置かれています。提供される料理はスパゲッティで、2 本のフォークで食べる必要があります。哲学者は思索と食事を交互に繰り返すことしかできません。さらに、哲学者は左右両方のフォークを持っている場合にのみ、スパゲッティを食べることができます。したがって、2 つのフォークは、両隣の哲学者が食べるのではなく考えている場合にのみ使用できます。それぞれの哲学者は、食べ終わった後、両方のフォークを置きます。
ko: 5명의 철학자가 원탁에서 식사를 하고 있습니다. 철학자는 원탁에서 자신의 자리에 앉아있습니다. 포크는 각 접시 사이에 있습니다. 제공되는 요리를 먹기 위해서는 두 개의 포크를 모두 사용해야합니다. 철학자는 생각을 하다가 배가 고프면 자신의 좌,우의 포크를 들어 요리를 먹습니다. 철학자는 요리를 먹은 후에는 포크를 다시 자리에 내려놓습니다. 철학자는 자신의 좌,우에 포크가 있을때만 요리를 먹을 수 있습니다. 따라서 두 개의 포크는 오직 자신의 좌,우 철학자가 생각을 할 때만 사용할 수 있습니다.
pt_br: Cinco filósofos jantam juntos na mesma mesa. Cada folósofo tem seu próprio lugar à mesa. Há um garfo entre cada prato. O prato servido é uma espécie de espaguete que se come com dois garfos. Cada filósofo pode somente pensar ou comer, alternadamente. Além disso, um filósofo só pode comer seu espaguete quando ele têm garfo esquerdo e direito. Assim, dois garfos só estarão disponíveis quando seus dois vizinhos mais próximos estiverem pensando, não comendo. Depois de um filósofo individual termina de comer, ele abaixa os dois garfos.
uk: П'ятеро філософів вечеряють разом за одним столом. У кожного філософа своє місце за столом. Між кожною тарілкою є виделка. Страва, що подається, являє собою різновид спагетті, яке потрібно їсти двома виделками. Кожен філософ може лише поперемінно мислити і їсти. Крім того, філософ може їсти свої спагетті лише тоді, коли у нього є і ліва, і права виделка. Таким чином, дві виделки будуть доступні лише тоді, коли його найближчі сусіди думають, а не їдять. Після того, як окремий філософ закінчує їсти, він кладе обидві виделки.

source: You will need a local [Cargo installation](../../cargo/running-locally.md) for this exercise. Copy the code below to a file called `src/main.rs`, fill out the blanks, and test that `cargo run` does not deadlock:
es: Para realizar este ejercicio necesitarás una \[instalación local de Cargo\] (../../cargo/running-locally.md). Copia el fragmento de código que aparece más abajo en un archivo denominado `src/main.rs`, rellena los espacios en blanco y comprueba que `cargo run` no presenta interbloqueos:
fa: برای این تمرین به یک [Cargo installation](../../cargo/running-locally.md) محلی نیاز دارید. کد زیر را در فایلی به نام `src/main.rs` کپی کنید، جاهای خالی را پر کنید و آزمایش کنید که `cargo run` به بن‌بست (deadlock) نمی‌خورد:
ja: この演習では、ローカルの [Cargo インストール](../../cargo/running-locally.md)が必要です。以下のコードを `src/main.rs` というファイルにコピーし、空欄を埋めて、`cargo run` がデッドロックしないことを確認します。
pt_br: Você precisará de uma [instalação local do Cargo](../../cargo/running-locally.md) para esse exercício. Copie o código abaixo para um arquivo chamado `src/main.rs`, preencha os espaços em branco e teste se `cargo run` não entra em _deadlock_:
uk: Для цієї вправи вам знадобиться локальний [встановленний Cargo](../../cargo/running-locally.md). Скопіюйте наведений нижче код у файл під назвою `src/main.rs`, заповніть порожні поля та перевірте, чи `cargo run` не блокує:

source: "Eureka! {} has a new idea!"
fa: "ایول! {} یک ایده جدید!"
pt_br: "Eureka! {} tem uma nova ideia!"
uk: "Еврика! {} має нову ідею!"

source: // Pick up forks...
pt_br: // Peguem os garfos...
uk: // Беремо виделки...

source: "{} is eating..."
pt_br: "{} está comendo..."
uk: "{} їсть..."

source: "Socrates"
pt_br: "Sócrates"
uk: "Сократ"

source: "Hypatia"
pt_br: "Hipátia"
uk: "Гіпатія"

source: "Plato"
pt_br: "Platão"
uk: "Платоне"

source: "Aristotle"
pt_br: "Aristóteles"
uk: "Аристотель"

source: "Pythagoras"
pt_br: "Pitágoras"
uk: "Піфагор"

source: // Create forks
ja: // フォークを作成する
pt_br: // Criem os garfos
uk: // Створюємо виделки

source: // Create philosophers
ja: // 哲学者を作成する
pt_br: // Criem os filósofos
uk: // Створюємо філософів

source: // Make each of them think and eat 100 times
ja: // それぞれの哲学者が思索と食事を 100 回行うようにする
pt_br: // Façam cada um deles pensar e comer 100 vezes
uk: // Змусимо кожного з них подумати і з'їсти 100 разів

source: // Output their thoughts
ja: // 哲学者の思索を出力する
pt_br: // Imprimam seus pensamentos
uk: // Вивести свої думки

source: You can use the following `Cargo.toml`:
es: Puedes usar el siguiente archivo `Cargo.toml`:
fa: می توانید از `Cargo.toml` زیر استفاده کنید:
ja: 次の `Cargo.toml` を使用できます。
pt_br: Você pode usar o seguinte `Cargo.toml`
uk: Ви можете використовувати наступний `Cargo.toml`:

source: Let us use our new knowledge to create a multi-threaded link checker. It should start at a webpage and check that links on the page are valid. It should recursively check other pages on the same domain and keep doing this until all pages have been validated.
es: Utilicemos nuestros nuevos conocimientos para crear un comprobador de enlaces multihilo. Debería empezar en una página web y comprobar que los enlaces de la página son válidos. Debería consultar otras páginas del mismo dominio y seguir haciéndolo hasta que todas las páginas se hayan validado.
fa: اجازه دهید از دانش جدید خود برای ایجاد یک جستجوگر لینک multi-thread استفاده کنیم. باید از یک صفحه وب شروع شود و بررسی کنید که لینک‌های موجود در صفحه معتبر هستند. باید به‌صورت بازگشتی صفحات دیگر را در همان دامنه بررسی کند و این کار را تا زمانی که همه صفحات تأیید نشده‌اند ادامه دهد.
ja: 新たに身に付けた知識を活かして、マルチスレッド リンク チェッカーを作成しましょう。まず、ウェブページ上のリンクが有効かどうかを確認する必要があります。同じドメインの他のページを再帰的にチェックし、すべてのページの検証が完了するまでこの処理を繰り返します。
ko: 새로 배운것들을 활용해서 멀티 스레드 링크 검사기를 만듭니다. 이 검사기는 웹페이지 안에 있는 링크들이 유효한지 확인합니다. 그리고 재귀적으로 동일 도메인의 다른 모든 페이지가 유효한지 확인합니다.
pt_br: Vamos usar nosso novo conhecimento para criar um verificador de links _multi-threads_. Comece em uma página da web e verifique se os links na página são válidos. Verifique recursivamente outras páginas no mesmo domínio e continue fazendo isso até que todas as páginas tenham sido validadas.
uk: Давайте використаємо наші нові знання, щоб створити багатопотоковий засіб перевірки лінків. Він має початися з веб-сторінки та перевірити, чи лінкі на сторінці дійсні. Він повинен рекурсивно перевіряти інші сторінки в тому самому домені та продовжувати робити це, доки всі сторінки не будуть перевірені.

source: For this, you will need an HTTP client such as [`reqwest`](https://docs.rs/reqwest/). You will also need a way to find links, we can use [`scraper`](https://docs.rs/scraper/). Finally, we'll need some way of handling errors, we will use [`thiserror`](https://docs.rs/thiserror/).
fa: برای این کار به یک کلاینت HTTP مانند [`reqwest`](https://docs.rs/reqwest/) نیاز دارید. شما همچنین به راهی برای یافتن لینک‌ها نیاز دارید، ما می توانیم از [`reqwest`](https://docs.rs/reqwest/) استفاده کنیم. در نهایت، ما به روشی برای رسیدگی به خطاها نیاز داریم پس درنتیجه از [`thiserror`](https://docs.rs/thiserror/) استفاده خواهیم کرد.
uk: Для цього вам знадобиться HTTP-клієнт, наприклад, [`reqwest`](https://docs.rs/reqwest/). Вам також знадобиться спосіб пошуку лінків, ми можемо використати [`scraper`](https://docs.rs/scraper/). Нарешті, нам знадобиться спосіб обробки помилок, ми скористаємося [`thiserror`](https://docs.rs/thiserror/).

source: Create a new Cargo project and `reqwest` it as a dependency with:
uk: Створіть новий проект Cargo та додайте `reqwest` як залежность з:

source: If `cargo add` fails with `error: no such subcommand`, then please edit the `Cargo.toml` file by hand. Add the dependencies listed below.
es: Si `cargo add` da `error: no such subcommand`, edita el archivo `Cargo.toml` de forma manual. Añade las dependencias que se indican más abajo.
fa: اگر`cargo add` با `error: no such subcommand` ناموفق بود، لطفاً فایل `Cargo.toml` را دستی ویرایش کنید و وابستگی‌های ذکر شده در زیر را اضافه کنید.
ja: `cargo add` が `error: no such subcommand` で失敗する場合は、`Cargo.toml` ファイルを手動で編集してください。下記の依存関係を追加します。
ko: 만일 `cargo add` 커맨드가 `error: no such subcommand` 로 실패한다면 `Cargo.toml` 파일을 직접 수정해도 됩니다. 아래에 전체 의존성 내용이 있습니다.
pt_br: Se `cargo add` falhar com `error: no such subcommand`, edite o arquivo `Cargo.toml` à mão. Adicione as dependências listadas abaixo.
uk: Якщо `cargo add` завершується помилкою `error: no such subcommand`, будь ласка, відредагуйте файл `Cargo.toml` вручну. Додайте перелічені нижче залежності.

source: The `cargo add` calls will update the `Cargo.toml` file to look like this:
es: Las llamadas a `cargo add` actualizarán el archivo `Cargo.toml` para que tenga este aspecto:
fa: فراخوانی‌ها `cargo add` را در فایل `Cargo.toml` به‌صورت زیر به‌روزرسانی می‌کند:
ja: `cargo add` の呼び出しにより、`Cargo.toml` ファイルは次のように更新されます。
ko: 모든 `cargo add`가 끝나면 `Cargo.toml`에 아래 내용이 추가됩니다:
pt_br: As chamadas `cargo add` irão atualizar o arquivo `Cargo.toml` para ficar assim:
uk: Виклики `cargo add` оновлять файл `Cargo.toml` таким чином:

source: You can now download the start page. Try with a small site such as `https://www.google.org/`.
es: Ya puedes descargar la página de inicio. Prueba con un sitio pequeño, como `https://www.google.org/`.
fa: اکنون می توانید صفحه شروع را دانلود کنید. با یک سایت کوچک مانند `https://www.google.org/` امتحان کنید.
ja: これで、スタートページをダウンロードできるようになりました。`https://www.google.org/` のような小規模なサイトで試してみましょう。
ko: 이제 `https://www.google.org/` 같은 웹 페이지를 탐색할 수 있습니다.
pt_br: Agora você pode baixar a página inicial. Tente com um pequeno site como `https://www.google.org/`.
uk: Тепер ви можете завантажити стартову сторінку. Спробуйте з невеликим сайтом, наприклад `https://www.google.org/`.

source: Your `src/main.rs` file should look something like this:
es: El archivo `src/main.rs` debería tener un aspecto similar a este:
fa: فایل `src/main.rs` شما باید چیزی شبیه به این باشد:
ja: `src/main.rs` ファイルは次のようになります。
ko: `rc/main.rs`파일은 아래와 같습니다:
pt_br: Seu arquivo `src/main.rs` deve se parecer com isto:
uk: Ваш файл `src/main.rs` має виглядати приблизно так:

source: "request error: {0}"
uk: "помилка запиту: {0}"

source: "bad http response: {0}"
uk: "погана http відповідь: {0}"

source: "Checking {:#}"
fa: "بررسی {:#}"
pt_br: "Verificando {:#}"
uk: "Перевіряємо {:#}"

source: "On {base_url:#}: ignored unparsable {href:?}: {err}"
pt_br: "Em {base_url:#}: ignorado não analisável {href:?}: {err}"
uk: "На {base_url:#}: проігноровано нерозбірливий {href:?}: {err}"

source: "Links: {links:#?}"
uk: "Лінкі: {links:#?}"

source: "Could not extract links: {err:#}"
fa: "نمی‌تواند لینک را باز کند: {err:#}"
pt_br: "Não foi possível extrair links: {err:#}"
uk: "Не вдалося витягти лінки: {err:#}"

source: Run the code in `src/main.rs` with
es: Ejecuta el código en `src/main.rs` con
fa: این کد را در `src/main.rs` اجرا کنید
ja: `src/main.rs` 内のコードを、次のコマンドで実行します。
ko: 아래 커맨드로 소스를 실행합니다
pt_br: Execute o código em `src/main.rs` com
uk: Запустіть код у `src/main.rs` за допомогою

source: Use threads to check the links in parallel: send the URLs to be checked to a channel and let a few threads check the URLs in parallel.
es: Comprueba los enlaces en paralelo con los hilos: envía las URLs que se van a comprobar a un canal y deja que varios hilos comprueben las URLs en paralelo.
fa: برای بررسی موازی لینک‌ها از threadها استفاده کنید: URLهایی را که باید بررسی شوند به یک channel ارسال کنید و اجازه دهید چند thread به‌صورت موازی URLها را بررسی کنند.
ja: スレッドを使用してリンクを同時にチェックします。つまり、チェックする URL をチャンネルに送信し、いくつかのスレッドで同時に URL を確認します。
ko: 스레드를 사용하여 링크를 병렬로 확인합니다: URL을 채널로 보내서 몇 개의 스레드가 URL을 병렬로 체크하도록 합니다.
pt_br: Use _threads_ para verificar os links em paralelo: envie as URLs a serem verificadas para um _channel_ e deixe alguns _threads_ verificarem as URLs em paralelo.
uk: Використовуйте потоки для паралельної перевірки лінків: надішліть URL-адреси для перевірки на канал і дозвольте кільком потокам перевіряти URL-адреси паралельно.

source: Extend this to recursively extract links from all pages on the `www.google.org` domain. Put an upper limit of 100 pages or so so that you don't end up being blocked by the site.
es: Amplía esta opción para extraer enlaces de todas las páginas del dominio `www.google.org`. Define un límite máximo de 100 páginas para que el sitio no te bloquee.
fa: این را به صورت بازگشتی پیوندها گسترش دهید تا از همه صفحات را در دامنه «www.google.org» استخراج کنید. حد بالا را حدود ۱۰۰ صفحه یا بیشتر قرار دهید تا در نهایت توسط سایت مسدود نشوید.
ja: これを拡張して、`www.google.org` ドメインのすべてのページからリンクを再帰的に抽出します。サイトがブロックされないように、ページ数の上限を 100 程度に設定します。
ko: `www.google.org`도메인의 모든 페이지를 재귀적으로 확인하기 위해 코드를 확장해서 작성합니다: 차단당하지 않도록 100페이지 정도로 제한을 두시기 바랍니다.
pt_br: Estenda isso para extrair recursivamente links de todas as páginas no domínio `www.google.org`. Coloque um limite máximo de 100 páginas ou menos para que você não acabe sendo bloqueado pelo site.
uk: Розширте це, щоб рекурсивно отримувати лінкі з усіх сторінок домену `www.google.org`. Встановіть верхню межу приблизно в 100 сторінок, щоб вас не заблокував сайт.

source: "{} is trying to eat"
pt_br: "{} está tentando comer"
uk: "{} намагається їсти"

source: // To avoid a deadlock, we have to break the symmetry // somewhere. This will swap the forks without deinitializing // either of them.
ja: // デッドロックを避けるために、どこかで対称性を // 崩す必要があります。下記のコードでは、 // 領域を開放することなく2つのフォークを交換します。
pt_br: // Para evitar um _deadlock_, temos que quebrar a simetria // em algum lugar. Isso trocará os garfos sem desinicializar // nenhum deles.
uk: // Щоб уникнути глухого кута, ми повинні порушити симетрію // десь. Це дозволить поміняти місцями виделки без деініціалізації // жодної з них.

source: Link Checker
es: Comprobador de Enlaces
fa: جستجوگر Link
pt_br: Verificador de Links
uk: Перевірка лінків

source: /// Determine whether links within the given page should be extracted.
ja: /// 指定されたページ内のリンクを抽出するかどうかを決定します。
pt_br: /// Determine se os links dentro da página fornecida devem ser extraídos.
uk: /// Визначаємо, чи потрібно витягувати лінки на даній сторінці.

source: /// Mark the given page as visited, returning false if it had already /// been visited.
ja: /// 指定されたページを訪問済みとしてマークし、すでに訪問済みであれば /// false を返します。
pt_br: /// Marque a página fornecida como visitada, retornando falso se ela já /// tiver sido visitada.
uk: /// Відмітимо дану сторінку як відвідану, повернувши false, якщо вона вже /// була відвідана.
