Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: For a parameter, `impl Trait` is like an anonymous generic parameter with a trait bound.
es: En el caso de los parámetros, `impl Trait` es como un parámetro genérico anónimo con un límite de trait.
fa: برای یک پارامتر، `impl Trait` شبیه به یک پارامتر generic ناشناخته با یک محدودیت trait است.
ja: パラメタに対しては、`impl Trait`は、トレイト境界を持つ匿名のジェネリックパラメタのようなものです。
ko: 함수 인자의 타입으로 사용되었을 경우에는 `impl Trait`는 트레잇 경계가 있는 익명의 제네릭 타입을 의미합니다.
pt_br: Como parâmetro, o _trait_ `impl` é como um parâmetro genérico anônimo com um limitador de características (trait).
uk: У випадку параметра, `impl Trait` - це як анонімний загальний параметрp з обмеженням трейту.

source: For a return type, it means that the return type is some concrete type that implements the trait, without naming the type. This can be useful when you don't want to expose the concrete type in a public API.
es: En el caso de un tipo de resultado devuelto, significa que este es un tipo concreto que implementa el trait, sin nombrar el tipo. Esto puede ser útil cuando no quieres exponer el tipo concreto en una API pública.
fa: برای تایپ بازگشتی، به این معناست که تایپ بازگشتی تایپ مشخصی است که trait را پیاده‌سازی می‌کند، بدون اینکه تایپ را نام ببرید. این می‌تواند زمانی مفید باشد که نمی‌خواهید تایپ مشخص را در یک API عمومی افشا کنید.
ja: 返り値の型に用いる場合は、特定のトレイトを実装する何らかの具象型を返すが、具体的な型名は明示しないということを意味します。このことは公開されるAPIに具象型を晒したくない場合に便利です。
ko: 리턴 타입으로 사용되었을 경우에는, 그 트레잇을 구현하는 구체적인 타입인데, 타입 이름을 프로그래머가 짓지 않았다는 것을 의미합니다. 이는 그 구체적인 타입 이름을 API로 공개하고 싶지 않은 경우에 유용합니다.
pt_br: Como tipo de retorno, significa que o tipo de retorno é algum tipo concreto que implementa o _trait_, sem nomear o tipo. Isso pode ser útil quando você não deseja expor o tipo concreto em uma API pública.
uk: Для типу, що повертається, це означає, що тип, що повертається, є деяким конкретним типом, який реалізує трейт, без назви типу. Це може бути корисно, коли ви не хочете викривати конкретний тип у публічному API.

source: Inference is hard in return position. A function returning `impl Foo` picks the concrete type it returns, without writing it out in the source. A function returning a generic type like `collect<B>() -> B` can return any type satisfying `B`, and the caller may need to choose one, such as with `let x: Vec<_> = foo.collect()` or with the turbofish, `foo.collect::<Vec<_>>()`.
es: La inferencia es más complicada en la posición de retorno. Una función que devuelve `impl Foo` elige el tipo concreto que devuelve, sin escribirlo en el código fuente. Una función que devuelve un tipo genérico como `collect<B>() -> B` puede devolver cualquier tipo que cumpla `B`, y es posible que el llamador tenga que elegir uno, como con `let x: Vec<_> = foo.collect()` o con la sintaxis turbofish, `foo.collect::<Vec<_>>()`.
fa: Inference در موقعیت بازگشتی دشوار است. تابعی که `impl Foo` را برمی‌گرداند، تایپ مشخصی را که برمی‌گرداند انتخاب می‌کند، بدون اینکه آن را به طور صریح در منبع بنویسد. تابعی که تایپ generic مانند `collect<B>() -> B` را برمی‌گرداند، می‌تواند هر تایپ که `B` را برآورده می‌کند بازگرداند، و ممکن است فراخوانی‌کننده نیاز به انتخاب یکی از آن‌ها داشته باشد، مانند `let x: Vec<_> = foo.collect()` یا با استفاده از ()<turbofish، `foo.collect::<Vec<_>`.
ja: 返り値の位置における型推論は困難です。`impl Foo`を返す関数は、それが返す具象型はソースコードに書かれることないまま、具象型を選びます。`collect<B>() -> B`のようなジェネリック型を返す関数は、`B`を満たすどのような型でも返すことがあります。 また、関数の呼び出し元はそのような型を一つを選ぶ必要があるかもしれません。 それは、 `let x: Vec<_> = foo.collect()`としたり、turbofishを用いて`foo.collect::<Vec<_>>()`とすることで行えます。
ko: 함수가 리턴되는 곳에서의 타입 추론은 어렵습니다. 어떤 함수의 리턴 타입이 `impl Foo`로 선언되어 있을 경우, 그 함수가 실제로 리턴하는 타입은 소스 코드 상 어디에도 나타나 있지 않습니다. `collect<B<() -> B`와 같이 제너릭 타입을 리턴하는 함수는 `B`를 만족하는 어떤 타입도 리턴할 수 있습니다. 이 경우, 호출하는 측에서는 `let x: Vec<_> = foo.collect()`나 터보피시 문법을 써서 `foo.collect::<Vec<_>>()`와 같이 리턴 타입을 명시적으로 써 주어야 할 수도 있습니다.
pt_br: A inferência é difícil na posição de retorno. Uma função que retorna `impl Foo` escolhe o tipo concreto que retorna, sem escrevê-lo na fonte. Uma função que retorna um tipo genérico como `collect<B>() -> B` pode retornar qualquer tipo que satisfaça `B`, e o chamador pode precisar escolher um, como com `let x: Vec<_> = foo.collect()` ou com o _turbofish_, `foo.collect::<Vec<_>>()`.
uk: У позиції повернення виведення є складним. Функція, що повертає `impl Foo`, вибирає конкретний тип, який вона повертає, не записуючи його у вихідному коді. Функція, що повертає узагальнений тип, наприклад, `collect<B>() -> B`, може повернути будь-який тип, що задовольняє `B`, і користувачеві може знадобитися вибрати один з них, наприклад, за допомогою `let x: Vec<_> = foo.collect()` або turbofish, `foo.collect::<Vec<_>>()`.

source: What is the type of `debuggable`? Try `let debuggable: () = ..` to see what the error message shows.
fa: نوع `debuggable` چیست؟ سعی کنید .. = () :let debuggable` را امتحان کنید تا ببینید پیام خطا چه چیزی را نشان می‌دهد.
ja: `debuggable` の型は何でしょうか。`let debuggable: () = ..` を試して、エラー メッセージの内容を確認してください。
pt_br: Qual é o tipo de `debuggable`? Tente `let debuggable: () = ..` para ver o que a mensagem de erro mostra.
uk: Який тип `debuggable`? Спробуйте `let debuggable: () = ..`, щоб побачити повідомлення про помилку.

source: In addition to using traits for static dispatch via generics, Rust also supports using them for type-erased, dynamic dispatch via trait objects:
fa: علاوه بر استفاده از تریدها برای فراخوانی استاتیک از طریق generic‌ها، Rust همچنین از استفاده از آن‌ها برای فراخوانی داینامیک با تایپ‌های حذف‌شده از طریق اشیاء trait پشتیبانی می‌کند:
pt_br: Além de usar _traits_ para despacho estático via genéricos, o Rust também suporta usá-los para despacho dinâmico, apagamento de tipo, via objetos de _trait_:
uk: На додаток до використання трейтів для статичного пересилання за допомогою узагальнень, Rust також підтримує їх використання для динамічного пересилання зі стиранням типу за допомогою об'єктів трейтів:

source: "Miau!"
uk: "Мяу!"

source: // Uses generics and static dispatch.
pt_br: // Usa genéricos e despacho estático.
uk: // Використовує узагальнення та статичну диспетчеризацію.

source: "Hello, who are you? {}"
fa: "سلام، شما کی هستید؟ {}"
pt_br: "Olá, quem é você? {}"
uk: "Привіт, ви хто? {}"

source: // Uses type-erasure and dynamic dispatch.
pt_br: // Usa apagamento de tipo e despacho dinâmico.
uk: // Використовує стирання типів та динамічну диспетчеризацію.

source: Generics, including `impl Trait`, use monomorphization to create a specialized instance of the function for each different type that the generic is instantiated with. This means that calling a trait method from within a generic function still uses static dispatch, as the compiler has full type information and can resolve which type's trait implementation to use.
fa: Generic‌ها، از جمله `impl Trait`، از monomorphization برای ایجاد یک نمونه تخصصی از تابع برای هر تایپ مختلفی که با آن نمونه‌سازی شده استفاده می‌کنند. این بدان معناست که فراخوانی یک متد trait از درون یک تابع generic همچنان از فراخوانی استاتیک استفاده می‌کند، زیرا کامپایلر اطلاعات کامل تایپ را دارد و می‌تواند پیاده‌سازی trait مربوط به تایپ را مشخص کند.
pt_br: Os genéricos, incluindo `impl Trait`, usam a monomorfização para criar uma instância especializada da função para cada tipo diferente com o qual o genérico é instanciado. Isso significa que chamar um método de _trait_ de dentro de uma função genérica ainda usa despacho estático, pois o compilador tem todas as informações de tipo e pode resolver qual tipo de implementação do _trait_ ele deverá utilizar.
uk: Узагальнення, включаючи `impl Trait`, використовують мономорфізацію для створення спеціалізованого екземпляру функції для кожного окремого типу, який є екземпляром узагальнення. Це означає, що виклик методу трейта з узагальненої функції все ще використовує статичну диспетчеризацію, оскільки компілятор має повну інформацію про тип і може вирішити, яку саме реалізацію трейта типу слід використовувати.

source: When using `dyn Trait`, it instead uses dynamic dispatch through a [virtual method table](https://en.wikipedia.org/wiki/Virtual_method_table) (vtable). This means that there's a single version of `fn dynamic` that is used regardless of what type of `Pet` is passed in.
fa: زمانی که از `dyn Trait` استفاده می‌شود، به‌جای آن از فراخوانی داینامیک از طریق یک [virtual method table](https://en.wikipedia.org/wiki/Virtual_method_table) (vtable) استفاده می‌کند. این بدان معناست که یک نسخه واحد از `fn dynamic` وجود دارد که بدون توجه به تایپ `Pet` که وارد می‌شود، استفاده می‌شود.
pt_br: Quando se usa `dyn Trait`, ele usa despacho dinâmico através de uma [tabela de métodos virtuais](https://en.wikipedia.org/wiki/Virtual_method_table) (vtable). Isso significa que há uma única versão de `fn dynamic` que é usada independentemente do tipo de `Pet` que é passado.
uk: При використанні `dyn Trait` замість цього використовується динамічна диспетчеризація через [віртуальну таблицю методів](https://en.wikipedia.org/wiki/Virtual_method_table) (vtable). Це означає, що існує єдина версія `fn dynamic`, яка використовується незалежно від того, який тип `Pet` передано.

source: When using `dyn Trait`, the trait object needs to be behind some kind of indirection. In this case it's a reference, though smart pointer types like `Box` can also be used (this will be demonstrated on day 3).
fa: زمانی که از `dyn Trait` استفاده می‌شود، شی trait باید پشت یک تایپ واسط قرار داشته باشد. در این مورد، این تایپ واسط یک ارجاع است، اگرچه تایپ‌های اشاره‌گرهای هوشمند مانند `Box` نیز می‌توانند استفاده شوند (این موضوع در روز سوم نشان داده خواهد شد).
pt_br: Quando se usa `dyn Trait`, o objeto de _trait_ precisa estar atrás de algum tipo de indireção. Neste caso, é uma referência, embora tipos de ponteiro inteligente (smart como `Box` também possam ser usados (isso será demonstrado no dia 3).
uk: При використанні `dyn Trait` об'єкт трейта повинен знаходитися за якимось посередником. У цьому випадку це буде посилання, хоча також можна використовувати розумні типи вказівників, такі як `Box` (це буде продемонстровано у день 3).

source: At runtime, a `&dyn Pet` is represented as a "fat pointer", i.e. a pair of two pointers: One pointer points to the concrete object that implements `Pet`, and the other points to the vtable for the trait implementation for that type. When calling the `talk` method on `&dyn Pet` the compiler looks up the function pointer for `talk` in the vtable and then invokes the function, passing the pointer to the `Dog` or `Cat` into that function. The compiler doesn't need to know the concrete type of the `Pet` in order to do this.
fa: در زمان اجرا، یک `dyn Pet&` به‌صورت یک "اشاره‌گر چاق" (fat pointer) نمایان می‌شود، یعنی یک جفت از دو اشاره‌گر: یکی از اشاره‌گرها به شیء مشخصی که `Pet` را پیاده‌سازی می‌کند اشاره دارد و دیگری به vtable برای پیاده‌سازی ترید آن نوع اشاره می‌کند. هنگام فراخوانی متد `talk` بر روی `dyn Pet&`، کامپایلر آدرس تابع `talk` را در vtable جستجو کرده و سپس تابع را فراخوانی می‌کند و اشاره‌گر به `Dog` یا `Cat` را به آن تابع پاس می‌دهد. کامپایلر نیازی به دانستن تایپ مشخص `Pet` برای انجام این کار ندارد.
pt_br: Em tempo de execução, um `&dyn Pet` é representado como um "ponteiro gordo", ou seja, um par de dois ponteiros: Um ponteiro aponta para o objeto concreto que implementa `Pet`, e o outro aponta para a tabela de métodos virtuais para a implementação do _trait_ para esse tipo. Ao chamar o método `talk` em `&dyn Pet`, o compilador procura o ponteiro de função para `talk` na tabela de métodos virtuais e então invoca a função, passando o ponteiro para o `Dog` ou `Cat` para essa função. O compilador não precisa saber o tipo concreto do `Pet` para fazer isso.
uk: Під час виконання `&dyn Pet` представляється як "жирний вказівник", тобто пара з двох вказівників: Один вказівник вказує на конкретний об'єкт, який реалізує `Pet`, а інший вказує на таблицю vtable для реалізації трейту для цього типу. При виклику методу `talk` на `&dyn Pet` компілятор шукає вказівник на функцію `talk` у таблиці vtable, а потім викликає цю функцію, передаючи вказівник на `Dog` або `Cat` у цю функцію. Для цього компілятору не потрібно знати конкретний тип `Pet`.

source: A `dyn Trait` is considered to be "type-erased", because we no longer have compile-time knowledge of what the concrete type is.
fa: یک `dyn Trait` به‌عنوان "تایپ ‌حذف‌ شده" (type-erased) در نظر گرفته می‌شود، زیرا دیگر در زمان کامپایل اطلاعاتی درباره تایپ مشخص نداریم.
pt_br: Um `dyn Trait` é considerado "apagado de tipo", porque não temos mais conhecimento em tempo de compilação sobre qual é o tipo concreto.
uk: `dyn Trait` вважається "стертим типом", оскільки під час компіляції ми більше не знаємо, яким є конкретний тип.

source: In this short exercise, you will implement a generic `min` function that determines the minimum of two values, using the [`Ord`](https://doc.rust-lang.org/stable/std/cmp/trait.Ord.html) trait.
fa: در این تمرین کوتاه، شما یک تابع `min`generic را پیاده‌سازی خواهید کرد که حداقل از دو مقدار را تعیین می‌کند، با استفاده از trait [`Ord`](https://doc.rust-lang.org/stable/std/cmp/trait.Ord.html).
pt_br: Neste exercício curto, você implementará uma função genérica `min` que determina o mínimo de dois valores, usando um _trait_ `LessThan`.
uk: У цій короткій вправі ви реалізуєте узагальнену функцію `min`, яка визначає мінімальне з двох значень, використовуючи трейт [`Ord`](https://doc.rust-lang.org/stable/std/cmp/trait.Ord.html).

source: // TODO: implement the `min` function used in `main`.
ja: // TODO: `main` で使用する `min` 関数を実装します。
pt_br: // TODO: implemente a função `min` usada em `main`.
uk: // TODO: реалізуйте функцію `min`, яка використовується в `main`.

source: "goodbye"
pt_br: "até logo"
uk: "до побачення"

source: "bat"
pt_br: "morcego"
uk: "кажан"

source: "armadillo"
pt_br: "tatu"
uk: "броненосець"

source: Show students the [`Ord`](https://doc.rust-lang.org/stable/std/cmp/trait.Ord.html) trait and [`Ordering`](https://doc.rust-lang.org/stable/std/cmp/enum.Ordering.html) enum.
fa: [`Ord`](https://doc.rust-lang.org/stable/std/cmp/trait.Ord.html) trait و [`Ordering`](https://doc.rust-lang.org/stable/std/cmp/enum.Ordering.html) enum را به دانش‌آموزان نشان دهید.
pt_br: Mostre aos estudantes o _trait_ [`Ord`](https://doc.rust-lang.org/stable/std/cmp/trait.Ord.html) e o enum [`Ordering`](https://doc.rust-lang.org/stable/std/cmp/enum.Ordering.html).
uk: Покажіть учням трейт [`Ord`](https://doc.rust-lang.org/stable/std/cmp/trait.Ord.html) та перелік [`Ordering`](https://doc.rust-lang.org/stable/std/cmp/enum.Ordering.html).

source: For each of the slides in this section, spend some time reviewing the documentation pages, highlighting some of the more common methods.
fa: برای هر یک از اسلایدهای این بخش، کمی زمان صرف مرور صفحات مستندات کنید و برخی از متدهای رایج‌تر را برجسته کنید.
ja: このセクションの各スライドでは、時間をかけてドキュメント ページを確認し、より一般的なメソッドをいくつか取り上げてください。
pt_br: Para cada um dos slides desta seção, reserve um tempo para revisar as páginas de documentação, destacando alguns dos métodos mais comuns.
uk: Для кожного слайда в цьому розділі витратьте деякий час на перегляд сторінок документації, виділяючи деякі з найбільш поширених методів.

source: Rust comes with a standard library which helps establish a set of common types used by Rust libraries and programs. This way, two libraries can work together smoothly because they both use the same `String` type.
fa: Rust دارای یک کتابخانه استاندارد است که به ایجاد مجموعه‌ای از تایپ‌های رایج استفاده‌شده توسط کتابخانه‌ها و برنامه‌های Rust کمک می‌کند. به این ترتیب، دو کتابخانه می‌توانند به‌راحتی با هم کار کنند زیرا هر دو از تایپ `String` یکسانی استفاده می‌کنند.
ja: Rust には、Rust のライブラリとプログラムで使用される一般的な型のセットを確立するのに役立つ標準ライブラリが付属しています。2 つのライブラリをスムーズに連携させることができるのは、このように両方とも同じ `String` 型を使用しているためです。
pt_br: Rust vem com uma biblioteca padrão (_standard library_) que ajuda a estabelecer um conjunto de tipos comuns usados por bibliotecas e programas Rust. Dessa forma, duas bibliotecas podem trabalhar juntas sem problemas porque ambas usam o mesmo tipo `String`.
uk: Rust поставляється зі стандартною бібліотекою, яка допомагає встановити набір загальних типів, які використовуються бібліотекою та програмами Rust. Таким чином, дві бібліотеки можуть безперешкодно працювати разом, оскільки обидві використовують той самий тип `String`.

source: In fact, Rust contains several layers of the Standard Library: `core`, `alloc` and `std`.
fa: در واقع، Rust شامل چندین لایه از کتابخانه استاندارد است: `core`، `alloc` و `std`.
ja: 実際、Rust には標準ライブラリ（`core`、`alloc`、`std`）の複数のレイヤが含まれています。
pt_br: Na verdade, o Rust contém várias camadas de Biblioteca Padrão: `core`, `alloc` e `std`.
uk: Насправді Rust містить кілька рівнів стандартної бібліотеки: `core`, `alloc` і `std`.

source: `core` includes the most basic types and functions that don't depend on `libc`, allocator or even the presence of an operating system.
fa: `core` شامل ابتدایی‌ترین تایپ‌ها و توابع است که به `libc`، تخصیص‌دهنده حافظه یا حتی وجود یک سیستم‌عامل وابسته نیستند.
ja: `core` には、`libc` やアロケータ、さらにはオペレーティング システムの存在にも依存しない、最も基本的な型と関数が含まれます。
pt_br: `core` inclui os tipos e funções mais básicos que não dependem de `libc`, alocador ou até mesmo a presença de um sistema operacional.
uk: `core` включає найпростіші типи та функції, які не залежать від `libc`, розподілювача чи навіть наявності операційної системи.

source: `alloc` includes types which require a global heap allocator, such as `Vec`, `Box` and `Arc`.
es: `alloc` incluye tipos que requieren un _allocator_ de _heap_ global, como `Vec`, `Box` y `Arc`.
fa: `alloc` شامل تایپ‌هایی است که به یک تخصیص‌دهنده حافظه سراسری نیاز دارند، مانند `Vec`، `Box` و `Arc`.
ja: `alloc` には、`Vec`、`Box`、`Arc` など、グローバルヒープアロケータを必要とする型が含まれます。
ko: `alloc`은 `Vec`, `Box`, `Arc`와 같이 전역 힙 할당이 필요한 타입을 포함합니다.
pt_br: `alloc` inclui tipos que requerem um alocador de heap global, tais como `Vec`, `Box` e `Arc`.
uk: `alloc` включає типи, для яких потрібен глобальний розподільник купи, наприклад `Vec`, `Box` і `Arc`.

source: Embedded Rust applications often only use `core`, and sometimes `alloc`.
es: Las aplicaciones embebidas en Rust menudo solo usan `core` y a algunas veces `alloc`.
fa: برنامه‌های Rust تعبیه‌شده اغلب تنها از `core` و گاهی اوقات از `alloc` استفاده می‌کنند.
ja: 多くの場合、埋め込みの Rust アプリは `core` のみを使用し、場合によっては `alloc` を使用します。
ko: 임베디드 러스트 응용프로그램은 주로 `core`만 사용하거나 가끔 `alloc`을 함께 사용합니다.
pt_br: Os aplicativos Rust embarcados geralmente usam apenas `core` e, às vezes, `alloc`.
uk: Вбудовані програми Rust часто використовують лише `core`, та іноді `alloc`.

source: Rust comes with extensive documentation. For example:
fa: Rust دارای مستندات گسترده‌ای است. به عنوان مثال:
ja: Rust には詳細なドキュメントが用意されています。次に例を示します。
pt_br: O Rust vem com uma extensa documentação. Por exemplo:
uk: Rust постачається з обширною документацією. Наприклад:

source: All of the details about [loops](https://doc.rust-lang.org/stable/reference/expressions/loop-expr.html).
fa: تمام جزئیات مربوط به [حلقه‌ها](https://doc.rust-lang.org/stable/reference/expressions/loop-expr.html).
pt_br: Todos os detalhes sobre [loops](https://doc.rust-lang.org/stable/reference/expressions/loop-expr.html).
uk: Всі подробиці про [цикли](https://doc.rust-lang.org/stable/reference/expressions/loop-expr.html).

source: Primitive types like [`u8`](https://doc.rust-lang.org/stable/std/primitive.u8.html).
fa: تایپ‌های ابتدایی مانند [`u8`](https://doc.rust-lang.org/stable/std/primitive.u8.html).
ja: [`u8`](https://doc.rust-lang.org/stable/std/primitive.u8.html) のようなプリミティブ型。
pt_br: Tipos primitivos como [`u8`](https://doc.rust-lang.org/stable/std/primitive.u8.html).
uk: Примітивні типи на зразок [`u8`](https://doc.rust-lang.org/stable/std/primitive.u8.html)

source: Standard library types like [`Option`](https://doc.rust-lang.org/stable/std/option/enum.Option.html) or [`BinaryHeap`](https://doc.rust-lang.org/stable/std/collections/struct.BinaryHeap.html).
fa: تایپ‌های کتابخانه استاندارد مانند [`Option`](https://doc.rust-lang.org/stable/std/option/enum.Option.html) یا [`BinaryHeap`](https://doc.rust-lang.org/stable/std/collections/struct.BinaryHeap.html).
ja: [`Option`](https://doc.rust-lang.org/stable/std/option/enum.Option.html) や [`BinaryHeap`](https://doc.rust-lang.org/stable/std/collections/struct.BinaryHeap.html) などの標準ライブラリ型。
pt_br: Tipos da biblioteca padrão como [`Option`](https://doc.rust-lang.org/stable/std/option/enum.Option.html) ou [`BinaryHeap`](https://doc.rust-lang.org/stable/std/collections/struct.BinaryHeap.html).
uk: Типи стандартної бібліотеки, такі як [`Option`](https://doc.rust-lang.org/stable/std/option/enum.Option.html) або [`BinaryHeap`](https://doc.rust-lang.org/stable/std/collections/struct.BinaryHeap.html).

source: In fact, you can document your own code:
fa: در واقع، شما می‌توانید کد خود را مستند کنید:
ja: 実際、独自のコードにドキュメントをつけることができます。
pt_br: Na verdade, você pode documentar seu próprio código:
uk: Фактично, ви можете документувати свій власний код:

source: /// Determine whether the first argument is divisible by the second argument. /// /// If the second argument is zero, the result is false.
ja: /// 最初の引数が 2 番目の引数で割り切れるかどうかを判定します。 /// /// 2 番目の引数がゼロの場合、結果は false になります。
pt_br: /// Determine se o primeiro argumento é divisível pelo segundo argumento. /// /// Se o segundo argumento for zero, o resultado é falso.
uk: /// Визначити, чи ділиться перший аргумент на другий. /// /// Якщо другий аргумент дорівнює нулю, результат буде false.

source: The contents are treated as Markdown. All published Rust library crates are automatically documented at [`docs.rs`](https://docs.rs) using the [rustdoc](https://doc.rust-lang.org/rustdoc/what-is-rustdoc.html) tool. It is idiomatic to document all public items in an API using this pattern.
es: El contenido se trata como Markdown. Todos los crates de la biblioteca de Rust publicados se documentan automáticamente en [`docs.rs`](https://docs.rs) mediante la herramienta [rustdoc](https://doc.rust-lang.org/rustdoc/what-is-rustdoc.html). Es propio documentar todos los elementos públicos de una API usando este patrón.
fa: محتویات به‌عنوان Markdown پردازش می‌شوند. تمام crate‌های کتابخانه‌ای منتشرشده Rust به‌طور خودکار در [`docs.rs`](https://docs.rs) با استفاده از ابزار [rustdoc](https://doc.rust-lang.org/rustdoc/what-is-rustdoc.html) مستند می‌شوند. مستند کردن تمام آیتم‌های عمومی در یک API با استفاده از این الگو به‌طور رایج مرسوم است.
ja: コンテンツはマークダウンとして扱われます。公開されたすべての Rust ライブラリ クレートは、[rustdoc](https://doc.rust-lang.org/rustdoc/what-is-rustdoc.html) ツールを使用して、[`docs.rs`](https://docs.rs) で自動的にドキュメントがまとめられます。このパターンを使用して、すべての公開アイテムを API でドキュメント化するのが慣用的です。
ko: 콘텐츠는 마크다운으로 처리됩니다. 게시된 모든 Rust 라이브러리 크레이트는 [rustdoc](https://doc.rust-lang.org/rustdoc/what-is-rustdoc.html) 도구를 사용하여 [`docs.rs`](https://docs.rs)에 자동으로 문서화됩니다. 일반적으로 API의 모든 공개 항목은 이 패턴을 사용하여 문서화됩니다.
pt_br: O conteúdo é tratado como _Markdown_. Todos os _crates_ publicados na biblioteca Rust são documentados automaticamente em [`docs.rs`](https://docs.rs) utilizando a ferramenta [rustdoc](https://doc.rust-lang.org/rustdoc/what-is-rustdoc.html). É idiomático documentar todos os itens públicos em uma API usando este padrão.
uk: Контент розглядається як Markdown. Усі опубліковані крейти бібліотеки Rust автоматично документуються на [`docs.rs`](https://docs.rs) за допомогою [rustdoc](https://doc.rust-lang.org/rustdoc/what-is-rustdoc.html). Це ідіоматично документувати всі публічні елементи в API за допомогою цього шаблону.
