Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: A binary tree is a tree-type data structure where every node has two children (left and right). We will create a tree where each node stores a value. For a given node N, all nodes in a N's left subtree contain smaller values, and all nodes in N's right subtree will contain larger values.
fa: یک درخت باینری (binary tree) یک ساختار داده درختی است که در آن هر گره دو فرزند (چپ و راست) دارد. ما درختی خواهیم ساخت که در آن هر گره یک مقدار را ذخیره می‌کند. برای یک گره معین N، تمام گره‌های زیر درخت چپ N دارای مقادیر کوچکتر خواهند بود و تمام گره‌های زیر درخت راست N دارای مقادیر بزرگتر خواهند بود.
ja: バイナリツリーは、すべてのノードに 2 つの子（左と右）があるツリー型のデータ構造です。ここでは、各ノードが値を格納するツリーを作成します。ある特定のノード N について、N の左側のサブツリー内のすべてのノードにはより小さい値が含まれ、N の右側のサブツリー内のすべてのノードにはより大きい値が含まれます。
pt_br: Uma árvore binária é uma estrutura de dados do tipo árvore onde cada nó tem dois filhos (esquerdo e direito). Criaremos uma árvore onde cada nó armazena um valor. Para um determinado nó N, todos os nós na subárvore esquerda de N contêm valores menores, e todos os nós na subárvore direita de N conterão valores maiores.
uk: Бінарне дерево - це структура даних деревовидного типу, де кожен вузол має двох нащадків (лівого і правого). Ми створимо дерево, у якому кожна вершина зберігає значення. Для заданого вузла N всі вузли лівого піддерева N містять менші значення, а всі вузли правого піддерева N будуть містити більші значення.

source: Implement the following types, so that the given tests pass.
fa: تایپ‌های زیر را پیاده‌سازی کنید تا آزمایش‌های داده شده موفقیت‌آمیز باشند.
ja: 次の型を実装して、指定されたテストが通るようにします。
pt_br: Implemente os seguintes tipos, para que os testes fornecidos passem.
uk: Реалізуйте наступні типи так, щоб задані тести пройшли.

source: Extra Credit: implement an iterator over a binary tree that returns the values in order.
fa: اعتبار اضافی: یک تکرارگر (iterator) بر روی درخت باینری پیاده‌سازی کنید که مقادیر را به ترتیب (in-order) برگرداند.
ja: 追加の実習: バイナリツリーに値を順番に返すイテレータを実装します。
pt_br: Extra: implemente um iterador sobre uma árvore binária que retorna os valores em ordem.
uk: Додаткове завдання: реалізувати ітератор над бінарним деревом, який повертає значення відповідно до порядку.

source: /// A node in the binary tree.
ja: /// バイナリツリーのノード。
pt_br: /// Um nó na árvore binária.
uk: /// Вузол у бінарному дереві.

source: /// A possibly-empty subtree.
ja: /// 空の可能性のあるサブツリー。
pt_br: /// Uma subárvore possivelmente vazia.
uk: /// Можливо-порожнє піддерево.

source: /// A container storing a set of values, using a binary tree. /// /// If the same value is added multiple times, it is only stored once.
ja: /// バイナリツリーを使用して一連の値を格納するコンテナ。 /// /// 同じ値が複数回追加された場合、その値は 1 回だけ格納される。
pt_br: /// Um contêiner que armazena um conjunto de valores, usando uma árvore binária. /// /// Se o mesmo valor for adicionado várias vezes, ele é armazenado apenas uma vez.
uk: /// Контейнер, що зберігає набір значень, використовуючи бінарне дерево. /// /// Якщо одне й те саме значення додається кілька разів, воно зберігається лише один раз.

source: // Implement `new`, `insert`, `len`, and `has` for `Subtree`.
uk: // Реалізуйте `new`, `insert`, `len` та `has` для `Subtree`.

source: // not a unique item
ja: // 固有のアイテムではない
pt_br: // não é um item único
uk: // не унікальний елемент

source: As we saw before, instead of transferring ownership when calling a function, you can let a function _borrow_ the value:
fa: همان‌طور که پیش‌تر دیدیم، به جای انتقال مالکیت هنگام فراخوانی یک تابع، می‌توانید به تابع اجازه دهید که _ارجاعی_ به مقدار داشته باشد:
ja: 前に説明したように、関数を呼び出すときに所有権を移動する代わりに、関数で値を借用できます。
pt_br: Como vimos antes, ao invés de transferir a _ownership_ ao chamar uma função, você pode deixar uma função _emprestar_ (_borrow_) o valor:
uk: Як ми бачили раніше, замість того, щоб передавати право власності при виклику функції, ви можете дозволити функції _позичити_ значення:

source: The `add` function _borrows_ two points and returns a new point.
es: La función `add` _toma prestados_ dos puntos y devuelve uno nuevo.
fa: تابع `add` _ارجاع_ می‌گیرد به دو نقطه و یک نقطه جدید برمی‌گرداند.
ja: `add` 関数は 2 つのポイントを _借用_ し、新しいポイントを返します。
ko: `add` 함수는 두 `Point` 객체 값을 \_빌려_와서 새로운 `Point` 객체를 반환합니다.
pt_br: A função `add` _pega emprestado_ (_borrows_) dois pontos e retorna um novo ponto.
uk: Функція `add` _позичає_ дві точки та повертає нову точку.

source: The caller retains ownership of the inputs.
es: El llamador conserva el _ownership_ de las entradas.
fa: فراخوانی‌کننده مالکیت ورودی‌ها را حفظ می‌کند.
ja: 呼び出し元は入力の所有権を保持します。
ko: `p1`과 `p2`의 소유권은 여전히 호출자(`main`함수)에 있습니다.
pt_br: O chamador mantém a _ownership_ das entradas.
uk: Викликач зберігає право власності на вхідні дані.

source: This slide is a review of the material on references from day 1, expanding slightly to include function arguments and return values.
fa: این اسلاید مرور مطالب مربوط به ارجاعات از روز اول است که به طور جزئی به شامل آرگومان‌های تابع و مقادیر بازگشتی گسترش یافته است.
ja: このスライドでは、1 日目の参照に関する資料を振り返りですが、少し対象を広げ、関数の引数と戻り値も含めています。
pt_br: Este slide é uma revisão do material sobre referências do dia 1, expandindo um pouco para incluir argumentos e valores de retorno de funções.
uk: Цей слайд є оглядом матеріалу про посилання з першого дня, дещо розширеного за рахунок включення аргументів функцій та значень, що повертаються.

source: Notes on stack returns and inlining:
fa: یادداشت‌هایی در مورد بازگشت‌های stack و درون‌ریزی (inlining):
uk: Примітки щодо повернення стеку та вбудовування:

source: Demonstrate that the return from `add` is cheap because the compiler can eliminate the copy operation, by inlining the call to add into main. Change the above code to print stack addresses and run it on the [Playground](https://play.rust-lang.org/?version=stable&mode=release&edition=2021&gist=0cb13be1c05d7e3446686ad9947c4671) or look at the assembly in [Godbolt](https://rust.godbolt.org/). In the "DEBUG" optimization level, the addresses should change, while they stay the same when changing to the "RELEASE" setting:
fa: برای نشان دادن این که بازگشت از `add` ارزان است، زیرا کامپایلر می‌تواند عملیات کپی را حذف کند، با درون‌ریزی (inlining) فراخوانی `add` به تابع `main`، کد فوق را تغییر دهید تا آدرس‌های پشته چاپ شوند و آن را در [Playground](https://play.rust-lang.org/?version=stable&mode=release&edition=2021&gist=0cb13be1c05d7e3446686ad9947c4671) اجرا کنید یا به اسمبلی در [Godbolt](https://rust.godbolt.org/) نگاه کنید. در سطح بهینه‌سازی "DEBUG"، آدرس‌ها باید تغییر کنند، در حالی که با تغییر به تنظیم "RELEASE" ثابت می‌مانند:
uk: Продемонструйте, що повернення з `add` є дешевим, оскільки компілятор може виключити операцію копіювання, вбудовуючи виклик додавання в main. Змініть наведений вище код так, щоб він виводив адреси стеку, і запустіть його на [Playground](https://play.rust-lang.org/) або перегляньте збірку в [Godbolt](https://rust.godbolt.org/). На рівні оптимізації "DEBUG" адреси мають змінитися, але вони залишаються незмінними під час переходу до налаштування "RELEASE":

source: The Rust compiler can do automatic inlining, that can be disabled on a function level with `#[inline(never)]`.
fa: کامپایلر Rust می‌تواند به‌طور خودکار درون‌ریزی (inlining) انجام دهد، که می‌تواند در سطح تابع با `[inline(never)]#` غیرفعال شود.
uk: Компілятор Rust може виконувати автоматичне вбудовування, яке можна вимкнути на рівні функції за допомогою `#[inline(never)]`.

source: Once disabled, the printed address will change on all optimization levels. Looking at Godbolt or Playground, one can see that in this case, the return of the value depends on the ABI, e.g. on amd64 the two i32 that is making up the point will be returned in 2 registers (eax and edx).
fa: پس از غیرفعال کردن درون‌ریزی، آدرس‌های چاپ شده در تمامی سطوح بهینه‌سازی تغییر خواهند کرد. با نگاه کردن به Godbolt یا Playground، می‌توان دید که در این حالت، بازگشت مقدار به ABI بستگی دارد، به عنوان مثال در amd64، دو `i32` که نقطه را تشکیل می‌دهند، در دو رجیستر (مانند `eax` و `edx`) بازگردانده خواهند شد.
uk: Якщо вимкнено, друкована адреса зміниться на всіх рівнях оптимізації. Дивлячись на Godbolt або Playground, можна побачити, що в цьому випадку повернення значення залежить від ABI, наприклад, на amd64 два i32, що складають точку, будуть повернуті у 2х регістрах (eax і edx).

source: Rust's _borrow checker_ puts constraints on the ways you can borrow values. For a given value, at any time:
fa: _بررسی‌کننده ارجاع_ (borrow checker) در Rust محدودیت‌هایی بر روی روش‌های ارجاع به مقادیر اعمال می‌کند. برای یک مقدار خاص، در هر زمان:
ja: Rust の _借用チェッカー_ は、値を借用する方法に制限を設けます。任意の値に対して、常に次の制限が課されます。
pt_br: O _verificador de empréstimo_ (_borrow checker_) do Rust impõe restrições sobre as maneiras como você pode emprestar valores. Para um determinado valor, a qualquer momento:
uk: Перевірка запозичень у Rust'і накладає обмеження на способи, якими ви можете запозичувати значення. Для певного значення, у будь-який час:

source: You can have one or more shared references to the value, _or_
fa: شما می‌توانید یک یا چند ارجاع اشتراکی به مقدار داشته باشید، _یا_
ja: 値への共有参照を 1 つ以上持つことが出来ます。または、
pt_br: Você pode ter uma ou mais referências compartilhadas para o valor, _ou_
uk: Ви можете мати одне або декілька спільних посилань на значення, _або_

source: You can have exactly one exclusive reference to the value.
fa: می‌توانید دقیقاً یک ارجاع انحصاری به مقدار داشته باشید.
ja: 値への排他参照を 1 つだけ持つことが出来ます。
pt_br: Você pode ter exatamente uma referência exclusiva para o valor.
uk: Ви можете мати лише одне ексклюзивне посилання на значення.

source: Note that the requirement is that conflicting references not _exist_ at the same point. It does not matter where the reference is dereferenced.
fa: توجه داشته باشید که نیاز این است که ارجاعات متضاد در همان نقطه _وجود_ نداشته باشند. مهم نیست که ارجاع در کجا dereferenced شود.
ja: 要件は、競合する参照が同じ時点に存在しないことです。参照がどこで外されていても構いません。
pt_br: Observe que o requisito é que as referências conflitantes não _existam_ no mesmo ponto. Não importa onde a referência é desreferenciada.
uk: Зверніть увагу, що вимога полягає в тому, що конфліктуючі посилання не повинні _існувати_ в тій самій момент часу. Не має значення, де посилання буде розіменовано.

source: The above code does not compile because `a` is borrowed as mutable (through `c`) and as immutable (through `b`) at the same time.
es: El código anterior no se compila porque `a` se toma prestada como mutable (a través de `c`) y como inmutable (a través de `b`) al mismo tiempo.
fa: کد بالا کامپایل نمی‌شود زیرا `a` به‌طور همزمان به‌صورت قابل تغییر (از طریق `c`) و غیرقابل تغییر (از طریق `b`) ارجاع داده شده است.
ja: 上記のコードは、`a` が `c` を通じて可変として借用されていると同時に、`b` を通じて不変として借用されているため、コンパイルできません。
ko: 위 코드 컴파일 되지 않습니다. 왜냐하면 `c`는 `a`를 가변 변수로 빌렸고, 이와 동시에 `b`는 `a`를 불변 변수로 빌렸기 때문입니다.
pt_br: O código acima não compila porque `a` é emprestado como mutável (através de `c`) e como imutável (através de `b`) ao mesmo tempo.
uk: Наведений вище код не компілюється, оскільки `a` запозичено як мутабельну змінну (через `c`) і як немутабельну (через `b`) одночасно.

source: Move the `println!` statement for `b` before the scope that introduces `c` to make the code compile.
es: Mueve la instrucción `println!` de `b` antes del ámbito que introduce `c` para que el código compile.
fa: برای اینکه کد کامپایل شود، دستور `!println` مربوط به `b` را قبل از محدوده‌ای که `c` را معرفی می‌کند، منتقل کنید.
ja: `b` の `println!` ステートメントを `c` を導入するスコープの前に移動して、コードをコンパイル出来るようにします。
ko: `b`에 대한 `println!` 구분을 `c`가 있는 스코프 앞으로 이동하면 컴파일이 됩니다.
pt_br: Mova a instrução `println!` para `b` antes do escopo que introduz `c` para fazer o código compilar.
uk: Перемістіть інструкцію `println!` для `b` перед областю видимості, яка вводить `c`, щоб забезпечити компіляцію коду.

source: After that change, the compiler realizes that `b` is only ever used before the new mutable borrow of `a` through `c`. This is a feature of the borrow checker called "non-lexical lifetimes".
es: Después de ese cambio, el compilador se da cuenta de que `b` solo se usa antes del nuevo préstamo mutable de `a` a través de `c`. Se trata de una función del verificador de préstamos denominada "tiempo de vida no léxico".
fa: پس از آن تغییر، کامپایلر متوجه می‌شود که `b` تنها پیش از ارجاع جدید قابل تغییر به `a` از طریق `c` استفاده می‌شود. این ویژگی بررسی‌کننده ارجاع به نام non-lexical lifetimes است.
ja: この変更後、コンパイラは c を通じたa の可変参照よりも前にしかbが使われていないことを認識します。これは「ノンレキシカル ライフタイム(_"non-lexical lifetimes"_)」と呼ばれる借用チェッカーの機能です。
ko: 이렇게 바꾸면, 컴파일러는 `c`가 `a`를 가변 변수로 빌리기 전에만 `b`가 사용된다는 것을 확인할 수 있습니다. 빌림 검사기의 이러한 기능을 "non-lexical lifetime" 이라고 합니다.
pt_br: Após essa alteração, o compilador percebe que `b` só é usado antes do novo empréstimo mutável de `a` através de `c`. Este é um recurso do verificador de empréstimo (_borrow checker_) chamado "tempos de vida não lexicais".
uk: Після цієї зміни компілятор розуміє, що `b` використовується тільки перед новим мутабельним запозиченням `a` через `c`. Це функція перевірки запозичень під назвою "нелексичні терміни життя".

source: The exclusive reference constraint is quite strong. Rust uses it to ensure that data races do not occur. Rust also _relies_ on this constraint to optimize code. For example, a value behind a shared reference can be safely cached in a register for the lifetime of that reference.
fa: محدودیت ارجاع انحصاری بسیار قوی است. Rust از آن برای اطمینان از عدم وقوع داده‌های رقابتی (data races) استفاده می‌کند. Rust همچنین _متکی_ به این محدودیت برای بهینه‌سازی کد است. به عنوان مثال، مقدار پشت یک ارجاع اشتراکی می‌تواند به‌طور ایمن در یک رجیستر برای طول عمر آن ارجاع کش شود.
ja: 排他参照制約は非常に強力です。Rust はこの制約を使用して、データへの競合が発生しないようにするとともに、コードを最適化しています。たとえば、共有参照を通して得られる値は、その参照が存続する間、安全にレジスタにキャッシュすることが出来ます
pt_br: A restrição de referência exclusiva é bastante forte. O Rust a usa para que _data races_ (_corridas de dados_) não ocorram. O Rust também _depende_ dessa restrição para otimizar o código. Por exemplo, um valor atrás de uma referência compartilhada pode ser armazenado com segurança em um registrador pelo tempo de vida dessa referência.
uk: Обмеження ексклюзивного посилання є досить сильним. Rust використовує його для запобігання гонці даних. Rust також _покладається_ на це обмеження для оптимізації коду. Наприклад, значення за спільним посиланням можна безпечно кешувати у регістрі на весь час існування цього посилання.

source: The borrow checker is designed to accommodate many common patterns, such as taking exclusive references to different fields in a struct at the same time. But, there are some situations where it doesn't quite "get it" and this often results in "fighting with the borrow checker."
fa: بررسی‌کننده ارجاع به‌گونه‌ای طراحی شده است که بسیاری از الگوهای رایج را پشتیبانی کند، مانند گرفتن ارجاعات انحصاری به فیلدهای مختلف در یک ساختار به‌طور همزمان. اما، در برخی موقعیت‌ها، ممکن است که به‌طور کامل متوجه وضعیت نشود و این اغلب منجر به "درگیری با borrow checker" می‌شود.
ja: 借用チェッカーは、構造体内の異なるフィールドへの排他参照を同時に取得するなど、多くの一般的なパターンに対応するように設計されています。しかし、状況によっては借用チェッカーがコードを正しく理解できず、「借用チェッカーとの戦い」に発展することが多くあります。
pt_br: O verificador de empréstimo (_borrow checker_) é projetado para acomodar muitos padrões comuns, como obter referências exclusivas para campos diferentes em uma _struct_ ao mesmo tempo. Mas, há algumas situações em que ele não entende muito bem e isso geralmente resulta em "lutar com o verificador de empréstimo".
uk: Перевірку запозичень розроблено з урахуванням багатьох поширених шаблонів, таких як одночасне отримання ексклюзивних посилань на різні поля у структурі. Але бувають ситуації, коли вона не зовсім "розуміє що відбувається", і це часто призводить до "боротьби з перевіряльником запозичень".

source: As a concrete example of how these borrowing rules prevent memory errors, consider the case of modifying a collection while there are references to its elements:
fa: به عنوان یک مثال ملموس از چگونگی جلوگیری از خطاهای حافظه توسط این قوانین ارجاع، به حالت تغییر یک مجموعه در حالی که ارجاعاتی به عناصر آن وجود دارد، توجه کنید:
uk: Як конкретний приклад того, як ці правила запозичення запобігають помилкам пам'яті, розглянемо випадок модифікації колекції, коли на її елементи є посилання:

source: Similarly, consider the case of iterator invalidation:
fa: به طور مشابه، به وضعیت نامعتبر شدن تکرارگر (iterator) توجه کنید:
uk: Аналогічно, розглянемо випадок оголошення ітератора недійсним:

source: In both of these cases, modifying the collection by pushing new elements into it can potentially invalidate existing references to the collection's elements if the collection has to reallocate.
fa: در هر دو مورد، تغییر مجموعه با اضافه کردن عناصر جدید به آن می‌تواند به‌طور بالقوه ارجاعات موجود به عناصر مجموعه را نامعتبر کند، اگر مجموعه نیاز به تخصیص مجدد حافظه داشته باشد.
uk: В обох випадках модифікація колекції шляхом додавання до неї нових елементів може потенційно зробити недійсними наявні посилання на елементи колекції, якщо колекція буде перерозподілена.

source: In some situations, it's necessary to modify data behind a shared (read-only) reference. For example, a shared data structure might have an internal cache, and wish to update that cache from read-only methods.
fa: در برخی موقعیت‌ها، لازم است که داده‌های پشت یک ارجاع اشتراکی (فقط خواندنی) را تغییر دهید. به عنوان مثال، یک ساختار داده اشتراکی ممکن است دارای یک کش داخلی باشد و بخواهد این کش را از روش‌های خواندنی به‌روزرسانی کند.
ja: 場合によっては、共有（読み取り専用）参照の背後にあるデータを変更する必要があります。たとえば、共有データ構造に内部キャッシュがあり、そのキャッシュを読み取り専用メソッドから更新する必要がある場合があります。
uk: У деяких ситуаціях необхідно модифікувати дані за спільним (доступним лише для читання) посиланням. Наприклад, структура даних зі спільним доступом може мати внутрішній кеш, і ви хочете оновити цей кеш методами, доступними лише для читання.

source: The "interior mutability" pattern allows exclusive (mutable) access behind a shared reference. The standard library provides several ways to do this, all while still ensuring safety, typically by performing a runtime check.
fa: الگوی "تغییرپذیری داخلی" (interior mutability) اجازه می‌دهد که دسترسی انحصاری (قابل تغییر) پشت یک ارجاع اشتراکی وجود داشته باشد. کتابخانه استاندارد روش‌های متعددی برای انجام این کار فراهم می‌کند، در حالی که همچنان ایمنی را تضمین می‌کند، معمولاً با انجام یک بررسی در زمان اجرا.
ja: 「内部可変性」パターンは、共有参照を通した排他的（可変）アクセスを可能にします。標準ライブラリには、これを安全に行うための方法がいくつか用意されており、通常はランタイム チェックを実行することで安全性を確保します。
uk: Паттерн "внутрішня мутабельність" дозволяє ексклюзивний (мутабельний) доступ за спільним посиланням. Стандартна бібліотека надає декілька способів зробити це, забезпечуючи при цьому безпеку, як правило, шляхом виконання перевірки під час виконання.

source: `Cell` wraps a value and allows getting or setting the value using only a shared reference to the `Cell`. However, it does not allow any references to the inner value. Since there are no references, borrowing rules cannot be broken.
uk: `Cell` обгортає значення і дозволяє отримати або встановити значення, використовуючи лише спільне посилання на `Cell`. Однак, вона не дозволяє жодних посилань на внутрішнє значення. Оскільки посилань немає, правила запозичення не можуть бути порушені.

source: // Note that `cell` is NOT declared as mutable.
uk: // Зауважте, що `cell` НЕ оголошено як мутабельну.

source: `RefCell` allows accessing and mutating a wrapped value by providing alternative types `Ref` and `RefMut` that emulate `&T`/`&mut T` without actually being Rust references.
uk: `RefCell` дозволяє отримувати доступ до обгорнутого значення та змінювати його, надаючи альтернативні типи `Ref` та `RefMut`, які імітують `&T`/`&mut T`, не будучи насправді Rust посиланнями.

source: These types perform dynamic checks using a counter in the `RefCell` to prevent existence of a `RefMut` alongside another `Ref`/`RefMut`.
fa: این type با استفاده از یک شمارنده در `RefCell` بررسی‌های dynamic را انجام می‌دهند تا از وجود `RefMut` در کنار `Ref`/`RefMut` دیگر جلوگیری کنند.
uk: Ці типи виконують динамічні перевірки за допомогою лічильника в `RefCell`, щоб запобігти існуванню `RefMut` поряд з іншим `Ref`/`RefMut`.

source: By implementing `Deref` (and `DerefMut` for `RefMut`), these types allow calling methods on the inner value without allowing references to escape.
fa: با پیاده‌سازی `Deref` (و `DerefMut` برای `RefMut`)، این تایپ‌ها امکان فراخوانی متدها روی مقدار داخلی را بدون اجازه خروج ارجاع‌ها فراهم می‌کنند.
uk: Завдяки реалізації `Deref` (і `DerefMut` для `RefMut`), ці типи дозволяють викликати методи за внутрішнім значенням, не дозволяючи посиланням втекти.

source: // This triggers an error at runtime. // let other = cell.borrow(); // println!("{}", *other);
uk: // Це спричиняє помилку під час виконання. // let other = cell.borrow(); // println!("{}", *other);

source: The main thing to take away from this slide is that Rust provides _safe_ ways to modify data behind a shared reference. There are a variety of ways to ensure that safety, and `RefCell` and `Cell` are two of them.
fa: مهم‌ترین نکته‌ای که باید از این اسلاید برداشت کرد این است که Rust روش‌های _ایمن_ برای تغییر داده‌های پشت یک ارجاع اشتراکی ارائه می‌دهد. راه‌های مختلفی برای تضمین این ایمنی وجود دارد، و `RefCell` و `Cell` دو مورد از آن‌ها هستند.
ja: このスライドで重要なのは、Rust には、共有参照の背後にあるデータを変更する安全な方法が用意されているということです。安全性を確保するにはさまざまな方法がありますが、ここでは `RefCell` と `Cell` を取り上げます。
uk: Основне, що можна винести з цього слайду, це те, що Rust надає _безпечні_ способи модифікації даних за спільним посиланням. Існує безліч способів забезпечити цю захищеність, і `RefCell` та `Cell` - два з них.

source: `RefCell` enforces Rust's usual borrowing rules (either multiple shared references or a single exclusive reference) with a runtime check. In this case, all borrows are very short and never overlap, so the checks always succeed.
fa: `RefCell` قوانین معمول ارجاع Rust (یا چندین ارجاع اشتراکی یا یک ارجاع انحصاری) را با یک بررسی در زمان اجرا اعمال می‌کند. در این حالت، همه ارجاعات بسیار کوتاه هستند و هرگز هم‌پوشانی ندارند، بنابراین بررسی‌ها همیشه موفقیت‌آمیز هستند.
ja: `RefCell` は、ランタイム チェックとともに Rust の通常の借用ルール（複数の共有参照または単一の排他参照）を適用します。この場合、すべての借用は非常に短く、重複しないため、チェックは常に成功します。
uk: `RefCell`застосовує звичайні правила запозичень Rust (або декілька спільних посилань, або одне ексклюзивне посилання) з перевіркою під час виконання. У цьому випадку всі запозичення дуже короткі і ніколи не перетинаються, тому перевірки завжди проходять успішно.

source: The extra block in the `RefCell` example is to end the borrow created by the call to `borrow_mut` before we print the cell. Trying to print a borrowed `RefCell` just shows the message `"{borrowed}"`.
fa: بلوک اضافی در مثال `RefCell` برای پایان دادن به ارجاعی که توسط فراخوانی `borrow_mut` ایجاد شده است، قبل از چاپ `cell` است. تلاش برای چاپ یک `RefCell` که در حال حاضر ارجاع داده شده است، فقط پیغام `"{borrowed}"` را نشان می‌دهد.
uk: Додатковий блок у прикладі `RefCell` призначений для завершення запозичення, створеного викликом `borrow_mut`, до того, як ми надрукуємо комірку. Спроба надрукувати запозичену комірку `RefCell` просто покаже повідомлення `"{borrowed}"`.

source: `Cell` is a simpler means to ensure safety: it has a `set` method that takes `&self`. This needs no runtime check, but requires moving values, which can have its own cost.
fa: `Cell` یک روش ساده‌تر برای تضمین ایمنی است: این نوع دارای متدی به نام `set` است که `self&` را می‌پذیرد. این روش نیاز به بررسی در زمان اجرا ندارد، اما نیاز به انتقال مقادیر دارد که می‌تواند هزینه‌های خود را داشته باشد.
ja: `Cell` は安全性を確保するためのよりシンプルな手段であり、`&self` を受け取る `set` メソッドを備えています。ランタイム チェックは必要ありませんが、値を移動する必要があり、それによってコストが発生することがあります。
uk: `Cell` є найпростішим засобом гарантування безпеки: він має метод `set`, який приймає значення `&self`. Це не потребує перевірки під час виконання, але вимагає переміщення значень, що може мати свою ціну.
