Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: The [Rust in Chromium](../chromium.md) deep dive is a half-day course on using Rust as part of the Chromium browser. It includes using Rust in Chromium's `gn` build system, bringing in third-party libraries ("crates") and C++ interoperability.
fa: عمیق [Rust in Chromium](../chromium.md) یک دوره نیم روزه برای استفاده از Rust به عنوان بخشی از مرورگر Chromium است. این شامل استفاده از Rust در سیستم ساخت `gn‍` Chromium، آوردن کتابخانه‌های شخص ثالث ("crates") و قابلیت همکاری ++C است.
ja: [Chromium での Rust](../chromium.md) は半日コースで、Chromium ブラウザの一部として Rust を使用する方法について詳しく説明します。Chromium の `gn` ビルドシステムで Rust を使用することで、サードパーティ ライブラリ（「クレート」）、および C++ との相互運用性を導入できます。
pt_br: O [Rust para Chromium](../chromium.md) é um curso de meio dia sobre o uso de Rust como parte do navegador Chromium. Ele inclui o uso de Rust no sistema de compilação `gn` do Chromium, a inclusão de bibliotecas de terceiros ("_crates_") e interoperabilidade com C++.
uk: Глибоке занурення [Rust in Chromium](../chromium.md) — це південний курс із використання Rust як частини браузера Chromium. Він включає використання Rust у системі збирання `gn` Chromium, залучення сторонніх бібліотек ("крейтів") і взаємодію з C++.

source: You will need to be able to build Chromium --- a debug, component build is [recommended](../chromium/setup.md) for speed but any build will work. Ensure that you can run the Chromium browser that you've built.
fa: شما باید بتوانید Chromium را بسازید --- یک اشکال زدایی، ساخت کامپوننت برای سرعت [توصیه می شود] (../chromium/setup.md) است، اما هر ساختی کار می کند. مطمئن شوید که می‌توانید مرورگر Chromium را که ساخته‌اید اجرا کنید.
ja: 受講者は、Chromium をビルドできる必要があります。時間を短縮できるデバッグのコンポーネント ビルドを [推奨](../chromium/setup.md) しますが、どのようなビルドでも問題ありません。作成した Chromium ブラウザを実行できることを確認します。
pt_br: Você precisará ser capaz de compilar o Chromium --- uma compilação de componentes de depuração é [recomendada](../chromium/setup.md) para velocidade, mas qualquer compilação funcionará. Certifique-se de que você possa executar o navegador Chromium que você compilou.
uk: Вам потрібно буде мати можливість зібрати Chromium --- налагодженна, компонентна побудова [рекомендується](../chromium/setup.md) для швидкості, але будь-яка збірка буде працювати. Переконайтеся, що ви можете запустити веб-переглядач Chromium, який ви побудували.

source: Bare-Metal Rust
fa: Rust بر روی سخت افزار بدون سیستم عامل
pt_br: Rust _Bare-Metal_
uk: Rust на голому залізі

source: The [Bare-Metal Rust](../bare-metal.md) deep dive is a full day class on using Rust for bare-metal (embedded) development. Both microcontrollers and application processors are covered.
es: [Bare Metal Rust](../bare-metal.md) es una clase de un día sobre cómo usar Rust para el desarrollo bare-metal (insertado). Se tratarán tanto microcontroladores como procesadores de aplicaciones.
fa: دوره آموزشی [Rust بر روی سخت افزار بدون سیستم عامل](../bare-metal.md) یک دوره یک روزه با تمرکز بر استفاده ازRust برای توسعه بر روی سخت افزار بدون سیستم عامل (embedded) است. این دوره هم میکروکنترلرها و هم پردازشگر هایی با کارایی خاص را پوشش می دهد.
pt_br: O [Rust _Bare-Metal_](../bare-metal.md) é uma aula de um dia inteiro sobre o uso de Rust para o desenvolvimento _bare-metal_ (sistema embarcado). Tanto micro-controladores quanto processadores de aplicação são cobertos.
uk: [Rust на голому залізі](../bare-metal.md): заняття на повний день з використання Rust для низькорівневої (embedded) розробки. Розглядаються як мікроконтролери, так і прикладні процесори.

source: For the microcontroller part, you will need to buy the [BBC micro:bit](https://microbit.org/) v2 development board ahead of time. Everybody will need to install a number of packages as described on the [welcome page](../bare-metal.md).
es: Para la parte de los microcontroladores, necesitarás comprar con antelación la segunda versión de la placa programable [BBC micro:bit](https://microbit.org/). Todo el mundo deberá instalar una serie de paquetes, tal como se describe en la [página de bienvenida](../bare-metal.md).
fa: برای قسمت میکروکنترلر، باید برد توسعه [BBCmicro:bit](https://microbit.org/) v2 را خریداری کنید. همه باید تعدادی بسته را همانطور که در [welcome page](../bare-metal.md) توضیح داده شده نصب کنند.
ja: マイクロコントローラの章では、事前に[BBCmicro:bit](https://microbit.org/)v2開発ボードを購入する必要があります。また、[welcomeページ](../bare-metal.md)で説明されているように、複数のパッケージをインストールする必要があります。
ko: 마이크로컨트롤러 파트를 진행하기 위해서는 [BBC micro:bit](https://microbit.org/) v2 개발 보드를 미리 구매해야 합니다. 모든 사용자는 [시작 페이지](../bare-metal.md)에 설명된 대로 각종 패키지를 설치해야 합니다.
pt_br: Para a parte do micro-controlador, você precisará comprar a placa de desenvolvimento [BBC micro:bit](https://microbit.org/) v2 com antecedência. Todos precisarão instalar vários pacotes, conforme descrito na [página inicial](../bare-metal.md).
uk: Щодо частини мікроконтролерів, то вам потрібно буде заздалегідь придбати плату розробки [BBC micro:bit](https://microbit.org/) v2. Усім потрібно встановити кілька пакетів, як описано на [сторінці привітання](../bare-metal.md).

source: Concurrency in Rust
es: Concurrencia en Rust
fa: همزمانی در Rust
ja: Rustでの並行性
pt_br: Concorrência em Rust
uk: Конкурентність в Rust

source: The [Concurrency in Rust](../concurrency/welcome.md) deep dive is a full day class on classical as well as `async`/`await` concurrency.
uk: [Конкурентність в Rust](../concurrency/welcome.md) це цілий день занять з класичної, а також `async`/`await` конкурентності.

source: You will need a fresh crate set up and the dependencies downloaded and ready to go. You can then copy/paste the examples into `src/main.rs` to experiment with them:
es: Necesitarás configurar un nuevo crate, y descargar y preparar las dependencias. A continuación, podrás copiar y pegar los ejemplos en `src/main.rs` para experimentar con ellos:
fa: شما به یک crate جدید نیاز خواهید داشت و وابستگی ها دانلود و آماده استفاده باشند. سپس می‌توانید نمونه‌ها را در `src/main.rs‍` کپی/پیست کنید تا با آنها آزمایش کنید:
ja: 新規クレートの作成と、依存関係（dependencies）のダウンロードが必要です。その後、例を`src/main.rs`にコピペして実行する事ができます：
ko: 새 크레이트를 설정하고 몇 가지 의존성을 다운로드해 두어야 합니다. 그런 다음 예제를 `src/main.rs`에 복사/붙여넣기 하여 테스트 해 볼 수 있습니다:
pt_br: Você precisará de um novo _crate_ configurado e as dependências baixadas e prontas para uso. Você pode então copiar/colar os exemplos para `src/main.rs` para experimentá-los:
uk: Вам знадобиться налаштований новий крейт, а також завантажені залежності готові до роботи. Потім ви сможете скопіювати приклади в `src/main.rs`, щоб поекспериментувати з ними:

source: Format
es: Formato
fa: فرمت
ja: フォーマット
ko: 강의 형식
pt_br: Formato
uk: Формат

source: The course is meant to be very interactive and we recommend letting the questions drive the exploration of Rust!
es: El curso está pensado para ser muy interactivo, por lo que te recomendamos que dejes que las preguntas guíen el aprendizaje de Rust.
fa: این دوره قرار است بسیار تعاملی باشد و توصیه می کنیم اجازه دهید حس کنجکاوی Rust را هدایت کنند!
ja: 本講座はインタラクティブな形式で行います。積極的に質問して、Rustへの理解を深めてください！
ko: 이 강의는 강사와 수강생이 양방향으로 소통하면서 진행하도록 디자인 되었습니다. 다양한 질문을 통해 러스트의 여러 부분을 탐험할 수 있도록 하세요!
pt_br: O curso foi projetado para ser bastante interativo e recomendamos deixar as perguntas conduzirem a exploração do Rust!
uk: Курс задуманий дуже інтерактивним, і ми рекомендуємо, щоб питання сприяли вивченню Rust!

source: There are several useful keyboard shortcuts in mdBook:
es: Existen varias combinaciones de teclas útiles en mdBook:
fa: چندین میانبر صفحه کلید مفید در mdBook وجود دارد:
ja: mdBookには、便利なショートカットキーがいくつか存在します：
ko: 다음은, mdBook 시스템(현 사이트)에서 유용한 단축키들 입니다:
pt_br: Existem vários atalhos de teclado úteis no _mdBook_:
uk: У mdBook є кілька корисних поєднань клавіш:

source: <kbd>Arrow-Left</kbd>: Navigate to the previous page.
fa: <kbd>Arrow-Left</kbd>: به صفحه قبلی هدایت می‌کند.
uk: <kbd>Стрілка вліво</kbd>: Перехід на попередню сторінку.

source: <kbd>Arrow-Right</kbd>: Navigate to the next page.
fa: <kbd>Arrow-Right</kbd>: به صفحه بعدی هدایت می‌کند.
uk: <kbd>Стрілка вправо</kbd>: Перехід до наступної сторінки.

source: <kbd>Ctrl + Enter</kbd>: Execute the code sample that has focus.
uk: <kbd>Ctrl + Enter</kbd>: Виконати приклад коду, який знаходиться у фокусі.

source: <kbd>s</kbd>: Activate the search bar.
fa: <kbd>s</kbd>: نوار جستجو را فعال می‌کند.
uk: <kbd>s</kbd>: Активувати панель пошуку.

source: The course has been translated into other languages by a set of wonderful volunteers:
es: El curso se ha traducido a otros idiomas gracias a grupo de maravillosos voluntarios:
fa: این دوره توسط مجموعه ای از داوطلبان فوق العاده به زبان های دیگر ترجمه شده است:
ja: 本資料は、ボランティアによって翻訳されています：
ko: 이 과정은 다른 언어로도 제공됩니다. 괄호 안은 번역에 도움 주신 분들입니다:
pt_br: O curso foi traduzido para outros idiomas por um grupo de voluntários maravilhosos:
uk: Курс був перекладений іншими мовами групою чудових волонтерів:

source: [Brazilian Portuguese](https://google.github.io/comprehensive-rust/pt-BR/) by [@rastringer](https://github.com/rastringer), [@hugojacob](https://github.com/hugojacob), [@joaovicmendes](https://github.com/joaovicmendes), and [@henrif75](https://github.com/henrif75).
fa: [پرتغالی برزیلی](https://google.github.io/comprehensive-rust/pt-BR/) توسط [@rastringer](https://github.com/rastringer), [@hugojacob](https://github.com/hugojacob), [@joaovicmendes](https://github.com/joaovicmendes) و [@henrif75](https://github.com/henrif75).
ja: [ポルトガル語（ブラジル）](https://google.github.io/comprehensive-rust/pt-BR/): [@rastringer](https://github.com/rastringer)、[@hugojacob](https://github.com/hugojacob)、[@joaovicmendes](https://github.com/joaovicmendes)、[@henrif75](https://github.com/henrif75)
pt_br: [Português do Brasil](https://google.github.io/comprehensive-rust/pt-BR/) por [@rastringer](https://github.com/rastringer), [@hugojacob](https://github.com/hugojacob), [@joaovicmendes](https://github.com/joaovicmendes) e [@henrif75](https://github.com/henrif75).
uk: [Бразильска Португальська](https://google.github.io/comprehensive-rust/pt-BR/) від [@rastringer](https://github.com/rastringer), [@hugojacob](https://github.com/hugojacob), [@joaovicmendes](https://github.com/joaovicmendes), та [@henrif75](https://github.com/henrif75).

source: [Chinese (Simplified)](https://google.github.io/comprehensive-rust/zh-CN/) by [@suetfei](https://github.com/suetfei), [@wnghl](https://github.com/wnghl), [@anlunx](https://github.com/anlunx), [@kongy](https://github.com/kongy), [@noahdragon](https://github.com/noahdragon), [@superwhd](https://github.com/superwhd), [@SketchK](https://github.com/SketchK), and [@nodmp](https://github.com/nodmp).
ja: [中国語（簡体字）](https://google.github.io/comprehensive-rust/zh-CN/): [@suetfei](https://github.com/suetfei)、[@wnghl](https://github.com/wnghl)、[@anlunx](https://github.com/anlunx)、[@kongy](https://github.com/kongy)、[@noahdragon](https://github.com/noahdragon)、[@superwhd](https://github.com/superwhd)、[@SketchK](https://github.com/SketchK)、[@nodmp](https://github.com/nodmp)
pt_br: [Chinês (Simplificado)](https://google.github.io/comprehensive-rust/zh-CN/) por [@suetfei](https://github.com/suetfei), [@wnghl](https://github.com/wnghl), [@anlunx](https://github.com/anlunx), [@kongy](https://github.com/kongy), [@noahdragon](https://github.com/noahdragon), [@superwhd](https://github.com/superwhd), [@SketchK](https://github.com/SketchK) e [@nodmp](https://github.com/nodmp).
uk: [Китайська (спрощена)](https://google.github.io/comprehensive-rust/zh-CN/) від [@suetfei](https://github.com/suetfei), [@wnghl](https://github.com/wnghl), [@anlunx](https://github.com/anlunx), [@kongy](https://github.com/kongy), [@noahdragon](https://github.com/noahdragon), [@superwhd](https://github.com/superwhd), [@SketchK](https://github.com/SketchK), and [@nodmp](https://github.com/nodmp).

source: [Chinese (Traditional)](https://google.github.io/comprehensive-rust/zh-TW/) by [@hueich](https://github.com/hueich), [@victorhsieh](https://github.com/victorhsieh), [@mingyc](https://github.com/mingyc), [@kuanhungchen](https://github.com/kuanhungchen), and [@johnathan79717](https://github.com/johnathan79717).
fa: [چینی (سنتی)](https://google.github.io/comprehensive-rust/zh-TW/) توسط [@hueich](https://github.com/hueich), [@victorhsieh](https://github.com/victorhsieh), [@mingyc](https://github.com/mingyc), [@kuanhungchen](https://github.com/kuanhungchen) و [@johnathan79717](https://github.com/johnathan79717).
ja: [中国語（繁体字）](https://google.github.io/comprehensive-rust/zh-TW/): [@hueich](https://github.com/hueich)、[@victorhsieh](https://github.com/victorhsieh)、[@mingyc](https://github.com/mingyc)、[@kuanhungchen](https://github.com/kuanhungchen)、[@johnathan79717](https://github.com/johnathan79717)
pt_br: [Chinês (Tradicional)](https://google.github.io/comprehensive-rust/zh-TW/) por [@hueich](https://github.com/hueich), [@victorhsieh](https://github.com/victorhsieh), [@mingyc](https://github.com/mingyc), [@kuanhungchen](https://github.com/kuanhungchen) e [@johnathan79717](https://github.com/johnathan79717).
uk: [Китайська (традиційна)](https://google.github.io/comprehensive-rust/zh-TW/) від [@hueich](https://github.com/hueich), [@victorhsieh](https://github.com/victorhsieh), [@mingyc](https://github.com/mingyc), [@kuanhungchen](https://github.com/kuanhungchen), and [@johnathan79717](https://github.com/johnathan79717).

source: [Japanese](https://google.github.io/comprehensive-rust/ja/) by [@CoinEZ-JPN](https://github.com/CoinEZ), [@momotaro1105](https://github.com/momotaro1105), [@HidenoriKobayashi](https://github.com/HidenoriKobayashi) and [@kantasv](https://github.com/kantasv).
uk: [Японьска](https://google.github.io/comprehensive-rust/ja/) від [@CoinEZ-JPN](https://github.com/CoinEZ), [@momotaro1105](https://github.com/momotaro1105), [@HidenoriKobayashi](https://github.com/HidenoriKobayashi) і [@kantasv](https://github.com/kantasv).

source: [Korean](https://google.github.io/comprehensive-rust/ko/) by [@keispace](https://github.com/keispace), [@jiyongp](https://github.com/jiyongp), [@jooyunghan](https://github.com/jooyunghan), and [@namhyung](https://github.com/namhyung).
fa: [کره ای](https://google.github.io/comprehensive-rust/ko/) توسط [@keispace](https://github.com/keispace), [@jiyongp](https://github.com/jiyongp) و [@jooyunghan](https://github.com/jooyunghan).
uk: [Корейска](https://google.github.io/comprehensive-rust/ko/) від [@keispace](https://github.com/keispace), [@jiyongp](https://github.com/jiyongp), [@jooyunghan](https://github.com/jooyunghan) та [@namhyung](https://github.com/namhyung).

source: [Spanish](https://google.github.io/comprehensive-rust/es/) by [@deavid](https://github.com/deavid).
fa: [اسپانیایی](https://google.github.io/comprehensive-rust/es/) توسط [@deavid](https://github.com/deavid).
ja: [スペイン語](https://google.github.io/comprehensive-rust/es/): [@deavid](https://github.com/deavid)
pt_br: [Espanhol](https://google.github.io/comprehensive-rust/es/) por [@deavid](https://github.com/deavid).
uk: [Іспанська](https://google.github.io/comprehensive-rust/es) від [@deavid](https://github.com/deavid).

source: [Ukrainian](https://google.github.io/comprehensive-rust/uk/) by [@git-user-cpp](https://github.com/git-user-cpp), [@yaremam](https://github.com/yaremam) and [@reta](https://github.com/reta).
uk: [Українська](https://google.github.io/comprehensive-rust/uk/) від [@git-user-cpp](https://github.com/git-user-cpp), [@yaremam](https://github.com/yaremam) і [@reta](https://github.com/reta).

source: Use the language picker in the top-right corner to switch between languages.
es: Cambia el idioma con el selector situado en la esquina superior derecha.
fa: از انتخابگر زبان در گوشه بالا سمت راست برای جابه‌جایی بین زبان‌ها استفاده کنید.
ja: 画面右上の言語切り替えボタンから、切り替えを行なってください。
ko: 페이지 오른쪽 위의 메뉴를 통해 다른 언어로 전환할 수 있습니다.
pt_br: Use o seletor de idioma no canto superior direito para alternar entre os idiomas.
uk: Використовуйте кнопку вибору мови у верхньому правому куті для перемикання між мовами.

source: Incomplete Translations
es: Traducciones Incompletas
fa: ترجمه‌های ناقص
ko: 번역 문제
pt_br: Traduções Incompletas
uk: Незавершені переклади

source: There is a large number of in-progress translations. We link to the most recently updated translations:
es: Hay muchas traducciones todavía en curso. A continuación, incluimos enlaces a las traducciones más actualizadas:
fa: تعداد زیادی ترجمه در حال انجام وجود دارد. ما به آخرین ترجمه های به روز شده پیوند می دهیم:
ja: 進行中の翻訳が多数あります。最新の翻訳へのリンクを以下に示します。
ko: 진행 중인 번역이 많습니다. 최근에 업데이트된 번역본으로 연결되는 링크는 다음과 같습니다:
pt_br: Há um grande número de traduções em andamento. Nós referenciamos as traduções mais recentemente atualizadas:
uk: Існує велика кількість незавершених перекладів. Ми посилаємося на останні оновлені переклади:

source: [Arabic](https://google.github.io/comprehensive-rust/ar/) by [@younies](https://github.com/younies)
uk: [Арабська](https://google.github.io/comprehensive-rust/ar/) від [@younies](https://github.com/younies).

source: [Bengali](https://google.github.io/comprehensive-rust/bn/) by [@raselmandol](https://github.com/raselmandol).
fa: [بنگالی](https://google.github.io/comprehensive-rust/bn/) توسط [@raselmandol](https://github.com/raselmandol).
ja: [ベンガル語](https://google.github.io/comprehensive-rust/bn/): [@raselmandol](https://github.com/raselmandol)
ko: [벵갈어](https://google.github.io/comprehensive-rust/bn/): [@raselmandol](https://github.com/raselmandol) 제공.
pt_br: [Bengali](https://google.github.io/comprehensive-rust/bn/) por [@raselmandol](https://github.com/raselmandol).
uk: [Бенгальська](https://google.github.io/comprehensive-rust/bn) від [@raselmandol](https://github.com/raselmandol).

source: [Farsi](https://google.github.io/comprehensive-rust/fa/) by [@Alix1383](https://github.com/alix1383), [@DannyRavi](https://github.com/DannyRavi), [@hamidrezakp](https://github.com/hamidrezakp), [@javad-jafari](https://github.com/javad-jafari) and [@moaminsharifi](https://github.com/moaminsharifi).
uk: [Фарсі](https://google.github.io/comprehensive-rust/fa/) від [@Alix1383](https://github.com/alix1383), [@DannyRavi](https://github.com/DannyRavi), [@hamidrezakp](https://github.com/hamidrezakp), [@javad-jafari](https://github.com/javad-jafari) і [@moaminsharifi](https://github.com/moaminsharifi).

source: [French](https://google.github.io/comprehensive-rust/fr/) by [@KookaS](https://github.com/KookaS), [@vcaen](https://github.com/vcaen) and [@AdrienBaudemont](https://github.com/AdrienBaudemont).
fa: [فرانسویی](https://google.github.io/comprehensive-rust/fr/) توسط [@KookaS](https://github.com/KookaS) و [@vcaen](https://github.com/vcaen).
uk: [Французька](https://google.github.io/comprehensive-rust/fr/) від [@KookaS](https://github.com/KookaS), [@vcaen](https://github.com/vcaen) і [@AdrienBaudemont](https://github.com/AdrienBaudemont).

source: [German](https://google.github.io/comprehensive-rust/de/) by [@Throvn](https://github.com/Throvn) and [@ronaldfw](https://github.com/ronaldfw).
fa: [آلمانی](https://google.github.io/comprehensive-rust/de/) توسط [@Throvn](https://github.com/Throvn) و [@ronaldfw](https://github.com/ronaldfw).
ja: [ドイツ語](https://google.github.io/comprehensive-rust/de/): [@Throvn](https://github.com/Throvn)、[@ronaldfw](https://github.com/ronaldfw)
ko: [독일어](https://google.github.io/comprehensive-rust/de/): [@Throvn](https://github.com/Throvn) 및 [@ronaldfw](https://github.com/ronaldfw) 제공.
pt_br: [Alemão](https://google.github.io/comprehensive-rust/de/) por [@Throvn](https://github.com/Throvn) e [@ronaldfw](https://github.com/ronaldfw).
uk: [Німецька](https://google.github.io/comprehensive-rust/de/) від [@Throvn](https://github.com/Throvn) і [@ronaldfw](https://github.com/ronaldfw).

source: [Italian](https://google.github.io/comprehensive-rust/it/) by [@henrythebuilder](https://github.com/henrythebuilder) and [@detro](https://github.com/detro).
fa: [ایتالیایی](https://google.github.io/comprehensive-rust/de/) توسط [@Throvn](https://github.com/Throvn) و [@ronaldfw](https://github.com/ronaldfw).
uk: [Італійська](https://google.github.io/comprehensive-rust/it/) від [@henrythebuilder](https://github.com/henrythebuilder) і [@detro](https://github.com/detro).

source: The full list of translations with their current status is also available either [as of their last update](https://google.github.io/comprehensive-rust/translation-report.html) or [synced to the latest version of the course](https://google.github.io/comprehensive-rust/synced-translation-report.html).
fa: فهرست کامل ترجمه‌ها با وضعیت فعلی‌شان نیز [در آخرین به‌روزرسانی](https://google.github.io/comprehensive-rust/translation-report.html) یا [همگام‌سازی شده با آخرین نسخه دوره](https://google.github.io/comprehensive-rust/synced-translation-report.html).
uk: Повний список перекладів з їхнім поточним статусом також доступний або [на момент останнього оновлення](https://google.github.io/comprehensive-rust/translation-report.html), або [синхронізований з останньою версією курсу](https://google.github.io/comprehensive-rust/synced-translation-report.html).

source: If you want to help with this effort, please see [our instructions](https://github.com/google/comprehensive-rust/blob/main/TRANSLATIONS.md) for how to get going. Translations are coordinated on the [issue tracker](https://github.com/google/comprehensive-rust/issues/282).
es: Si quieres ayudar en esta iniciativa, consulta [nuestras instrucciones](https://github.com/google/comprehensive-rust/blob/main/TRANSLATIONS.md) para empezar. Las traducciones se coordinan en la [herramienta de seguimiento de incidencias](https://github.com/google/comprehensive-rust/issues/282).
fa: اگر می‌خواهید به این کار کمک کنید، لطفاً [دستورالعمل‌های ما](https://github.com/google/comprehensive-rust/blob/main/TRANSLATIONS.md) را برای چگونگی ادامه کار ببینید. ترجمه ها در [issue tracker](https://github.com/google/comprehensive-rust/issues/282) هماهنگ و کنترل می شوند.
ja: この取り組みにご協力いただける場合は、[our instructions](https://github.com/google/comprehensive-rust/blob/main/TRANSLATIONS.md)をご覧ください。翻訳は[issue tracker](https://github.com/google/comprehensive-rust/issues/282)で管理されています。
ko: 이 과정의 번역 작업에 도움을 주고 싶다면 [여기](https://github.com/google/comprehensive-rust/blob/main/TRANSLATIONS.md) 설명된 내용을 참고하세요. 진행 중인 번역 작업에 대한 내용은 [이슈 트래커](https://github.com/google/comprehensive-rust/issues/282)를 참고하세요.
pt_br: Se você quiser ajudar com essa iniciativa, consulte [nossas instruções](https://github.com/google/comprehensive-rust/blob/main/TRANSLATIONS.md) sobre como proceder. As traduções são coordenadas no _[issue tracker](https://github.com/google/comprehensive-rust/issues/282)_.
uk: Якщо ви хочете допомогти в цьому, будь ласка, ознайомтеся з [нашими інструкціями](https://github.com/google/comprehensive-rust/blob/main/TRANSLATIONS.md) про те, як розпочати роботу. Переклади координуються за допомогою [трекера проблем](https://github.com/google/comprehensive-rust/issues/282).
