Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: This example is great, because it uses `impl Display` twice. It helps to explain that nothing here enforces that it is _the same_ `impl Display` type. If we used a single `T: Display`, it would enforce the constraint that input `T` and return `T` type are the same type. It would not work for this particular function, as the type we expect as input is likely not what `format!` returns. If we wanted to do the same via `: Display` syntax, we'd need two independent generic parameters.
es: Este ejemplo es fantástico porque usa `impl Display` dos veces. Nos ayuda explicar que no hay nada que obligue a que sea _el mismo_ tipo `impl Display`. Si se utiliza un solo `T: Display`, se aplicaría la restricción de que el tipo de entrada `T` y el tipo de retorno `T` son iguales. No funcionaría para esta función en concreto, ya que el tipo que esperamos como entrada probablemente no sea el que devuelve `format!`. Si quisiéramos hacer lo mismo a través de la sintaxis `: Display`, necesitaríamos dos parámetros genéricos independientes.
ko: 이 예시는 `impl Display`가 두번 사용 되었다는 점에서 훌륭합니다. 여기서 중요한 것은 이 두 `impl Display`가 실제로 같은 타입일 필요가 없다는 것입니다. 만약 `T: Display`로 트레잇 경계를 정하고 입력 파라메터와 리턴 값의 타입을 모두 `T`로 했다면, 이는 입력과 리턴값이 같은 타입임을 강제합니다. 이렇게 했다면 위의 예제는 동작하지 않았을 것입니다. 왜냐하면, 입력 값의 타입이 `format!`이 리턴하는 타입과 같지 않을 가능성이 높기 때문입니다. 만약 `: Display` 문법을 사용하고 싶다면 독립적인 제네릭 매개변수가 두 개가 필요합니다.

source: We will now look at some of the most common traits of the Rust standard library:
es: A continuación, veremos algunos de los _traits_ más comunes de la biblioteca estándar de Rust:
ko: 러스트 표준 라이브러리에는 다음과 같은 범용 트레잇들이 정의되어 있습니다:

source: [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html) and [`IntoIterator`](https://doc.rust-lang.org/std/iter/trait.IntoIterator.html) used in `for` loops,
es: [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html) y [`IntoIterator`](https://doc.rust-lang.org/std/iter/trait.IntoIterator.html) se usan en los bucles `for`.
ko: [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html)와 [`IntoIterator`](https://doc.rust-lang.org/std/iter/trait.IntoIterator.html) 트레잇은 `for` 반복문에서 사용됩니다,

source: [`From`](https://doc.rust-lang.org/std/convert/trait.From.html) and [`Into`](https://doc.rust-lang.org/std/convert/trait.Into.html) used to convert values,
es: [`From`](https://doc.rust-lang.org/std/convert/trait.From.html) y [`Into`](https://doc.rust-lang.org/std/convert/trait.Into.html) se usan para convertir valores.
ko: [`From`](https://doc.rust-lang.org/std/convert/trait.From.html)과 [`Into`](https://doc.rust-lang.org/std/convert/trait.Into.html) 트레잇은 값을 변환할 때 사용됩니다,

source: [`Read`](https://doc.rust-lang.org/std/io/trait.Read.html) and [`Write`](https://doc.rust-lang.org/std/io/trait.Write.html) used for IO,
es: [`Read`](https://doc.rust-lang.org/std/io/trait.Read.html) y [`Write`](https://doc.rust-lang.org/std/io/trait.Write.html) se usan para E/S.
ko: [`Read`](https://doc.rust-lang.org/std/io/trait.Read.html)와 [`Write`](https://doc.rust-lang.org/std/io/trait.Write.html) 트레잇은 I/O에 사용됩니다,

source: [`Add`](https://doc.rust-lang.org/std/ops/trait.Add.html), [`Mul`](https://doc.rust-lang.org/std/ops/trait.Mul.html), ... used for operator overloading, and
es: [`Add`](https://doc.rust-lang.org/std/ops/trait.Add.html), [`Mul`](https://doc.rust-lang.org/std/ops/trait.Mul.html), ... se usan para sobrecargar operadores, y
ko: [`Add`](https://doc.rust-lang.org/std/ops/trait.Add.html), [`Mul`](https://doc.rust-lang.org/std/ops/trait.Mul.html) 등의 트레잇들은 연산자 오버로딩(overloading)에 사용됩니다.

source: [`Drop`](https://doc.rust-lang.org/std/ops/trait.Drop.html) used for defining destructors.
es: [`Drop`](https://doc.rust-lang.org/std/ops/trait.Drop.html) se usa para definir destructores.
ko: [`Drop`](https://doc.rust-lang.org/std/ops/trait.Drop.html) 트레잇은 소멸자 정의에 사용됩니다.

source: [`Default`](https://doc.rust-lang.org/std/default/trait.Default.html) used to construct a default instance of a type.
es: [`Default`](https://doc.rust-lang.org/std/default/trait.Default.html) se usa para construir una instancia predeterminada de un tipo.
ko: [`Default`](https://doc.rust-lang.org/std/default/trait.Default.html) 트레잇은 어떤 타입의 기본값 인스턴스를 만들때 사용됩니다.

source: You can implement the [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html) trait on your own types:
es: Se puede implementar el trait [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html) en tus propios tipos:
ko: `Iterator`트레잇을 여러분이 정의한 타입에서 구현해 보겠습니다:

source: The `Iterator` trait implements many common functional programming operations over collections (e.g. `map`, `filter`, `reduce`, etc). This is the trait where you can find all the documentation about them. In Rust these functions should produce the code as efficient as equivalent imperative implementations.
es: El trait `Iterator` implementa muchas operaciones comunes de programación funcional en colecciones (por ejemplo, `map`, `filter`, `reduce`, etc.). Este es el trait que te permite encontrar toda la documentación sobre ellas. En Rust, estas funciones deberían generar un código tan eficiente como las implementaciones imperativas equivalentes.
ko: `Iterator` 트레잇은 컬렉션에 대한 여러 일반적인 함수 프로그래밍 작업(예: `map`, `filter`, `reduce` 등)을 구현합니다. 이는 관련 문서를 모두 찾을 수 있는 트레잇입니다. Rust에서는 이러한 함수가, 이와 동일한 일을 하는 명령형 구현만큼 효율적인 코드를 생성합니다.

source: `Iterator` implements `fn collect<B>(self) -> B where B: FromIterator<Self::Item>, Self: Sized`
es: `Iterator` implementa `fn collect<B>(self) -> B where B: FromIterator<Self::Item>, Self: Sized`.
ko: `Iterator`에는 다음 함수가 정의되어 있습니다: `fn collect<B>(self) -> B where B: FromIterator<Self::Item>, Self: Sized`

source: There are also implementations which let you do cool things like convert an `Iterator<Item = Result<V, E>>` into a `Result<Vec<V>, E>`.
es: También hay implementaciones que permiten hacer cosas interesantes, como convertir un `Iterator<Item = Result<V, E>>` en un `Result<Vec<V>, E>`.
ko: `Iterator<Item = Result<V, E>>`을 `Result<Vec<V>, E>`로 변환할 수 있는 멋진 기능들도 구현되어 있습니다.

source: The partial struct copy works nicely with default.
es: La copia parcial de la estructura funciona correctamente con los valores predeterminados. .
ko: 구조체의 일부분만 복사하고 싶을 때 `default`를 편리하게 사용할 수 있습니다.

source: Rust standard library is aware that types can implement `Default` and provides convenience methods that use it.
es: La biblioteca estándar de Rust tiene en cuenta que los tipos pueden implementar `Default` y, por ello, proporciona métodos prácticos que lo utilizan.
ko: 러스트 표준 라이브러리는 `Default` 트레잇을 구현한 타입을 위한 편의 메서드를 제공하기도 합니다.

source: the `..` syntax is called [struct update syntax](https://doc.rust-lang.org/book/ch05-01-defining-structs.html#creating-instances-from-other-instances-with-struct-update-syntax)
es: la sintaxis `..` se denomina [sintaxis de actualización de estructuras](https://doc.rust-lang.org/book/ch05-01-defining-structs.html#creating-instances-from-other-instances-with-struct-update-syntax)
ko: 이 `..` 문법은 [구조체 업데이트 문법(struct update syntax)](https://doc.rust-lang.org/book/ch05-01-defining-structs.html#creating-instances-from-other-instances-with-struct-update-syntax)라고 합니다

source: `Add`, `Mul`, ...
es: `Add`, `Mul`, etc.

source: You could implement `Add` for `&Point`. In which situations is that useful?
es: ¿En qué situaciones sería útil implementar `Add` para `&Point`?
ko: `&Point`가 `Add`를 구현하도록 할 수도 있습니다. 이게 어떤 경우에 유용할까요?

source: Short answer: Function type parameters are controlled by the caller, but associated types (like `Output`) are controlled by the implementor of a trait.
es: Respuesta corta: el llamador controla los parámetros tipo de la función, pero los tipos asociados (como `Output`) los controla el implementador de un trait .
ko: 답: 타입 파라메터를 호출하는 쪽에서 결정합니다. 반면 연관된 타입(`Output`같은) 은 트레잇을 구현하는 쪽에서 제어 가능합니다.

source: Day 3: Morning Exercises
es: Día 3: Ejercicios de la Mañana
ko: 3일차 오전 연습문제

source: We will design a classical GUI library using traits and trait objects.
es: Diseñaremos una biblioteca GUI clásica de _traits_ y objetos _trait_.

source: We will also look at enum dispatch with an exercise involving points and polygons.
es: También veremos la asignación de enumeraciones con un ejercicio que involucra puntos y polígonos.

source: Let us design a classical GUI library using our new knowledge of traits and trait objects.
es: Vamos a diseñar una biblioteca GUI clásica con nuestro recién adquirido conocimiento sobre _traits_ y objetos trait.
ko: 이번 연습문제에서는 트레잇와 트레잇 객체에 대해 배운것을 활용하여 고전적인 GUI 라이브러리를 설계할 것입니다.

source: We will have a number of widgets in our library:
es: Tendremos varios widgets en nuestra biblioteca:
ko: 라이브러리에는 몇 가지 위젯이 있습니다:

source: `Window`: has a `title` and contains other widgets.
es: `Window`: tiene un `title` y contiene otros widgets.
ko: `Window`: `title` 속성을 가지고 있으며, 다른 위젯들을 포함할 수 있습니다.

source: `Button`: has a `label` and a callback function which is invoked when the button is pressed.
es: `Button`: tiene una `label` y una función de retrollamada que se invoca cuando se pulsa el botón.
ko: `Button`: `label` 속성을 가지고 있으며, 버튼이 눌렸을때 실행되는 콜백 함수가 있습니다.

source: `Label`: has a `label`.
es: `Label`: tiene una `label`.
ko: `Label`: `label` 속성을 가지고 있습니다.

source: The widgets will implement a `Widget` trait, see below.
es: Los widgets implementarán un trait `Widget`, como se indica más abajo.
ko: 위젯들은 모두 `Widget` 트레잇을 구현합니다. 아래 코드를 참조하세요.

source: Copy the code below to <https://play.rust-lang.org/>, fill in the missing `draw_into` methods so that you implement the `Widget` trait:
es: Copia el siguiente fragmento de código en la página <https://play.rust-lang.org/> y rellena los métodos `draw_into` que faltan para implementar el trait `Widget`:
ko: 아래 코드를 <https://play.rust-lang.org/>에 복사하고 누락된 `draw_into`메서드를 채워 넣어 `Widget` 트레잇을 완성해봅시다:

source: The output of the above program can be something simple like this:
es: La salida del programa anterior puede ser algo sencillo como esto:
ko: 위 프로그램의 출력은 아래와 같습니다:

source: If you want to draw aligned text, you can use the [fill/alignment](https://doc.rust-lang.org/std/fmt/index.html#fillalignment) formatting operators. In particular, notice how you can pad with different characters (here a `'/'`) and how you can control alignment:
es: Si quieres trazar texto alineado, puedes usar los operadores de formato [relleno/alineación](https://doc.rust-lang.org/std/fmt/index.html#fillalignment). En concreto, observa cómo puedes rellenar con distintos caracteres (en este caso, `'/'`) y cómo puedes controlar la alineación:
ko: 텍스트를 줄맞춤 해서 그리려면 [fill/alignment](https://doc.rust-lang.org/std/fmt/index.html#fillalignment)를 참조하시기 바랍니다. 특수 문자(여기서는 `'/'`)로 패딩을 주는 방법과 정렬을 제어하는 방법을 확인하시기 바랍니다:

source: Using such alignment tricks, you can for example produce output like this:
es: Con estos trucos de alineación puedes, por ejemplo, obtener resultados como el siguiente:
ko: 위의 정렬 트릭을 사용하여 다음과 같은 출력을 생성할 수 있습니다:

source: Polygon Struct
es: Estructura de polígono
ko: Polygon 구조체

source: We will create a `Polygon` struct which contain some points. Copy the code below to <https://play.rust-lang.org/> and fill in the missing methods to make the tests pass:
es: Crearemos una estructura `Polygon` que contenga algunos puntos. Copia el siguiente fragmento de código en la página <https://play.rust-lang.org/> y rellena los métodos que faltan para pasar las pruebas:
ko: 우리는 몇개의 꼭지점을 가진 다각형을 표현하는 `Polygon` 구조체를 만들 것입니다. 아래 코드를 <https://play.rust-lang.org/>에 복사해서 테스트가 통과하도록 빠진 메서드를 구현하시면 됩니다:

source: Since the method signatures are missing from the problem statements, the key part of the exercise is to specify those correctly. You don't have to modify the tests.
es: Dado que faltan las firmas de los métodos en las instrucciones del problema, la parte clave del ejercicio consiste en especificarlas correctamente. No tienes que modificar las pruebas.
ko: 누락된 메서드 시그니처를 올바르게 정의하는 것이 문제의 핵심 부분입니다. 테스트는 수정하면 안됩니다.

source: Other interesting parts of the exercise:
es: Otras partes interesantes del ejercicio:
ko: 연습문제의 다른 흥미로운 부분:

source: Derive a `Copy` trait for some structs, as in tests the methods sometimes don't borrow their arguments.
es: Deriva un trait `Copy` en algunas estructuras, ya que, en las pruebas, los métodos a veces no toman prestados sus argumentos.
ko: 테스트 코드를 보면 어떤 메서드들은 인자를 borrow하는 대신 `Copy` 트레잇을 사용하기도 합니다. 구조체가 `Copy` 트레잇을 상속(derive)하도록 하면 됩니다.

source: Discover that `Add` trait must be implemented for two objects to be addable via "+". Note that we do not discuss generics until Day 3.
es: Descubrir que hay que implementar el trait `Add` para que se puedan añadir dos objetos mediante "+". Ten en cuenta que no hablaremos de los genéricos hasta el día 3.
ko: "+"를 사용하여 두 객체를 서로 더하려면 `Add` 트레잇을 구현해야 합니다. 이는 3일차에 다룰 내용입니다.

source: Error handling in Rust is done using explicit control flow:
es: La gestión de errores en Rust se realiza mediante un flujo de control explícito:
ko: 러스트에서 오류는 명시적인 흐름을 따라 처리가 됩니다:

source: Functions that can have errors list this in their return type,
es: Las funciones que pueden tener errores lo indican en su tipo de resultado devuelto.
ko: 오류를 발생할 수 있는 함수는 반환 타입에 이를 명시해야 합니다,

source: There are no exceptions.
es: No hay excepciones.
ko: 예외(exception) 기능은 없습니다.

source: Catching the Stack Unwinding
es: Capturar el Desenrrollado de la _Stack_
ko: 스택 되감기

source: Structured Error Handling with `Result`
es: Gestión Estructurada de Errores con `Result`
ko: `Result`를 이용한 구조화된 오류처리

source: We have already seen the `Result` enum. This is used pervasively when errors are expected as part of normal operation:
es: Ya hemos visto la _enum_ `Result`. Se utiliza normalmente cuando se esperan errores como parte del funcionamiento normal:
ko: 여러분은 이미 `Result` 열거형을 몇 번 봤습니다. 이 타입은 프로그램의 정상적인 수행 중에 발생할 수 있는 오류값들을 나타내기 위해 사용됩니다:

source: `Result` documentation is a recommended read. Not during the course, but it is worth mentioning. It contains a lot of convenience methods and functions that help functional-style programming.
es: La documentación sobre `Result` es una lectura recomendada. Aunque no se vea durante este curso, merece la pena mencinarlo. Contiene muchos métodos y funciones prácticos que ayudan a seguir una programación funcional.
ko: 수업중엔 아니지만 `Result`의 API 레퍼런스를 읽는 것을 권장합니다. 함수형 프로그래밍 스타일에 도움이 되는 편리한 메서드와 함수를 많이 배울 수 있습니다.

source: Propagating Errors with `?`
es: Propagar errores con `?`
ko: `?`를 이용한 오류 전파

source: The try-operator `?` is used to return errors to the caller. It lets you turn the common
es: El operador try `?` se utiliza para devolver errores al llamador. Te permite convertir
ko: 연산자 `?`는 호출자에게 오류를 반환할 때 사용합니다. 이를 이용하면 이런 코드를

source: The return type of the function has to be compatible with the nested functions it calls. For instance, a function returning a `Result<T, Err>` can only apply the `?` operator on a function returning a `Result<AnyT, Err>`. It cannot apply the `?` operator on a function returning an `Option<AnyT>` or `Result<T, OtherErr>` unless `OtherErr` implements `From<Err>`. Reciprocally, a function returning an `Option<T>` can only apply the `?` operator on a function returning an `Option<AnyT>`.
es: El tipo de resultado de la función tiene que ser compatible con las funciones anidadas que llama. Por ejemplo, una función que devuelve un `Result<T, Err>` solo puede aplicar el operador `?` a una función que devuelve un `Result<AnyT, Err>`. No puede aplicar el operador `?` a una función que devuelve un `Option<AnyT>` o `Result<T, OtherErr>` a menos que `OtherErr` implemente `From<Err>`. Recíprocamente, una función que devuelve un `Option<T>` solo puede aplicar el operador `?` a una función que devuelve un `Option<AnyT>`.
ko: 함수의 리턴 타입은 네스팅 되어 호출되는 함수의 리턴 타입과 호환되어야 합니다. 예를 들어 `Result<T, Err>`를 리턴하는 함수는 `Result<AnyT, Err>`를 리턴하는 함수를 호출할 때에만`?`를 사용할 수 있습니다. `Option<AnyT>`나 `Result<T, OtherErr>` (`OtherError`가 `From<Err>`를 구현하지 않는 다고 가정할 때)와 같은 타입을 리턴하는 함수를 호출할 때에는 `?`를 사용할 수 없습니다. 동일한 이유로, `Option<T>`를 리턴하는 함수는 `Option<AnyT>`를 리턴하는 함수를 호출할 때에만 `?`를 사용할 수 있습니다.

source: You can convert incompatible types into one another with the different `Option` and `Result` methods such as `Option::ok_or`, `Result::ok`, `Result::err`.
es: Puedes convertir tipos incompatibles entre sí con los distintos métodos de `Option` y `Result` como `Option::ok_or`, `Result::ok`, `Result::err`.
ko: `Option`과 `Result`간의 변환을 위해 `Option::ok_or`, `Result::ok`, `Result::err`와 같은 함수들을 사용할 수 있습니다.

source: The `From::from` call here means we attempt to convert the error type to the type returned by the function:
es: Aquí la llamada a `From::from` significa que intentamos convertir el tipo de error al tipo que devuelve la función:
ko: `From::from`을 통해 원래의 에러 타입을 이 함수가 반환하는 에러 타입으로 변환하고 있습니다:

source: It is good practice for all error types that don't need to be `no_std` to implement `std::error::Error`, which requires `Debug` and `Display`. The `Error` crate for `core` is only available in [nightly](https://github.com/rust-lang/rust/issues/103765), so not fully `no_std` compatible yet.
es: Se recomienda que todos los tipos de errores que no necesitan ser `no_std` implementen `std::error::Error`, que requiere `Debug` y `Display`. El crate `Error` para `core` solo está disponible en [nightly](https://github.com/rust-lang/rust/issues/103765), por lo que aún no es totalmente compatible con `no_std`.
ko: 모든 에러 타입 (`no_std`이어야 하는 에러 타입을 제외하고)에 대해 `std::error::Error`를 구현하는 것은 좋은 습관입니다. `std::error::Error`를 구현한다는 것은 `Debug`와 `Display`도 구현한다는 것입니다. `core`를 위한 `Error`크레이크는 [나이틀리](https://github.com/rust-lang/rust/issues/103765)에만 제공이 됩니다. 그래서 아직 `no_std`환경에서 사용할 수는 없습니다.

source: It's generally helpful for them to implement `Clone` and `Eq` too where possible, to make life easier for tests and consumers of your library. In this case we can't easily do so, because `io::Error` doesn't implement them.
es: Por lo general, es útil que también implementen `Clone` y `Eq`, siempre que sea posible, para facilitar las cosas a las pruebas y a los consumidores de tu biblioteca. En este caso, no podemos hacerlo de forma sencilla porque `io::Error` no los implementa.
ko: 가능하다면 `Clone`과 `Eq` 트레잇도 구현하도록 하세요. 여러분의 라이브러리가 테스트 하기 쉬워지고, 사용하기 좋아질 겁니다. 다만, 이 예제에서는 그렇게 하기 힘듭니다. 왜냐하면 `io::Error`는 이 트레잇들을 구현하고 있지 않기 때문입니다.

source: The [thiserror](https://docs.rs/thiserror/) crate is a popular way to create an error enum like we did on the previous page:
es: Uno de los métodos más populares para crear una _enum_ (enumeración) de errores es el crate [thiserror](https://docs.rs/thiserror/), como hicimos en la página anterior:
ko: [thiserror](https://docs.rs/thiserror/)는, 이전 페이지에서 보았던 것과 같은 에러 열거형을 쉽게 만들 수 있게 해 주는 유명한 크레이트 입니다:

source: `thiserror`'s derive macro automatically implements `std::error::Error`, and optionally `Display` (if the `#[error(...)]` attributes are provided) and `From` (if the `#[from]` attribute is added). It also works for structs.
es: La macro de derivación de `thiserror` implementa automáticamente `std::error::Error` y, de forma opcional, `Display` (si se proporcionan los atributos `#[error(...)]`) y `From` (si se añade el atributo `#[from]`). También funciona con estructuras.
ko: `thiserror`의 derive 매크로를 이용하면 `std::error::Error`과 `Display`(만약 `#[error(...)]` 어트리뷰트를 추가했을 경우), `From`(만약 `#[from]` 어트리뷰트를 추가했을 경우) 트레잇들이 자동으로 구현이 됩니다. 구조체에 대해서도 사용 가능합니다.

source: It doesn't affect your public API, which makes it good for libraries.
es: No afecta a tu API pública, lo que la hace idónea para las bibliotecas.
ko: 이 매크로를 사용해도 밖으로 노출되는 API가 변경되지는 않습니다. 라이브러리를 만들 경우에는 이게 중요하죠.

source: Sometimes we want to allow any type of error to be returned without writing our own enum covering all the different possibilities. `std::error::Error` makes this easy.
es: A veces, queremos permitir que se devuelva cualquier tipo de error sin escribir nuestra propia _enum_ que cubra todas las posibilidades. `std::error::Error` facilita este proceso.
ko: 때때로 우리는, 발생 가능한 모든 에러를 일일히 열거하지 않고, 어떤 종류의 에러라도 상관없이 리턴하고 싶을 때가 있습니다. `std::error::Error`를 이용하면 쉽습니다.

source: This saves on code, but gives up the ability to cleanly handle different error cases differently in the program. As such it's generally not a good idea to use `Box<dyn Error>` in the public API of a library, but it can be a good option in a program where you just want to display the error message somewhere.
es: Esto permite ahorrar código, pero no da la posibilidad de gestionar eficazmente los distintos casos de error en el programa. Por lo general, no es una buena idea utilizar `Box<dyn Error>` en la API pública de una biblioteca, pero puede ser una buena opción en un programa en el que solo quieras mostrar el mensaje de error en alguna parte.
ko: 이렇게 하면 코드의 양을 줄일 수 있습니다. 그러나 서로 다른 종류의 에러를 구별하여 다르게 처리하는 것이 불가능해 집니다. 때문에, `Box<dyn Error>`를 라이브러리의 API로 노출하는게 좋은 디자인은 아닙니다. 에러 발생 시, 그저 에러 메시지를 출력하고 싶은 경우와 같이 제한된 상황에서는 유용할 수 있습니다.

source: The widely used [anyhow](https://docs.rs/anyhow/) crate can help you add contextual information to your errors and allows you to have fewer custom error types:
es: El crate [anyhow](https://docs.rs/anyhow/), que se utiliza con frecuencia, puede ayudar a añadir información contextual a los errores y permite tener menos tipos de errores personalizados:
ko: [anyhow](https://docs.rs/anyhow/) 크레이트는 에러에 에러가 발생한 문맥에 대한 정보를 추가하기 위해 널리 사용되며, 이를 이용하면 서로 다른 문맥을 나타내기 사용자 정의 오류 타입을 많이 만들어야 하는 불편함을 피할 수 있습니다:

source: Mark unit tests with `#[test]`:
es: Marca pruebas unitarias con `#[test]`:
ko: 단위 테스트는 `#[test]` 로 표시합니다:

source: Use `cargo test` to find and run the unit tests.
es: Busca y ejecuta las pruebas unitarias con `cargo test`.
ko: `cargo test` 커맨드를 사용하면 단위 테스트를 찾아서 실행합니다.

source: Unit tests are often put in a nested module (run tests on the [Playground](https://play.rust-lang.org/)):
es: Las pruebas unitarias se suelen incluir en un módulo anidado (ejecuta las pruebas en el [_Playground_](https://play.rust-lang.org/)):
ko: 단위 테스트는 원래 모듈 밑에 서브 모듈로 만드는 경우가 많습니다. ([플레이그라운드](https://play.rust-lang.org/)에서 다음 테스트를 수행해 보세요):

source: Useful crates for writing tests
es: Crates útiles para escribir pruebas
ko: 테스트 작성에 유용한 크레이트

source: We will be seeing mostly safe Rust in this course, but it's important to know what Unsafe Rust is.
es: En este curso, casi todo lo que veremos es _Safe_ Rust, aunque es importante saber qué es _Unsafe_ Rust.
ko: 이 강의는 대부분 안전한 러스트에 대해 다루지만 안전하지 않은 러스트가 무엇인지는 알아 두어야 합니다.

source: Unsafe Rust does not mean the code is incorrect. It means that developers have turned off the compiler safety features and have to write correct code by themselves. It means the compiler no longer enforces Rust's memory-safety rules.
es: _Unsafe_ Rust no significa que el código sea incorrecto. Significa que los desarrolladores han desactivado las funciones de seguridad del compilador y que tienen que escribir el código correcto por su cuenta. Significa que el compilador ya no aplica las reglas de seguridad de memoria de Rust.
ko: 안전하지 않은 러스트라고 해서 코드가 부정확 하다는 뜻은 아닙니다. 여기서 안전하지 않다의 의미는 컴파일러가 제공해주는 안전 장치들이 꺼진 상태이며, 개발자가 스스로 정확하고 안전한 코드를 작성해야 함을 의미합니다. 이는 컴파일러가 더 이상 러스트의 메모리 안전과 관련된 규칙들을 적용하지 않는다는 것입니다.

source: We wouldn't actually use pointers for this because it can be done safely with references.
es: En realidad, no usaríamos punteros para este caso porque se puede hacer de forma segura con referencias.
ko: 참조를 사용하면 안전하게 구현할 수 있기 때문에, 실제로 포인터를 사용할 필요는 없습니다.
