Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: **Safe Rust:** memory safe, no undefined behavior possible.
es: **_Safe_ Rust:** memoria segura, sin posibilidad de comportamiento indefinido.
fa: در **Safe Rust:** حافظه ایمن یا memory safe، هیچ رفتار تعریف نشده‌ای امکان پذیر نیست.
ja: **安全な Rust:** メモリセーフで、未定義の動作は起こりえません。
ko: **안전한 러스트:** 메모리 관련 오류 발생 불가능, 정의되지 않은 동작 없음.
pt_br: **Rust Seguro (_Safe_):** memória segura, nenhum comportamento indefinido é possível.
uk: **Safe Rust:** безпека пам’яті, невизначена поведінка неможлива.

source: **Unsafe Rust:** can trigger undefined behavior if preconditions are violated.
es: **_Unsafe_ Rust:** puede activar un comportamiento no definido si se infringen las condiciones previas.
fa: در **Unsafe Rust:** در صورت نقض پیش‌شرط‌ها، می‌تواند باعث رفتار نامشخص شود.
ja: **アンセーフRust:** 前提条件に違反した場合、未定義の動作がトリガーされる可能性があります。
ko: **안전하지 않은 러스트:** 특별한 조건을 만족하지 않은채로 사용되면 정의되지 않은 동작을 유발할 수 있음.
pt_br: **Rust Inseguro (_Unsafe_):** pode desencadear comportamento indefinido se pré-condições forem violadas.
uk: **Небезпечний Rust:** може викликати невизначену поведінку, якщо порушуються попередні умови.

source: We saw mostly safe Rust in this course, but it's important to know what Unsafe Rust is.
fa: ما عمدتاً safe Rust را در این دوره دیدیم، اما مهم است که بدانیم Unsafe Rust چیست.
ja: このコースでは主に安全な Rust を見てきましたが、安全でない Rust とは何かを理解しておくことが重要です。
pt_br: Veremos principalmente Rust seguro neste curso, mas é importante saber o que é Rust inseguro.
uk: У цьому курсі ми розглянули переважно безпечний Rust, але важливо знати, що таке небезпечний Rust.

source: Unsafe code is usually small and isolated, and its correctness should be carefully documented. It is usually wrapped in a safe abstraction layer.
es: Por lo general, el código inseguro es pequeño y está aislado, y su corrección debe estar bien documentada. Suele estar envuelto en una capa de abstracción segura.
fa: کد ناامن معمولا کوچک و ایزوله است و صحت آن باید به دقت مستند شود. معمولاً در یک لایه انتزاعی ایمن پیچیده می‌شود.
ja: アンセーフなコードは通常、小規模で分離されており、その正確性は慎重に文書化されている必要があります。通常は安全な抽象化レイヤでラップされています。
ko: 보통, 안전하지 않은 러스트 코드는 크기가 작으며, 독립적으로 존재합니다. 그리고 코드가 왜 잘 작동하는지에 대해 세밀하게 문서화가 되어 있습니다. 그리고, 많은 경우 안전한 러스트 코드를 통해서 추상화를 시킨 후 사용하게 됩니다.
pt_br: Código inseguro é geralmente pequeno e isolado, e seu funcionamento correto deve ser cuidadosamente documentado. Geralmente é envolto em uma camada de abstração segura.
uk: Небезпечний код зазвичай невеликий та ізольований, і його правильність слід ретельно задокументувати. Зазвичай він загорнутий у безпечний рівень абстракції.

source: Unsafe Rust gives you access to five new capabilities:
es: Rust inseguro te permite acceder a cinco nuevas funciones:
fa: این Unsafe Rust به شما امکان دسترسی به پنج قابلیت جدید را می‌دهد:
ja: アンセーフRustでは、次の 5 つの新機能を利用できます。
ko: 안전하지 않은 러스트를 이용하면 다음과 같은 다섯 가지 것들이 가능해 집니다:
pt_br: O código inseguro do Rust oferece acesso a cinco novos recursos:
uk: Небезпечний Rust дає вам доступ до п’яти нових можливостей:

source: Dereference raw pointers.
es: Desreferenciar punteros sin formato.
fa: اشاره‌گرهای خام.
ja: 生ポインタの参照外し。
ko: 원시 포인터 역참조(따라가기)
pt_br: Desreferenciar ponteiros brutos (_raw pointers_).
uk: Розіменування необроблених вказівників.

source: Access or modify mutable static variables.
es: Acceder o modificar variables estáticas mutables.
fa: به متغیرهای mutable static variable تغییر دسترسی دهید.
ja: 可変の静的変数へのアクセスまたは変更。
ko: 정적 가변변수 접근 및 수정.
pt_br: Acessar ou modificar variáveis estáticas mutáveis.
uk: Доступ або зміна мутабельних статичних змінних.

source: Access `union` fields.
es: Acceder a los campos `union`.
fa: به فیلدهای `union` دسترسی پیدا کنید.
ja: `union` フィールドへのアクセス。
ko: `union` 필드 접근.
pt_br: Acessar os campos de uma `union`.
uk: Доступ до полів `union`.

source: Call `unsafe` functions, including `extern` functions.
es: Llamar a funciones `unsafe`, incluidas las funciones `extern`.
fa: توابع `unsafe`، از جمله توابع `extern` را فراخوانی کنید.
ja: `extern` 関数を含む `unsafe` 関数の呼び出し。
ko: `extern` 함수를 포함한 `unsafe` 함수 호출.
pt_br: Chamar funções `unsafe` (inseguras), incluindo funções `extern` (externas).
uk: Викликати `unsafe` функції, включаючи `extern` функції.

source: Implement `unsafe` traits.
es: Implementar traits `unsafe`.
fa: ویژگی‌های `unsafe` را اجرا کنید.
ja: `unsafe` トレイトの実装。
ko: `unsafe` 트레잇 구현.
pt_br: Implementar _traits_ `unsafe`.
uk: Реалізація `unsafe` трейтів.

source: We will briefly cover unsafe capabilities next. For full details, please see [Chapter 19.1 in the Rust Book](https://doc.rust-lang.org/book/ch19-01-unsafe-rust.html) and the [Rustonomicon](https://doc.rust-lang.org/nomicon/).
es: A continuación, hablaremos brevemente sobre las funciones que no son seguras. Para obtener más información, consulta el [capítulo 19.1 del Libro de Rust](https://doc.rust-lang.org/book/ch19-01-unsafe-rust.html) y el documento [Rustonomicon](https://doc.rust-lang.org/nomicon/).
fa: در ادامه به طور خلاصه به قابلیت‌های unsafe می‌پردازیم. برای جزئیات کامل، لطفاً به [Chapter 19.1 in the Rust Book](https://doc.rust-lang.org/book/ch19-01-unsafe-rust.html) و [Rustonomicon](https://doc.rust-lang.org/nomicon/).
ja: 次に、安全でない機能について簡単に説明します。詳しくは、[Rust Book の第 19.1 章](https://doc.rust-lang.org/book/ch19-01-unsafe-rust.html)と、[Rustonomicon](https://doc.rust-lang.org/nomicon/) をご覧ください。
ko: 위 기능들에 대해 간략히 살펴보겠습니다. 자세한 내용은 [러스트 프로그래밍 언어, 19.1절](https://doc.rust-lang.org/book/ch19-01-unsafe-rust.html)과 [Rustonomicon](https://doc.rust-lang.org/nomicon/)를 참조하세요.
pt_br: A seguir, abordaremos brevemente os recursos inseguros. Para detalhes completos, consulte o [Capítulo 19.1 no Rust Book](https://doc.rust-lang.org/book/ch19-01-unsafe-rust.html) e o [Rustonomicon](https://doc.rust-lang.org/nomicon/).
uk: Далі ми коротко розглянемо небезпечні можливості. Щоб отримати повну інформацію, перегляньте [розділ 19.1 у книзі Rust](https://doc.rust-lang.org/book/ch19-01-unsafe-rust.html) та [Rustonomicon](https://doc .rust-lang.org/nomicon/).

source: Unsafe Rust does not mean the code is incorrect. It means that developers have turned off some compiler safety features and have to write correct code by themselves. It means the compiler no longer enforces Rust's memory-safety rules.
fa: همینطور Unsafe Rust به این معنی نیست که کد نادرست است. این بدان معنی است که توسعه‌دهندگان برخی از ویژگی‌های ایمنی کامپایلر را خاموش کرده‌اند و باید کد صحیح را خودشان بنویسند. این بدان معناست که کامپایلر دیگر قواعد ایمنی Rust را اجرا نمی‌کند.
ja: アンセーフRustは、コードが正しくないことを意味するものではありません。デベロッパーが一部のコンパイラ安全性機能をオフにし、自分で正しいコードを記述しなければならないことを意味します。また、コンパイラがRustのメモリ安全性に関するルールを強制しなくなるということを意味します。
pt_br: Rust inseguro não significa que o código esteja incorreto. Significa que os desenvolvedores desligaram os recursos de segurança do compilador e precisam escrever o código corretamente por eles mesmos. Significa também que o compilador não impõe mais as regras de segurança de memória do Rust.
uk: Небезпечний Rust не означає, що код неправильний. Це означає, що розробники вимкнули деякі функції безпеки компілятора і змушені писати коректний код самостійно. Це означає, що компілятор більше не забезпечує дотримання правил безпеки пам'яті Rust.

source: Creating pointers is safe, but dereferencing them requires `unsafe`:
es: La creación de punteros es un proceso seguro, pero para anular las referencias, es necesario utilizar `unsafe`:
fa: ایجاد اشاره‌گر ایمن است، اما عدم ارجاع به آنها «ناامن» یا `unsafe` است:
ja: ポインタの作成は安全ですが、参照外しには `unsafe` が必要です。
ko: 포인터를 만드는 것은 안전합니다. 하지만 역참조(따라가기)할 경우 `unsafe`가 필요합니다:
pt_br: Criar ponteiros é seguro, mas desreferenciá-los requer `unsafe`:
uk: Створення вказівників є безпечним, але для їх розіменування потрібно `unsafe`:

source: "careful!"
fa: "مراقب باش!"
pt_br: "cuidado!"
uk: "обережно!"

source: // SAFETY: r1 and r2 were obtained from references and so are guaranteed to // be non-null and properly aligned, the objects underlying the references // from which they were obtained are live throughout the whole unsafe // block, and they are not accessed either through the references or // concurrently through any other pointers.
uk: // БЕЗПЕКА: r1 та r2 були отримані з посилань і тому // гарантовано є ненульовими та правильно вирівняними, об'єкти, що лежать в основі // посилань, з яких вони були отримані, є дійсними на протязі // всього небезпечного блоку, і до них немає доступу ні через // посилання, ні одночасно через будь-які інші покажчики.

source: "r1 is: {}"
fa: "r1 برابر هست: {}"
pt_br: "r1 é: {}"
uk: "r1 є: {}"

source: "uhoh"
fa: "اوهو"
pt_br: "oh-oh"
uk: "ууухооох"

source: "r2 is: {}"
fa: "r2 برابر هست: {}"
pt_br: "r2 é: {}"
uk: "r2 є: {}"

source: // NOT SAFE. DO NOT DO THIS. /* let r3: &String = unsafe { &*r1 }; drop(s); println!("r3 is: {}", *r3); */
ja: // 安全でないため、NOT SAFE。このような記述をしないでください。 /* let r3: &String = unsafe { &*r1 }; drop(s); println!("r3 is: {}", *r3); */
pt_br: // NÃO É SEGURO. NÃO FAÇA ISSO. /* let r3: &String = unsafe { &*r1 }; drop(s); println!("r3 é: {}", *r3); */
uk: // НЕБЕЗПЕЧНО. НЕ РОБІТЬ ЦЬОГО. /* let r3: &String = unsafe { &*r1 }; drop(s); println!("r3 is: {}", *r3); */

source: It is good practice (and required by the Android Rust style guide) to write a comment for each `unsafe` block explaining how the code inside it satisfies the safety requirements of the unsafe operations it is doing.
es: Se recomienda (y es obligatorio en la guía de estilo Rust de Android) escribir un comentario para cada bloque `unsafe` explicando cómo el código que contiene cumple los requisitos de seguridad de las operaciones inseguras que realiza.
fa: این تمرین خوبی است (و طبق راهنمای سبک Android Rust لازم است) برای هر بلوک `unsafe` یک نظر بنویسید و توضیح دهد که چگونه کد داخل آن الزامات ایمنی عملیات ناامنی را که انجام می‌دهد برآورده می‌کند.
ja: `unsafe`ブロックごとにコメントを記述し、そのブロック内のコードが行うアンセーフな操作がどのように安全性要件を満たしているのかを記述することをおすすめします（Android Rust スタイルガイドでも必須とされています）。
ko: 모든 `unsafe` 블록에 대해 왜 그 코드가 안전한지에 대한 설명을 주석으로 다는 것은 좋은 습관입니다(사실 안드로이드의 러스트 스타일 가이드에서는 이게 필수입니다).
pt_br: É uma boa prática (e exigida pelo guia de estilo do Android Rust) escrever um comentário para cada bloco `unsafe` explicando como o código dentro dele satisfaz os requisitos de segurança para a operação insegura que está fazendo.
uk: Хорошою практикою є (і вимагається посібником зі стилю Android Rust) писати коментар до кожного `unsafe` блоку, пояснюючи, наскільки код у ньому відповідає вимогам безпеки небезпечних операцій, які він виконує.

source: In the case of pointer dereferences, this means that the pointers must be [_valid_](https://doc.rust-lang.org/std/ptr/index.html#safety), i.e.:
es: En el caso de la desreferenciación de punteros, significa que los punteros deben ser [_válidos_](https://doc.rust-lang.org/std/ptr/index.html#safety), por ejemplo:
fa: در مورد عدم ارجاع اشاره‌گر، این بدان معنی است که نشانگرها باید [_valid_](https://doc.rust-lang.org/std/ptr/index.html#safety) باشند، یعنی:
ja: ポインタ参照外しの場合、これはポインタが [_valid_](https://doc.rust-lang.org/std/ptr/index.html#safety) でなければならないことを意味します。つまり、次のようになります。
ko: 포인터 역참조를 할 경우, 포인터가 [_유효_](https://doc.rust-lang.org/std/ptr/index.html#safety)해야 합니다. 예를 들어:
pt_br: No caso de desreferência de ponteiros, isso significa que os ponteiros devem ser [_válidos_](https://doc.rust-lang.org/std/ptr/index.html#safety), ou seja:
uk: У випадку розіменувань покажчиків це означає, що покажчики мають бути [_дійсними_](https://doc.rust-lang.org/std/ptr/index.html#safety), тобто:

source: The pointer must be non-null.
es: El puntero no puede ser nulo.
fa: اشاره‌گر باید غیر تهی یا non-null باشد.
ja: ポインタは null 以外でなければならないこと。
ko: 포인터는 null이면 안됩니다.
pt_br: O ponteiro deve ser não nulo.
uk: Покажчик має бути ненульовим.

source: The pointer must be _dereferenceable_ (within the bounds of a single allocated object).
es: El puntero debe ser _desreferenciable_ (dentro de los límites de un único objeto asignado).
fa: اشاره‌گر باید _dereferenceable_ باشد (در محدوده یک object اختصاص داده شده).
ja: ポインタは、（割り当てられた単一のオブジェクトの境界内で）参照外し可能でなければならない。
ko: 포인터는 따라가기가 가능해야 합니다 (객체의 어느 한 부분을 가리키고 있어야 합니다).
pt_br: O ponteiro deve ser _desreferenciável_ (dentro dos limites de um único objeto alocado).
uk: Покажчик має бути _розіменоваючим_ (у межах одного виділеного об’єкта).

source: The object must not have been deallocated.
es: El objeto no debe haberse desasignado.
fa: این object نباید جابجا شده باشد.
ja: オブジェクトが解放されていないこと。
ko: 이미 반환된 객체를 가리키면 안됩니다.
pt_br: O objeto não deve ter sido desalocado.
uk: Об’єкт не повинен бути звільнений.

source: There must not be concurrent accesses to the same location.
es: No debe haber accesos simultáneos a la misma ubicación.
fa: دسترسی همزمان به یک مکان نباید وجود داشته باشد.
ja: 同じロケーションに同時アクセスすることがないこと。
ko: 같은 위치에 대해 동시적인 접근이 있으면 안됩니다.
pt_br: Não deve haver acessos simultâneos à mesma localização.
uk: Не повинно бути одночасних доступів до того самого розташування.

source: If the pointer was obtained by casting a reference, the underlying object must be live and no reference may be used to access the memory.
es: Si el puntero se ha obtenido enviando una referencia, el objeto subyacente debe estar activo y no puede utilizarse ninguna referencia para acceder a la memoria.
fa: اگر اشاره‌گر با فرستادن یک reference به دست آمده باشد، object زیرین باید live باشد و نمی‌توان از هیچ مرجعی برای دسترسی به حافظه استفاده کرد.
ja: 参照をキャストしてポインタを取得した場合、基になるオブジェクトが存続しなければならず、他のいかなる参照を通してもそのメモリにアクセスがないこと
ko: 참조를 캐스팅 해서 포인터를 만들었다면, 그 참조가 가리키는 객체는 살아 있어야 하며, 그 객체의 메모리를 접근하는 참조가 하나도 없어야 합니다.
pt_br: Se o ponteiro foi obtido lançando uma referência, o objeto subjacente deve estar válido e nenhuma referência pode ser usada para acessar a memória.
uk: Якщо вказівник було отримано шляхом приведення посилання, базовий об’єкт має бути дійсним, і жодне посилання не може використовуватися для доступу до пам’яті.

source: In most cases the pointer must also be properly aligned.
es: En la mayoría de los casos, el puntero también debe estar alineado adecuadamente.
fa: در بیشتر موارد، اشاره‌گر نیز باید به درستی تراز شود.
ja: ほとんどの場合、ポインタも適切にアラインされる必要があります。
ko: 대부분의 경우 포인터는 align되어 있어야 합니다.
pt_br: Na maioria dos casos, o ponteiro também deve estar alinhado corretamente.
uk: У більшості випадків вказівник також має бути правильно вирівняний.

source: The "NOT SAFE" section gives an example of a common kind of UB bug: `*r1` has the `'static` lifetime, so `r3` has type `&'static String`, and thus outlives `s`. Creating a reference from a pointer requires _great care_.
fa: بخش «NOT SAFE» نمونه‌ای از یک نوع رایج از اشکال UB را ارائه می‌کند: `*r1` دارای طول عمر `'static` است، بنابراین `r3` دارای نوع `&'static String` است و بنابراین عمر `s` بیشتر می‌شود. ایجاد یک مرجع از یک اشاره گر نیاز به دقت بسیار دارد.
ja: "NOT SAFE"というコメントがあるところは、よくあるUBバグの例を示しています。`*r1` のライフタイムは `'static` であるため、`r3` の型は `&'static String` となり、`s` より長く存続します。ポインタからの参照の作成には細心の注意が必要です。
pt_br: A seção "NÃO É SEGURO" dá um exemplo de um tipo comum de bug UB: `*r1` tem o tempo de vida `'static`, então `r3` tem o tipo `&'static String`, e portanto sobrevive a `s`. Criar uma referência a partir de um ponteiro requer _muito cuidado_.
uk: У розділі "НЕ БЕЗПЕЧНО" наведено приклад поширеної помилки UB: `*r1` має `'static` час життя, тому `r3` має тип `&'static String`, і таким чином переживає `s`. Створення посилання з покажчика вимагає _великої обережності_.

source: It is safe to read an immutable static variable:
es: Es seguro leer una variable estática inmutable:
fa: خواندن یک متغیر استاتیک تغییرناپذیر بی‌خطر است:
ja: 不変の静的変数は安全に読み取ることができます。
ko: 불변 정적변수를 읽는 것은 안전합니다:
pt_br: É seguro ler uma variável estática imutável:
uk: Читати незмінну статичну змінну безпечно:

source: "Hello, world!"
fa: "سلام دنیا!"
pt_br: "Olá, mundo!"
uk: "Привіт, світ!"

source: However, since data races can occur, it is unsafe to read and write mutable static variables:
es: Sin embargo, dado que pueden producirse carreras de datos, no es seguro leer y escribir variables estáticas mutables:
fa: با‌این‌حال، از آنجایی که شرایط رقابتی داده‌ها ممکن است رخ دهد، خواندن و نوشتن متغیرهای mutable static ناامن است:
ja: ただし、データ競合が発生する可能性があるため、可変静的変数の読み取りと書き込みは安全ではありません。
ko: 하지만, 데이터 레이스가 발생할 수 있으므로 정적 가변변수를 읽고 쓰는 것은 안전하지 않습니다:
pt_br: No entanto, como podem ocorrer corridas de dados (_data races_), não é seguro ler e gravar dados em variáveis estáticas mutáveis:
uk: Однак, оскільки можуть відбуватися перегони даних, небезпечно читати і записувати статичні змінні, що мутуються:

source: // SAFETY: There are no other threads which could be accessing `COUNTER`.
uk: // БЕЗПЕКА: Немає інших потоків, які могли б отримати доступ до `COUNTER`.

source: The program here is safe because it is single-threaded. However, the Rust compiler is conservative and will assume the worst. Try removing the `unsafe` and see how the compiler explains that it is undefined behavior to mutate a static from multiple threads.
fa: برنامه در اینجا امن است زیرا single-thread است. با این حال، کامپایلر Rust محافظه کار است و بدترین‌ها را در نظر می‌گیرد. `unsafe` را حذف کنید و ببینید چگونه کامپایلر توضیح می‌دهد که جهش یک static از چندین thread یک رفتار تعریف نشده است.
ja: このプログラムはシングルスレッドなので安全です。しかし、Rust コンパイラは保守的で、最悪の事態を想定します。`unsafe` を削除すると、複数のスレッドから静的変数を変更することは未定義の動作であることを説明するメッセージがコンパイラにより表示されるはずです。
pt_br: O programa aqui é seguro porque é _single-threaded_. No entanto, o compilador Rust é conservador e assumirá o pior. Tente remover o `unsafe` e veja como o compilador explica que é um comportamento indefinido alterar uma variável estática de várias _threads_.
uk: Програма тут безпечна, оскільки вона однопотокова. Однак компілятор Rust є консервативним і припускає найгірше. Спробуйте видалити `unsafe` і подивіться, як компілятор пояснює, що мутація статики з кількох потоків є невизначеною поведінкою.

source: Using a mutable static is generally a bad idea, but there are some cases where it might make sense in low-level `no_std` code, such as implementing a heap allocator or working with some C APIs.
es: No suele ser buena idea usar una variable estática mutable, pero en algunos casos puede encajar en código `no_std` de bajo nivel, como implementar una asignación de _heap_ o trabajar con algunas APIs C.
fa: استفاده از یک static قابل تغییر (mutable) به طور کلی ایده بدی است، اما مواردی وجود دارد که ممکن است در کدهای سطح پایین `no_std` منطقی باشد، مانند اجرای یک heap allocator یا کار با برخی از APIهای مربوط به زبان C.
ja: 一般的に、可変静的変数を使用することはおすすめしませんが、ヒープ アロケータの実装や一部の C API の操作など、低レベルの `no_std` コードでは適している場合もあります。
ko: 일반적으로 이야기 해서, 정적 가변 변수를 쓰는 것은 좋은 아이디어가 아닙니다. 그러나 `no_std`와 같은 저수준 코딩을 할 경우에는 필요하기도 합니다. 예를 들어 힙 할당기를 구현하거나, C API를 사용하는 게 그런 경우입니다.
pt_br: Usar uma variável estática mutável geralmente é uma má ideia, mas há alguns casos em que isso pode fazer sentido, tais como em código `no_std` de baixo nível, como implementar um alocador de heap ou trabalhar com algumas APIs C.
uk: Використання мутабельної статики, як правило, погана ідея, але є деякі випадки, коли це може мати сенс у низькорівневому коді `no_std`, наприклад реалізація розподілювача купи або робота з деякими API C.

source: Unions are like enums, but you need to track the active field yourself:
es: Las uniones son como _enums_ (enumeraciones), pero eres tú quien debe hacer el seguimiento del campo activo:
fa: همینطور Unionها مانند enum‌ها هستند، اما شما باید خودتان active field را ردیابی کنید:
ja: 共用体は列挙型に似ていますが、アクティブ フィールドを自分でトラッキングする必要があります。
ko: 유니온 타입은 열거형(enum)과 비슷하지만, 어떤 필드에 해당하는 값을 가지고 있는지 여부를 프로그래머가 수동으로 추적해야 합니다:
pt_br: _Unions_ são como _enums_, mas você mesmo precisa rastrear o campo ativo:
uk: Об’єднання подібні до переліків, але вам потрібно самостійно відстежувати активне поле:

source: // Undefined behavior!
ja: // 未定義の動作
pt_br: // Comportamento indefinido!
uk: // Невизначена поведінка!

source: Unions are very rarely needed in Rust as you can usually use an enum. They are occasionally needed for interacting with C library APIs.
es: Las uniones raramente son necesarias en Rust, ya que se suele utilizar una _enum_. A veces se necesitan para interactuar con APIs de biblioteca C.
fa: به طور کلی Unionها در Rust به ندرت مورد نیاز هستند زیرا معمولاً می‌توانید از enum استفاده کنید. آنها گاهی اوقات برای تعامل با APIهای کتابخانه C مورد نیاز هستند.
ja: Rust では、通常は列挙型を使用できるため、共用体はほとんど必要ありません。共用体は、C ライブラリ API とのやり取りで必要になることがあります。
ko: 러스트에는 열거형이 있기 때문에 유니온이 필요한 경우는 극히 드뭅니다. 유니온은 C 라이브러리 API를 사용할 때 가끔 필요합니다.
pt_br: _Unions_ raramente são necessárias no Rust, pois geralmente você pode usar um _enum_. Elas são ocasionalmente necessárias para interagir com as APIs da biblioteca C.
uk: Об’єднання дуже рідко потрібні в Rust, оскільки зазвичай можна використовувати перелік. Іноді вони потрібні для взаємодії з API бібліотек C.

source: If you just want to reinterpret bytes as a different type, you probably want [`std::mem::transmute`](https://doc.rust-lang.org/stable/std/mem/fn.transmute.html) or a safe wrapper such as the [`zerocopy`](https://crates.io/crates/zerocopy) crate.
es: Si solo quieres reinterpretar los bytes como otro tipo, probablemente te interese [`std::mem::transmute`](https://doc.rust-lang.org/stable/std/mem/fn.transmute.html) o una envoltura segura, como el crate [`zerocopy`](https://crates.io/crates/zerocopy).
fa: اگر فقط می‌خواهید بایت‌ها را به‌عنوان نوع متفاوتی تفسیر کنید، احتمالاً [`std::mem::transmute`](https://doc.rust-lang.org/stable/std/mem/fn.transmute.html را می‌خواهید ) یا یک safe wrapper مانند جعبه [`zerocopy`(https://crates.io/crates/zerocopy).
ja: バイトを別の型として再解釈したい場合は、[`std::mem::transmute`](https://doc.rust-lang.org/stable/std/mem/fn.transmute.html) か、[`zerocopy`](https://crates.io/crates/zerocopy) クレートのような安全なラッパーを使用することをおすすめします。
ko: 바이트들을 특정 타입으로 재해석 하고 싶다면 [`std::mem::transmute`](https://doc.rust-lang.org/stable/std/mem/fn.transmute.html)나 좀 더 안전한 [`zerocopy`](https://crates.io/crates/zerocopy) 크레이트를 사용하세요.
pt_br: Se você deseja apenas reinterpretar os bytes como um tipo diferente, você provavelmente deveria usar [`std::mem::transmute`](https://doc.rust-lang.org/stable/std/mem/fn.transmute.html) ou um wrapper seguro como o _crate_ [`zerocopy`](https://crates.io/crates/zerocopy).
uk: Якщо ви просто хочете по-новому інтерпретувати байти як інший тип, вам, мабуть, знадобиться [`std::mem::transmute`](https://doc.rust-lang.org/stable/std/mem/fn.transmute.html ) або безпечна оболонка, як-от крейт [`zerocopy`](https://crates.io/crates/zerocopy).

source: Calling Unsafe Functions
es: Llamar Funciones Unsafe (Inseguras)
fa: فراخوانی متدهای ناامن
ja: Unsafe関数の呼び出し
ko: 안전하지 않은 함수 호출
pt_br: Chamando Funções Inseguras
uk: Виклик небезпечних функцій

source: A function or method can be marked `unsafe` if it has extra preconditions you must uphold to avoid undefined behaviour:
es: Una función o método se puede marcar como `unsafe` si tiene condiciones previas adicionales que debes mantener para evitar un comportamiento indefinido:
fa: یک function یا method را می‌توان `unsafe` علامت‌گذاری کرد، اگر دارای پیش‌شرط‌های اضافی باشد که باید برای جلوگیری از رفتار نامشخص رعایت کنید:
ja: 未定義の動作を回避するために満たす必要がある追加の前提条件がある関数またはメソッドは、`unsafe` とマークできます。
ko: 함수나 메서드가 정의되지 않은 동작으로 빠지지 않게 하기 위해서 만족해야 하는 전제 조건이 있는 경우, 그 함수나 메서드를 `unsafe`로 표시할 수 있습니다:
pt_br: Uma função ou método pode ser marcado como `unsafe` se houver pré-condições extras que você deve respeitar para evitar comportamento indefinido:
uk: Функцію або метод можна позначити як `unsafe`, якщо вони мають додаткові передумови, які ви повинні підтримувати, щоб уникнути невизначеної поведінки:

source: // SAFETY: The indices are in the correct order, within the bounds of the // string slice, and lie on UTF-8 sequence boundaries.
uk: // БЕЗПЕКА: Індекси розташовані в правильному порядку в межах // фрагмента рядка та лежать на межах послідовності UTF-8.

source: "emoji: {}"
uk: "смайлик: {}"

source: "char count: {}"
pt_br: "contador de caracteres: {}"
uk: "кількість символів: {}"
