Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: To document an item from inside the item (such as inside a module), use `//!` or `/*! .. */`, called "inner doc comments":
fa: برای مستند کردن یک آیتم از درون خود آیتم (مانند درون یک ماژول)، از `!//` یا `/* .. !*/` استفاده کنید که به آن "کامنت‌های مستندات داخلی" می‌گویند:
ja: アイテム内（モジュール内など）からアイテムをドキュメント化するには、「内部ドキュメントのコメント」と呼ばれる `//!` または `/*! .. */` を使用します。
pt_br: Para documentar um item de dentro do item (como dentro de um módulo), use `//!` ou `/*! .. */`, chamado de "comentários de documentação interna":
uk: Щоб задокументувати елемент із середини елемента (наприклад, всередині модуля), використовуйте `//!` або `/*! .. */`, які називаються "внутрішні коментарі до документу":

source: //! This module contains functionality relating to divisibility of integers.
ja: //! このモジュールには、整数の整除に関連する機能が含まれています。
pt_br: //! Este módulo contém funcionalidades relacionadas à divisibilidade de inteiros.
uk: //! Цей модуль містить функціональність, пов'язану з подільністю цілих чисел.

source: Show students the generated docs for the `rand` crate at <https://docs.rs/rand>.
fa: مستندات تولیدشده برای `rand` crate را در <https://docs.rs/rand> به دانش‌آموزان نشان دهید.
ja: <https://docs.rs/rand> で `rand` クレート用に生成されたドキュメントを受講者に示します。
pt_br: Mostre aos alunos os documentos gerados para o crate `rand` em [<https://docs.rs/rand>.
uk: Покажіть студентам згенеровану документацію для крейта `rand` на <https://docs.rs/rand>.

source: We have already seen some use of `Option<T>`. It stores either a value of type `T` or nothing. For example, [`String::find`](https://doc.rust-lang.org/stable/std/string/struct.String.html#method.find) returns an `Option<usize>`.
fa: ما قبلاً برخی استفاده‌ها از `<Option<T` را مشاهده کرده‌ایم. این تایپ یا مقداری از تایپ`T` را ذخیره می‌کند یا هیچ چیزی را ذخیره نمی‌کند. به عنوان مثال، [`String::find`](https://doc.rust-lang.org/stable/std/string/struct.String.html#method.find) یک `<Option<usize` را برمی‌گرداند.
ja: `Option<T>` の使用方法についてはすでにいくつか見てきましたが、これは型 `T` の値を格納するか、何も格納しません。たとえば、[`String::find`](https://doc.rust-lang.org/stable/std/string/struct.String.html#method.find) は `Option<usize>` を返します。
pt_br: Já vimos algum uso de `Option<T>`. Ele armazena um valor do tipo `T` ou nada. Por exemplo, [`String::find`](https://doc.rust-lang.org/stable/std/string/struct.String.html#method.find) retorna um `Option<usize>`.
uk: Ми вже бачили деяке використання `Option<T>`. Це зберігає або значення типу `T`, або нічого. Наприклад, [`String::find`](https://doc.rust-lang.org/stable/std/string/struct.String.html#method.find) повертає `Option<usize>`.

source: "find returned {position:?}"
fa: "پیدا کردن نوع بازگشتی{position:?}"
pt_br: "find retornou {position:?}"
uk: "пошук повернув {position:?}"

source: "Character not found"
pt_br: "Caractere não encontrado"
uk: "Символ не знайдено"

source: `Option` is widely used, not just in the standard library.
fa: `Option` به‌طور گسترده‌ای استفاده می‌شود و تنها در کتابخانه استاندارد محدود نمی‌شود.
pt_br: `Option` é amplamente utilizado, não apenas na biblioteca padrão.
uk: `Option` широко використовуються, і не тільки в стандартній бібліотеці.

source: `unwrap` will return the value in an `Option`, or panic. `expect` is similar but takes an error message.
fa: `unwrap` مقدار موجود در یک `Option` را برمی‌گرداند یا باعث panic می‌شود. `expect` مشابه است اما پیامی برای خطا می‌پذیرد.
ja: `unwrap` は `Option` 内の値を返すか、パニックになります。`expect` も同様ですが、エラーメッセージを受け取ります。
pt_br: `unwrap` retornará o valor em um `Option`, ou entrará em pânico. `expect` é semelhante, mas recebe uma mensagem de erro.
uk: `unwrap` поверне значення в `Option`, або паніку. `expect` працює аналогічно, але повертає повідомлення про помилку.

source: You can panic on None, but you can't "accidentally" forget to check for None.
fa: می‌توانید در مواجهه با panic `None` کنید، اما نمی‌توانید به‌طور "تصادفی" فراموش کنید که `None` بررسی کنید.
ja: None でパニックになる場合もありますが、「誤って」None のチェックを忘れることはありません。
pt_br: Você pode entrar em pânico em `None`, mas não pode "acidentalmente" esquecer de verificar `None`.
uk: Ви можете панікувати на None, але ви не можете "випадково" забути перевірити на None.

source: It's common to `unwrap`/`expect` all over the place when hacking something together, but production code typically handles `None` in a nicer fashion.
fa: استفاده از `unwrap`/`expect` در همه‌جا هنگام ساخت سریع چیزی رایج است، اما کد تولیدی معمولاً `None` را به‌شیوه‌ای مناسب‌تر مدیریت می‌کند.
ja: 何かを一緒にハッキングする場合は、あちこちで `unwrap`/`expect` を行うのが一般的ですが、本番環境のコードは通常、`None` をより適切に処理します。
pt_br: É comum `unwrap`/`expect` em todos os lugares ao hackear algo, mas o código de produção normalmente lida com `None` de uma maneira mais elegante.
uk: Під час швидкої експерементації зазвичай прийнято використовувати `unwrap`/`expect` повсюди, але у виробничому коді `None` зазвичай обробляється у більш зручному вигляді.

source: The niche optimization means that `Option<T>` often has the same size in memory as `T`.
fa: بهینه‌سازی niche به این معناست که `<Option<T` اغلب اندازه‌ای مشابه با `T` در حافظه دارد.
ja: ニッチな最適化とは、`Option<T>` がメモリ内で `T` と同じサイズであることが多いということです。
pt_br: A otimização de nicho significa que `Option<T>` muitas vezes tem o mesmo tamanho na memória que `T`.
uk: Нішева оптимізація означає, що `Option<T>` часто має той самий розмір у пам'яті, що й `T`.

source: `Result` is similar to `Option`, but indicates the success or failure of an operation, each with a different enum variant. It is generic: `Result<T, E>` where `T` is used in the `Ok` variant and `E` appears in the `Err` variant.
fa: `Result` مشابه `Option` است، اما موفقیت یا شکست یک عملیات را نشان می‌دهد، هرکدام با یک نوع متغیر enum متفاوت. این نوع جنریک است: `<Result<T, E` که در آن `T` در متغیر `Ok` استفاده می‌شود و `E` در متغیر `Err` ظاهر می‌شود.
pt_br: `Result` é semelhante a `Option`, mas indica o sucesso ou falha de uma operação, cada um com um tipo diferente. Isso é genérico: `Result<T, E>` onde `T` é usado na variante `Ok` e `E` aparece na variante `Err`.
uk: `Result` схожий на `Option`, але вказує на успіх або невдачу операції, кожен з яких має свій варіант переліку. Він має вигляд: `Result<T, E>`, де `T` використовується у варіанті `Ok`, а `E` з'являється у варіанті `Err`.

source: "Dear diary: {contents} ({bytes} bytes)"
fa: "دفتر خاطرات عزیز: {contents} ({bytes} bytes)"
pt_br: "Querido diário: {contents} ({bytes} bytes)"
uk: "Дорогий щоденник: {contents} ({bytes} байтів)"

source: "Could not read file content"
fa: "نمی‌توان محتوای فایل را خواند"
pt_br: "Não foi possível ler o conteúdo do arquivo"
uk: "Не вдалося прочитати вміст файлу"

source: "The diary could not be opened: {err}"
fa: "دفتر خاطرات باز نشد: {err}"
pt_br: "Não foi possível abrir o diário: {err}"
uk: "Щоденник не вдалося відкрити: {err}"

source: As with `Option`, the successful value sits inside of `Result`, forcing the developer to explicitly extract it. This encourages error checking. In the case where an error should never happen, `unwrap()` or `expect()` can be called, and this is a signal of the developer intent too.
es: Al igual que con `Option`, el valor correcto se encuentra dentro de `Result`, lo que obliga al desarrollador a extraerlo de forma explícita. Esto fomenta la comprobación de errores. En el caso de que nunca se produzca un error, se puede llamar a `unwrap()` o a `expect()`, y esto también es una señal de la intención del desarrollador.
fa: همانند `Option`، مقدار موفقیت‌آمیز درون `Result` قرار دارد و توسعه‌دهنده را ملزم به استخراج صریح آن می‌کند. این به بررسی خطاها تشویق می‌کند. در صورتی که خطا هرگز نباید رخ دهد، می‌توان از `()unwrap` یا `()expect` استفاده کرد که این نیز نشان‌دهنده نیت توسعه‌دهنده است.
ja: `Option` と同様に、成功した値は `Result` の内部にあり、デベロッパーはそれを明示的に抽出する必要があります。これにより、エラーチェックが促進されます。エラーが発生してはならない場合は、`unwrap()` または `expect()` を呼び出すことができます。これもデベロッパーのインテントのシグナルです。
ko: `Option`와 마찬가지로, 성공한 경우의 값은 `Result` 내부에 있습니다. 그래서, 개발자는 명시적으로 이를 추출하여야 합니다. 이렇게 함으로써 값을 읽기 전에 오류 발생 여부를 반드시 체크하도록 유도하고 있습니다. 만일 오류가 절대 발생하지 않는 경우라면 `unwrap()`이나 `expect()`를 사용할 수 있으며, 이는 개발자의 의도(_역주_: 오류가 발생할 수 없음)을 명시적으로 나타내는 방법이기도 합니다.
pt_br: Como em `Option`, o valor bem-sucedido fica dentro de `Result`, forçando o desenvolvedor a extraí-lo explicitamente. Isso encoraja a verificação de erros. No caso em que um erro nunca deve acontecer, `unwrap()` ou `expect()` podem ser chamados, e isso também sinaliza a intenção do desenvolvedor.
uk: Як і у випадку з `Option`, успішне значення знаходиться всередині `Result`, змушуючи розробника явно витягти його. Це стимулює перевірку помилок. У випадку, коли помилка взагалі не очикуєтся, можна викликати `unwrap()` або `expect()`, і це також є сигналом про наміри розробника.

source: `Result` documentation is a recommended read. Not during the course, but it is worth mentioning. It contains a lot of convenience methods and functions that help functional-style programming.
fa: مستندات `Result` مطالعه‌ای توصیه‌شده است. نه در طول دوره، اما ذکر آن ارزشمند است. این مستندات شامل بسیاری از متدها و توابع کاربردی است که به برنامه‌نویسی به استایل تابع‌محور کمک می‌کند.
ja: `Result` のドキュメントを読むことをすすめましょう。この講座では取り上げませんが、言及する価値があります。このドキュメントには、関数型プログラミングに役立つ便利なメソッドや関数が多数含まれています。
pt_br: A documentação de `Result` é uma leitura recomendada. Não durante o curso, mas vale a pena mencioná-la. Ele contém muitos métodos e funções de conveniência que ajudam na programação ao estilo funcional.
uk: Порекомендуйте прочитати `Result` документацію. Не під час курсу, але варто згадати. Вона містить багато зручних методів і функцій, які допомагають програмувати у функціональному стилі.

source: `Result` is the standard type to implement error handling as we will see on Day 4.
fa: `Result` نوع استاندارد برای پیاده‌سازی مدیریت خطاها است که در روز چهارم دوره خواهیم دید.
pt_br: `Result` é o tipo padrão para implementar tratamento de erros, como veremos no Dia 4.
uk: `Result` — це стандартний тип для реалізації обробки помилок, як ми побачимо у 4-му дні.

source: [`String`](https://doc.rust-lang.org/std/string/struct.String.html) is a growable UTF-8 encoded string:
fa: [`String`](https://doc.rust-lang.org/std/string/struct.String.html) یک رشته قابل رشد با کدگذاری UTF-8 است:
pt_br: [`String`](https://doc.rust-lang.org/std/string/struct.String.html) é uma string UTF-8 expansível:
uk: [`String`](https://doc.rust-lang.org/std/string/struct.String.html) — це розширюваний рядок у кодуванні UTF-8:

source: "Hello"
fa: "سلام"
pt_br: "Olá"
uk: "Привіт"

source: `String` implements [`Deref<Target = str>`](https://doc.rust-lang.org/std/string/struct.String.html#deref-methods-str), which means that you can call all `str` methods on a `String`.
es: `String` implementa \[`Deref<Target = str>`\]\[2\], lo que significa que puedes llamar a todos los métodos `str` en una `String`.
fa: `String` پیاده‌سازی‌کننده [`Deref<Target = str>`](https://doc.rust-lang.org/std/string/struct.String.html#deref-methods-str) است، که به این معناست که می‌توانید تمام متدهای `str` را بر روی `String` فراخوانی کنید.
ja: `String` は [`Deref<Target = str>`](https://doc.rust-lang.org/std/string/struct.String.html#deref-methods-str) を実装します。つまり、`String` のすべての `str` メソッドを呼び出すことができます。
ko: `String`은 [`Deref<Target = str>`](https://doc.rust-lang.org/std/string/struct.String.html#deref-methods-str)을 구현합니다. 이는 , `String` 값에 대해서도 `str`의 모든 메서드를 호출 할 수 있다는 의미 입니다.
pt_br: `String` implementa [`Deref<Target = str>`](https://doc.rust-lang.org/std/string/struct.String.html#deref-methods-str), o que significa que você pode chamar todos os métodos de `str` em uma `String`.
uk: `String` реалізує [`Deref<Target = str>`](https://doc.rust-lang.org/std/string/struct.String.html#deref-methods-str), що означає, що ви можете викликати усі методи `str` у `String`.

source: `String::new` returns a new empty string, use `String::with_capacity` when you know how much data you want to push to the string.
es: `String::new` devuelve una nueva cadena vacía. Usa `String::with_capacity` cuando sepas cuántos datos quieres guardar.
fa: `String::new` یک رشته جدید خالی برمی‌گرداند. از `String::with_capacity` استفاده کنید زمانی که می‌دانید چقدر داده می‌خواهید به رشته اضافه کنید.
ja: `String::new` は新しい空の文字列を返します。文字列にプッシュするデータの量がわかっている場合は `String::with_capacity` を使用します。
ko: `String::new`는 새로운 빈 문자열을 반환합니다. `String::with_capacity`는 새로 만들 문자열 버퍼에 넣을 데이터 크기를 알고 있는 경우에 사용할 수 있습니다.
pt_br: `String::new` retorna uma nova string vazia, use `String::with_capacity` quando você sabe a quantidade de dados que você deseja colocar na string.
uk: `String::new` повертає новий порожній рядок. Використовуйте `String::with_capacity`, якщо ви знаєте, скільки даних ви хочете передати в рядок.

source: `String::len` returns the size of the `String` in bytes (which can be different from its length in characters).
es: `String::len` devuelve el tamaño de `String` en bytes (que puede ser diferente de su longitud en caracteres).
fa: `String::len` اندازه رشته `String` را به‌صورت بایت برمی‌گرداند (که ممکن است با طول آن به‌صورت کاراکتر متفاوت باشد).
ja: `String::len` は、`String` のサイズをバイト単位で返します（文字数とは異なる場合があります）。
ko: `String::len`은 `String`의 바이트 크기를 반환합니다. (실제 문자 개수와는 다를 수 있습니다.)
pt_br: `String::len` retorna o tamanho da `String` em bytes (que pode ser diferente de seu comprimento em caracteres).
uk: `String::len` повертає розмір `String` у байтах (який може відрізнятися від його довжини в символах).

source: `String::chars` returns an iterator over the actual characters. Note that a `char` can be different from what a human will consider a "character" due to [grapheme clusters](https://docs.rs/unicode-segmentation/latest/unicode_segmentation/struct.Graphemes.html).
es: `String::chars` devuelve un iterador sobre los caracteres reales. Ten en cuenta que un `char` puede ser diferente de lo que un humano consideraría un "caracter", debido a los [grupos de grafemas](https://docs.rs/unicode-segmentation/latest/unicode_segmentation/struct.Graphemes.html).
fa: `String::chars` یک تکرارگر (iterator) از روی کاراکترهای واقعی برمی‌گرداند. توجه داشته باشید که یک `char` ممکن است با آنچه که یک انسان به عنوان "کاراکتر" در نظر می‌گیرد، متفاوت باشد به دلیل [grapheme clusters](https://docs.rs/unicode-segmentation/latest/unicode_segmentation/struct.Graphemes.html).
ja: `String::chars` は、実際の文字のイテレータを返します。[書記素クラスタ](https://docs.rs/unicode-segmentation/latest/unicode_segmentation/struct.Graphemes.html)により、`char` は人間が「文字」と見なすものとは異なる場合があります。
ko: `String::chars`는 실제 문자(character)들에 대한 이터레이터를 반환합니다. `char`로 표현되는 문자는 우리가 실제로 인식하고 사용하는 문자와는 다를 수 있습니다. 자소 결합으로 문자를 표현하는 경우가 있기 때문입니다. 이에 대해서는 [Grapheme Cluster](https://docs.rs/unicode-segmentation/latest/unicode_segmentation/struct.Graphemes.html)를 참고하세요.
pt_br: `String::chars` retorna um iterador com os caracteres de fato. Observe que um `char` pode ser diferente do que um humano considerará um "caracter" devido a [agrupamentos de grafemas (_grapheme clusters_)](https://docs.rs/unicode-segmentation/latest/unicode_segmentation/struct.Graphemes.html).
uk: `String::chars` повертає ітератор поверх фактичних символів. Зауважте, що `char` може відрізнятися від того, що людина вважатиме "символом" через [кластери графем](https://docs.rs/unicode-segmentation/latest/unicode_segmentation/struct.Graphemes.html).

source: When people refer to strings they could either be talking about `&str` or `String`.
es: Cuando la gente se refiere a cadenas, pueden estar hablando de `&str` o de `String`.
fa: زمانی که مردم به رشته‌ها اشاره می‌کنند، ممکن است منظورشان `str&` یا `String` باشد.
ja: 人々が文字列について言及する場合、単に `&str` または `String` のことを話している可能性があります。
ko: 사람들이 문자열이라고 말할 때에는 `&str`이거나 `String`일 수 있습니다.
pt_br: Quando as pessoas se referem a strings, elas podem estar falando sobre `&str` ou `String`.
uk: Коли люди посилаються на рядки, вони можуть говорити про `&str` або `String`.

source: When a type implements `Deref<Target = T>`, the compiler will let you transparently call methods from `T`.
es: Cuando un tipo implementa `Deref<Target = T>`, el compilador te permite llamar a métodos de forma transparente desde `T`.
fa: زمانی که یک تایپ، `<Deref<Target = T` را پیاده‌سازی می‌کند، کامپایلر به شما این امکان را می‌دهد که به‌طور شفاف متدهای `T` را فراخوانی کنید.
ja: 型が `Deref<Target = T>` を実装している場合、コンパイラにより `T` からメソッドを透過的に呼び出せるようになります。
ko: 어떤 타입이 `Deref<Target = T>`를 구현하고 있으면, 컴파일러는 여러분이 `T`의 메소드들을 호출할 수 있게 도와줍니다.
pt_br: Quando um tipo implementa `Deref<Target = T>`, o compilador permitirá que você transparentemente chame métodos de `T`.
uk: Коли тип реалізує `Deref<Target = T>`, компілятор дозволить вам прозоро викликати методи з `T`.

source: We haven't discussed the `Deref` trait yet, so at this point this mostly explains the structure of the sidebar in the documentation.
fa: ما هنوز `Deref` trait را بررسی نکرده‌ایم، بنابراین در این مرحله این بیشتر توضیح‌دهنده ساختار نوار کناری در مستندات است.
ja: `Deref` トレイトについてはまだ説明していないため、現時点では主にドキュメントのサイドバーの構造について説明しています。
pt_br: Ainda não discutimos o _trait_ `Deref`, então, neste ponto, isso explica principalmente a estrutura da barra lateral na documentação.
uk: Ми ще не обговорювали трейт `Deref`, тому на даний момент це здебільшого пояснює структуру бокової панелі у документації.

source: `String` implements `Deref<Target = str>` which transparently gives it access to `str`'s methods.
es: `String` implementa `Deref<Target = str>`, que le proporciona acceso transparente a los métodos de `str`.
fa: `String` پیاده‌سازی‌کننده `<Deref<Target = str` است که به‌طور شفاف دسترسی به متدهای `str` را فراهم می‌کند.
ja: `String` は `Deref<Target = str>` を実装し、`str` のメソッドへのアクセスを透過的に許可します。
ko: `String`은 `Deref<Target = str>`을 구현하고 있기 때문에 `String`에 대해서도 `str` 메소드들을 호출할 수 있습니다.
pt_br: `String` implementa `Deref<Target = str>` que, de forma transparente, dá acesso aos métodos de `str`.
uk: `String` реалізує `Deref<Target = str>`, що прозоро надає йому доступ до методів `str`.

source: Write and compare `let s3 = s1.deref();` and `let s3 = &*s1;`.
fa: `;()let s3 = s1.deref` و `;let s3 = &*s1` بنویسید و مقایسه کنید .
ja: `let s3 = s1.deref();` と `let s3 = &*s1;` を記述して比較します。
pt_br: Escreva e compare `let s3 = s1.deref();` e `let s3 = &*s1;`.
uk: Напишіть і порівняйте `let s3 = s1.deref();` and `let s3 = &*s1;`

source: `String` is implemented as a wrapper around a vector of bytes, many of the operations you see supported on vectors are also supported on `String`, but with some extra guarantees.
es: `String` se implementa como un envoltorio alrededor de un vector de bytes. Muchas de las operaciones que ves como compatibles con vectores también lo son con `String`, pero con algunas garantías adicionales.
fa: بنویسید و مقایسه کنید `let s3 = s1.deref();` و `let s3 = &*s1;`.
ja: `String` はバイトのベクターのラッパーとして実装されます。ベクターでサポートされているオペレーションの多くは `String` でもサポートされていますが、いくつかの保証が追加されています。
ko: `String`은 바이트 벡터의 래퍼로 구현되어 있습니다. 벡터가 지원하는 여러가지 연산들을 `String`도 지원합니다. 다만 `String`은 몇가지 보장 내용이 더 있습니다.
pt_br: `String` é implementado como um wrapper em torno de um vetor de bytes, muitas das operações que você vê suportadas em vetores também são suportadas em `String`, mas com algumas garantias extras.
uk: `String` реалізовано як оболонку навколо вектора байтів, багато операцій, які ви бачите, що підтримуються над векторами, також підтримуються `String`, але з деякими додатковими гарантіями.

source: Compare the different ways to index a `String`:
es: Compara las diferentes formas de indexar `String`:
fa: راه‌های مختلف برای ایندکس‌گذاری یک `String` را مقایسه کنید:
ja: `String` にインデックスを付けるさまざまな方法を比較します。
ko: `String`을 인덱스로 접근하는 방법들을 비교해보세요:
pt_br: Compare as diferentes formas de indexar uma `String`:
uk: Порівняйте різні способи індексування `String`:

source: To a character by using `s3.chars().nth(i).unwrap()` where `i` is in-bound, out-of-bounds.
es: A un carácter mediante `s3. chars().nth(i).unwrap()`, donde `i` está dentro o fuera de los límites
fa: به یک کاراکتر با استفاده از `()s3.chars().nth(i).unwrap`، جایی که `i` در محدوده است یا خارج از محدوده.
ja: 文字には `s3.chars().nth(i).unwrap()` を使用します。ここで `i` は境界内の場合や境界外の場合を表します。
ko: `s3.chars().nth(i).unwrap()`를 이용하여 한 문자를 선택하는 경우, `i`값이 범위를 벗어날 때, 벗어나지 않을 때 동작을 설명하세요.
pt_br: Para um caracter usando `s3.chars().nth(i).unwrap()` onde `i` está dentro dos limites, fora dos limites.
uk: До символу за допомогою `s3.chars().nth(i).unwrap()`, де `i` є в межі, поза межами.

source: To a substring by using `s3[0..4]`, where that slice is on character boundaries or not.
es: A una cadena secundaria mediante `s3[0..4]`, donde el slice está en los límites de caracteres o no.
fa: به یک زیررشته با استفاده از `[4..0]s3`، جایی که این برش در مرزهای کاراکترها است یا نباشد.
ja: 部分文字列には `s3[0..4]` を使用します。このスライスは、文字境界にある場合とない場合があります。
ko: `s3[0..4]`를 이용해서 문자열의 일부를 선택하는데, 슬라이스가 유니코드 문자열 경계에 딱 맞지 않을 경우 어떻게 되는지 설명하세요.
pt_br: Para uma substring usando `s3[0..4]`, onde essa _slice_ está nos limites dos caracteres ou não.
uk: До підрядка за допомогою `s3[0..4]`, де цей фрагмент знаходиться на межах символів чи ні.

source: Many types can be converted to a string with the [`to_string`](https://doc.rust-lang.org/std/string/trait.ToString.html#tymethod.to_string) method. This trait is automatically implemented for all types that implement `Display`, so anything that can be formatted can also be converted to a string.
fa: بسیاری از تایپ داده‌ها می‌توانند با استفاده از متد [`to_string`](https://doc.rust-lang.org/std/string/trait.ToString.html#tymethod.to_string) به رشته تبدیل شوند. این ترید به‌طور خودکار برای تمام تایپ‌هایی که `Display` را پیاده‌سازی می‌کنند، پیاده‌سازی شده است، بنابراین هر چیزی که می‌تواند قالب‌بندی شود، همچنین می‌تواند به رشته تبدیل شود.
pt_br: Muitos tipos podem ser convertidos para uma string com o método [`to_string`](https://doc.rust-lang.org/std/string/trait.ToString.html#tymethod.to_string). Este _trait_ é implementado automaticamente para todos os tipos que implementam `Display`, então qualquer coisa que possa ser formatada também pode ser convertida para uma string.
uk: Багато типів можна перетворити у рядок за допомогою методу [`to_string`](https://doc.rust-lang.org/std/string/trait.ToString.html#tymethod.to_string). Цей трейт автоматично реалізується для всіх типів, що реалізують `Display`, тому все, що може бути відформатовано, також може бути перетворено у рядок.

source: [`Vec`](https://doc.rust-lang.org/std/vec/struct.Vec.html) is the standard resizable heap-allocated buffer:
es: [`Vec`](https://doc.rust-lang.org/std/vec/struct.Vec.html) es el búfer estándar redimensionable asignado al _heap_:
fa: این [`Vec`](https://doc.rust-lang.org/std/vec/struct.Vec.html) بافر قابل تغییر اندازه و heap-allocated است:
ja: [`Vec`](https://doc.rust-lang.org/std/vec/struct.Vec.html) は、サイズ変更可能な標準のヒープ割り当てバッファです。
ko: [`Vec`](https://doc.rust-lang.org/std/vec/struct.Vec.html) 는 힙에 할당된 표준 가변 크기 버퍼입니다:
pt_br: [`Vec`](https://doc.rust-lang.org/std/vec/struct.Vec.html) é o buffer padrão redimensionável alocado no heap:
uk: [`Vec`](https://doc.rust-lang.org/std/vec/struct.Vec.html) — стандартний буфер із змінним розміром, виділений у купі:

source: // Canonical macro to initialize a vector with elements.
ja: // 要素でベクターを初期化する正規マクロ。
pt_br: // Macro canônica para inicializar um vetor com elementos.
uk: // Канонічний макрос для ініціалізації вектора з елементами.

source: // Retain only the even elements.
ja: // 偶数要素のみを保持します。
pt_br: // Mantém apenas os elementos pares.
uk: // Зберігаємо тільки парні елементи.

source: // Remove consecutive duplicates.
ja: // 連続する重複を削除します。
pt_br: // Remove duplicatas consecutivas.
uk: // Видаляємо дублікати, що йдуть підряд.
