Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: This slide introduces strings. Everything here will be covered in more depth later, but this is enough for subsequent slides and exercises to use strings.
ja: このスライドでは文字列を紹介します。ここで取り上げた内容については後ほど詳しく説明しますが、以降のスライドや演習で文字列を使用するにはこれで十分です。

source: Invalid UTF-8 in a string is UB, and this not allowed in safe Rust.
ja: 文字列内の無効な UTF-8 は UB であり、Safe Rust では許可されません。

source: `String` is a user-defined type with a constructor (`::new()`) and methods like `s.push_str(..)`.
ja: `String` は、コンストラクタ（`::new()` と `s.push_str(..)` などのメソッド）を持つユーザー定義型です。

source: The `&` in `&str` indicates that this is a reference. We will cover references later, so for now just think of `&str` as a unit meaning "a read-only string".
ja: `&str` 内の `&` は、これが参照であることを示します。参照については後ほど説明しますので、ここでは `&str` を、「読み取り専用の文字列」を意味する単位と考えてください。

source: The commented-out line is indexing into the string by byte position. `12..13` does not end on a character boundary, so the program panics. Adjust it to a range that does, based on the error message.
ja: コメントアウトされた行は、バイト位置で文字列をインデックス化しています。`12..13` は文字境界で終わっていないため、プログラムはパニックします。エラー メッセージに基づいて、適切な範囲に調整してください。

source: The first and second Fibonacci numbers are both `1`. For n>2, the n'th Fibonacci number is calculated recursively as the sum of the n-1'th and n-2'th Fibonacci numbers.
ja: 1 つ目と 2 つ目のフィボナッチ数はどちらも `1` です。n>2 の場合、n 番目のフィボナッチ数は、n-1 番目のフィボナッチ数と n-2 番目のフィボナッチ数の合計として再帰的に計算されます。

source: [Conditionals](./control-flow-basics/conditionals.md) (5 minutes)
ja: [条件文](./control-flow-basics/conditionals.md)（5 分）

source: [Loops](./control-flow-basics/loops.md) (5 minutes)
ja: [ループ](./control-flow-basics/loops.md)（5 分）

source: [break and continue](./control-flow-basics/break-continue.md) (5 minutes)
ja: [break と continue](./control-flow-basics/break-continue.md)（5 分）

source: [Blocks and Scopes](./control-flow-basics/blocks-and-scopes.md) (10 minutes)
ja: [ブロックとスコープ](./control-flow-basics/blocks-and-scopes.md)（10 分）

source: [Functions](./control-flow-basics/functions.md) (3 minutes)
ja: [関数](./control-flow-basics/functions.md)（3 分）

source: [Macros](./control-flow-basics/macros.md) (2 minutes)
ja: [マクロ](./control-flow-basics/macros.md)（2 分）

source: [Exercise: Collatz Sequence](./control-flow-basics/exercise.md) (30 minutes)
ja: [演習: コラッツ数列](./control-flow-basics/exercise.md)（30 分）

source: Much of the Rust syntax will be familiar to you from C, C++ or Java:
es: Gran parte de la sintaxis de Rust te resultará familiar de C, C++ o Java:
ja: Rust の構文の多くは、C、C++、Java で見覚えがあるでしょう。
ko: 대부분의 러스트 문법은 C/C++/Java 와 유사합니다:

source: Line comments are started with `//`, block comments are delimited by `/* ... */`.
es: Los comentarios de línea empiezan por `//`, mientras que los comentarios de bloque están delimitados por `/* ... */`.
ja: 行コメントは `//` で始まり、ブロック コメントは `/* ... */` で区切られます。
ko: 인라인 주석은 `//`, 블록 주석은 `/* ... */`로 사용합니다.

source: Keywords like `if` and `while` work the same.
es: Palabras clave como `if` y `while` funcionan igual.
ja: `if` や `while` などのキーワードの動作は同じです。
ko: `if`나 `while`같은 키워드도 동일합니다.

source: Variable assignment is done with `=`, comparison is done with `==`.
es: La asignación de variables se realiza con `=` y la comparación con `==`.
ja: 変数の代入は `=` で行われ、比較は `==` で行われます。
ko: 변수 할당은 `=`, 비교는 `==`를 사용합니다.

source: The [`for` loop](https://doc.rust-lang.org/std/keyword.for.html) iterates over ranges of values:
ja: [`for` ループ](https://doc.rust-lang.org/std/keyword.for.html) は、値の範囲を反復処理します。

source: We will discuss iteration later; for now, just stick to range expressions.
ja: 反復処理については後で説明しますので、ここでは範囲式だけに注目してください。

source: Note that the `for` loop only iterates to `4`. Show the `1..=5` syntax for an inclusive range.
ja: なお、この `for` ループは `4` までしか反復処理しません。5 を範囲に含める場合の構文は `1..=5` であることを示します。

source: In this case we break the outer loop after 3 iterations of the inner loop.
es: En este caso, detenemos el bucle exterior tras tres iteraciones del bucle interno.
ja: 上の例では、内側のループを 3 回イテレーションしたのちに外側のループを抜けることになります。
ko: 위 예제는 내부의 `while` 루프를 3회 반복한 후 바깥 루프를 빠져나갑니다.

source: [Tuples and Arrays](./tuples-and-arrays.md) (1 hour)
ja: [タプルと配列](./tuples-and-arrays.md)（1 時間）

source: [References](./references.md) (50 minutes)
ja: [参照](./references.md)（50 分）

source: [User-Defined Types](./user-defined-types.md) (50 minutes)
ja: [ユーザー定義型](./user-defined-types.md)（50 分）

source: Including 10 minute breaks, this session should take about 2 hours and 55 minutes
ja: このセッションの所要時間は、10 分間の休憩を入れて約 2 時間 55 分です。

source: [Tuples and Arrays](./tuples-and-arrays/tuples-and-arrays.md) (10 minutes)
ja: [タプルと配列](./tuples-and-arrays/tuples-and-arrays.md)（10 分）

source: [Array Iteration](./tuples-and-arrays/iteration.md) (3 minutes)
ja: [配列の反復処理](./tuples-and-arrays/iteration.md)（3 分）

source: [Pattern Matching](./tuples-and-arrays/match.md) (10 minutes)
ja: [パターン マッチング](./tuples-and-arrays/match.md)（10 分）

source: [Destructuring](./tuples-and-arrays/destructuring.md) (5 minutes)
ja: [分解](./tuples-and-arrays/destructuring.md)（5 分）

source: [Exercise: Nested Arrays](./tuples-and-arrays/exercise.md) (30 minutes)
ja: [演習: ネストされた配列](./tuples-and-arrays/exercise.md)（30 分）

source: Tuples and arrays are the first "compound" types we have seen. All elements of an array have the same type, while tuples can accommodate different types. Both types have a size fixed at compile time.
ja: タプルと配列は、このコースで初めて扱う「複合」型です。配列のすべての要素の型は同じですが、タプルは異なる型に対応できます。どちらの型もコンパイル時にサイズが固定されます。

source: Array assignment and access:
es: Asignación y acceso a arrays:
ja: 配列の代入とアクセス:
ko: 배열 선언과 접근:

source: Tuple assignment and access:
es: Asignación y acceso a tuplas:
ja: タプルの代入とアクセス:
ko: 튜플 선언과 접근:

source: Arrays:
ja: 配列:
ko: 배열:

source: Tuples:
es: Tuplas:
ja: タプル:
ko: 튜플:

source: The empty tuple `()` is also known as the "unit type". It is both a type, and the only valid value of that type --- that is to say both the type and its value are expressed as `()`. It is used to indicate, for example, that a function or expression has no return value, as we'll see in a future slide.
ja: 空のタプル `()` は、「ユニット型」とも呼ばれます。これは型であるとともに、その型で唯一の有効な値です。つまり、型とその値の両方が `()` として表現されます。以降のスライドで説明するように、これは関数や式に戻り値がないことを示す場合などに使用されます。

source: You can think of it as `void` that can be familiar to you from other programming languages.
ja: これは、他のプログラミング言語で馴染みのある `void` と考えることができます。

source: The `_` pattern is a wildcard pattern which matches any value. The expressions _must_ be irrefutable, meaning that it covers every possibility, so `_` is often used as the final catch-all case.
ja: `_` パターンは、任意の値に一致するワイルドカード パターンです。式は論駁不可能でなければなりません。つまり、あらゆる可能性をカバーする必要があるため、最後のキャッチオール ケースとして `_` がよく使用されます。

source: Destructuring is a way of extracting data from a data structure by writing a pattern that is matched up to the data structure, binding variables to subcomponents of the data structure.
ja: 分解とは、データ構造に一致するパターンを記述し、変数をデータ構造のサブコンポーネントにバインドすることで、データ構造からデータを抽出する方法です。

source: You can destructure tuples and arrays by matching on their elements:
ja: タプルと配列は、要素を照合することで分解できます。

source: Create a new array pattern using `_` to represent an element.
ja: `_` を使用して要素を表す新しい配列パターンを作成します。

source: Add more values to the array.
es: Añade más valores al array.
ja: 配列に値を追加します。
ko: 배열에 값을 더 추가해보세요.

source: Point out that how `..` will expand to account for different number of elements.
es: Señala cómo `..` se expandirá para representar un número distinto de elementos.
ja: 要素数が異なる場合に `..` がどのように展開されるかを説明します。
ko: `..`가 요소 개수에 상관없이 매치될 수 있음을 알려주세요.

source: Show matching against the tail with patterns `[.., b]` and `[a@..,b]`
es: Muestra las coincidencias de tail con los patrones `[.., b]` y `[a@..,b]`.
ja: パターン `[.., b]` と `[a@..,b]` で末尾を照合します。
ko: `[.., b]`나 `[a@.., b]`와 같은 패턴으로 꼬리 부분을 매칭하는 것을 보여주세요

source: Hard-code both functions to operate on 3 × 3 matrices.
es: Codifica ambas funciones para que operen con matrices de 3 × 3.
ja: 3 × 3 の行列で動作するように、両方の関数をハードコードします。
ko: 두 함수 모두 행렬의 크기는 3 x 3 으로 하드코딩 합니다.

source: Copy the code below to <https://play.rust-lang.org/> and implement the functions:
es: Copia el siguiente fragmento de código en <https://play.rust-lang.org/> e implementa las funciones:
ja: 以下のコードを <https://play.rust-lang.org/> にコピーして、関数を実装します。
ko: 아래 코드를 <https://play.rust-lang.org/>에 복사해서 구현하시면 됩니다:

source: [Shared References](./references/shared.md) (10 minutes)
ja: [共有参照](./references/shared.md)（10 分）

source: [Exclusive References](./references/exclusive.md) (10 minutes)
ja: [排他参照](./references/except.md)（10 分）

source: [Exercise: Geometry](./references/exercise.md) (30 minutes)
ja: [演習: ジオメトリ](./references/exercise.md)（30 分）

source: This segment should take about 50 minutes
ja: このセグメントの所要時間は約 50 分です

source: Rust will auto-dereference in some cases, in particular when invoking methods (try `r.count_ones()`). There is no need for an `->` operator like in C++.
ja: Rust は、特にメソッドを呼び出すとき、自動的に逆参照する場合があります（`r.count_ones()` を試してください）。C++ のような `->` 演算子は必要ありません。

source: [Named Structs](./user-defined-types/named-structs.md) (10 minutes)
ja: [名前付き構造体](./user-defined-types/named-structs.md)（10 分）

source: [Tuple Structs](./user-defined-types/tuple-structs.md) (10 minutes)
ja: [タプル構造体](./user-defined-types/tuple-structs.md)（10 分）

source: [Enums](./user-defined-types/enums.md) (5 minutes)
ja: [列挙型](./user-defined-types/enums.md)（5 分）

source: [Static and Const](./user-defined-types/static-and-const.md) (5 minutes)
ja: [static と const](./user-defined-types/static-and-const.md)（5 分）

source: [Type Aliases](./user-defined-types/aliases.md) (2 minutes)
ja: [型エイリアス](./user-defined-types/aliases.md)（2 分）

source: [Exercise: Elevator Events](./user-defined-types/exercise.md) (15 minutes)
ja: [演習: エレベーター イベント](./user-defined-types/exercise.md)（15 分）

source: Static and constant variables are two different ways to create globally-scoped values that cannot be moved or reallocated during the execution of the program.
ja: 静的変数と定数変数は、プログラムの実行中に移動または再割り当てできないグローバル スコープの値を作成するための、2 つの異なる方法です。

source: Constant variables are evaluated at compile time and their values are inlined wherever they are used:
es: Las variables constantes se evalúan en tiempo de compilación y sus valores se insertan dondequiera que se utilicen:
ja: 定数変数はコンパイル時に評価され、使用場所にかかわらずその値がインライン化されます。
ko: 상수는 컴파일 할 때 그 값이 정해집니다. 그리고 그 값은 그 상수가 사용되는 모든 부분에서 인라인 됩니다:

source: Mention that `const` behaves semantically similar to C++'s `constexpr`.
es: Menciona que `const` se comporta semánticamente de forma similar a `constexpr` de C++.
ja: `const` は C++ の `constexpr` と意味的によく似ていることを説明します。
ko: 러스트의 `const`는 C++의 `constexpr`과 매우 비슷합니다.

source: `static`, on the other hand, is much more similar to a `const` or mutable global variable in C++.
es: Por su parte, `static` se parece mucho más a `const` o a una variable global mutable de C++.
ja: 一方、`static` は、C++ の `const` または可変グローバル変数にかなり似ています。
ko: 반면에 러스트의 `static`은 C++의 `const`나 가변 정적 변수(mutable global variable)와 훨씬 더 유사합니다.

source: Properties table:
es: Tabla de Propiedades:
ja: プロパティの表:
ko: 속성 비교 테이블:

source: Constant
es: Constante
ja: 定数
ko: 상수(constant)

source: Has an address in memory
es: Tiene una dirección en la memoria
ja: メモリ内にアドレスがある
ko: 메모리 상에 주소가 있는가

source: No (inlined)
es: No (insertado)
ja: いいえ（インライン化）
ko: 아니오(인라인 됨)

source: Can be mutable
es: Puede ser mutable
ja: 変更可能
ko: 변경 가능한가

source: Yes (unsafe)
es: Sí (inseguro)
ja: はい（安全でない）
ko: 예 (그러나 안전하지 않음)

source: Evaluated at compile time
es: Evaluado en tiempo de compilación
ja: コンパイル時に評価
ko: 컴파일시 그 값이 결정되는가

source: Yes (initialised at compile time)
es: Sí (inicializado en tiempo de compilación)
ja: はい（コンパイル時に初期化）
ko: 예 (컴파일시 초기화 됨)

source: Inlined wherever it is used
es: Insertado dondequiera que se utilice
ja: 使用場所にかかわらずインライン化
ko: 사용되는 곳에 인라인 되는가

source: [Pattern Matching](./pattern-matching.md) (50 minutes)
ja: [パターン マッチング](./pattern-matching.md)（50 分）

source: Including 10 minute breaks, this session should take about 3 hours and 5 minutes
ja: このセッションの所要時間は、10 分間の休憩を入れて約 3 時間 5 分です。

source: [Destructuring](./pattern-matching/destructuring.md) (10 minutes)
ja: [デストラクト](./pattern-matching/destructuring.md)（10 分）

source: Like tuples, structs and enums can also be destructured by matching:
ja: タプルと同様に、構造体と列挙型もパターンマッチによりデストラクトできます。

source: `match` expressions
es: Expresiones `match`
ja: `match` 式
ko: `match` 표현식

source: [Traits](./methods-and-traits/traits.md) (10 minutes)
ja: [トレイト](./methods-and-features/train.md)（10 分）

source: [Deriving](./methods-and-traits/deriving.md) (5 minutes)
ja: [導出](./methods-and-train/deriving.md)（5 分）

source: [Trait Objects](./methods-and-traits/trait-objects.md) (10 minutes)
ja: [トレイトオブジェクト](./methods-and-features/train.md)（10 分）

source: This segment should take about 55 minutes
ja: このセグメントの所要時間は約 55 分です

source: Traits are implemented in an `impl <trait> for <type> { .. }` block.
ja: トレイトは `impl <trait> for <type> { .. }` ブロックに実装されます。

source: Trait objects allow for values of different types, for instance in a collection:
es: Los objetos de _traits_ permiten valores de diferentes tipos, por ejemplo, en una colección:
ja: トレイトオブジェクトは異なる型の値をひとつのコレクションにまとめることを可能にします：
ko: 트레잇 객체는 타입이 다른 값(예를 들어 컬렉션에 속한 각 값)들을 가질 수 있습니다:

source: ```bob Stack Heap .- - - - - - - - - - - - - -. .- - - - - - - - - - - - - - - - - - - - - - -. : : : : : pets : : +----+----+----+----+ : : +-----------+-------+ : : +-----+-----+ .->| F | i | d | o | : : | ptr | o---+---+-----+-->| o o | o o | | +----+----+----+----+ : : | len | 2 | : : +-|-|-+-|-|-+ `---------. : : | capacity | 2 | : : | | | | data | : : +-----------+-------+ : : | | | | +-------+--|-------+ : : : : | | | '-->| name | o, 4, 4 | : : : : | | | | age | 5 | : `- - - - - - - - - - - - - -' : | | | +-------+----------+ : : | | | : : | | | vtable : : | | | +----------------------+ : : | | '---->| "<Dog as Pet>::talk" | : : | | +----------------------+ : : | | : : | | data : : | | +-------+-------+ : : | '-->| lives | 9 | : : | +-------+-------+ : : | : : | vtable : : | +----------------------+ : : '---->| "<Cat as Pet>::talk" | : : +----------------------+ : : : '- - - - - - - - - - - - - - - - - - - - - - -' ```
ja: ```bob スタック ヒープ .- - - - - - - - - - - - - -. .- - - - - - - - - - - - - - - - - - - - - - -. : : : : : pets : : +----+----+----+----+ : : +-----------+-------+ : : +-----+-----+ .->| F | i | d | o | : : | ptr | o---+---+-----+-->| o o | o o | | +----+----+----+----+ : : | len | 2 | : : +-|-|-+-|-|-+ `---------. : : | capacity | 2 | : : | | | | data | : : +-----------+-------+ : : | | | | +-------+--|-------+ : : : : | | | '-->| name | o, 4, 4 | : : : : | | | | age | 5 | : `- - - - - - - - - - - - - -' : | | | +-------+----------+ : : | | | : : | | | vtable : : | | | +----------------------+ : : | | '---->| "<Dog as Pet>::talk" | : : | | +----------------------+ : : | | : : | | data : : | | +-------+-------+ : : | '-->| lives | 9 | : : | +-------+-------+ : : | : : | vtable : : | +----------------------+ : : '---->| "<Cat as Pet>::talk" | : : +----------------------+ : : : '- - - - - - - - - - - - - - - - - - - - - - -' ```

source: [Generic Data Types](./generics/generic-data.md) (15 minutes)
ja: [ジェネリック データ型](./generics/generic-data.md)（15 分）

source: In this short exercise, you will implement a generic `min` function that determines the minimum of two values, using a `LessThan` trait.
ja: この短い演習では、`LessThan` トレイトを使用して、2 つの値の最小値を決定するジェネリックな `min` 関数を実装します。

source: /// Return true if self is less than other.
ja: /// 自身がその他より小さい場合は true を返します。

source: [Standard Library Types](./std-types.md) (1 hour and 10 minutes)
ja: [標準ライブラリ型](./std-types.md)（1 時間 10 分）

source: [Standard Library Traits](./std-traits.md) (1 hour and 40 minutes)
ja: [標準ライブラリ トレイト](./std-train.md)（1 時間 40 分）

source: [Result](./std-types/result.md) (10 minutes)
ja: [Result](./std-types/result.md)（10 分）

source: [String](./std-types/string.md) (10 minutes)
ja: [String](./std-types/string.md)（10 分）

source: [Vec](./std-types/vec.md) (10 minutes)
ja: [Vec](./std-types/vec.md)（10 分）

source: [HashMap](./std-types/hashmap.md) (10 minutes)
ja: [HashMap](./std-types/hashmap.md)（10 分）

source: [Exercise: Counter](./std-types/exercise.md) (10 minutes)
ja: [演習: カウンタ](./std-types/exercise.md)（10 分）

source: `Result` is similar to `Option`, but indicates the success or failure of an operation, each with a different type. This is similar to the `Res` defined in the expression exercise, but generic: `Result<T, E>` where `T` is used in the `Ok` variant and `E` appears in the `Err` variant.
ja: `Result` は `Option` に似ていますが、オペレーションの成功または失敗を、それぞれ異なる型で示します。これは式の演習で定義されていた `Res` に似ているものの、汎用的で、`Result<T, E>` の形式を取ります（`T` は `Ok` バリアントで使用され、`E` は `Err` バリアントで使用されます）。

source: `Result` is the standard type to implement error handling as we will see on Day 3.
es: `Result` es el tipo estándar para implementar la gestión de errores, tal y como veremos el día 3.
ja: `Result` は、3 日目で説明するエラー処理を実装する標準型です。
ko: `Result`는 오류 처리를 위한 표준 타입입니다. 3일차 과정에서 살펴봅니다.

source: String
ja: 文字列（String）

source: [`String`](https://doc.rust-lang.org/std/string/struct.String.html) is the standard heap-allocated growable UTF-8 string buffer:
es: [`String`](https://doc.rust-lang.org/std/string/struct.String.html) es el búfer de cadena UTF-8 estándar, ampliable y asignado a un _heap_:
ja: [`String`](https://doc.rust-lang.org/std/string/struct.String.html) は、標準的なヒープ割り当ての拡張可能な UTF-8 文字列バッファです。
ko: [`String`](https://doc.rust-lang.org/std/string/struct.String.html)은 힙에 할당되고 가변 길이의 표준 UTF-8 문자열 버퍼입니다:

source: [Comparisons](./std-traits/comparisons.md) (10 minutes)
ja: [比較](./std-lets/comparisons.md)（10 分）

source: [Operators](./std-traits/operators.md) (10 minutes)
ja: [演算子](./std-train/operators.md)（10 分）

source: [From and Into](./std-traits/from-and-into.md) (10 minutes)
ja: [From と Into](./std-lets/from-and-into.md)（10 分）

source: [Read and Write](./std-traits/read-and-write.md) (10 minutes)
ja: [読み取りと書き込み](./std-train/read-and-write.md)（10 分）

source: [Closures](./std-traits/closures.md) (20 minutes)
ja: [クロージャ](./std-lets/closures.md)（20 分）

source: This segment should take about 1 hour and 40 minutes
ja: このセグメントの所要時間は約 1 時間 40 分です

source: [Welcome](./welcome-day-3.md) (3 minutes)
ja: [ようこそ](./welcome-day-3.md)（3 分）

source: [Memory Management](./memory-management.md) (1 hour and 10 minutes)
ja: [メモリ管理](./memory-management.md)（1 時間 10 分）

source: [Smart Pointers](./smart-pointers.md) (45 minutes)
ja: [スマート ポインタ](./smart-pointers.md)（45 分）

source: Including 10 minute breaks, this session should take about 2 hours and 15 minutes
ja: このセッションの所要時間は、10 分間の休憩を入れて約 2 時間 15 分です。

source: [Review of Program Memory](./memory-management/review.md) (5 minutes)
ja: [プログラム メモリの復習](./memory-management/review.md)（5 分）

source: [Approaches to Memory Management](./memory-management/approaches.md) (10 minutes)
ja: [メモリ管理の方法](./memory-management/approaches.md)（10 分）

source: [Ownership](./memory-management/ownership.md) (5 minutes)
ja: [所有権](./memory-management/ownership.md)（5 分）

source: [Move Semantics](./memory-management/move.md) (10 minutes)
ja: [ムーブ セマンティクス](./memory-management/move.md)（10 分）

source: [Clone](./memory-management/clone.md) (2 minutes)
ja: [Clone](./memory-management/clone.md)（2 分）

source: [Copy Types](./memory-management/copy-types.md) (5 minutes)
ja: [Copy 型](./memory-management/copy-types.md)（5 分）

source: [Drop](./memory-management/drop.md) (10 minutes)
ja: [Drop](./memory-management/drop.md)（10 分）

source: [Exercise: Builder Type](./memory-management/exercise.md) (20 minutes)
ja: [演習: ビルダー型](./memory-management/exercise.md)（20 分）

source: ```bob Stack Heap .- - - - - - - - - - - - - -. .- - - - - - - - - - - - - -. : : : : : s1 "(inaccessible)" : : : : +-----------+-------+ : : +----+----+----+----+ : : | ptr | o---+---+--+--+-->| R | u | s | t | : : | len | 4 | : | : +----+----+----+----+ : : | capacity | 4 | : | : : : +-----------+-------+ : | : : : : | `- - - - - - - - - - - - - -' : s2 : | : +-----------+-------+ : | : | ptr | o---+---+--' : | len | 4 | : : | capacity | 4 | : : +-----------+-------+ : : : `- - - - - - - - - - - - - -' ```
ja: ```bob スタック ヒープ .- - - - - - - - - - - - - -. .- - - - - - - - - - - - - -. : : : : : s1 "（アクセス不可）" : : : : +-----------+-------+ : : +----+----+----+----+ : : | ptr | o---+---+--+--+-->| R | u | s | t | : : | len | 4 | : | : +----+----+----+----+ : : | capacity | 4 | : | : : : +-----------+-------+ : | : : : : | `- - - - - - - - - - - - - -' : s2 : | : +-----------+-------+ : | : | ptr | o---+---+--' : | len | 4 | : : | capacity | 4 | : : +-----------+-------+ : : : `- - - - - - - - - - - - - -' ```

source: Clone
ja: 複製

source: The idea of `Clone` is to make it easy to spot where heap allocations are occurring. Look for `.clone()` and a few others like `Vec::new` or `Box::new`.
ja: `Clone` はヒープ割当が起きる場所を見つけやすくすることを目的としたものです。`.clone()` のほか、`Vec::new` や `Box::new` などを探してください。

source: ](./smart-pointers/box.md) (10 minutes)
ja: ](./smart-pointers/box.md)（10 分）

source: [Rc](./smart-pointers/rc.md) (5 minutes)
ja: [Rc](./smart-pointers/rc.md)（5 分）

source: [Exercise: Binary Tree](./smart-pointers/exercise.md) (30 minutes)
ja: [演習: バイナリツリー](./smart-pointers/exercise.md)（30 分）

source: Remove the `Box` in the List definition and show the compiler error. "Recursive with indirection" is a hint you might want to use a Box or reference of some kind, instead of storing a value directly.
es: Elimina `Box` de la definición de la lista y muestra el error del compilador. "Recursivo con indirección" es una sugerencia de que puedes usar un Box o referencia de algún tipo, en lugar de almacenar un valor directamente.
ja: List 定義の `Box` を削除して、コンパイラ エラーを表示します。"Recursive with indirection" は、値を直接保持するのではなく、Boxや何らかの参照を使用したら良いことを示唆するものです。
ko: `List` 정의에서 `Box`를 제거하면 어떤 컴파일러 에러가 나오는지 같이 살펴보세요. “Recursive with indirection”라는 메시지를 보면, 값을 직접 저장하는 대신 `Box`나 비슷한 다른 종류의 참조 타입이 필요하다는 힌트를 얻을 수 있습니다.

source: A `Box` cannot be empty, so the pointer is always valid and non-`null`. This allows the compiler to optimize the memory layout:
es: `Box` no puede estar vacío, por lo que el puntero siempre es válido y no `null`. Esto permite que el compilador optimice el diseño de la memoria:
ja: `Box` を空にすることはできないため、ポインタは常に有効かつ非 `null` になります。これにより、コンパイラがメモリ レイアウトを最適化できます。
ko: `Box`는 비어있을 수 없습니다. 따라서 포인터는 항상 유효하며 `null`이 아닙니다. 이는 컴파일러가 메모리 레이아웃을 최적화 할 수 있게 해줍니다:

source: // Implement `new`, `insert`, `len`, and `has`.
ja: // `new`、`insert`、`len`、`has` を実装します。

source: [Borrowing](./borrowing.md) (1 hour)
ja: [借用](./borrowing.md)（1 時間）

source: [Slices and Lifetimes](./slices-and-lifetimes.md) (1 hour and 10 minutes)
ja: [スライスとライフタイム](./slices-and-lifetimes.md)（1 時間 10 分）

source: Including 10 minute breaks, this session should take about 2 hours and 20 minutes
ja: このセッションの所要時間は、10 分間の休憩を入れて約 2 時間 20 分です。

source: [Borrowing a Value](./borrowing/shared.md) (10 minutes)
ja: [値の借用](./borrowing/shared.md)（10 分）

source: [Borrow Checking](./borrowing/borrowck.md) (10 minutes)
ja: [借用チェック](./borrowing/borrowck.md)（10 分）

source: [Interior Mutability](./borrowing/interior-mutability.md) (10 minutes)
ja: [内部可変性](./borrowing/interior-mutability.md)（10 分）

source: [Exercise: Health Statistics](./borrowing/exercise.md) (30 minutes)
ja: [演習: 健康に関する統計情報](./borrowing/exercise.md)（30 分）

source: Notes on stack returns:
es: Notas sobre la devolución de resultados de la _stack_:
ja: スタックの戻り値に関する注意事項:
ko: 스택에 할당된 값을 리턴하는 것에 대한 참고:
