Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: If an exception is thrown from an extern "C++" function that is not declared by the CXX bridge to return `Result`, the program calls C++'s `std::terminate`. The behavior is equivalent to the same exception being thrown through a `noexcept` C++ function.
fa: اگر یک exception از یک extern "C++" function که توسط پل CXX برای بازگشت "نتیجه" اعلان نشده است، ایجاد شود، برنامه C++' `std::terminate` را فراخوانی می‌کند. این رفتار معادل همان exception است که از طریق یک `noexcept` C++ function فعال می‌شود.
ja: CXX ブリッジでResultを返すように宣言されていないextern "C++"関数から例外がスローされると、`Result`が返されると、プログラムは C++ の`std::terminate`を呼び出します。この動作は、同じ例外が`noexcept` C++ 関数でスローされた場合と同等です。
pt_br: Se uma exceção for lançada de uma função externa "C++" que não é declarada pela _bridge_ CXX para retornar `Result`, o programa chama `std::terminate` do C++. O comportamento é equivalente à mesma exceção sendo lançada por meio de uma função `noexcept` C++.
uk: Якщо виключна ситуація виникає з функції extern "C++", яка не оголошена мостом CXX і повертає `Result`, програма викликає `std::terminate` у C++. Поведінка еквівалентна тій самій виключній ситуації, яка виникає через функцію C++ `noexcept`.

source: C++ Type
ja: C++ 型
pt_br: Tipo em C++
uk: Тип C++

source: These types can be used in the fields of shared structs and the arguments and returns of extern functions.
fa: این typeها را می‌توان در فیلدهای ساختارهای مشترک و آرگومان‌ها و extern functionها استفاده کرد.
ja: これらの型は、共有構造体のフィールドと、extern 関数の引数と戻り値で使用できます。
pt_br: Esses tipos podem ser usados nos campos de _structs_ compartilhadas e nos argumentos e retornos de funções externas.
uk: Ці типи можна використовувати в полях спільних структур, а також в аргументах і поверненнях зовнішніх функцій.

source: Note that Rust's `String` does not map directly to `std::string`. There are a few reasons for this:
fa: توجه داشته باشید که `String` در Rust مستقیماً به `std::string` نگاشت نمی‌شود. چند دلیل برای این وجود دارد:
ja: Rust の `String` は `std::string` に直接マッピングされません。これには次のような理由があります。
pt_br: Observe que a `String` do Rust não é mapeada diretamente para `std::string`. Há algumas razões para isso:
uk: Зверніть увагу, що `String` у Rust не відображається безпосередньо у `std::string`. На це є декілька причин:

source: `std::string` does not uphold the UTF-8 invariant that `String` requires.
fa: ‏`std::string` ثابت UTF-8 را که `String` به آن نیاز دارد را پشتیبانی نمی‌کند.
ja: `std::string` は、`String` が必要とする UTF-8 不変条件を満たしません。
pt_br: `std::string` não mantém a invariante UTF-8 que `String` requer.
uk: `std::string` не підтримує інваріант UTF-8, якого вимагає `String`.

source: The two types have different layouts in memory and so can't be passed directly between languages.
fa: این دو نوع طرح‌بندی‌های متفاوتی در حافظه دارند و بنابراین نمی‌توان آنها را مستقیماً بین زبان‌ها منتقل کرد.
ja: この 2 つの型はメモリ内のレイアウトが異なるため、言語間で直接渡すことはできません。
pt_br: Os dois tipos têm layouts diferentes na memória e, portanto, não podem ser passados diretamente entre as linguagens.
uk: Ці два типи мають різне розташування в пам'яті, тому їх не можна передавати безпосередньо між мовами.

source: `std::string` requires move constructors that don't match Rust's move semantics, so a `std::string` can't be passed by value to Rust.
ja: `std::string` は、Rust のムーブ セマンティクスと一致しないムーブコンストラクタを必要とするため、`std::string` を Rust に値で渡すことはできません。
pt_br: `std::string` requer construtores de movimento que não correspondem à semântica de movimento do Rust, portanto, uma `std::string` não pode ser passada por valor para o Rust.
uk: `std::string` вимагає конструктора переміщення, який не відповідає семантиці переміщення Rust, тому `std::string` не може бути переданий за значенням до Rust

source: Building in Android
fa: ساخت در اندروید
pt_br: Compilando no Android
uk: Збірка в Android

source: Create a `cc_library_static` to build the C++ library, including the CXX generated header and source file.
fa: یک `cc_library_static` برای ساخت کتابخانه ++C از جمله هدر و فایل منبع تولید شده CXX ایجاد کنید.
ja: `cc_library_static` を作成して、CXX で生成されたヘッダーとソースファイルを含む C++ ライブラリをビルドします。
pt_br: Crie uma `cc_library_static` para compilar a biblioteca C++, incluindo o cabeçalho e o arquivo de origem gerados pelo CXX.
uk: Створіть `cc_library_static`, щоб зібрати бібліотеку C++, включаючи згенерований CXX заголовок і вихідний файл.

source: Point out that `libcxx_test_bridge_header` and `libcxx_test_bridge_code` are the dependencies for the CXX-generated C++ bindings. We'll show how these are setup on the next slide.
fa: به این نکته اشاره کنید که `libcxx_test_bridge_header` و `libcxx_test_bridge_code` وابستگی‌هایی برای پیوندهای ++C تولید شده توسط CXX ​​هستند. نحوه تنظیم اینها را در اسلاید بعدی نشان خواهیم داد.
ja: `libcxx_test_bridge_header` と `libcxx_test_bridge_code` が、CXX CXXにより生成される C++ バインディングに対する依存関係であることを説明します。次のスライドで、これらがどのような記述になっているかを説明します。
pt_br: Observe que `libcxx_test_bridge_header` e `libcxx_test_bridge_code` são as dependências para as vinculações C++ geradas pelo CXX. Mostraremos como essas são configuradas no próximo slide.
uk: Зверніть увагу, що `libcxx_test_bridge_header` і `libcxx_test_bridge_code` є залежностями для CXX-згенерованих зв'язок C++. Ми покажемо, як їх налаштовувати, на наступному слайді.

source: Note that you also need to depend on the `cxx-bridge-header` library in order to pull in common CXX definitions.
fa: توجه داشته باشید که برای ایجاد تعاریف رایج CXX باید به کتابخانه `cxx-bridge-header` وابسته باشید.
ja: また、一般的な CXX 定義を取得するためには、`cxx-bridge-header` ライブラリに依存する必要があることにも注意してください。
pt_br: Observe que você também precisa depender da biblioteca `cxx-bridge-header` para puxar as definições CXX comuns.
uk: Зауважте, що вам також потрібно залежати від бібліотеки `cxx-bridge-header`, щоб отримати загальні визначення CXX.

source: Full docs for using CXX in Android can be found in [the Android docs](https://source.android.com/docs/setup/build/rust/building-rust-modules/android-rust-patterns#rust-cpp-interop-using-cxx). You may want to share that link with the class so that students know where they can find these instructions again in the future.
fa: مستندات کامل برای استفاده از CXX در Android را می‌توانید در این آدرس پیدا کنید [the Android docs](https://source.android.com/docs/setup/build/rust/building-rust-modules/android-rust-patterns#rust-cpp-interop-using-cxx). ممکن است بخواهید آن پیوند را با کلاس به اشتراک بگذارید تا دانش‌آموزان بدانند که در آینده می‌توانند این دستورالعمل‌ها را دوباره پیدا کنند.
ja: Android で CXX を使用するための詳細なドキュメントについては、[Android のドキュメント](https://source.android.com/docs/setup/build/rust/building-rust-modules/android-rust-patterns#rust-cpp-interop-using-cxx)をご覧ください。そのリンクをクラスと共有して、受講者が後で手順を確認できるようにすることをおすすめします。
pt_br: Documentação completa para usar CXX no Android pode ser encontrada na [documentação do Android](https://source.android.com/docs/setup/build/rust/building-rust-modules/android-rust-patterns#rust-cpp-interop-using-cxx). Você pode querer compartilhar esse link com a classe para que os alunos saibam onde podem encontrar essas instruções novamente no futuro.
uk: Повну документацію щодо використання CXX в Android можна знайти в [документації для Android](https://source.android.com/docs/setup/build/rust/building-rust-modules/android-rust-patterns#rust-cpp-interop-using-cxx). Ви можете поділитися цим посиланням з класом, щоб студенти знали, де вони можуть знайти ці інструкції у майбутньому.

source: Create two genrules: One to generate the CXX header, and one to generate the CXX source file. These are then used as inputs to the `cc_library_static`.
fa: دو نوع ژانر ایجاد کنید: یکی برای تولید هدر CXX و دیگری برای تولید فایل منبع CXX. سپس از اینها به عنوان ورودی `cc_library_static` استفاده می‌شود.
ja: genrule を 2 つ作成します。1 つは CXX ヘッダーの生成用、もう 1 つは CXX ソースファイルの生成用です。これらは `cc_library_static` への入力として使用されます。
pt_br: Crie duas regras de geração: uma para gerar o cabeçalho CXX e outra para gerar o arquivo de origem CXX. Estes são então usados como entradas para a `cc_library_static`.
uk: Створіть два правила генерування: Одне для створення заголовка CXX, а інше для створення вихідного файлу CXX. Потім їх буде використано як вхідні дані для `cc_library_static`.

source: // Generate a C++ header containing the C++ bindings // to the Rust exported functions in lib.rs.
ja: // lib.rs にある Rustからエクスポートされた関数に対する // C++ バインディングを含む C++ ヘッダーを生成します。
pt_br: // Gera um cabeçalho C++ contendo as vinculações C++ // para as funções exportadas do Rust em lib.rs.
uk: // Згенерує C++ заголовок, що містить C++ прив'язки до // експортованих функцій Rust у lib.rs.

source: // Generate the C++ code that Rust calls into.
ja: // Rust が呼び出す C++ コードを生成します。
pt_br: // Gera o código C++ que o Rust chama.
uk: // Згенерує C++ код, до якого звертається Rust.

source: The `cxxbridge` tool is a standalone tool that generates the C++ side of the bridge module. It is included in Android and available as a Soong tool.
fa: ابزار`cxxbridge` یک ابزار مستقل است که سمت ++C ماژول پل را تولید می‌کند. در Android گنجانده شده و به عنوان ابزار Soong در دسترس است.
ja: `cxxbridge` ツールは、ブリッジ モジュールの C++ 側を生成するスタンドアロン ツールです。Android に組み込まれており、Soong ツールとして利用できます。
pt_br: A ferramenta `cxxbridge` é uma ferramenta independente que gera o lado C++ do módulo _bridge_. Ele está incluído no Android e está disponível como uma ferramenta Soong.
uk: Інструмент `cxxbridge` - це окремий інструмент, який генерує C++ частину модуля моста. Він входить до складу Android і доступний як інструмент Soong.

source: By convention, if your Rust source file is `lib.rs` your header file will be named `lib.rs.h` and your source file will be named `lib.rs.cc`. This naming convention isn't enforced, though.
fa: طبق قرارداد، اگر فایل منبع Rust شما `lib.rs` باشد، فایل header شما `lib.rs.h` و فایل منبع شما `lib.rs.cc` نام خواهد داشت. اگرچه این قرارداد نامگذاری اجرا نمی‌شود.
ja: 慣例として、Rust ソースファイルが `lib.rs` の場合、ヘッダー ファイルの名前は `lib.rs.h`、ソースファイルの名前は `lib.rs.cc` となります。ただし、この命名規則は強制ではありません。
pt_br: Por convenção, se o seu arquivo de origem Rust for `lib.rs`, seu arquivo de cabeçalho será chamado `lib.rs.h` e seu arquivo de origem será chamado `lib.rs.cc`. Essa convenção de nomenclatura não é aplicada, no entanto.
uk: За домовленістю, якщо ваш вихідний файл Rust має ім'я `lib.rs`, ваш заголовний файл буде називатися `lib.rs.h`, а вихідний файл буде називатися `lib.rs.cc`. Втім, цей порядок іменування не є обов'язковим.

source: Create a `rust_binary` that depends on `libcxx` and your `cc_library_static`.
fa: یک`rust_binary` ایجاد کنید که به `libcxx` و `cc_library_static` شما بستگی دارد.
ja: `libcxx` と `cc_library_static`に依存する `rust_binary` を作成します。
pt_br: Crie um `rust_binary` que depende de `libcxx` e sua `cc_library_static`.
uk: Створіть `rust_binary`, який залежить від `libcxx` і вашої `cc_library_static`.

source: Interoperability with Java
es: Interoperabilidad con Java
fa: قابلیت همکاری با جاوا
ja: Java との相互運用性
ko: Java와의 상호운용성
pt_br: Interoperabilidade com Java
uk: Взаємодія з Java

source: Java can load shared objects via [Java Native Interface (JNI)](https://en.wikipedia.org/wiki/Java_Native_Interface). The [`jni` crate](https://docs.rs/jni/) allows you to create a compatible library.
es: Java puede cargar objetos compartidos a través de la [interfaz nativa de Java (JNI)](https://es.wikipedia.org/wiki/Java_Native_Interface). [El crate `jni`](https://docs.rs/jni/) permite crear una biblioteca compatible.
fa: جاوا می‌تواند objectهای مشترک را از طریق [واسط بومی جاوا [Java Native Interface (JNI)](https://en.wikipedia.org/wiki/Java_Native_Interface) بارگیری کند. [`jni` crate](https://docs.rs/jni/) به شما امکان می دهد یک کتابخانه سازگار ایجاد کنید.
ja: Java では、[Java Native Interface（JNI）](https://en.wikipedia.org/wiki/Java_Native_Interface) を介して共有オブジェクトを読み込むことができます。[`jni` クレート](https://docs.rs/jni/) を使用すると、互換性のあるライブラリを作成できます。
ko: 자바는 [Java Native Interface(JNI)](https://en.wikipedia.org/wiki/Java_Native_Interface)를 통해 공유 라이브러리를 로드할 수 있습니다. [`jni` 크레이트](https://docs.rs/jni/)를 사용하여 JNI 라이브러리를 만들 수 있습니다.
pt_br: Java pode carregar objetos compartilhados via [Java Native Interface (JNI)](https://en.wikipedia.org/wiki/Java_Native_Interface). O [crate `jni`](https://docs.rs/jni/) permite que você crie uma biblioteca compatível.
uk: Java може завантажувати спільні об’єкти через [Java Native Interface (JNI)](https://en.wikipedia.org/wiki/Java_Native_Interface). Крейт [`jni`](https://docs.rs/jni/) дозволяє створити сумісну бібліотеку.

source: First, we create a Rust function to export to Java:
es: En primer lugar, creamos una función de Rust para exportar a Java:
fa: ابتدا یک تابع Rust برای export به Java ایجاد می‌کنیم:
ja: まず、Java にエクスポートする Rust 関数を作成します。
ko: 먼저, 자바로 내보낼 러스트 함수를 생성합니다:
pt_br: Primeiro, criamos uma função Rust para exportar para Java:
uk: Спочатку ми створюємо функцію Rust для експорту в Java:

source: //! Rust <-> Java FFI demo.
ja: //! Rust <-> Java FFI のデモ。
uk: //! Rust <-> Java FFI демонстрація.

source: /// HelloWorld::hello method implementation.
ja: /// HelloWorld::hello メソッドの実装。
pt_br: /// Implementação do método HelloWorld::hello.
uk: /// Реалізація методу HelloWorld::hello.

source: "Hello, {input}!"
fa: "سلام, {input}!"
pt_br: "Olá, {input}!"
uk: "Привіт, {input}!"

source: We then call this function from Java:
fa: سپس این تابع را از جاوا فراخوانی می کنیم:
ja: 次に、Java からこの関数を呼び出します。
uk: Потім ми можемо викликати цю функцію з Java:

source: Finally, you can build, sync, and run the binary:
es: Ahora puedes compilar, sincronizar y ejecutar el binario:
fa: در نهایت، می‌توانید باینری را بسازید، همگام‌سازی کنید و اجرا کنید:
ja: 最後に、バイナリをビルド、同期、実行します。
ko: 마지막으로 바이너리를 빌드, 싱크, 실행합니다:
pt_br: Por fim, você pode criar, sincronizar e executar o binário:
uk: Нарешті, ви можете створити, синхронізувати та запустити бінарний файл:

source: This is a group exercise: We will look at one of the projects you work with and try to integrate some Rust into it. Some suggestions:
es: Este es un ejercicio de grupo: escogeremos uno de los proyectos con los que se esté trabajando e intentaremos integrar Rust en él. Algunas sugerencias:
fa: این یک تمرین گروهی است: ما به یکی از پروژه‌هایی که با آن کار می‌کنید نگاه می‌کنیم و سعی می‌کنیم مقداری Rust را در آن ادغام کنیم. چند پیشنهاد:
ja: これはグループ演習です。皆さんが取り組んでいるプロジェクトの一つを題材に、そこに Rust を統合してみましょう。以下にヒントを示します。
pt_br: Este é um exercício em grupo: Nós iremos ver um dos projetos com os quais você trabalha e tentar integrar um pouco de Rust nele. Algumas sugestões:
uk: Це групова вправа: ми розглянемо один із проектів, з яким ви працюєте, і спробуємо інтегрувати в нього трохи Rust. Деякі пропозиції:

source: Call your AIDL service with a client written in Rust.
es: Llama a tu servicio de AIDL con un cliente escrito en Rust.
fa: با سرویس AIDL خود با کلاینت که در Rust نوشته شده است تماس بگیرید.
ja: Rust で記述されたクライアントを使用して AIDL サービスを呼び出します。
ko: 당신의 AIDL서비스를 러스트 클라이언트에서 호출해봅니다.
pt_br: Chame seu serviço AIDL com um cliente escrito em Rust.
uk: Викличте свій сервіс AIDL з клієнтом, написаним на Rust.

source: Move a function from your project to Rust and call it.
es: Mueve una función desde tu proyecto a Rust y llámala.
fa: یک تابع را از پروژه خود به Rust منتقل کنید و آن را فراخوانی کنید.
ja: プロジェクトから Rust に関数を移動して呼び出します。
ko: 당신의 프로젝트의 함수를 러스트로 옮기고 호출해봅니다.
pt_br: Mova uma função do seu projeto para o Rust e a chame.
uk: Перемістіть функцію зі свого проекту в Rust і викличте її.

source: No solution is provided here since this is open-ended: it relies on someone in the class having a piece of code which you can turn in to Rust on the fly.
es: Aquí la solución es abierta, ya que depende de que alguno de los asistentes tenga un fragmento de código que se pueda convertir en Rust sobre la marcha.
fa: هیچ راه‌حلی در اینجا ارائه نشده است زیرا این مورد باز است: به فردی در کلاس متکی است که یک قطعه کد دارد که می توانید آن را به Rust on fly تبدیل کنید.
ja: この演習は自由回答形式であるため、解答は用意されていません。クラスの誰かがコードを持っていて、その場で Rust に変換できることを前提としています。
ko: 이 연습문제는 열려있기 때문에 해답이 제공되지 않습니다. 클래스에서 제출된 코드에 의존합니다.
pt_br: Nenhuma solução é fornecida aqui, pois isso é aberto: depende de você ter uma classe tendo um pedaço de código que você pode transformar em Rust em tempo real.
uk: Тут не надано жодного рішення, оскільки воно є відкритим: воно покладається на те, що хтось у класі має фрагмент коду, який ви можете передати Rust на льоту.

source: Welcome to Rust in Chromium
fa: به Rust در Chromium خوش‌آمدید
pt_br: Bem-vindo ao Rust para Chromium
uk: Ласкаво просимо до Rust в Chromium

source: Rust is supported for third-party libraries in Chromium, with first-party glue code to connect between Rust and existing Chromium C++ code.
fa: ‏ Rust برای کتابخانه‌های شخص ثالث در Chromium پشتیبانی می‌شود، با glue code اول شخص برای اتصال بین Rust و کد موجود در ++Chromium C.
pt_br: O Rust é suportado para bibliotecas de terceiros no Chromium, com código original para conectar com o código C++ existente do Chromium.
uk: Rust підтримується для бібліотек сторонніх розробників у Chromium, а також стороннім кодом для з'єднання між Rust та існуючим кодом Chromium C++.

source: Today, we'll call into Rust to do something silly with strings. If you've got a corner of the code where you're displaying a UTF8 string to the user, feel free to follow this recipe in your part of the codebase instead of the exact part we talk about.
fa: امروز ما با Rust ارتباط می‌گیریم تا کار احمقانه‌ای با stringها انجام دهد. اگر گوشه‌ای از کد را دارید که در آن رشته UTF8 را به کاربر نشان می دهید، به جای قسمت دقیقی که در مورد آن صحبت می‌کنیم، این دستور العمل را در قسمت خود از پایگاه کد دنبال کنید.
pt_br: Hoje, chamaremos o Rust para fazer algo simples com strings. Se você tem um pedacinho do código onde é exibida uma string UTF8 para o usuário, sinta-se à vontade para seguir esta receita em sua parte do código-fonte em vez da parte exata sobre a qual falamos.
uk: Сьогодні ми будемо викликати Rust, щоб зробити дещо безглузде з рядками. Якщо у вас є ділянка коду, де ви показуєте користувачеві рядок у кодуванні UTF8, сміливо використовуйте цей рецепт у вашій частині коду, замість тієї частини, про яку ми говоримо.

source: Make sure you can build and run Chromium. Any platform and set of build flags is OK, so long as your code is relatively recent (commit position 1223636 onwards, corresponding to November 2023):
fa: مطمئن شوید که می‌توانید Chromium را build و اجرا کنید. هر پلتفرم و مجموعه‌ای از build flag ها بدون مشکل هستند، تا زمانی که کد شما نسبتاً جدید باشد (موقعیت commit 1223636 به بعد، مربوط به نوامبر 2023):
pt_br: Certifique-se de que você pode compilar e executar o Chromium. Qualquer plataforma e conjunto de _flags_ de compilação está OK, desde que seu código seja relativamente recente (posição de _commit_ 1223636 em diante, correspondendo a novembro de 2023):
uk: Переконайтеся, що ви можете зібрати та запустити Chromium. Підійде будь-яка платформа і набір флажків збірки, якщо ваш код відносно свіжий (позиція коміту 1223636 і далі, що відповідає листопаду 2023 року):

source: (A component, debug build is recommended for quickest iteration time. This is the default!)
fa: (یک component به صورت debug build برای سریع‌ترین زمان تکرار توصیه می‌شود. این یک حالت پیش‌فرض است!)
pt_br: (Um componente, compilação de _debug_ é recomendado para o tempo de iteração mais rápido. Este é o padrão!)
uk: (Рекомендується використовувати налагоджувальну збірку компонента для скорочення часу ітерацій. Це збірка за замовчуванням!)

source: See [How to build Chromium](https://www.chromium.org/developers/how-tos/get-the-code/) if you aren't already at that point. Be warned: setting up to build Chromium takes time.
fa: اگر از قبل در آن مرحله نیستید، به [چگونه Chromium بسازیم](https://www.chromium.org/developers/how-tos/get-the-code/) مراجعه کنید. هشدار: راه‌اندازی برای build Chromium زمان زیادی می‌برد.
pt_br: Veja [Como compilar o Chromium](https://www.chromium.org/developers/how-tos/get-the-code/) se você ainda não estiver nesse ponto. Atenção: configurar a compilação do Chromium leva tempo.
uk: Дивіться [Як зібрати Chromium](https://www.chromium.org/developers/how-tos/get-the-code/), якщо ви ще не зробили цього. Зауважте: підготовка до збірки Chromium потребує часу.

source: It's also recommended that you have Visual Studio code installed.
fa: همچنین توصیه می شود که Visual Studio code را نصب کرده باشید.
pt_br: Também é recomendável que você tenha o Visual Studio Code instalado.
uk: Також рекомендується, щоб у вас був встановлений код Visual Studio.

source: About the exercises
fa: در مورد تمرین‌ها
pt_br: Sobre os exercícios
uk: Про вправи

source: This part of the course has a series of exercises which build on each other. We'll be doing them spread throughout the course instead of just at the end. If you don't have time to complete a certain part, don't worry: you can catch up in the next slot.
fa: این بخش از دوره دارای یک سری تمرینات است که بر روی یکدیگر ساخته می‌شوند. ما آنها را به جای اینکه فقط در انتها انجام دهیم، در طول دوره پخش خواهیم کرد. اگر برای تکمیل قسمت خاصی وقت ندارید، نگران نباشید: می توانید در اسلاید بعدی به عقب برگردید.
pt_br: Esta parte do curso tem uma série de exercícios que se complementam. Faremo-os ao longo do curso em vez de apenas no final. Se você não tiver tempo para concluir uma determinada parte, não se preocupe: você pode alcançar no próximo slot.
uk: Ця частина курсу складається з серії вправ, які будуються одна на одній. Ми будемо виконувати їх протягом усього курсу, а не лише наприкінці. Якщо ви не встигнете виконати певну частину, не хвилюйтеся: ви зможете надолужити згаяне на наступному занятті.

source: The Rust community typically uses `cargo` and libraries from [crates.io](https://crates.io/). Chromium is built using `gn` and `ninja` and a curated set of dependencies.
fa: جامعه Rust معمولاً از `cargo` و کتابخانه‌های [crates.io](https://crates.io/) استفاده می‌کند. Chromium با استفاده از `gn` و `ninja` و مجموعه‌ای از وابستگی‌ها ساخته شده است.
uk: Спільнота Rust зазвичай використовує `cargo` та бібліотеки з [crates.io](https://crates.io/). Chromium збирається за допомогою `gn` і `ninja` та курованого набору залежностей.

source: When writing code in Rust, your choices are:
fa: هنگام نوشتن کد در Rust، انتخاب‌های شما عبارتند از:
pt_br: Ao escrever código em Rust, suas escolhas são:
uk: Коли ви пишете код на Rust, у вас є вибір:

source: Use `gn` and `ninja` with the help of the templates from `//build/rust/*.gni` (e.g. `rust_static_library` that we'll meet later). This uses Chromium's audited toolchain and crates.
fa: از `gn` و `ninja` با کمک الگوهای `//build/rust/*.gni` استفاده کنید (مثلاً `rust_static_library` که بعداً با آن آشنا خواهیم شد). این از toolchain و crateهای بررسی‌شده Chromium استفاده می‌کند.
pt_br: Use `gn` e `ninja` com a ajuda dos _templates_ de `//build/rust/*.gni` (por exemplo, `rust_static_library` que veremos mais adiante). Isso usa o conjunto de ferramentas e _crates_ auditados do Chromium.
uk: Використовувати `gn` і `ninja` за допомогою шаблонів з `//build/rust/*.gni` (наприклад, `rust_static_library`, з яким ми познайомимося пізніше). Для цього використовується перевірений інструментарій та крейти Chromium.

source: Use `cargo`, but [restrict yourself to Chromium's audited toolchain and crates](https://chromium.googlesource.com/chromium/src/+/refs/heads/main/docs/rust.md#Using-cargo)
fa: از `cargo` استفاده کنید، اما [خود را به toolchain و crateهای بررسی‌شده Chromium محدود کنید](https://chromium.googlesource.com/chromium/src/+/refs/heads/main/docs/rust.md#Using-cargo)
pt_br: Use `cargo`, mas [restrinja-se ao conjunto de ferramentas e _crates_ auditados do Chromium](https://chromium.googlesource.com/chromium/src/+/refs/heads/main/docs/rust.md#Using-cargo)
uk: Використовувати `cargo`, але [обмежитися перевіреним інструментарієм та крейтами Chromium](https://chromium.googlesource.com/chromium/src/+/refs/heads/main/docs/rust.md#Using-cargo)
