Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: If it were running in a VM, this can lead to cache coherency issues. The problem is that the VM is accessing memory directly with the cache disabled, while the host has cacheable aliases to the same memory. Even if the host doesn't explicitly access the memory, speculative accesses can lead to cache fills, and then changes from one or the other will get lost. Again this is alright in this particular case (running directly on the hardware with no hypervisor), but isn't a good pattern in general.
es: Si se estuviera ejecutando en una máquina virtual, podría provocar problemas de coherencia en la caché. El problema es que la máquina virtual accede a la memoria directamente con la caché inhabilitada, mientras que el host cuenta con alias que se pueden almacenar en caché en la misma memoria. Incluso si el host no accede explícitamente a la memoria, los accesos especulativos pueden provocar que se llene la caché, haciendo que los cambios de uno u otro se pierdan. De nuevo, es correcto en este caso particular (si se ejecuta directamente en el hardware sin hipervisor) pero, por lo general, no es un buen patrón.
ja: もしVM上で実行していたとすると、キャッシュコヒーレンシーの問題を起こすことがあります。問題なのはVMがキャッシュを無効化したまま直接メモリにアクセスしているのに対し、ホストは同じメモリに対してキャッシュ可能なエイリアスを持ってしまうということです。ホストが仮に明示的にメモリにアクセスしないとしても、投機的なアクセスによりキャッシュフィルが起きることがあり、そうなるとVMかホストのどちらかによる変更が失われてしまいます。この（ハイパーバイザなしで直接ハードウェアで実行する）場合には問題にはなりませんが、一般的には良くないパターンです。
pt_br: Se estivesse sendo executado em uma VM, isso pode levar a problemas de coerência de cache. O problema é que a VM está acessando a memória diretamente com o cache desabilitado, enquanto o host tem _aliases_ cacheáveis para a mesma memória. Mesmo que o host não acesse explicitamente a memória, acessos especulativos podem levar a preenchimentos de cache e, em seguida, alterações de um ou de outro serão perdidas. Novamente, está tudo bem neste caso particular (executando diretamente no hardware sem hipervisor), mas não é um bom padrão em geral.
uk: Якщо код працював у віртуальній машині, це може призвести до проблем узгодженості кешу. Проблема полягає в тому, що віртуальна машина звертається до пам’яті безпосередньо з вимкненою кеш-пам’яттю, тоді як хост має кешовані псевдоніми для тієї самої пам’яті. Навіть якщо хост явно не звертається до пам’яті, спекулятивні доступи можуть призвести до заповнення кешу, і тоді зміни з одного або іншого боку будуть втрачені. Знову ж таки, це нормально в цьому конкретному випадку (працює безпосередньо на апаратному забезпеченні без гіпервізора), але це не дуже гарний шаблон загалом.

source: Useful crates
es: Crates Útiles
fa: جعبه‌های (crates) کاربردی
ja: 便利クレート
ko: 유용한 크레이트
pt_br: Crates Úteis
uk: Корисні крейти

source: We'll go over a few crates which solve some common problems in bare-metal programming.
es: A continuación, repasaremos algunos crates que resuelven ciertos problemas comunes en la programación bare-metal.
fa: ما به چند crate می‌پردازیم که برخی از مشکلات رایج در برنامه‌نویسی bare-metal را حل می‌کند.
ja: ベアメタルプログラミングにおいて共通に発生する問題に対する解を与えるクレートについていくつか紹介します。
ko: bare-metal 프로그래밍의 몇 가지 일반적인 문제를 해결하는 크레이트를 살펴봅니다.
pt_br: Vamos ver algumas _crates_ que resolvem alguns problemas comuns na programação _bare-metal_.
uk: Ми розглянемо кілька крейтів, які вирішують деякі поширені проблеми програмування на голому залізі.

source: The [`zerocopy`](https://docs.rs/zerocopy/) crate (from Fuchsia) provides traits and macros for safely converting between byte sequences and other types.
es: El crate [`zerocopy`](https://docs.rs/zerocopy/) (de Fuchsia) proporciona traits y macros para realizar conversiones seguras entre secuencias de bytes y otros tipos.
fa: این crate [`zerocopy`](https://docs.rs/zerocopy/) (از Fuchsia) صفات و ماکروهایی را برای تبدیل ایمن بین دنباله‌های بایت و انواع دیگر فراهم می‌کند.
ja: （Fuchsiaの）[`zerocopy`](https://docs.rs/zerocopy/)クレートはバイトシーケンスとその他の型の変換を安全に行うためのトレイトやマクロを提供します。
ko: Fuchsia팀이 만든 [`zerocopy`](https://docs.rs/zerocopy/) 크레이트는 바이트 시퀀스를 다른 타입으로 안전하게 변환하기 위한 트레잇 및 매크로를 제공합니다.
pt_br: O _crate_ [`zerocopy`](https://docs.rs/zerocopy/) (do Fuchsia) fornece _traits_ e macros para converter com segurança entre sequências de bytes e outros tipos.
uk: Крейт [`zerocopy`](https://docs.rs/zerocopy/) (від Fuchsia) надає трейти та макроси для безпечного перетворення між послідовностями байтів та іншими типами.

source: This is not suitable for MMIO (as it doesn't use volatile reads and writes), but can be useful for working with structures shared with hardware e.g. by DMA, or sent over some external interface.
es: No es adecuado para MMIO (ya que no utiliza lecturas y escrituras volátiles), pero puede ser útil para trabajar con estructuras compartidas con hardware (por ejemplo, mediante DMA) o enviadas a través de alguna interfaz externa.
fa: این برای MMIO مناسب نیست (زیرا از خواندن و نوشتن فرار یا volatile استفاده نمی‌کند)، اما می‌تواند برای کار با ساختارهای مشترک با سخت افزار مفید باشد. توسط DMA، یا از طریق برخی از رابط‌های خارجی ارسال می‌شود.
ja: これは（volatile read、writeを使用していないため）MMIOには適してませんが、例えばDMAのようなハードウェアと共有するデータ構造あるいは外部インタフェースを通して送信するデータ構造を扱うに場合には有用です。
ko: 이 크레이트는 휘발성(volatile) 읽기 및 쓰기를 사용하지 않으므로 MMIO에 적합하지 않지만, 하드웨어와 공유되거나(예: DMA에서) 외장 인터페이스를 통해 전송되는 구조체를 다루는 데에는 유용할 수 있습니다.
pt_br: Isso não é adequado para MMIO (pois não usa leituras e gravações voláteis), mas pode ser útil para trabalhar com estruturas compartilhadas com hardware, por exemplo, por DMA, ou enviadas por alguma interface externa.
uk: Це не підходить для MMIO (оскільки він не використовує непостійні читання та записи), але може бути корисним для роботи зі структурами, спільними з обладнанням, наприклад, з прямим доступом до пам'яті (DMA), або переданими через зовнішній інтерфейс.

source: `FromBytes` can be implemented for types for which any byte pattern is valid, and so can safely be converted from an untrusted sequence of bytes.
es: `FromBytes` se puede implementar en tipos en los que cualquier patrón de bytes es válido, por lo que se puede convertir de forma segura a partir de una secuencia de bytes que no es fiable.
fa: ‏ `FromBytes` را می‌توان برای انواعی که هر الگوی بایتی برای آنها معتبر است پیاده‌سازی کرد و بنابراین می‌توان با خیال راحت از یک دنباله بایت‌های نامعتبر تبدیل کرد.
ja: `FromBytes`はいかなるバイトパターンも有効な値となる型に対して実装することができ、信用できないバイトシーケンスからの安全な変換を可能にします。
ko: 어떤 타입이 가능한 모든 바이트 패턴들에 대해 올바른 값을 가질 때에만 , 그 타입이 `FromBytes`를 구현할 수 있습니다. 그렇게 해서 신뢰할 수 없는 바이트 시퀀스를 안전하게 해당 타입으로 변환할 수 있습니다.
pt_br: `FromBytes` pode ser implementado para tipos para os quais qualquer padrão de byte é válido e, portanto, pode ser convertido com segurança de uma sequência de bytes não confiável.
uk: `FromBytes` можна реалізувати для типів, для яких дійсний будь-який шаблон байтів, і тому його можна безпечно перетворити з ненадійної послідовності байтів.

source: Attempting to derive `FromBytes` for these types would fail, because `RequestType` doesn't use all possible u32 values as discriminants, so not all byte patterns are valid.
es: Si se intenta derivar `FromBytes` para estos tipos, se produciría un error, pues `RequestType` no utiliza todos los valores u32 posibles como discriminantes y, por tanto, todos los patrones de bytes son válidos.
fa: تلاش برای استخراج `FromBytes` برای این تایپ‌ها ناموفق خواهد بود، زیرا `RequestType` از همه مقادیر ممکن u32 به عنوان متمایزکننده استفاده نمی‌کند، بنابراین همه الگوهای بایت معتبر نیستند.
ja: `RequestType`はu32型のすべての値を有効なenum値として定義していないので、すべてのバイトパターンが有効とはならず、これらに対する`FromBytes`の導出はフェールするでしょう。
ko: 위 코드에서 정의한 타입에 대해 `FromBytes`를 구현하려고 하면 에러가 발생합니다. `RequestType`은 가능한 모든 u32 값을 식별자로 받아들이지 않기 때문입니다. 즉 모든 바이트 패턴이 유효한 `RequestType`값은 아닙니다.
pt_br: Tentar derivar `FromBytes` para esses tipos falharia, porque `RequestType` não usa todos os valores u32 possíveis como discriminantes, portanto, nem todos os padrões de bytes são válidos.
uk: Спроба отримати `FromBytes` для цих типів не вдасться, оскільки `RequestType` не використовує всі можливі значення u32 як дискримінанти, тому не всі шаблони байтів є дійсними.

source: `zerocopy::byteorder` has types for byte-order aware numeric primitives.
es: `zerocopy::byteorder` tiene tipos para primitivos numéricos conscientes del orden de bytes.
fa: `zerocopy::byteorder` دارای تایپ‌های برای اعداد اولیه مطلع از byte-order است.
ja: `zerocopy::byteorder`はバイトオーダを気にする数値プリミティブに関する型を提供します。
ko: `zerocopy::byteorder`에는 바이트 오더에 따른 서로 다른 표현 방식을 지원하는 숫자 타입을 제공합니다.
pt_br: `zerocopy::byteorder` tem tipos para primitivas numéricas que levam em consideração a ordem dos bytes.
uk: `zerocopy::byteorder` має типи для числових примітивів з урахуванням порядку байтів.

source: Run the example with `cargo run` under `src/bare-metal/useful-crates/zerocopy-example/`. (It won't run in the Playground because of the crate dependency.)
es: Ejecuta el ejemplo con `cargo run` en `src/bare-metal/useful-crates/zerocopy-example/`. (No se ejecutará en el playground debido a la dependencia del crate).
fa: مثال را با `cargo run` در `src/bare-metal/useful-crates/zerocopy-example/`اجرا کنید. (به دلیل وابستگی به crate در Playground اجرا نمی‌شود.)
ja: この例を`src/bare-metal/useful-crates/zerocopy-example/`において`cargo run`ととすることで実行してみましょう。（Playgroundではこの例が依存するクレートを利用できないため実行できません）
ko: `src/bare-metal/useful-crates/zerocopy-example/`에서 `cargo run`을 사용하여 예시를 실행합니다(종속성 문제로 인해 플레이그라운드에서는 실행되지 않습니다).
pt_br: Execute o exemplo com `cargo run` em `src/bare-metal/useful-crates/zerocopy-example/`. (Não executará no Playground por causa da dependência do _crate_).
uk: Запустіть приклад із `cargo run` у `src/bare-metal/useful-crates/zerocopy-example/`. (Він не працюватиме на Rust Playground через залежність від крейту.)

source: The [`aarch64-paging`](https://crates.io/crates/aarch64-paging) crate lets you create page tables according to the AArch64 Virtual Memory System Architecture.
es: El crate [`aarch64-paging`](https://crates.io/crates/aarch64-paging) permite crear tablas de páginas de acuerdo con la arquitectura del sistema de memoria virtual AArch64.
fa: این crate [`aarch64-paging`](https://crates.io/crates/aarch64-paging) به شما امکان می‌دهد page tableها را مطابق با معماری سیستم حافظه‌مجازی AArch64 ایجاد کنید.
ja: [`aarch64-paging`](https://crates.io/crates/aarch64-paging)クレートはAArch64仮想メモリシステムアーキテクチャに則ったページテーブルの生成を可能にします。
ko: [`aarch64-paging`](https://crates.io/crates/aarch64-paging) 크레이트를 사용하면 AArch64 가상 메모리 시스템 아키텍처에 따라 페이지 테이블을 만들 수 있습니다.
pt_br: O _crate_ [`aarch64-paging`](https://crates.io/crates/aarch64-paging) permite criar tabelas de páginas de acordo com a Arquitetura do Sistema de Memória Virtual AArch64.
uk: Крейт [`aarch64-paging`](https://crates.io/crates/aarch64-paging) дозволяє створювати таблиці сторінок відповідно до архітектури системи віртуальної пам’яті AArch64.

source: // Create a new page table with identity mapping.
pt_br: // Cria uma nova tabela de páginas com mapeamento de identidade.
uk: // Створити нову таблицю сторінок з відображенням ідентичності.

source: // Map a 2 MiB region of memory as read-only.
pt_br: // Mapeia uma região de memória de 2 MiB como somente leitura.
uk: // Відобразити область пам'яті розміром 2 MiB як доступну тільки для читання.

source: // Set `TTBR0_EL1` to activate the page table.
pt_br: // Seta `TTBR0_EL1` para ativar a tabela de páginas.
uk: // Встановити `TTBR0_EL1` для активації таблиці сторінок.

source: For now it only supports EL1, but support for other exception levels should be straightforward to add.
es: Por ahora, solo es compatible con EL1, pero debería ser sencillo añadir compatibilidad con otros niveles de excepción.
fa: در حال حاضر فقط از EL1 پشتیبانی می‌کند، اما پشتیبانی از سایر سطوح استثنا باید ساده باشد.
ja: 現時点ではEL1しかサポートされていませんが、他の例外レベルのサポートも簡単に追加できるはずです。
ko: 현재는 EL1만 지원하지만 다른 익셉션 레벨(Exception Level: EL)도 어렵지 않게 추가할 수 있습니다.
pt_br: Por enquanto, ele suporta apenas EL1, mas o suporte para outros níveis de exceção deve ser fácil de adicionar.
uk: Наразі він підтримує лише EL1, але підтримка інших рівнів винятків має бути легко додана.

source: This is used in Android for the [Protected VM Firmware](https://cs.android.com/android/platform/superproject/+/master:packages/modules/Virtualization/pvmfw/).
es: Se utiliza en Android para el [Firmware de Máquina Virtual Protegida](https://cs.android.com/android/platform/superproject/+/master:packages/modules/Virtualization/pvmfw/).
fa: این مورد در Android برای [Protected VM Firmware]‌(https://cs.android.com/android/platform/superproject/+/master:packages/modules/Virtualization/pvmfw/) استفاده می‌شود.
ja: これはAndroidで[Protected VM Firmware](https://cs.android.com/android/platform/superproject/+/master:packages/modules/Virtualization/pvmfw/)のために利用されています。
ko: Android에서 [보호된 VM 펌웨어](https://cs.android.com/android/platform/superproject/+/master:packages/modules/Virtualization/pvmfw/)에 사용됩니다.
pt_br: Isso é usado no Android para o [Firmware VM Protegido](https://cs.android.com/android/platform/superproject/+/master:packages/modules/Virtualization/pvmfw/).
uk: Це використовується в Android для [прошивки захищеної віртуальної машини](https://cs.android.com/android/platform/superproject/+/master:packages/modules/Virtualization/pvmfw/).

source: There's no easy way to run this example, as it needs to run on real hardware or under QEMU.
es: No hay una forma sencilla de ejecutar este ejemplo, ya que debe hacerse en hardware real o en QEMU.
fa: هیچ راه آسانی برای اجرای این مثال وجود ندارد، زیرا باید روی سخت‌افزار واقعی یا تحت QEMU اجرا شود.
ja: この例は本物のハードウェアかQEMUを必要とするので、簡単には実行できません。
ko: 이 예시를 간단하게 실행하는 방법은 없습니다. 실제 하드웨어 또는 QEMU에서 실행해야 하기 때문입니다.
pt_br: Não há uma maneira fácil de executar este exemplo, pois ele precisa ser executado em hardware real ou no QEMU.
uk: Немає простого способу запустити цей приклад, оскільки він повинен працювати на реальному обладнанні або під керуванням QEMU.

source: [`buddy_system_allocator`](https://crates.io/crates/buddy_system_allocator) is a third-party crate implementing a basic buddy system allocator. It can be used both for [`LockedHeap`](https://docs.rs/buddy_system_allocator/0.9.0/buddy_system_allocator/struct.LockedHeap.html) implementing [`GlobalAlloc`](https://doc.rust-lang.org/core/alloc/trait.GlobalAlloc.html) so you can use the standard `alloc` crate (as we saw [before](../alloc.md)), or for allocating other address space. For example, we might want to allocate MMIO space for PCI BARs:
es: [`buddy_system_allocator`](https://crates.io/crates/buddy_system_allocator) es un crate de terceros que implementa un asignador básico del sistema buddy. Se puede utilizar tanto para [`LockedHeap`](https://docs.rs/buddy_system_allocator/0.9.0/buddy_system_allocator/struct.LockedHeap.html) implementando [`GlobalAlloc`](https://doc.rust-lang.org/core/alloc/trait.GlobalAlloc.html), de forma que puedas usar el crate `alloc` estándar (tal y como vimos [antes](../alloc.md)), o para asignar otro espacio de direcciones. Por ejemplo, podríamos querer asignar espacio MMIO para los registros de dirección base (BAR) de PCI:
fa: ‏ ['buddy_system_allocator'](https://crates.io/crates/buddy_system_allocator) یک third-party crate است که یک buddy system allocator را پیاده‌سازی می‌کند. می‌توان آن را هم برای ['LockedHeap'](https://docs.rs/buddy_system_allocator/0.9.0/buddy_system_allocator/struct.LockedHeap.html) در پیاده‌سازی [`GlobalAlloc`]‌(https://doc.rust-lang.org/core/alloc/trait.GlobalAlloc.html) استفاده کرد. بنابراین می‌توانید از crate استاندارد `alloc` (همانطور که [قبل از](../alloc.md) دیدیم) یا برای تخصیص فضای آدرس دیگر استفاده کنید. به عنوان مثال، ممکن است بخواهیم فضای MMIO را برای PCI BARها اختصاص دهیم:
ja: [`buddy_system_allocator`](https://crates.io/crates/buddy_system_allocator) はサードパーティのクレートで、基本的なバディシステムアローケータを実装しています。このクレートは[`GlobalAlloc`](https://doc.rust-lang.org/core/alloc/trait.GlobalAlloc.html) を実装する [`LockedHeap`](https://docs.rs/buddy_system_allocator/0.9.0/buddy_system_allocator/struct.LockedHeap.html) により（ [以前](../alloc.md)見たように）標準の`alloc` クレートを利用可能にするために使えますし、別のアドレス空間をアロケートするためにも使えます。例えば、PCI BARに対するMMIO領域をアロケートしたい場合には以下のようにできます：
ko: [`buddy_system_allocator`](https://crates.io/crates/buddy_system_allocator)는 버디 시스템 할당자를 구현하는 서드 파티 크레이트입니다. 이 크레이트의 [`LockedHeap`](https://docs.rs/buddy_system_allocator/0.9.0/buddy_system_allocator/struct.LockedHeap.html)은 [`GlobalAlloc`](https://doc.rust-lang.org/core/alloc/trait.GlobalAlloc.html)를 구현합니다. 따라서 여러분은 버디 시스템 할당자를 'alloc' 크레이트를 통해서 사용할 수 있습니다([이전](../alloc.md)에 확인함). 또는 다른 주소 공간을 할당하는 데 사용할 수 있습니다. 예를 들어 PCI BAR에 MMIO 공간을 할당할 수 있습니다.
pt_br: [`buddy_system_allocator`](https://crates.io/crates/buddy_system_allocator) é um _crate_ de terceiros que implementa um alocador básico de sistema buddy. Ele pode ser usado tanto para [`LockedHeap`](https://docs.rs/buddy_system_allocator/0.9.0/buddy_system_allocator/struct.LockedHeap.html) implementando [`GlobalAlloc`](https://doc.rust-lang.org/core/alloc/trait.GlobalAlloc.html) para que você possa usar o _crate_ padrão `alloc` (como vimos [antes](../alloc.md)), ou para alocar outro espaço de endereço. Por exemplo, podemos querer alocar espaço MMIO para os BARs PCI:
uk: [`buddy_system_allocator`](https://crates.io/crates/buddy_system_allocator) — це сторонній крейт, який реалізує базовий системний розподільник між друзями. Його можна використовувати як для [`LockedHeap`](https://docs.rs/buddy_system_allocator/0.9.0/buddy_system_allocator/struct.LockedHeap.html), так і для реалізації [`GlobalAlloc`](https://doc.rust-lang.org/core/alloc/trait.GlobalAlloc.html), щоб ви могли використовувати стандартний крейт `alloc` (як ми бачили [раніше](../alloc.md)), або для виділення іншого адресного простору. Наприклад, ми можемо захотіти виділити простір MMIO для шин PCI:

source: PCI BARs always have alignment equal to their size.
es: Los BAR de PCI siempre tienen una alineación igual a su tamaño.
fa: ‏ PCI BAR‌ها همیشه دارای تراز برابر با اندازه خود هستند.
ja: PCI BARは常にサイズと同じアラインになります。
ko: PCI BAR는 BAR영역의 크기에 맞추어 정렬됩니다.
pt_br: Os BARs PCI sempre têm alinhamento igual ao seu tamanho.
uk: Шини PCI завжди мають вирівнювання відповідно до їх розміру.

source: Run the example with `cargo run` under `src/bare-metal/useful-crates/allocator-example/`. (It won't run in the Playground because of the crate dependency.)
es: Ejecuta el ejemplo con `cargo run` en `src/bare-metal/useful-crates/allocator-example/`. (No se ejecutará en el playground debido a la dependencia del crate).
fa: مثال را با `cargo run` در `src/bare-metal/useful-crates/allocator-example/` اجرا کنید. (به دلیل وابستگی به crate در Playground اجرا نمی‌شود.)
ja: この例を`src/bare-metal/useful-crates/allocator-example/`において `cargo run`とすることで実行してみましょう。（Playgroundではこの例が依存するクレートを利用できないため実行できません）
ko: `src/bare-metal/useful-crates/allocator-example/`에서 `cargo run`을 사용하여 예시를 실행합니다(종속성 문제로 인해 플레이그라운드에서는 실행되지 않습니다).
pt_br: Execute o exemplo com `cargo run` em `src/bare-metal/useful-crates/allocator-example/`. (Não executará no Playground por causa da dependência do _crate_).
uk: Запустіть приклад із `cargo run` у `src/bare-metal/useful-crates/allocator-example/`. (Він не працюватиме на Rust Playground через залежність від крейту.)

source: Sometimes you want something which can be resized like a `Vec`, but without heap allocation. [`tinyvec`](https://crates.io/crates/tinyvec) provides this: a vector backed by an array or slice, which could be statically allocated or on the stack, which keeps track of how many elements are used and panics if you try to use more than are allocated.
es: A veces, se necesita algo que se pueda cambiar de tamaño, como `Vec`, pero sin asignación de _heap_. [`tinyvec`](https://crates.io/crates/tinyvec) ofrece un vector respaldado por un array o slice, que se podría asignar estáticamente o en la _stack_, y que hace un seguimiento de cuántos elementos se usan, entrando en _panic_ si intentas utilizar más elementos de los asignados.
fa: گاهی اوقات شما چیزی را می‌خواهید که بتوان آن را مانند Vec تغییر اندازه داد، اما بدون heap allocation که [`tinyvec`] (https://crates.io/crates/tinyvec) این را فراهم می‌کند: یک برداری که توسط یک آرایه یا برش پشتیبانی می‌شود که می‌تواند به‌صورت ایستا allocate داده شود یا روی stack که تعداد عناصر استفاده شده را ردیابی می‌کند و اگر سعی کنید بیشتر از آنچه که اختصاص‌داده‌شده را استفاده کنید panic می‌کند.
ja: 時には`Vec`のようにリサイズできる領域をヒープを使わずに確保したいと思うことがあります。[`tinyvec`](https://crates.io/crates/tinyvec)は静的に確保、またはスタック上に確保した配列またはスライスを割当領域とするベクタを提供します。この実装では、いくつの要素が使われているかが管理され、確保された以上に使おうとするとパニックします。
ko: 힙에 메모리 할당하지 않고 크기 조절이 가능한 컨테이너(예: `Vec` 같은)가 필요할 때가 있습니다. [`tinyvec`](https://crates.io/crates/tinyvec)을 사용하면 됩니다. `tinyvec`에서 벡터는 배열 또는 슬라이스로부터 생성이 되며, 이들은 정적으로 할당되었거나 스택에 할당되어 있을 수 있습니다.`tinyvec`은 현재 벡터 안에 얼마나 많은 엘리먼트들이 존재하는 지를 추적하고 있으며, 할당된 양보다 더 많이 사용하려고 하면 패닉을 발생시킵니다.
pt_br: Às vezes, você deseja algo que possa ser redimensionado como um `Vec`, mas sem alocação de heap. [`tinyvec`](https://crates.io/crates/tinyvec) fornecer isso: um vetor com suporte a um array ou _slice_, que pode ser alocado estaticamente ou na pilha, que mantém o controle de quantos elementos são usados e gera um _panic_ se você tentar usar mais do que está alocado.
uk: Іноді вам потрібне щось, розмір якого можна змінити, наприклад `Vec`, але без виділення купи. [`tinyvec`](https://crates.io/crates/tinyvec) надає це: вектор, підкріплений масивом або зрізом, який може бути статично розміщений або в стеку, який відстежує, скільки елементів використовується та впадає в паніку, якщо ви намагаєтеся використати більше, ніж виділено.

source: `tinyvec` requires that the element type implement `Default` for initialisation.
es: `tinyvec` requiere que el tipo de elemento implemente `Default` para la inicialización.
fa: ‏ `tinyvec` نیاز دارد که تایپ عنصر `Default` را برای مقداردهی اولیه اجرا کند.
ja: `tinyvec` は初期化のために要素となるタイプが`Default`を実装することを必要とします。
ko: `tinyvec`를 사용하려면 엘리먼트의 타입이 `Default`를 통해 초기화 될 수 있어야 합니다.
pt_br: `tinyvec` requer que o tipo de elemento implemente `Default` para inicialização.
uk: `tinyvec` вимагає, щоб тип елемента реалізував `Default` для ініціалізації.

source: The Rust Playground includes `tinyvec`, so this example will run fine inline.
es: El playground de Rust incluye `tinyvec`, por lo que este ejemplo se ejecutará bien aunque esté insertado.
fa: ‏ Rust Playground شامل `tinyvec` می‌شود، بنابراین این مثال به‌خوبی به صورت داخلی اجرا می‌شود.
ja: Rust Playgroundは`tinyvec`を内包しているので、オンラインでこの例を実行することができます。
ko: Rust 플레이그라운드에는 `tinyvec`가 포함되어 있으므로 이 예시는 인라인으로 실행됩니다.
pt_br: O Rust Playground inclui `tinyvec`, portanto, este exemplo será executado corretamente inline.
uk: Rust Playground містить `tinyvec`, тож цей приклад добре працюватиме вбудовано.
