Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: [smol](https://docs.rs/smol/latest/smol/): simple and lightweight
es: [smol](https://docs.rs/smol/latest/smol/): sencillo y ligero.
fa: [smol](https://docs.rs/smol/latest/smol/): ساده و سبک است
pt_br: [smol](https://docs.rs/smol/latest/smol/): simples e leve
uk: [smol](https://docs.rs/smol/latest/smol/): простий і легкий

source: Several larger applications have their own runtimes. For example, [Fuchsia](https://fuchsia.googlesource.com/fuchsia/+/refs/heads/main/src/lib/fuchsia-async/src/lib.rs) already has one.
es: Varias aplicaciones de mayor tamaño tienen sus propios tiempos de ejecución. Por ejemplo, [Fuchsia](https://fuchsia.googlesource.com/fuchsia/+/refs/heads/main/src/lib/fuchsia-async/src/lib.rs) ya tiene uno.
fa: چندین برنامه بزرگتر زمان اجرا (runtime) مخصوص به خود را دارند. برای مثال، [Fuchsia](https://fuchsia.googlesource.com/fuchsia/+/refs/heads/main/src/lib/fuchsia-async/src/lib.rs) اکنون یکی runtime دارد.
ja: いくつかのより巨大なアプリケーションは、独自のランタイムを備えています。例えば[Fuchsia](https://fuchsia.googlesource.com/fuchsia/+/refs/heads/main/src/lib/fuchsia-async/src/lib.rs)はそのようなものをすでに備えています。
ko: 여러 대규모 애플리케이션에는 자체 런타임이 있는 경우도 있습니다. 예들 들어 [Fuchsia](https://fuchsia.googlesource.com/fuchsia/+/refs/heads/main/src/lib/fuchsia-async/src/lib.rs)가 있습니다.
pt_br: Várias aplicações maiores têm seus próprios _runtimes_. Por exemplo, [Fuchsia](https://fuchsia.googlesource.com/fuchsia/+/refs/heads/main/src/lib/fuchsia-async/src/lib.rs) já tem um.
uk: Кілька великих програм мають власний час виконання. Наприклад, [Fuchsia](https://fuchsia.googlesource.com/fuchsia/+/refs/heads/main/src/lib/fuchsia-async/src/lib.rs) вже має один.

source: Note that of the listed runtimes, only Tokio is supported in the Rust playground. The playground also does not permit any I/O, so most interesting async things can't run in the playground.
es: Ten en cuenta que, de los tiempos de ejecución enumerados, el playground de Rust solo admite Tokio. El playground tampoco permite ningún tipo de E/S, por lo que la mayoría de elementos asíncronos interesantes no se pueden ejecutar. en él.
fa: توجه داشته باشید که از میان زمان‌های اجرا ذکر شده، فقط Tokio در playground زبان Rust پشتیبانی می‌شود.playground همچنین اجازه ورود/خروجی (I/O) را نمی دهد، بنابراین بیشتر چیزهای async جالب نمی‌توانند در playground اجرا شوند.
ja: 上で挙げられたランタイムのうち、TokioのみがRustプレイグラウンドでサポートされています。このプレイグラウンドではいかなる入出力操作も許可されていないため、大抵の興味深い非同期のあれこれは、プレイグラウンドで実行することはできません。
ko: Rust 플레이그라운드에서는 위에 나열된 비동기 런타임 중에서 Tokio만 사용할 수 있습니다. 또한 Rust 플레이그라운드는 I/O를 허용하지 않으므로 async를 가지고 할 수 있는 많은 흥미로운 작업들이 불가능 합니다.
pt_br: Observe que, dos _runtimes_ listados, apenas Tokio é suportado no _Rust playground_. O _playground_ também não permite nenhum I/O, então a maioria das coisas _async_ interessantes não pode ser executada no _playground_.
uk: Зверніть увагу, що з перелічених середовищ виконання лише Tokio підтримується на ігровому майданчику Rust. Ігровий майданчик також не дозволяє будь-який ввід-вивід, тому більшість цікавих асинхронних речей не можуть працювати на ігровому майданчику.

source: Futures are "inert" in that they do not do anything (not even start an I/O operation) unless there is an executor polling them. This differs from JS Promises, for example, which will run to completion even if they are never used.
es: Los futuros son "inertes", ya que no realizan ninguna acción (ni siquiera iniciar una operación de E/S) a menos que haya un ejecutor que los sondee. Muy diferente de las promesas de JavaScript, por ejemplo, que se ejecutan hasta su finalización, aunque nunca se utilicen.
fa: ‏ Futureها از این جهت «بی‌اثر(inert)» هستند که هیچ کاری انجام نمی‌دهند (حتی عملیات I/O را شروع نمی‌کنند) مگر اینکه یک مجری(executor) وجود داشته باشد که آنها را polling کند. به عنوان مثال، این با JS Promises متفاوت است که حتی اگر هرگز استفاده نشوند تا پایان کامل شدن برنامه اجرا خواهند شد.
ja: Futureは、ポーリングを行うエグゼキュータの存在なしには何も行わない（入出力操作さえ始めない）という点で「怠惰」です。例えば、これは、エグゼキュータがなくとも最後まで実行されるJavaScriptのPromiseとは異なります。
ko: Futures는 실행자가 폴링하지 않는 한 아무것도 하지 않는다는 점에서(I/O 작업조차 시작하지 않음) "비활성" 상태입니다. 이는 사용되지 않는 경우에도 완료될 때 까지 실행되는, 자바 스크립트의 promise와 다릅니다.
pt_br: As _futures_ são "inertes" no sentido de que elas não fazem nada (nem mesmo iniciam uma operação de I/O) a menos que haja um _executor_ _polling_. Isso difere das _Promises_ do JS, por exemplo, que serão executadas até o final mesmo que nunca sejam usadas.
uk: Ф'ючерси "інертні" в тому, що вони нічого не роблять (навіть не починають операцію вводу-виводу), якщо немає виконавця, який їх опитує. Це відрізняється від, наприклад, JS Promises, які виконуватимуться до кінця, навіть якщо їх ніколи не використовувати.

source: Tokio provides:
pt_br: Tokio fornece:
uk: Tokio надає:

source: A multi-threaded runtime for executing asynchronous code.
es: Un tiempo de ejecución multihilo para ejecutar código asíncrono.
fa: یک runtime از نوع multi-thread برای اجرای کدهای ناهمزمان(asynchronous).
ja: 非同期のコードを実行するためのマルチスレッドのランタイム。
ko: 비동기 코드 실행을 위한 멀티스레드 런타임
pt_br: Um _runtime multi-threaded_ para executar código assíncrono.
uk: Багатопотокове середовище виконання для виконання асинхронного коду.

source: An asynchronous version of the standard library.
es: Una versión asíncrona de la biblioteca estándar.
fa: یک asynchronous version کتابخانه‌ای استاندارد است.
ja: 標準ライブラリの非同期バージョン。
ko: 표준 라이브러리의 비동기 버전
pt_br: Uma versão assíncrona da biblioteca padrão.
uk: Асинхронну версію стандартної бібліотеки.

source: A large ecosystem of libraries.
es: Un amplio ecosistema de bibliotecas.
fa: اکوسیستم بزرگی از کتابخانه‌ها.
ja: 大きなライブラリのエコシステム。
ko: 대규모 라이브러리 생태계
pt_br: Um grande ecossistema de bibliotecas.
uk: Велику екосистему бібліотек.

source: "Count in task: {i}!"
fa: "شمارش task: {i}!"
pt_br: "Contador na tarefa: {i}!"
uk: "Підрахунок у завданні: {i}!"

source: "Main task: {i}"
pt_br: "Tarefa principal: {i}"
uk: "Основне завдання: {i}"

source: With the `tokio::main` macro we can now make `main` async.
es: Con la macro `tokio::main`, podemos hacer que `main` sea asíncrono.
fa: با ماکرو `tokio::main` اکنون می‌توانیم `main` را async کنیم.
ja: `tokio::main`のマクロにより、`main`の非同期処理を作ることができます。
ko: 이제 `tokio::main` 매크로를 사용하면 `main`을 비동기로 만들 수 있습니다.
pt_br: Com a macro `tokio::main` agora podemos tornar `main` _async_.
uk: За допомогою макросу `tokio::main` ми тепер можемо зробити `main` асинхронною.

source: The `spawn` function creates a new, concurrent "task".
es: La función `spawn` crea una "tarea" simultánea.
fa: تابع `spawn` یک "task" جدید و همزمان ایجاد می‌کند.
ja: `spawn`関数は新しい並行の「タスク」を作成します。
ko: `spawn` 함수는 동시 실행되는 새로운 "작업"을 만듭니다.
pt_br: A função `spawn` cria uma nova "tarefa" concorrente.
uk: Функція `spawn` створює нове, одночасне "завдання".

source: Note: `spawn` takes a `Future`, you don't call `.await` on `count_to`.
es: Nota: `spawn` utiliza un `Future`, no se llama a `.await` en `count_to`.
fa: توجه: `spawn` یک `Future` می‌گیرد، شما `.await` را در `count_to` صدا نمی‌زنید.
ja: 注意：`spawn`は`Future`を引数に取るため、`count_to`に対して`.await`を呼ぶことはありません。
ko: 참고: `spawn`은 `Future`를 인자로 받습니다. 때문에 `count_to`에 `.await`를 호출하지 않는 점을 주목하세요.
pt_br: Nota: `spawn` recebe uma `Future`, você não chama `.await` em `count_to`.
uk: Примітка: `spawn` приймає `Future`, ви не викликаєте `.await` на `count_to`.

source: **Further exploration:**
es: **Más información:**
fa: **Further بررسی:**
ja: **さらなる探求:**
ko: **심화 학습:**
pt_br: **Exploração adicional:**
uk: **Подальше дослідження:**

source: Why does `count_to` not (usually) get to 10? This is an example of async cancellation. `tokio::spawn` returns a handle which can be awaited to wait until it finishes.
es: ¿Por qué `count_to` no suele llegar a 10? Se trata de un ejemplo de cancelación asíncrona. `tokio::spawn` devuelve un controlador que puede esperarse hasta que termine.
fa: چرا `count_to` (معمولا) به مقدار ۱۰ نمی‌رسد؟ این نمونه‌ای از لغو async است. `tokio::spawn` یک handle را برمی‌گرداند که می‌توان مدتی منتظر ماند تا تمام شود.
ja: どうして`count_to`は（通常は）10に辿り着かないのでしょうか？これは非同期処理のキャンセルの例です。 `tokio::spawn`は完了まで待機するためのハンドラを返します。
ko: `count_to`가 10에 도달하지 않는 경우가 많은데 그 이유는 무엇일까요? 이는 비동기적인 취소를 보여주는 예입니다. `tokio::spawn`이 리턴하는 것은 완료될 때까지 기다리도록 대기하는데 사용되는 핸들입니다.
pt_br: Por que `count_to` (geralmente) não chega a 10? Este é um exemplo de cancelamento _async_. `tokio::spawn` retorna um _handle_ que pode ser aguardado para esperar que ele termine.
uk: Чому `count_to` (зазвичай) не досягає 10? Це приклад асинхронного скасування. `tokio::spawn` повертає дескриптор, який можна чекати, поки він не завершиться.

source: Try `count_to(10).await` instead of spawning.
es: Prueba `count_to(10).await` en lugar de usar spawn.
fa: به جای spawn مورد `count_to(10).await`» را امتحان کنید.
ja: プロセスを新しく作る代わりに、`count_to(10).await`を試してみてください。
ko: `tokio::spawn` 대신 `count_to(10).await`를 사용해 보세요.
pt_br: Tente `count_to(10).await` em vez de _spawn_.
uk: Спробуйте `count_to(10).await` замість породження.

source: Try awaiting the task returned from `tokio::spawn`.
es: Intenta esperar a la correción de la tarea de `tokio::spawn`.
fa: منتظر کار برگشتی از `tokio::spawn` باشید.
ja: `tokio::spawn`から返されたタスクを待機してみてください。
ko: `tokio::spawn`에서 반환된 작업을 `await` 해 보세요.
pt_br: Tente aguardar a tarefa retornada de `tokio::spawn`.
uk: Спробуйте дочекатися завдання, повернутого з `tokio::spawn`.

source: Rust has a task system, which is a form of lightweight threading.
es: Rust tiene un sistema de tareas, que es una forma de hilo ligero.
fa: ‏ Rust یک task system دارد که نوعی thread سبک‌ وزن است.
ja: Rust には、軽量のスレッド形式の一種であるタスクシステムがあります。
ko: Rust의 태스크(작업) 시스템은 경량 스레딩의 한 종류로 볼 수 있습니다.
pt_br: Rust tem um sistema de tarefas, que é uma forma de _threading_ leve.
uk: У Rust є система завдань, яка є формою полегшеного потокового програмування.

source: A task has a single top-level future which the executor polls to make progress. That future may have one or more nested futures that its `poll` method polls, corresponding loosely to a call stack. Concurrency within a task is possible by polling multiple child futures, such as racing a timer and an I/O operation.
es: Una tarea tiene un solo futuro de nivel superior que el ejecutor sondea para hacer que progrese. El futuro puede tener uno o varios futuros anidados que su método `poll` sondea, lo que se corresponde con una pila de llamadas. La concurrencia dentro de una tarea es posible mediante el sondeo de varios futuros secundarios , como una carrera de un temporizador y una operación de E/S.
fa: یک task یک future در سطح بالا دارد که اجراکننده (executor) برای ادامه کار آن را poll می‌کند. آن future ممکن است یک یا چند future تودرتو داشته باشد که متد `poll` آن را `poll` می‌کند، که به طور ناپایداری با یک stack فراخوانی شده مطابقت دارد. همزمانی در یک task با poll از چندین child future، مانند رقابت یک تایمر و یک عملیات I/O امکان‌پذیر است.
ja: タスクには、単一のトップレベルのfutureがあり、これはエグゼキュータが先に進むためにポーリングする対象となります。そのfutureには一つまたは複数のfutureがネストされていることもあり、トップレベルのfutureの`poll`メソッドがポーリングすることになり、大まかにはコールスタックに対応すると言えます。タスクにおける並行処理は、例えば競合タイマーや入出力操作など、複数の子のfutureをポーリングすることにより可能になります。
ko: 하나의 작업에는, 실행자가 이 작업을 진행하기 위해 계속 폴링하는, 최상위 future가 한 개 있습니다. 이 future에는 `poll` 메서드가 폴링하는 중첩된 future가 한 개 이상 있을 수 있습니다. 이러한 중첩된 future는 일반적인 함수 호출 스택하고 비슷한 역할을 합니다. 한 작업 안에서 여러 자식 future들을 폴링하면, 타이머를 켜는 것과 어떤 I/O작업을 동시에 수행시킨 후 타이머와 I/O 중 먼저 끝나는 것을 기다리는 것과 같은동시성도 구현할 수 있습니다.
pt_br: Uma tarefa tem uma única _future_ de nível superior que o _executor_ _polls_ para fazer progresso. Essa _future_ pode ter uma ou mais _futures_ aninhadas que seu método `poll` _polls_, correspondendo vagamente a uma pilha de chamadas. A concorrência dentro de uma tarefa é possível _polling_ várias _futures_ filhas, como correr um temporizador e uma operação de I/O.
uk: Завдання має єдиний ф'ючерс верхнього рівня, яке виконавець опитує для прогресу. Цей ф'ючерс може мати один або декілька вкладених ф’ючерсів, які опитує його метод `poll`, що приблизно відповідає стеку викликів. Одночасність виконання у межах завдання можлива за допомогою опитування кількох дочірніх ф’ючерсів, таких як перегони таймера та операції введення/виведення.

source: "listening on port {}"
pt_br: "escutando na porta {}"
uk: "слухаємо на порту {}"

source: "connection from {addr:?}"
pt_br: "conexão de {addr:?}"
uk: "з'єднання з {addr:?}"

source: b"Who are you?\n"
pt_br: b"Quem é você?\n"
uk: b"Хто ви?\n"

source: "socket error"
pt_br: "erro de _socket_"
uk: "помилка сокета"

source: "Thanks for dialing in, {name}!\n"
fa: "از تماس تلفنی متشکریم، {name}!\n"
pt_br: "Obrigado por ligar, {name}!\n"
uk: "Дякуємо за дзвінок, {name}!\n"

source: Copy this example into your prepared `src/main.rs` and run it from there.
es: Copia este ejemplo en el archivo `src/main.rs` que has preparado y ejecútalo desde ahí.
fa: این مثال را در `src/main.rs` آماده شده خود کپی کنید و آن را از آنجا اجرا کنید.
ja: この例を準備した`src/main.rs`にコピーして、そこから実行してみましょう。
ko: 이 예제를, 로컬 컴퓨터에 만들어 둔 `src/main.rs`에 복사하고 거기에서 실행하세요.
pt_br: Copie este exemplo para o seu `src/main.rs` preparado e execute-o a partir daí.
uk: Скопіюйте цей приклад у ваш підготовлений `src/main.rs` і запустіть його звідти.

source: Try connecting to it with a TCP connection tool like [nc](https://www.unix.com/man-page/linux/1/nc/) or [telnet](https://www.unix.com/man-page/linux/1/telnet/).
fa: سعی کنید با یک ابزار اتصال TCP مانند [nc](https://www.unix.com/man-page/linux/1/nc/) یا [telnet](https://www.unix.com/) به آن متصل شوید.
ja: [nc](https://www.unix.com/man-page/linux/1/nc/) や [telnet](https://www.unix.com/man-page/linux/1/telnet/) などの TCP 接続ツールを使用して接続してみてください。
pt_br: Tente se conectar a ele com uma ferramenta de conexão TCP como [nc](https://www.unix.com/man-page/linux/1/nc/) ou [telnet](https://www.unix.com/man-page/linux/1/telnet/).
uk: Спробуйте підключитися до нього за допомогою TCP-з'єднання, наприклад, [nc](https://www.unix.com/man-page/linux/1/nc/) або [telnet](https://www.unix.com/man-page/linux/1/telnet/).

source: Ask students to visualize what the state of the example server would be with a few connected clients. What tasks exist? What are their Futures?
es: Pide a los alumnos que vean cuál sería el estado del servidor de ejemplo con algunos clientes conectados. ¿Qué tareas hay? ¿Cuáles son sus futuros?
ja: 例のサーバーがどのような状態の時に、いくつかのクライアントと接続された状態にあるのかを、可視化するように受講者に指示してください。どんなタスクが存在していますか？それらのfutureは何ですか？
ko: 수강생들에게 이 서버에 몇 개의 클라이언트가 연결되면 이 서버의 상태가 어떻게 변할지 그림을 그려보도록 하세요. 어떤 태스크들이 있는지, 이 태스크들의 Future는 어떤 상태에 있는지 물어봅니다.
pt_br: Pergunte aos alunos para visualizar qual seria o estado do servidor de exemplo com alguns clientes conectados. Quais tarefas existem? Quais são suas _futures_?
uk: Попросіть студентів візуалізувати стан сервера прикладу з кількома підключеними клієнтами. Які існують завдання? Які їхні Futures?

source: This is the first time we've seen an `async` block. This is similar to a closure, but does not take any arguments. Its return value is a Future, similar to an `async fn`.
pt_br: Esta é a primeira vez que vemos um bloco `async`. Isso é semelhante a um _closure_, mas não aceita argumentos. Seu valor de retorno é uma _future_, semelhante a um `async fn`.
uk: Це перший раз, коли ми бачимо блок `async`. Це схоже на закриття, але не приймає жодних аргументів. Він повертає значення Future, подібно до `async fn`.

source: Refactor the async block into a function, and improve the error handling using `?`.
es: Refactoriza el bloque asíncrono en una función y mejora la gestión de errores con `?`.
fa: بلوک async را به یک تابع تغییر دهید و مدیریت خطا را با استفاده از `?` بهبود بخشید.
ja: mainのasyncブロックを関数にリファクタして、`?`を使ったエラーハンドリングを改善してみましょう。
ko: Async 블록을 함수로 리팩터링하고 `?`를 사용하여 오류 처리를 개선해 봅시다.
pt_br: Refatore o bloco _async_ em uma função e melhore o tratamento de erros usando `?`.
uk: Перетворіть асинхронний блок у функцію та покращіть обробку помилок за допомогою `?`.

source: Several crates have support for asynchronous channels. For instance `tokio`:
es: Varios crates admiten canales asíncronos. Por ejemplo, `tokio`:
fa: چندین crate از asynchronous channel پشتیبانی می‌کنند. به عنوان مثال `tokio`:
ko: 여러 크레이트에서 비동기 채널을 지원합니다. 예를 들어 `tokio`에서는 아래와 같이합니다.
pt_br: Vários _crates_ têm suporte para canais assíncronos. Por exemplo, `tokio`:
uk: Кілька крейтів підтримують асинхронні канали. Наприклад `tokio`:

source: "Received {count} pings so far."
fa: "تاکنون {count} عدد ping دریافت شده است."
pt_br: "Recebido {count} pings até agora."
uk: "Отримано {count} пінгів до цього часу."

source: "ping_handler complete"
fa: "ping_handler کامل‌شده‌است"
pt_br: "_ping_handler_ completo"
uk: "ping_handler завершено"

source: "Failed to send ping."
pt_br: "Falha ao enviar _ping_"
uk: "Не вдалося надіслати пінг."

source: "Sent {} pings so far."
pt_br: "Enviado {} pings até agora."
uk: "Поки що надіслано {} пінгів."

source: "Something went wrong in ping handler task."
pt_br: "Algo deu errado na tarefa do gerenciador de _ping_"
uk: "Щось пішло не так у завданні обробника пінгу."

source: Change the channel size to `3` and see how it affects the execution.
es: Cambia el tamaño del canal a `3` y comprueba cómo afecta a la ejecución.
fa: اندازه کانال را به`3` تغییر دهید و ببینید که چگونه بر اجرا تأثیر می‌گذارد.
ja: チャネルサイズを `3`に変えてみて、これがどのように処理に影響するか確認してみましょう。
ko: 채널 크기를 `3`으로 변경하고 동작이 어떻게 바뀌는지 확인하세요.
pt_br: Altere o tamanho do canal para `3` e veja como isso afeta a execução.
uk: Змініть розмір каналу на `3` і подивіться, як це вплине на виконання.

source: Overall, the interface is similar to the `sync` channels as seen in the [morning class](../channels.md).
fa: به‌طور‌کلی، interface شبیه به channelهای `sync` است که در [کلاس صبح‌گاهی](../channels.md) دیده می‌شود.
uk: Загалом, інтерфейс подібний до каналів `sync`, які ми бачили в [ранковому класі](../channels.md).

source: Try removing the `std::mem::drop` call. What happens? Why?
es: Prueba a quitar la llamada a `std::mem::drop`. ¿Qué sucede? ¿Por qué?
fa: تماس `std::mem::drop` را حذف کنید. چه اتفاقی می‌افتد؟ چرا؟
ja: `std::mem::drop`の呼び出しを除いてみましょう。何か起こるでしょうか？それはなぜでしょうか？
ko: `std::mem::drop` 호출하는 줄을 삭제해 보세요. 어떤 결과가 나타나나요? 이유가 무엇인가요?
pt_br: Tente remover a chamada `std::mem::drop`. O que acontece? Por quê?
uk: Спробуйте видалити виклик `std::mem::drop`. Що сталося? Чому?

source: The [Flume](https://docs.rs/flume/latest/flume/) crate has channels that implement both `sync` and `async` `send` and `recv`. This can be convenient for complex applications with both IO and heavy CPU processing tasks.
es: El crate [Flume](https://docs.rs/flume/latest/flume/) tiene canales que implementan `sync` y `async`,`send` y `recv`. Esto puede resultar práctico para aplicaciones complejas con tareas de E/S y tareas pesadas de procesamiento de CPU.
fa: این crate مربوط به [Flume](https://docs.rs/flume/latest/flume/) دارای کانال‌هایی است که `sync` و `async` `send` و `recv` را اجرا می‌کنند. این کار می‌تواند برای برنامه‌های پیچیده با taskهای پردازشی IO و CPU سنگین مناسب باشد.
ja: [Flume](https://docs.rs/flume/latest/flume/)クレートには`sync`と`async`や`send`と`recv`の両方を実装するチャネルがあります。 これは入出力と重いCPUの処理のタスクの両方を含む、複雑なアプリケーションで便利です。
ko: [Flume](https://docs.rs/flume/latest/flume/) 크레이트에는 `sync`와 `async`, `send`와 `recv`를 모두 구현하는 채널이 있습니다. 이것은 IO와 CPU 처리 작업이 많은 복잡한 애플리케이션을 구현할 때 매우 유용합니다.
pt_br: O _crate_ [Flume](https://docs.rs/flume/latest/flume/) tem canais que implementam tanto `sync` quanto `async` `send` e `recv`. Isso pode ser conveniente para aplicações complexas com tarefas de processamento de I/O e CPU pesadas.
uk: Крейт [Flume](https://docs.rs/flume/latest/flume/) має канали, які реалізують як `sync`, так і `async` `send` і `recv`. Це може бути зручно для складних програм, що використовують як ввід-вивід, так і важкі процесорні завдання.

source: What makes working with `async` channels preferable is the ability to combine them with other `future`s to combine them and create complex control flow.
es: Es preferible trabajar con canales `async` por la capacidad de combinarlos con otros `future` para poder crear un flujo de control complejo.
fa: چیزی که کار با کانال‌های `async` را ترجیح می‌دهد، توانایی ترکیب آن‌ها با دیگر `future` برای ترکیب آنها و ایجاد جریان کنترل پیچیده است.
ja: `async`チャネルを扱うことを好ましくするのは、チャネルと繋げるためにや、複雑なコントロールフローを作るために、チャネルを他の`future`と繋げられることです。
ko: `async` 채널을 사용하는 것이 더 좋은 이유는 이를 다른 `future`와 결합하여 복잡한 제어 흐름을 만들 수 있기 때문입니다.
pt_br: O que torna o trabalho com canais `async` preferível é a capacidade de combiná-los com outras _futures_ para combiná-los e criar um fluxo de controle complexo.
uk: Що робить роботу з `async` каналами більш кращою, так це можливість комбінувати їх з іншими `future`, щоб об'єднувати їх і створювати складні потоки управління.

source: A join operation waits until all of a set of futures are ready, and returns a collection of their results. This is similar to `Promise.all` in JavaScript or `asyncio.gather` in Python.
es: Una operación join espera hasta que todos los futuros estén listos y devuelve una colección de sus resultados. Es similar a `Promise.all` en JavaScript o `asyncio.gather` en Python.
fa: عملیات پیوستن (join) منتظر می‌ماند تا تمام مجموعه‌ای از futureها آماده شوند و مجموعه‌ای (collection) از نتایج آنها را برمی‌گرداند. این شبیه به `Promise.all` در JavaScript یا `asyncio.gather` در پایتون است.
ja: Joinという操作では、futureの集合の準備が整うまで待機し、その後に結果をまとめて返します。これはJavaScriptにおける `Promise.all` やPythonにおける`asyncio.gather`に似ています。
ko: Join 연산은 모든 future가 준비될 때까지 기다린 후, 각 future의 결과값을 담은 컬렉션을 리턴합니다. 이는 자바스크립트의 `Promise.all`이나 파이썬의 `asyncio.gather`와 유사합니다.
pt_br: Uma operação de _join_ espera até que todas as _futures_ de um conjunto estejam prontas e retorna uma coleção de seus resultados. Isso é semelhante a `Promise.all` em JavaScript ou `asyncio.gather` em Python.
uk: Операція об’єднання очікує, поки весь набір ф’ючерсів буде готовий, і повертає колекцію їхніх результатів. Це схоже на `Promise.all` у JavaScript або `asyncio.gather` у Python.

source: For multiple futures of disjoint types, you can use `std::future::join!` but you must know how many futures you will have at compile time. This is currently in the `futures` crate, soon to be stabilised in `std::future`.
es: En el caso de varios futuros de tipos distintos, puedes utilizar `std::future::join!`, pero debes saber cuántos futuros tendrás en el tiempo de compilación. Esto se encuentra actualmente en el crate `futures`, que pronto se estabilizará en `std::future`.
fa: برای چند future از تایپ‌های مختلف، می‌توانید از `std::future::join!` استفاده کنید، اما باید بدانید که در زمان کامپایل چند future خواهید داشت. این در حال حاضر در جعبه (crate از نوع `futures` است که به زودی در `std::future` تثبیت می‌شود.
ja: 複数の互いに素な型のfutureに対しては、`std::future::join!`を利用できます。しかし、いくつのfutureがコンパイル時に存在しているのかを把握しておく必要があります。これは現在`futures`クレートにありますが、近いうちに`std::future`に統合される予定です。
ko: 서로 다른 타입을 가지는 여러 여러 futures들을 join하고자 할 경우 `std::future::join!`을 사용할 수 있습니다. 이 매크로를 사용하려면 futures가 몇 개나 있을지 컴파일 할 때 알아야 한다는 점을 주의하세요. 이 매크로는 지금은 'futures' 크레이트에 있으며 곧 안정화 되어 `std::future`에 포함될 예정입니다.
pt_br: Para várias _futures_ de tipos disjuntos, você pode usar `std::future::join!` mas deve saber quantas _futures_ você terá em tempo de compilação. Isso atualmente está no _crate_ `futures`, em breve será estabilizado em `std::future`.
uk: Для кількох ф’ючерсів непересічних типів ви можете використовувати `std::future::join!`, але ви повинні знати, скільки ф’ючерсів у вас буде під час компіляції. Наразі це в коейті `futures`, незабаром буде стабілізовано в `std::future`.

source: The risk of `join` is that one of the futures may never resolve, this would cause your program to stall.
fa: خطر `join` این است که یکی از future‌ها ممکن است هرگز resolve نشود، این مسئله باعث می‌شود برنامه شما متوقف شود.
pt_br: O risco do `join` é que uma das _futures_ pode nunca ser resolvida, o que faria seu programa travar.
uk: Ризик `join` полягає в тому, що один із ф'ючерсів може ніколи не вирішитися, це призведе до зависання вашої програми.
