Repository: google/comprehensive-rust
Catalog: po/*.po
Languages: ar, es, fa, ja, ko, pt_br, uk

source: The broad answer is that no C/C++ code is "safe" by the normal Rust standards. Calling back and forth to C/C++ from Rust may do arbitrary things to memory, and compromise the safety of Rust's own data layouts. Presence of _too many_ `unsafe` keywords in C/C++ interop can harm the signal-to-noise ratio of such a keyword, and is [controversial](https://steveklabnik.com/writing/the-cxx-debate), but strictly, bringing any foreign code into a Rust binary can cause unexpected behavior from Rust's perspective.
fa: پاسخ کلی این است که هیچ کد ++C/C با استانداردهای معمول Rust "ایمن" نیست. فراخوانی مجدد و برگشتی به ++C/C از Rust ممکن است کارهای دلخواه را در حافظه انجام دهد و ایمنی طرح‌بندی داده‌های خود Rust را به خطر بیندازد. وجود کلمات کلیدی بسیار زیاد «ناامن» در تعامل ++C/C می‌تواند به نسبت سیگنال به نویز چنین کلمه کلیدی آسیب برساند و این [جنجال‌برانگیز]‌(https://steveklabnik.com/writing/the-cxx-debate) است، اما به طور دقیق، آوردن هر کد خارجی به یک باینری Rust می‌تواند باعث رفتار غیرمنتظره از دیدگاه Rust شود.
pt_br: A resposta mais geral é que nenhum código C/C++ é "seguro" pelos padrões normais do Rust. Chamar C/C++ a partir do Rust pode fazer coisas arbitrárias na memória e comprometer a segurança dos próprios layouts de dados do Rust. A presença de _muitas_ palavras-chave `unsafe` na interoperabilidade C/C++ pode prejudicar a relação sinal-ruído de tal palavra-chave e é [controversa](https://steveklabnik.com/writing/the-cxx-debate), mas estritamente, trazer qualquer código externo para um binário Rust pode causar um comportamento inesperado do ponto de vista do Rust.
uk: Загальна відповідь полягає у тому, що жоден C/C++ код не є "безпечним" за звичайними стандартами Rust. Виклик C/C++ з Rust може призвести до довільних дій з пам'яттю та поставити під загрозу безпеку власних структур даних Rust. Наявність _занадто_ `unsafe` ключових слів у взаємодії C/C++ може погіршити співвідношення сигнал/шум такого ключового слова, що є [суперечливим](https://steveklabnik.com/writing/the-cxx-debate), але строго кажучи, внесення будь-якого стороннього коду у бінарний файл Rust може спричинити неочікувану поведінку з точки зору Rust'у.

source: The narrow answer lies in the diagram at the top of [this page](../interoperability-with-cpp.md) --- behind the scenes, CXX generates Rust `unsafe` and `extern "C"` functions just like we did manually in the previous section.
fa: پاسخ دقیقق دردیاگرام بالای [این صفحه](../interoperability-with-cpp.md) نهفته است --- در پشت صحنه، CXX توابع Rust «ناامن» و `extern "C"` را درست مانند در بخش قبل به صورت دستی انجام دادیم.
pt_br: A resposta mais específica está no diagrama no topo [desta página](../interoperability-with-cpp.md) --- nos bastidores, o CXX gera funções Rust `unsafe` e `extern "C"` exatamente como fizemos manualmente na seção anterior.
uk: Вузька відповідь міститься на діаграмі у верхній частині [цієї сторінки](../interoperability-with-cpp.md) --- за завісою CXX генерує `unsafe` та `extern "C"` функції Rust так само, як ми робили це вручну у попередньому розділі.

source: Exercise: Interoperability with C++
fa: تمرین: قابلیت همکاری با ++C
pt_br: Exercício: Interoperabilidade com C++
uk: Вправа: Інтероперабельність з C++

source: Part one
fa: قسمت اول
pt_br: Parte um
uk: Частина перша

source: In the Rust file you previously created, add a `#[cxx::bridge]` which specifies a single function, to be called from C++, called `hello_from_rust`, taking no parameters and returning no value.
fa: در فایل Rust که قبلاً ایجاد کرده‌اید، یک `#[cxx::bridge]` اضافه کنید که یک تابع را مشخص می‌کند که باید از++C فراخوانی شود که نام `hello_from_rust` دارد، بدون اینکه پارامتر و هیچ مقداری برگرداند.
pt_br: No arquivo Rust que você criou anteriormente, adicione um `#[cxx::bridge]` que especifica uma única função, a ser chamada do C++, chamada `hello_from_rust`, sem parâmetros e sem valor de retorno.
uk: У створений раніше файл Rust додайте `#[cxx::bridge]`, який визначає єдину функцію для виклику з C++ під назвою `hello_from_rust`, яка не отримує параметрів і не повертає жодного значення.

source: Modify your previous `hello_from_rust` function to remove `extern "C"` and `#[no_mangle]`. This is now just a standard Rust function.
fa: تابع `hello_from_rust` قبلی خود را برای حذف `extern "C"` و `#[no_mangle]` تغییر دهید. حالا این فقط یک تابع استاندارد Rust است.
pt_br: Modifique sua função `hello_from_rust` anterior para remover `extern "C"` e `#[no_mangle]`. Esta é agora apenas uma função Rust padrão.
uk: Змініть вашу попередню функцію `hello_from_rust`, видаливши `extern "C"` і `#[no_mangle]`. Тепер це просто стандартна функція Rust.

source: Modify your `gn` target to build these bindings.
fa: هدف `gn` خود را برای ایجاد این پیوندها (bindings) تغییر دهید.
pt_br: Modifique seu alvo `gn` para compilar esses _bindings_.
uk: Змініть вашу ціль `gn`, щоб створити ці прив'язки.

source: In your C++ code, remove the forward-declaration of `hello_from_rust`. Instead, include the generated header file.
fa: در کد ++C خود، forward-declaration برای `hello_from_rust` را حذف کنید. در عوض، فایل هِدِر تولید شده را اضافه کنید.
pt_br: No seu código C++, remova a declaração antecipada de `hello_from_rust`. Em vez disso, inclua o arquivo de cabeçalho gerado.
uk: У вашому C++ коді видаліть форвардне оголошення `hello_from_rust`. Замість цього додайте згенерований заголовний файл.

source: Build and run!
fa: Build و run!
pt_br: Compile e execute!
uk: Будуємо і запускаємо!

source: Part two
fa: قسمت دوم
pt_br: Parte dois
uk: Частина друга

source: It's a good idea to play with CXX a little. It helps you think about how flexible Rust in Chromium actually is.
fa: ایده خوبی است که کمی با CXX بازی کنید. این به شما کمک می کند تا به این فکر کنید که Rust در Chromium واقعا چقدر انعطاف پذیر است.
pt_br: É uma boa ideia brincar um pouco com o CXX. Isso ajuda você a pensar sobre quão flexível o Rust no Chromium realmente é.
uk: Це гарна ідея - трохи погратися з CXX. Це допоможе вам зрозуміти, наскільки гнучким є Rust у Chromium.

source: Some things to try:
fa: برخی از چیزهایی که باید امتحان کنید:
pt_br: Algumas coisas para tentar:
uk: Декілька речей, які варто спробувати:

source: Call back into C++ from Rust. You will need:
fa: از Rust دوباره به ++C فراخوانی کنید. درنهایت شما نیاز خواهید داشت:
pt_br: Chame de volta para o C++ a partir do Rust. Você vai precisar de:
uk: Зворотний виклик у C++ з Rust. Вам знадобиться:

source: An additional header file which you can `include!` from your `cxx::bridge`. You'll need to declare your C++ function in that new header file.
fa: یک فایل هِدِر اضافی که می‌توانید از `cxx::bridge` خود `include!` را وارد کنید. شما باید تابع ++C خود را در آن فایل هِدِر جدید اعلام کنید.
pt_br: Um arquivo de cabeçalho adicional que você pode `include!` do seu `cxx::bridge`. Você precisará declarar sua função C++ nesse novo arquivo de cabeçalho.
uk: Додатковий заголовний файл, який ви можете `include!` до вашого `cxx::bridge`. Вам потрібно буде оголосити вашу функцію C++ у цьому новому заголовному файлі.

source: An `unsafe` block to call such a function, or alternatively specify the `unsafe` keyword in your `#[cxx::bridge]` [as described here](https://cxx.rs/extern-c++.html#functions-and-member-functions).
fa: یک بلوک `unsafe` برای فراخوانی چنین تابعی، یا به طور متناوب کلمه کلیدی `unsafe` را در `#[cxx::bridge]` خود [همانطور که در اینجا توضیح داده شده است](https://cxx.rs/extern-c++.html#functions-and-member-functions).
pt_br: Um bloco `unsafe` para chamar tal função, ou alternativamente especifique a palavra-chave `unsafe` no seu `#[cxx::bridge]` [conforme descrito aqui](https://cxx.rs/extern-c++.html#functions-and-member-functions).
uk: `unsafe` блок для виклику такої функції, або вкажіть ключове слово `unsafe` у вашому `#[cxx::bridge]` [як описано тут](https://cxx.rs/extern-c++.html#functions-and-member-functions).

source: You may also need to `#include "third_party/rust/cxx/v1/crate/include/cxx.h"`
fa: همچنین ممکن است لازم باشد`#include "third_party/rust/cxx/v1/crate/include/cxx.h"` را وارد کنید.
pt_br: Você também pode precisar `#include "third_party/rust/cxx/v1/crate/include/cxx.h"`
uk: Вам також може знадобитися `#include "third_party/rust/cxx/v1/crate/include/cxx.h"`

source: Pass a C++ string from C++ into Rust.
fa: یک رشته++C را از ++C به Rust منتقل کنید.
pt_br: Passe uma string C++ para o Rust.
uk: Передати рядок C++ з C++ у Rust.

source: Pass a reference to a C++ object into Rust.
fa: ارسال یک reference از یک C++ object به Rust .
pt_br: Passe uma referência a um objeto C++ para o Rust.
uk: Передати в Rust посилання на об'єкт C++.

source: Intentionally get the Rust function signatures mismatched from the `#[cxx::bridge]`, and get used to the errors you see.
fa: عمداً امضاهای تابع Rust را که از `#[cxx::bridge]` مطابقت ندارند، دریافت کنید و به خطاهایی که می بینید عادت کنید.
pt_br: Intencionalmente, obtenha as assinaturas de função Rust incompatíveis com o `#[cxx::bridge]` e familiarize-se com os erros que você vê.
uk: Навмисно зробити так, щоб сигнатури функцій Rust не співпадали з `#[cxx::bridge]`, і звикати до помилок, які ви побачите.

source: Intentionally get the C++ function signatures mismatched from the `#[cxx::bridge]`, and get used to the errors you see.
fa: عمداً امضاهای تابع ++C را که از `#[cxx::bridge]` مطابقت ندارند، دریافت کنید و به خطاهایی که می بینید عادت کنید.
pt_br: Intencionalmente, obtenha as assinaturas de função C++ incompatíveis com o `#[cxx::bridge]` e familiarize-se com os erros que você vê.
uk: Навмисно зробити так, щоб сигнатури функцій C++ не співпадали з `#[cxx::bridge]`, і звикати до помилок, які ви побачите.

source: Pass a `std::unique_ptr` of some type from C++ into Rust, so that Rust can own some C++ object.
fa: یک `std::unique_ptr` از نوعی از ++C را به Rust ارسال کنید، به طوری که Rust بتواند دارای یک C++ object باشد.
pt_br: Passe um `std::unique_ptr` de algum tipo do C++ para o Rust, para que o Rust possa _own_ (possuir) algum objeto C++.
uk: Передати `std::unique_ptr` деякого типу з C++ у Rust, щоб Rust міг володіти деяким об'єктом C++.

source: Create a Rust object and pass it into C++, so that C++ owns it. (Hint: you need a `Box`).
fa: یک Rust object ایجاد کنید و آن را به ++C ارسال کنید تا ++C مالک آن باشد. (نکته: شما به یک `Box` نیاز دارید).
pt_br: Crie um objeto Rust e passe-o para o C++, para que o C++ o possua. (Dica: você precisa de uma `Box`).
uk: Створити об'єкт Rust і передати його в C++ так, щоб C++ володів ним. (Підказка: вам потрібен `Box`).

source: Declare some methods on a C++ type. Call them from Rust.
fa: چند متد را در نوع ++C اعلام کنید. آنها را از Rust فراخوانی کنید.
pt_br: Declare alguns métodos em um tipo C++. Chame-os do Rust.
uk: Оголосити деякі методи на типі C++. Викликати їх з Rust.

source: Declare some methods on a Rust type. Call them from C++.
fa: چند متد را در Rust type اعلام کنید. از ++C آن‌ها را فراخوانی کنید.
pt_br: Declare alguns métodos em um tipo Rust. Chame-os do C++.
uk: Оголосити декілька методів на типі Rust. Викликати їх з C++.

source: Part three
fa: قسمت سوم
pt_br: Parte três
uk: Частина третя

source: Now you understand the strengths and limitations of CXX interop, think of a couple of use-cases for Rust in Chromium where the interface would be sufficiently simple. Sketch how you might define that interface.
fa: اکنون نقاط قوت و محدودیت‌های CXX interop را درک کرده‌اید، به چند مورد استفاده برای Rust در Chromium فکر کنید که در آن رابط به اندازه کافی ساده باشد. نحوه تعریف این رابط را ترسیم کنید.
pt_br: Agora que você entende os pontos fortes e as limitações da interoperabilidade do CXX, pense em alguns casos de uso para o Rust no Chromium, onde a interface seria suficientemente simples. Esboce como você pode definir essa interface.
uk: Тепер, коли ви розумієте сильні та слабкі сторони взаємодії CXX, подумайте про пару варіантів використання Rust у Chromium, де інтерфейс був би достатньо простим. Накидайте ескіз того, як ви могли б визначити цей інтерфейс.

source: The [`cxx` binding reference](https://cxx.rs/bindings.html)
fa: یک [`cxx` binding reference](https://cxx.rs/bindings.html)
pt_br: A [referência de _bindings_ `cxx`](https://cxx.rs/bindings.html)
uk: [Довідник `cxx` зв'язувань](https://cxx.rs/bindings.html)

source: The [`rust_static_library` gn template](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/rust_static_library.gni;l=16)
fa: یک [`rust_static_library` gn template](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/rust_static_library.gni;l=16)
pt_br: O [_template_ gn `rust_static_library`](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/rust_static_library.gni;l=16)
uk: [`rust_static_library` шаблон gn](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/rust_static_library.gni;l=16)

source: Some of the questions you may encounter:
fa: برخی از سؤالاتی که ممکن است با آن مواجه شوید:برخی از سوالاتی که ممکن است با آن مواجه شوید:
pt_br: Algumas das perguntas que você pode encontrar:
uk: Ви можете зіткнутися з деякими питаннями:

source: I'm seeing a problem initializing a variable of type X with type Y, where X and Y are both function types. This is because your C++ function doesn't quite match the declaration in your `cxx::bridge`.
fa: من مشکلی در مقداردهی اولیه یک متغیر از نوع X با نوع Y می‌بینم، که در آن X و Y هر دو نوع تابع هستند. بخاطر اینکه تابع ++ C شما کاملاً با اعلان موجود در `cxx::bridge` شما مطابقت ندارد.
pt_br: Estou vendo um problema ao inicializar uma variável do tipo X com o tipo Y, onde X e Y são ambos tipos de função. Isso ocorre porque sua função C++ não corresponde exatamente à declaração em sua `cxx::bridge`.
uk: Я бачу проблему з ініціалізацією змінної типу X типом Y, де X і Y є типами функцій. Це пов'язано з тим, що ваша функція C++ не зовсім відповідає оголошенню у вашому `cxx::bridge`.

source: I seem to be able to freely convert C++ references into Rust references. Doesn't that risk UB? For CXX's _opaque_ types, no, because they are zero-sized. For CXX trivial types yes, it's _possible_ to cause UB, although CXX's design makes it quite difficult to craft such an example.
fa: به نظر می‌رسد می‌توانم آزادانه مراجع ++C را به منابع Rust تبدیل کنم. آیا این خطر UB را ندارد؟ برای تایپ‌های _opaque_ CXX، خیر، زیرا اندازه آنها صفر است. برای انواع بی‌اهمیت CXX بله، ممکن است باعث UB شود، اگرچه طراحی CXX ساخت چنین نمونه‌ای را بسیار دشوار می‌کند.
pt_br: Parece que posso converter livremente referências C++ em referências Rust. Isso não arrisca UB? Para os tipos _opaque_ do CXX, não, porque eles têm tamanho zero. Para os tipos triviais do CXX, sim, é _possível_ causar UB, embora o design do CXX torne bastante difícil criar um exemplo assim.
uk: Здається, я можу вільно конвертувати посилання на C++ у посилання на Rust. Чи не загрожує це UB? Для _непрозорих_ типів CXX - ні, тому що вони мають нульовий розмір. Для тривіальних типів CXX так, це _можливо_ спричинити UB, хоча дизайн CXX робить досить складним створення такого прикладу.

source: Rust libraries are called "crates" and are found at [crates.io](https://crates.io). It's _very easy_ for Rust crates to depend upon one another. So they do!
fa: کتابخانه‌های Rust "Crates" نامیده می‌شوند و در [crates.io](https://crates.io) یافت می‌شوند. وابستگی cratesهای Rust به یکدیگر بسیار آسان است. بنابراین آنها این کار را انجام می‌دهند!
pt_br: As bibliotecas Rust são chamadas de "_crates_" e são encontradas em [crates.io](https://crates.io). É _muito fácil_ para as _crates_ Rust dependerem umas das outras. Então eles fazem!
uk: Бібліотеки Rust називаються "крейтами" і знаходяться на [crates.io](https://crates.io). Для крейтів Rust дуже легко залежати один від одного. Так вони і роблять!

source: Property
es: Propiedad
fa: ویژگی
ja: プロパティ
ko: 속성
pt_br: Propriedade
uk: Власивість

source: C++ library
pt_br: Bibliotecas do C++
uk: Бібліотека C++

source: Rust crate
pt_br: _Crates_ de Rust
uk: Крейт Rust

source: Build system
pt_br: Sistema de compilação
uk: Система збірки

source: Lots
fa: تعداد زیادی
pt_br: Muitos
uk: Багато

source: Consistent: `Cargo.toml`
fa: یکپارچگی: `Cargo.toml`
pt_br: Consistente: `Cargo.toml`
uk: Послідовна: `Cargo.toml`

source: Typical library size
fa: اندازه کتابخانه معمولی
pt_br: Tamanho típico da biblioteca
uk: Типовий розмір бібліотеки

source: Large-ish
pt_br: Meio grande
uk: Великий

source: Small
fa: کوچک
pt_br: Pequeno
uk: Маленький

source: Transitive dependencies
fa: وابستگی‌های گذرا
pt_br: Dependências transitivas
uk: Транзитивні залежності

source: Few
pt_br: Poucos(as)
uk: Небагато

source: For a Chromium engineer, this has pros and cons:
fa: برای یک مهندس Chromium، این مزایا و معایب دارد:
pt_br: Para um engenheiro do Chromium, isso tem prós e contras:
uk: Для інженера Chromium це має плюси та мінуси:

source: All crates use a common build system so we can automate their inclusion into Chromium...
fa: همه crateها از یک سیستم ساخت مشترک استفاده می‌کنند، بنابراین می‌توانیم گنجاندن آن‌ها در Chromium را خودکار کنیم...
pt_br: Todas as _crates_ usam um sistema de compilação comum, para que possamos automatizar sua inclusão no Chromium...
uk: Всі крейти використовують спільну систему збірки, тому ми можемо автоматизувати їхнє включення до Chromium ...

source: ... but, crates typically have transitive dependencies, so you will likely have to bring in multiple libraries.
fa: ... اما، crateها معمولاً وابستگی‌های گذرا دارند، بنابراین احتمالاً مجبور خواهید بود چندین کتابخانه را بیاورید.
pt_br: ... mas, os _crates_ normalmente têm dependências transitivas, então você provavelmente terá que importar várias bibliotecas.
uk: ... але, як правило, крейти мають транзитивні залежності, тому вам, ймовірно, доведеться залучити декілька бібліотек.

source: We'll discuss:
fa: بحث خواهیم کرد:
pt_br: Vamos discutir:
uk: Ми обговоримо:

source: How to put a crate in the Chromium source code tree
fa: نحوه قرار دادن یک crate در درخت کد منبع Chromium
pt_br: Como colocar um _crate_ na árvore do código-fonte do Chromium
uk: Як розмістити крейт у дереві вхідного коду Chromium

source: How to make `gn` build rules for it
fa: چگونه قوانین ساخت `gn` برای آن ایجاد کنیم
pt_br: Como criar regras de compilação `gn` para ele
uk: Як зробити так, щоб `gn` будував правила для нього

source: How to audit its source code for sufficient safety.
fa: نحوه بررسی کد منبع آن برای ایمنی کافی
pt_br: Como auditar seu código-fonte para que ele seja seguro o suficiente.
uk: Як провести аудит його вхідного коду на предмет достатньої безпеки.

source: Configuring the `Cargo.toml` file to add crates
fa: پیکربندی فایل `Cargo.toml` برای افزودن crateها
pt_br: Configurando o arquivo `Cargo.toml` para adicionar _crates_
uk: Налаштування файлу `Cargo.toml` для додавання крейтів

source: Chromium has a single set of centrally-managed direct crate dependencies. These are managed through a single [`Cargo.toml`](https://source.chromium.org/chromium/chromium/src/+/main:third_party/rust/chromium_crates_io/Cargo.toml):
fa: ‏ Chromium دارای یک مجموعه واحد از وابستگی‌های crate مستقیم با مدیریت مرکزی است. اینها از طریق یک [`Cargo.toml`](https://source.chromium.org/chromium/chromium/src/+/main:third_party/rust/chromium_crates_io/Cargo.toml) مدیریت می‌شوند :
pt_br: O Chromium tem um único conjunto de dependências de _crates_ diretos gerenciados centralmente. Eles são gerenciados por meio de um único [`Cargo.toml`](https://source.chromium.org/chromium/chromium/src/+/main:third_party/rust/chromium_crates_io/Cargo.toml):
uk: Chromium має єдиний набір централізовано керованих прямих залежностей крейтів. Вони управляються через єдиний [`Cargo.toml`](https://source.chromium.org/chromium/chromium/src/+/main:third_party/rust/chromium_crates_io/Cargo.toml):

source: As with any other `Cargo.toml`, you can specify [more details about the dependencies](https://doc.rust-lang.org/cargo/reference/specifying-dependencies.html) --- most commonly, you'll want to specify the `features` that you wish to enable in the crate.
fa: مانند هر `Cargo.toml` دیگری، می‌توانید [جزئیات بیشتر در مورد وابستگی‌ها](https://doc.rust-lang.org/cargo/reference/specifying-dependencies.html) را مشخص کنید --- معمولاً شما می‌خواهید «ویژگی‌هایی» را که می‌خواهید در crate فعال کنید را مشخص کنید.
pt_br: Como em qualquer outro `Cargo.toml`, você pode especificar [maiores detalhes sobre as dependências](https://doc.rust-lang.org/cargo/reference/specifying-dependencies.html) --- mais comumente, você desejará especificar os `features` que deseja ativar no _crate_.
uk: Як і для будь-якого іншого `Cargo.toml`, ви можете вказати [більш детальну інформацію про залежності](https://doc.rust-lang.org/cargo/reference/specifying-dependencies.html) --- найчастіше, вам потрібно вказати `features`, які ви хочете увімкнути в крейті.

source: When adding a crate to Chromium, you'll often need to provide some extra information in an additional file, `gnrt_config.toml`, which we'll meet next.
fa: هنگام افزودن crate به Chromium، اغلب باید اطلاعات اضافی را در یک فایل اضافی، `gnrt_config.toml` ارائه کنید، که در ادامه با آن آشنا خواهیم شد.
pt_br: Ao adicionar um _crate_ ao Chromium, você frequentemente precisará fornecer algumas informações extras em um arquivo adicional, `gnrt_config.toml`, que conheceremos a seguir.
uk: При додаванні крейту до Chromium вам часто потрібно надати додаткову інформацію у додатковому файлі `gnrt_config.tml`, з яким ми познайомимося далі.

source: Alongside `Cargo.toml` is [`gnrt_config.toml`](https://source.chromium.org/chromium/chromium/src/+/main:third_party/rust/chromium_crates_io/gnrt_config.toml). This contains Chromium-specific extensions to crate handling.
fa: در کنار `Cargo.toml` یک [`gnrt_config.toml`](https://source.chromium.org/chromium/chromium/src/+/main:third_party/rust/chromium_crates_io/gnrt_config.toml) قرار دارد. این شامل برنامه‌های extension مخصوص Chromium برای مدیریت crate است.
pt_br: Junto com `Cargo.toml` está [`gnrt_config.toml`](https://source.chromium.org/chromium/chromium/src/+/main:third_party/rust/chromium_crates_io/gnrt_config.toml). Isso contém extensões específicas do Chromium para o gerenciamento de _crates_.
uk: Поряд з `Cargo.toml` знаходиться [`gnrt_config.toml`](https://source.chromium.org/chromium/chromium/src/+/main:third_party/rust/chromium_crates_io/gnrt_config.toml). Він містить специфічні для Chromium розширення для роботи з крейтами.

source: If you add a new crate, you should specify at least the `group`. This is one of:
fa: اگر crate جدیدی اضافه کنید، باید حداقل`group` را مشخص کنید. این یکی از:
pt_br: Se você adicionar um novo _crate_, deverá especificar pelo menos o `group`. Este é um de:
uk: Якщо ви додаєте новий крейт, ви повинні вказати принаймні `group`. Це одна з них:

source: For instance,
fa: به عنوان مثال،
pt_br: Por exemplo,
uk: Наприклад,

source: Depending on the crate source code layout, you may also need to use this file to specify where its `LICENSE` file(s) can be found.
fa: بسته به طرح کد منبع crate، ممکن است لازم باشد از این فایل برای تعیین محل یافتن فایل (های) مجوز آن استفاده کنید.
pt_br: Dependendo do layout do código-fonte do _crate_, você também pode precisar usar este arquivo para especificar onde seu(s) arquivo(s) `LICENSE` pode(m) ser encontrado(s).
uk: Залежно від компонування вхідного коду крейту, вам також може знадобитися використовувати цей файл, щоб вказати, де можна знайти його файл(и) `LICENSE`.

source: Later, we'll see some other things you will need to configure in this file to resolve problems.
fa: بعداً، موارد دیگری را که برای حل مشکلات باید پیکربندی کنید، در این فایل مشاهده خواهیم کرد.
pt_br: Mais tarde, veremos algumas outras coisas que você precisará configurar neste arquivo para resolver problemas.
uk: Пізніше ми розглянемо деякі інші речі, які вам потрібно буде налаштувати в цьому файлі для вирішення проблем.
