Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: "listening on port 2000"
fr_fr: "en écoute sur le port 2000"

source: "New connection from {addr:?}"
fr_fr: "Nouvelle connexion depuis {addr:?}"

source: // Wrap the raw TCP stream into a websocket.
fr_fr: // Envelopper le flux TCP brut dans un WebSocket.

source: Running the binaries
fr_fr: Exécution des binaires

source: Run the server with:
fr_fr: Lancez le serveur avec :

source: and the client with:
fr_fr: et le client avec :

source: Implement the `handle_connection` function in `src/bin/server.rs`.
fr_fr: Implémentez la fonction `handle_connection` dans `src/bin/server.rs`.

source: Hint: Use `tokio::select!` for concurrently performing two tasks in a continuous loop. One task receives messages from the client and broadcasts them. The other sends messages received by the server to the client.
fr_fr: Indice : utilisez `tokio::select!` pour exécuter deux tâches en parallèle dans une boucle continue. Une tâche reçoit les messages du client et les diffuse ; l'autre envoie au client les messages reçus par le serveur.

source: Complete the main function in `src/bin/client.rs`.
fr_fr: Complétez la fonction `main` dans `src/bin/client.rs`.

source: Hint: As before, use `tokio::select!` in a continuous loop for concurrently performing two tasks: (1) reading user messages from standard input and sending them to the server, and (2) receiving messages from the server, and displaying them for the user.
fr_fr: Indice : comme précédemment, utilisez `tokio::select!` dans une boucle continue pour effectuer deux tâches en parallèle : (1) lire les messages de l'utilisateur depuis l'entrée standard et les envoyer au serveur, et (2) recevoir les messages du serveur et les afficher à l'utilisateur.

source: Optional: Once you are done, change the code to broadcast messages to all clients, but the sender of the message.
fr_fr: Optionnel : une fois terminé, modifiez le code pour que les messages soient diffusés à tous les clients sauf à celui qui les a envoyés.

source: Concurrency Afternoon Exercise
fr_fr: Exercice de l'après-midi : Concurrence

source: ([back to exercise](dining-philosophers-async.md))
fr_fr: ([retour à l’exercice](dining-philosophers-async.md))

source: // If we didn't get the left fork, drop the right fork if we // have it and let other tasks make progress.
fr_fr: // Si nous n'avons pas obtenu la fourchette gauche, relâcher la fourchette droite si nous l'avons, et laisser les autres tâches progresser.

source: // If we didn't get the right fork, drop the left fork and let // other tasks make progress.
fr_fr: // Si nous n'avons pas obtenu la fourchette droite, relâcher la fourchette gauche et laisser les autres tâches progresser.

source: // The locks are dropped here
fr_fr: // Les verrous sont libérés ici

source: // tx is dropped here, so we don't need to explicitly drop it later
fr_fr: // tx est libéré ici, donc inutile de le libérer explicitement plus tard

source: "Here is a thought: {thought}"
fr_fr: "Voici une pensée : {thought}"

source: ([back to exercise](chat-app.md))
fr_fr: ([retour à l’exercice](chat-app.md))

source: "Welcome to chat! Type a message"
fr_fr: "Bienvenue dans le chat ! Tapez un message"

source: // A continuous loop for concurrently performing two tasks: (1) receiving // messages from `ws_stream` and broadcasting them, and (2) receiving // messages on `bcast_rx` and sending them to the client.
fr_fr: // Une boucle continue pour exécuter deux tâches en parallèle : (1) recevoir // les messages de `ws_stream` et les diffuser, et (2) recevoir les messages // via `bcast_rx` et les envoyer au client.

source: "From client {addr:?} {text:?}"
fr_fr: "Du client {addr:?} {text:?}"

source: // Continuous loop for concurrently sending and receiving messages.
fr_fr: // Boucle continue pour envoyer et recevoir des messages en parallèle.

source: "From server: {}"
fr_fr: "Du serveur : {}"

source: _Thank you for taking Comprehensive Rust 🦀!_ We hope you enjoyed it and that it was useful.
fr_fr: _Merci d'avoir pris Comprehensive Rust(le guide complet de Rust) 🦀!_ Nous espérons que vous l'avez apprécié et qu'il était utile.

source: We've had a lot of fun putting the course together. The course is not perfect, so if you spotted any mistakes or have ideas for improvements, please get in [contact with us on GitHub](https://github.com/google/comprehensive-rust/discussions). We would love to hear from you.
fr_fr: Nous avons pris beaucoup de plaisir à concevoir ce cours. Il n’est pas parfait, donc si vous repérez des erreurs ou avez des suggestions d’amélioration, n’hésitez pas à [nous contacter sur GitHub](https://github.com/google/comprehensive-rust/discussions). Nous serions ravis de recevoir vos retours.

source: The following is a glossary which aims to give a short definition of many Rust terms. For translations, this also serves to connect the term back to the English original.
fr_fr: Le glossaire suivant vise à donner une brève définition de nombreux termes liés à Rust. Pour les traductions, il sert également à relier chaque terme à son équivalent anglais d'origine.

source: allocate: Dynamic memory allocation on [the heap](memory-management/stack-vs-heap.md).
fr_fr: allouer : Allocation dynamique de mémoire sur [le tas](memory-management/stack-vs-heap.md).

source: argument: Information that is passed into a function or method.
fr_fr: argument : Information transmise à une fonction ou une méthode.

source: Bare-metal Rust: Low-level Rust development, often deployed to a system without an operating system. See [Bare-metal Rust](bare-metal.md).
fr_fr: Bare-metal Rust : Développement Rust bas niveau, souvent déployé sur un système sans système d’exploitation. Voir [Bare-metal Rust](bare-metal.md).

source: block: See [Blocks](control-flow/blocks.md) and _scope_.
fr_fr: bloc : Voir [Blocs](control-flow/blocks.md) et _portée_.

source: borrow: See [Borrowing](ownership/borrowing.md).
fr_fr: emprunt : Voir [Emprunt](ownership/borrowing.md).

source: borrow checker: The part of the Rust compiler which checks that all borrows are valid.
fr_fr: vérificateur d’emprunt (_borrow checker_) : Partie du compilateur Rust qui vérifie que tous les emprunts sont valides.

source: brace: `{` and `}`. Also called _curly brace_, they delimit _blocks_.
fr_fr: accolade : `{` et `}`. Aussi appelées _accolades_, elles délimitent les _blocs_.

source: build: The process of converting source code into executable code or a usable program.
fr_fr: compilation (_build_) : Processus de transformation du code source en programme exécutable.

source: call: To invoke or execute a function or method.
fr_fr: appel : Invocation ou exécution d’une fonction ou méthode.

source: channel: Used to safely pass messages [between threads](concurrency/channels.md).
fr_fr: canal (_channel_) : Permet d’échanger des messages de manière sûre [entre les threads](concurrency/channels.md).

source: Comprehensive Rust 🦀: The courses here are jointly called Comprehensive Rust 🦀.
fr_fr: Comprehensive Rust 🦀 : Nom donné à l’ensemble des cours présentés ici.

source: concurrency: The execution of multiple tasks or processes at the same time.
fr_fr: concurrence : Exécution simultanée de plusieurs tâches ou processus.

source: Concurrency in Rust: See [Concurrency in Rust](concurrency.md).
fr_fr: Concurrence en Rust : Voir [Concurrence en Rust](concurrency.md).

source: constant: A value that does not change during the execution of a program.
fr_fr: constante : Valeur qui ne change pas durant l'exécution d’un programme.

source: control flow: The order in which the individual statements or instructions are executed in a program.
fr_fr: flux de contrôle : L’ordre dans lequel les instructions sont exécutées dans un programme.

source: crash: An unexpected and unhandled failure or termination of a program.
fr_fr: plantage (_crash_) : Échec ou arrêt inattendu et non géré d’un programme.

source: enumeration: A data type that holds one of several named constants, possibly with an associated tuple or struct.
fr_fr: énumération : Type de donnée pouvant contenir l’une de plusieurs constantes nommées, parfois accompagnée d’un tuple ou d’une structure.

source: error: An unexpected condition or result that deviates from the expected behavior.
fr_fr: erreur : Condition ou résultat inattendu, qui dévie du comportement attendu.

source: error handling: The process of managing and responding to errors that occur during program execution.
fr_fr: gestion des erreurs : Processus consistant à gérer les erreurs rencontrées durant l’exécution du programme.

source: exercise: A task or problem designed to practice and test programming skills.
fr_fr: exercice : Tâche ou problème destiné à pratiquer et tester des compétences en programmation.

source: function: A reusable block of code that performs a specific task.
fr_fr: fonction : Bloc de code réutilisable accomplissant une tâche spécifique.

source: garbage collector: A mechanism that automatically frees up memory occupied by objects that are no longer in use.
fr_fr: ramasse-miettes (_garbage collector_) : Mécanisme qui libère automatiquement la mémoire occupée par des objets inutilisés.

source: generics: A feature that allows writing code with placeholders for types, enabling code reuse with different data types.
fr_fr: génériques : Fonctionnalité permettant d’écrire du code avec des types paramétrés, afin de le réutiliser avec divers types de données.

source: immutable: Unable to be changed after creation.
fr_fr: immuable : Qui ne peut pas être modifié après sa création.

source: integration test: A type of test that verifies the interactions between different parts or components of a system.
fr_fr: test d’intégration : Type de test qui vérifie les interactions entre différentes parties ou composants d’un système.

source: keyword: A reserved word in a programming language that has a specific meaning and cannot be used as an identifier.
fr_fr: mot-clé : Mot réservé d’un langage de programmation, ayant une signification précise et ne pouvant pas être utilisé comme identifiant.

source: library: A collection of precompiled routines or code that can be used by programs.
fr_fr: bibliothèque : Ensemble de fonctions ou de code précompilé pouvant être utilisé par d’autres programmes.

source: macro: Rust macros can be recognized by a `!` in the name. Macros are used when normal functions are not enough. A typical example is `format!`, which takes a variable number of arguments, which isn't supported by Rust functions.
fr_fr: macro : Les macros en Rust sont reconnaissables grâce à un `!` dans leur nom. Elles sont utilisées lorsque les fonctions normales ne suffisent pas. Un exemple typique est `format!`, qui accepte un nombre variable d’arguments, ce que les fonctions Rust ne prennent pas en charge.

source: `main` function: Rust programs start executing with the `main` function.
fr_fr: fonction `main` : Les programmes Rust commencent leur exécution dans la fonction `main`.

source: match: A control flow construct in Rust that allows for pattern matching on the value of an expression.
fr_fr: match : Structure de contrôle du flux en Rust permettant de faire du filtrage par motif (_pattern matching_) sur la valeur d’une expression.

source: memory leak: A situation where a program fails to release memory that is no longer needed, leading to a gradual increase in memory usage.
fr_fr: fuite de mémoire : Situation où un programme ne libère pas la mémoire qui n’est plus nécessaire, entraînant une consommation mémoire croissante.

source: method: A function associated with an object or a type in Rust.
fr_fr: méthode : Fonction associée à un objet ou un type en Rust.

source: module: A namespace that contains definitions, such as functions, types, or traits, to organize code in Rust.
fr_fr: module : Espace de nommage contenant des définitions (fonctions, types, traits…) pour organiser le code en Rust.

source: move: The transfer of ownership of a value from one variable to another in Rust.
fr_fr: move : Transfert de la possession (_ownership_) d’une valeur d’une variable à une autre en Rust.

source: mutable: A property in Rust that allows variables to be modified after they have been declared.
fr_fr: mutable : Propriété permettant à une variable d’être modifiée après sa déclaration.

source: ownership: The concept in Rust that defines which part of the code is responsible for managing the memory associated with a value.
fr_fr: ownership (_possession_) : Concept en Rust qui définit quelle partie du code est responsable de la gestion de la mémoire associée à une valeur.

source: panic: An unrecoverable error condition in Rust that results in the termination of the program.
fr_fr: panic : Condition d’erreur irrécupérable en Rust entraînant l’arrêt du programme.

source: parameter: A value that is passed into a function or method when it is called.
fr_fr: paramètre : Valeur transmise à une fonction ou méthode lors de son appel.

source: pattern: A combination of values, literals, or structures that can be matched against an expression in Rust.
fr_fr: motif (_pattern_) : Combinaison de valeurs, littéraux ou structures pouvant être comparée à une expression.

source: payload: The data or information carried by a message, event, or data structure.
fr_fr: charge utile (_payload_) : Données ou informations transportées par un message, un événement ou une structure de données.

source: program: A set of instructions that a computer can execute to perform a specific task or solve a particular problem.
fr_fr: programme : Ensemble d’instructions qu’un ordinateur peut exécuter pour accomplir une tâche ou résoudre un problème.

source: programming language: A formal system used to communicate instructions to a computer, such as Rust.
fr_fr: langage de programmation : Système formel permettant de communiquer des instructions à un ordinateur, comme Rust.

source: receiver: The first parameter in a Rust method that represents the instance on which the method is called.
fr_fr: récepteur (_receiver_) : Premier paramètre d’une méthode en Rust, représentant l’instance sur laquelle la méthode est appelée.

source: reference counting: A memory management technique in which the number of references to an object is tracked, and the object is deallocated when the count reaches zero.
fr_fr: comptage de références (_reference counting_) : Technique de gestion de mémoire où le nombre de références à un objet est compté, et l’objet est libéré lorsque ce nombre atteint zéro.

source: return: A keyword in Rust used to indicate the value to be returned from a function.
fr_fr: return : Mot-clé en Rust utilisé pour indiquer la valeur à renvoyer depuis une fonction.

source: Rust: A systems programming language that focuses on safety, performance, and concurrency.
fr_fr: Rust : Langage de programmation système axé sur la sûreté, la performance et la concurrence.

source: Rust Fundamentals: Days 1 to 4 of this course.
fr_fr: Principes fondamentaux de Rust : Les jours 1 à 4 de ce cours.

source: Rust in Android: See [Rust in Android](android.md).
fr_fr: Rust dans Android : Voir [Rust dans Android](android.md).

source: Rust in Chromium: See [Rust in Chromium](chromium.md).
fr_fr: Rust dans Chromium : Voir [Rust dans Chromium](chromium.md).

source: safe: Refers to code that adheres to Rust's ownership and borrowing rules, preventing memory-related errors.
fr_fr: sûr (_safe_) : Fait référence à du code qui respecte les règles de possession (_ownership_) et d’emprunt (_borrowing_) de Rust, évitant ainsi les erreurs liées à la mémoire.

source: scope: The region of a program where a variable is valid and can be used.
fr_fr: portée (_scope_) : Région d’un programme dans laquelle une variable est valide et peut être utilisée.

source: standard library: A collection of modules providing essential functionality in Rust.
fr_fr: bibliothèque standard : Ensemble de modules fournissant les fonctionnalités essentielles en Rust.

source: static: A keyword in Rust used to define static variables or items with a `'static` lifetime.
fr_fr: static : Mot-clé en Rust utilisé pour définir des variables statiques ou des éléments ayant une durée de vie `'static`.

source: string: A data type storing textual data. See [`String` vs `str`](basic-syntax/string-slices.html) for more.
fr_fr: chaîne (_string_) : Type de données destiné à stocker du texte. Voir [`String` vs `str`](basic-syntax/string-slices.html) pour en savoir plus.

source: struct: A composite data type in Rust that groups together variables of different types under a single name.
fr_fr: struct : Type de données composite en Rust qui regroupe plusieurs variables de types différents sous un même nom.

source: test: A Rust module containing functions that test the correctness of other functions.
fr_fr: test : Module Rust contenant des fonctions destinées à vérifier le bon fonctionnement d’autres fonctions.

source: thread: A separate sequence of execution in a program, allowing concurrent execution.
fr_fr: thread (_fil d’exécution_) : Suite d’instructions distincte dans un programme, permettant une exécution concurrente.

source: thread safety: The property of a program that ensures correct behavior in a multithreaded environment.
fr_fr: sécurité des threads (_thread safety_) : Propriété garantissant le bon comportement d’un programme dans un environnement multithreadé.

source: trait: A collection of methods defined for an unknown type, providing a way to achieve polymorphism in Rust.
fr_fr: trait : Ensemble de méthodes définies pour un type inconnu, permettant de réaliser du polymorphisme en Rust.

source: trait bound: An abstraction where you can require types to implement some traits of your interest.
fr_fr: contrainte de trait (_trait bound_) : Abstraction permettant d’exiger qu’un type implémente certains traits.

source: tuple: A composite data type that contains variables of different types. Tuple fields have no names, and are accessed by their ordinal numbers.
fr_fr: tuple : Type de données composite contenant des variables de différents types. Les champs du tuple n’ont pas de noms et sont accessibles par leur indice.

source: type: A classification that specifies which operations can be performed on values of a particular kind in Rust.
fr_fr: type : Classification définissant les opérations possibles sur une valeur particulière en Rust.

source: type inference: The ability of the Rust compiler to deduce the type of a variable or expression.
fr_fr: inférence de type (_type inference_) : Capacité du compilateur Rust à déduire le type d’une variable ou d’une expression.

source: undefined behavior: Actions or conditions in Rust that have no specified result, often leading to unpredictable program behavior.
fr_fr: comportement indéfini (_undefined behavior_) : Action ou situation en Rust n’ayant pas de résultat spécifié, ce qui conduit souvent à un comportement imprévisible.

source: union: A data type that can hold values of different types but only one at a time.
fr_fr: union : Type de données pouvant contenir différentes valeurs de types distincts, mais une seule à la fois.

source: unit test: Rust comes with built-in support for running small unit tests and larger integration tests. See [Unit Tests](testing/unit-tests.html).
fr_fr: test unitaire : Rust propose un support intégré pour l’exécution de petits tests unitaires et de tests d’intégration. Voir [tests unitaires](testing/unit-tests.html).

source: unit type: Type that holds no data, written as a tuple with no members.
fr_fr: type unité (_unit type_) : Type ne contenant aucune donnée, représenté par un tuple vide : `()`.

source: unsafe: The subset of Rust which allows you to trigger _undefined behavior_. See [Unsafe Rust](unsafe.html).
fr_fr: unsafe : Sous-ensemble de Rust permettant de déclencher un _comportement indéfini_. Voir [Rust non sûr](unsafe.html).

source: variable: A memory location storing data. Variables are valid in a _scope_.
fr_fr: variable : Emplacement mémoire stockant des données. Les variables sont valides dans une _portée_ (_scope_).

source: Other Rust Resources
fr_fr: Autres ressources Rust

source: The Rust community has created a wealth of high-quality and free resources online.
fr_fr: La communauté Rust a créé de nombreuses ressources gratuites et de haute qualité en ligne.

source: Official Documentation
fr_fr: Documentation officielle

source: The Rust project hosts many resources. These cover Rust in general:
fr_fr: Le projet Rust héberge de nombreuses ressources qui couvrent Rust de manière générale :

source: [The Rust Programming Language](https://doc.rust-lang.org/book/): the canonical free book about Rust. Covers the language in detail and includes a few projects for people to build.
fr_fr: [The Rust Programming Language](https://doc.rust-lang.org/book/) : le livre de référence gratuit sur Rust. Il couvre le langage en détail et inclut quelques projets à réaliser.

source: [Rust By Example](https://doc.rust-lang.org/rust-by-example/): covers the Rust syntax via a series of examples which showcase different constructs. Sometimes includes small exercises where you are asked to expand on the code in the examples.
fr_fr: [Rust By Example](https://doc.rust-lang.org/rust-by-example/) : couvre la syntaxe de Rust via une série d'exemples qui présentent différentes constructions. Parfois comprend de petits exercices où l'on vous demande de développer le code de l'exemple.

source: [Rust Standard Library](https://doc.rust-lang.org/std/): full documentation of the standard library for Rust.
fr_fr: [Rust Standard Library](https://doc.rust-lang.org/std/) : documentation complète de la bibliothèque standard de Rust.

source: [The Rust Reference](https://doc.rust-lang.org/reference/): an incomplete book which describes the Rust grammar and memory model.
fr_fr: [The Rust Reference](https://doc.rust-lang.org/reference/) : un ouvrage en cours d’écriture décrivant la grammaire et le modèle mémoire de Rust.

source: More specialized guides hosted on the official Rust site:
fr_fr: Guides plus spécialisés hébergés sur le site officiel de Rust :

source: [The Rustonomicon](https://doc.rust-lang.org/nomicon/): covers unsafe Rust, including working with raw pointers and interfacing with other languages (FFI).
fr_fr: [The Rustonomicon](https://doc.rust-lang.org/nomicon/) : couvre le Rust non securisé (_unsafe_), y compris les pointeurs nus et l'interfaçage avec d'autres langages (FFI).

source: [Asynchronous Programming in Rust](https://rust-lang.github.io/async-book/): covers the new asynchronous programming model which was introduced after the Rust Book was written.
fr_fr: [Programmation asynchrone avec Rust](https://rust-lang.github.io/async-book/) : couvre le nouveau modèle de programmation asynchrone qui a été introduit après la publication du livre Rust.

source: [The Embedded Rust Book](https://doc.rust-lang.org/stable/embedded-book/): an introduction to using Rust on embedded devices without an operating system.
fr_fr: [The Embedded Rust Book](https://doc.rust-lang.org/stable/embedded-book/) : une introduction à l’utilisation de Rust sur des systèmes embarqués sans système d’exploitation.

source: Unofficial Learning Material
fr_fr: Ressources d’apprentissage non officielles

source: A small selection of other guides and tutorial for Rust:
fr_fr: Une petite sélection d’autres guides et tutoriels pour Rust :

source: [Learn Rust the Dangerous Way](http://cliffle.com/p/dangerust/): covers Rust from the perspective of low-level C programmers.
fr_fr: [Learn Rust the Dangerous Way](http://cliffle.com/p/dangerust/) : une approche de Rust du point de vue des programmeurs C bas niveau.
