Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: The pointer must be _dereferenceable_ (within the bounds of a single allocated object).
fr_fr: Le pointeur doit être _déréférençable_ (dans les limites d’un seul objet alloué).

source: The object must not have been deallocated.
fr_fr: L'objet ne doit pas avoir été désalloué.

source: There must not be concurrent accesses to the same location.
fr_fr: Il ne doit pas y avoir d'accès concurrents au même emplacement.

source: If the pointer was obtained by casting a reference, the underlying object must be live and no reference may be used to access the memory.
fr_fr: Si le pointeur a été obtenu en convertissant une référence, l'objet sous-jacent doit être vivant et aucune autre référence ne doit être utilisée pour accéder à cette mémoire.

source: In most cases the pointer must also be properly aligned.
fr_fr: Dans la plupart des cas, le pointeur doit aussi être correctement aligné.

source: The "NOT SAFE" section gives an example of a common kind of UB bug: `*r1` has the `'static` lifetime, so `r3` has type `&'static String`, and thus outlives `s`. Creating a reference from a pointer requires _great care_.
fr_fr: La section « NON SÉCURISÉ » illustre un exemple classique de bug lié à un comportement indéfini (UB) : `*r1` a une durée de vie `'static`, donc `r3` est de type `&'static String` et survit à `s`. Créer une référence à partir d’un pointeur demande _beaucoup de précaution_.

source: It is safe to read an immutable static variable:
fr_fr: Lire une variable statique immuable est sûr :

source: However, since data races can occur, it is unsafe to read and write mutable static variables:
fr_fr: Cependant, comme des conditions de concurrence peuvent se produire, il est dangereux de lire ou écrire dans des variables statiques mutables :

source: The program here is safe because it is single-threaded. However, the Rust compiler is conservative and will assume the worst. Try removing the `unsafe` and see how the compiler explains that it is undefined behavior to mutate a static from multiple threads.
fr_fr: Le programme est ici sûr car il est mono-threadé. Toutefois, le compilateur Rust est conservateur et suppose le pire. Essayez de retirer le `unsafe` et observez comment le compilateur explique que modifier une variable `static` dans un contexte multi-threadé est un comportement indéfini.

source: Using a mutable static is generally a bad idea, but there are some cases where it might make sense in low-level `no_std` code, such as implementing a heap allocator or working with some C APIs.
fr_fr: L'utilisation de variables statiques mutables est généralement déconseillée, mais peut avoir du sens dans certains cas de bas niveau (`no_std`), comme l’implémentation d’un allocateur ou l'interfaçage avec des API C.

source: Unions are like enums, but you need to track the active field yourself:
fr_fr: Les unions sont semblables aux enums, mais c’est à vous de suivre manuellement le champ actif :

source: "int: {}"
fr_fr: "entier : {}"

source: "bool: {}"
fr_fr: "booléen : {}"

source: // Undefined behavior!
fr_fr: // Comportement indéfini !

source: Unions are very rarely needed in Rust as you can usually use an enum. They are occasionally needed for interacting with C library APIs.
fr_fr: Les unions sont très rarement nécessaires en Rust, car on peut généralement utiliser une enum. Elles sont parfois utiles pour interagir avec des API de bibliothèques C.

source: If you just want to reinterpret bytes as a different type, you probably want [`std::mem::transmute`](https://doc.rust-lang.org/stable/std/mem/fn.transmute.html) or a safe wrapper such as the [`zerocopy`](https://crates.io/crates/zerocopy) crate.
fr_fr: Si vous souhaitez simplement réinterpréter des octets comme un autre type, vous devriez plutôt utiliser [`std::mem::transmute`](https://doc.rust-lang.org/stable/std/mem/fn.transmute.html) ou un wrapper sécurisé comme le crate [`zerocopy`](https://crates.io/crates/zerocopy).

source: Calling Unsafe Functions
fr_fr: Appel de fonctions non sécurisées

source: A function or method can be marked `unsafe` if it has extra preconditions you must uphold to avoid undefined behaviour:
fr_fr: Une fonction ou méthode peut être marquée `unsafe` si elle impose des préconditions supplémentaires à respecter pour éviter un comportement indéfini :

source: // Safe because the indices are in the correct order, within the bounds of // the string slice, and lie on UTF-8 sequence boundaries.
fr_fr: // Sûr car les indices sont dans le bon ordre, dans les limites de la // tranche de chaîne, et alignés sur les frontières des séquences UTF-8.

source: "char count: {}"
fr_fr: "nombre de caractères : {}"

source: // Undefined behavior if abs misbehaves.
fr_fr: // Comportement indéfini si `abs` se comporte mal.

source: "Absolute value of -3 according to C: {}"
fr_fr: "Valeur absolue de -3 selon C : {}"

source: // Not upholding the UTF-8 encoding requirement breaks memory safety! // println!("emoji: {}", unsafe { emojis.get_unchecked(0..3) }); // println!("char count: {}", count_chars(unsafe { // emojis.get_unchecked(0..3) }));
fr_fr: // Ne pas respecter l'encodage UTF-8 compromet la sécurité mémoire ! // println!(\emoji : {}\, unsafe { emojis.get_unchecked(0..3) }); // println!(ombre de caractères : {}\, count_chars(unsafe { // emojis.get_unchecked(0..3) }));

source: Writing Unsafe Functions
fr_fr: Ecrire des fonctions non sécurisées

source: You can mark your own functions as `unsafe` if they require particular conditions to avoid undefined behaviour.
fr_fr: Vous pouvez marquer vos propres fonctions comme `unsafe` si elles nécessitent des conditions particulières pour éviter un comportement indéfini.

source: /// Swaps the values pointed to by the given pointers. /// /// # Safety /// /// The pointers must be valid and properly aligned.
fr_fr: /// Échange les valeurs pointées par les pointeurs donnés. /// /// # Sécurité /// /// Les pointeurs doivent être valides et correctement alignés.

source: // Safe because ...
fr_fr: // Sûr car ...

source: `get_unchecked`, like most `_unchecked` functions, is unsafe, because it can create UB if the range is incorrect. `abs` is incorrect for a different reason: it is an external function (FFI). Calling external functions is usually only a problem when those functions do things with pointers which might violate Rust's memory model, but in general any C function might have undefined behaviour under any arbitrary circumstances.
fr_fr: `get_unchecked`, comme la plupart des fonctions avec le suffixe `_unchecked`, est `unsafe` car elle peut entraîner un comportement indéfini si la plage est incorrecte. `abs` est problématique pour une autre raison : c’est une fonction externe (FFI). Appeler des fonctions externes pose généralement problème si elles manipulent des pointeurs d’une manière incompatible avec le modèle mémoire de Rust, mais en réalité, toute fonction C peut avoir un comportement indéfini dans des circonstances imprévisibles.

source: The `"C"` in this example is the ABI; [other ABIs are available too](https://doc.rust-lang.org/reference/items/external-blocks.html).
fr_fr: Le `"C"` dans cet exemple est l’ABI (Application Binary Interface) ; [d'autres ABIs sont également disponibles](https://doc.rust-lang.org/reference/items/external-blocks.html).

source: We wouldn't actually use pointers for a `swap` function - it can be done safely with references.
fr_fr: En réalité, on n'utiliserait pas de pointeurs pour une fonction `swap` — cela peut être fait en toute sécurité avec des références.

source: Note that unsafe code is allowed within an unsafe function without an `unsafe` block. We can prohibit this with `#[deny(unsafe_op_in_unsafe_fn)]`. Try adding it and see what happens. This will likely change in a future Rust edition.
fr_fr: Notez que du code `unsafe` est autorisé dans une fonction marquée `unsafe` sans bloc `unsafe` explicite. On peut interdire cela avec `#[deny(unsafe_op_in_unsafe_fn)]`. Essayez de l'ajouter et observez le résultat. Ce comportement changera probablement dans une future édition de Rust.

source: Implementing Unsafe Traits
fr_fr: Implémentation de traits non sécurisés

source: Like with functions, you can mark a trait as `unsafe` if the implementation must guarantee particular conditions to avoid undefined behaviour.
fr_fr: Comme pour les fonctions, vous pouvez marquer un trait comme `unsafe` si son implémentation doit garantir certaines conditions pour éviter un comportement indéfini.

source: For example, the `zerocopy` crate has an unsafe trait that looks [something like this](https://docs.rs/zerocopy/latest/zerocopy/trait.AsBytes.html):
fr_fr: Par exemple, le crate `zerocopy` définit un trait non sûr ressemblant à [cela](https://docs.rs/zerocopy/latest/zerocopy/trait.AsBytes.html) :

source: /// ... /// # Safety /// The type must have a defined representation and no padding.
fr_fr: /// ... /// # Sécurité /// Le type doit avoir une représentation définie et ne pas contenir de padding.

source: // Safe because u32 has a defined representation and no padding.
fr_fr: // Sûr car u32 a une représentation définie et ne contient pas de padding.

source: There should be a `# Safety` section on the Rustdoc for the trait explaining the requirements for the trait to be safely implemented.
fr_fr: Il devrait y avoir une section `# Safety` dans la documentation du trait pour expliquer les exigences nécessaires à une implémentation sûre.

source: The actual safety section for `AsBytes` is rather longer and more complicated.
fr_fr: La section de sécurité réelle du trait `AsBytes` est en fait plus longue et complexe.

source: The built-in `Send` and `Sync` traits are unsafe.
fr_fr: Les traits intégrés `Send` et `Sync` sont non sûrs (`unsafe`).

source: Safe FFI Wrapper
fr_fr: Enveloppe FFI sécurisée

source: Rust has great support for calling functions through a _foreign function interface_ (FFI). We will use this to build a safe wrapper for the `libc` functions you would use from C to read the names of files in a directory.
fr_fr: Rust offre un excellent support pour appeler des fonctions via une _interface de fonction étrangère_ (FFI). Nous allons l’utiliser pour construire un wrapper sûr autour des fonctions `libc` permettant de lire les noms de fichiers dans un répertoire depuis du code C.

source: You will want to consult the manual pages:
fr_fr: Vous voudrez consulter les pages de manuel :

source: You will also want to browse the [`std::ffi`](https://doc.rust-lang.org/std/ffi/) module. There you find a number of string types which you need for the exercise:
fr_fr: Il est également utile de consulter le module [`std::ffi`](https://doc.rust-lang.org/std/ffi/), qui contient plusieurs types de chaînes utiles pour cet exercice :

source: Encoding
fr_fr: Encodage

source: Use
fr_fr: Usage

source: [`str`](https://doc.rust-lang.org/std/primitive.str.html) and [`String`](https://doc.rust-lang.org/std/string/struct.String.html)
fr_fr: [`str`](https://doc.rust-lang.org/std/primitive.str.html) et [`String`](https://doc.rust-lang.org/std/string/struct.String.html)

source: Text processing in Rust
fr_fr: Traitement de texte en Rust

source: [`CStr`](https://doc.rust-lang.org/std/ffi/struct.CStr.html) and [`CString`](https://doc.rust-lang.org/std/ffi/struct.CString.html)
fr_fr: [`CStr`](https://doc.rust-lang.org/std/ffi/struct.CStr.html) et [`CString`](https://doc.rust-lang.org/std/ffi/struct.CString.html)

source: NUL-terminated
fr_fr: Terminé par NUL

source: Communicating with C functions
fr_fr: Communication avec des fonctions C

source: [`OsStr`](https://doc.rust-lang.org/std/ffi/struct.OsStr.html) and [`OsString`](https://doc.rust-lang.org/std/ffi/struct.OsString.html)
fr_fr: [`OsStr`](https://doc.rust-lang.org/std/ffi/struct.OsStr.html) et [`OsString`](https://doc.rust-lang.org/std/ffi/struct.OsString.html)

source: OS-specific
fr_fr: Spécifique au système d’exploitation

source: Communicating with the OS
fr_fr: Communication avec le système d’exploitation

source: You will convert between all these types:
fr_fr: Vous convertirez entre tous ces types :

source: `&str` to `CString`: you need to allocate space for a trailing `\0` character,
fr_fr: `&str` vers `CString` : il faut allouer de l’espace pour un caractère de fin `\0`,

source: `CString` to `*const i8`: you need a pointer to call C functions,
fr_fr: `CString` vers `*const i8` : un pointeur est nécessaire pour appeler des fonctions C,

source: `*const i8` to `&CStr`: you need something which can find the trailing `\0` character,
fr_fr: `*const i8` vers `&CStr` : il faut un type capable de trouver le caractère final `\0`,

source: `&CStr` to `&[u8]`: a slice of bytes is the universal interface for "some unknown data",
fr_fr: `&CStr` vers `&[u8]` : une tranche d’octets est l’interface universelle pour des données « inconnues »,

source: `&[u8]` to `&OsStr`: `&OsStr` is a step towards `OsString`, use [`OsStrExt`](https://doc.rust-lang.org/std/os/unix/ffi/trait.OsStrExt.html) to create it,
fr_fr: `&[u8]` vers `&OsStr` : `&OsStr` est une étape vers `OsString`, utilisez [`OsStrExt`](https://doc.rust-lang.org/std/os/unix/ffi/trait.OsStrExt.html) pour le créer,

source: `&OsStr` to `OsString`: you need to clone the data in `&OsStr` to be able to return it and call `readdir` again.
fr_fr: `&OsStr` vers `OsString` : il faut cloner les données de `&OsStr` pour pouvoir les retourner et appeler `readdir` à nouveau.

source: The [Nomicon](https://doc.rust-lang.org/nomicon/ffi.html) also has a very useful chapter about FFI.
fr_fr: Le [Nomicon](https://doc.rust-lang.org/nomicon/ffi.html) propose également un chapitre très utile sur le FFI.

source: Copy the code below to <https://play.rust-lang.org/> and fill in the missing functions and methods:
fr_fr: Copiez le code ci-dessous sur <https://play.rust-lang.org/> et complétez les fonctions et méthodes manquantes :

source: // Opaque type. See https://doc.rust-lang.org/nomicon/ffi.html.
fr_fr: // Type opaque. Voir https://doc.rust-lang.org/nomicon/ffi.html.

source: // Layout according to the Linux man page for readdir(3), where ino_t and // off_t are resolved according to the definitions in // /usr/include/x86_64-linux-gnu/{sys/types.h, bits/typesizes.h}.
fr_fr: // Disposition selon la page de manuel Linux pour readdir(3), où ino_t et // off_t sont définis selon // /usr/include/x86_64-linux-gnu/{sys/types.h, bits/typesizes.h}.

source: // Layout according to the macOS man page for dir(5).
fr_fr: // Disposition selon la page de manuel macOS pour dir(5).

source: // See https://github.com/rust-lang/libc/issues/414 and the section on // _DARWIN_FEATURE_64_BIT_INODE in the macOS man page for stat(2). // // "Platforms that existed before these updates were available" refers // to macOS (as opposed to iOS / wearOS / etc.) on Intel and PowerPC.
fr_fr: // Voir https://github.com/rust-lang/libc/issues/414 et la section sur // _DARWIN_FEATURE_64_BIT_INODE dans la page de manuel macOS pour stat(2). // // « Plateformes existantes avant ces mises à jour » fait référence à // macOS (et non iOS / wearOS / etc.) sur Intel et PowerPC.

source: // Call opendir and return a Ok value if that worked, // otherwise return Err with a message.
fr_fr: // Appeler opendir et retourner Ok si cela fonctionne, // sinon retourner Err avec un message.

source: // Keep calling readdir until we get a NULL pointer back.
fr_fr: // Appeler readdir jusqu’à obtenir un pointeur NULL.

source: // Call closedir as needed.
fr_fr: // Appeler closedir si nécessaire.

source: "files: {:#?}"
fr_fr: "fichiers : {:#?}"

source: "Invalid path: {err}"
fr_fr: "Chemin invalide : {err}"

source: // SAFETY: path.as_ptr() cannot be NULL.
fr_fr: // SÉCURITÉ : path.as_ptr() ne peut pas être NULL.

source: "Could not open {:?}"
fr_fr: "Impossible d’ouvrir {:?}"

source: // Keep calling readdir until we get a NULL pointer back. // SAFETY: self.dir is never NULL.
fr_fr: // Appeler readdir jusqu’à obtenir un pointeur NULL. // SÉCURITÉ : self.dir n’est jamais NULL.

source: // We have reached the end of the directory.
fr_fr: // Nous avons atteint la fin du répertoire.

source: // SAFETY: dirent is not NULL and dirent.d_name is NUL // terminated.
fr_fr: // SÉCURITÉ : dirent n’est pas NULL et dirent.d_name est terminé par NUL.

source: // SAFETY: self.dir is not NULL.
fr_fr: // SÉCURITÉ : self.dir n’est pas NULL.

source: "Could not close {:?}"
fr_fr: "Impossible de fermer {:?}"

source: "no-such-directory"
fr_fr: "répertoire-inexistant"

source: "Non UTF-8 character in path"
fr_fr: "Caractère non UTF-8 dans le chemin"

source: "The Foo Diaries\n"
fr_fr: "Le journal de Foo\n"

source: "//! Crab\n"
fr_fr: "//! Crabe\n"

source: Welcome to Rust in Android
fr_fr: Bienvenue à Rust sur Android

source: Rust is supported for system software on Android. This means that you can write new services, libraries, drivers or even firmware in Rust (or improve existing code as needed).
fr_fr: Rust est pris en charge pour les logiciels système sur Android. Cela signifie que vous pouvez écrire de nouveaux services, bibliothèques, pilotes ou même micrologiciels en Rust (ou améliorer du code existant si nécessaire).

source: We will attempt to call Rust from one of your own projects today. So try to find a little corner of your code base where we can move some lines of code to Rust. The fewer dependencies and "exotic" types the better. Something that parses some raw bytes would be ideal.
fr_fr: Nous allons essayer d'appeler Rust depuis l'un de vos propres projets aujourd'hui. Alors essayez de trouver un petit coin de votre code où nous pouvons déplacer quelques lignes de code vers Rust. Le moins il y a de dépendances et de types "exotiques", le mieux c'est. Quelque chose qui analyse quelques octets de donnée brute serait idéal.

source: The speaker may mention any of the following given the increased use of Rust in Android:
fr_fr: L’intervenant peut mentionner les éléments suivants compte tenu de l’utilisation croissante de Rust dans Android :

source: Service example: [DNS over HTTP](https://security.googleblog.com/2022/07/dns-over-http3-in-android.html)
fr_fr: Exemple de service : [DNS sur HTTP](https://security.googleblog.com/2022/07/dns-over-http3-in-android.html)

source: Libraries: [Rutabaga Virtual Graphics Interface](https://crosvm.dev/book/appendix/rutabaga_gfx.html)
fr_fr: Bibliothèques : [Rutabaga Virtual Graphics Interface](https://crosvm.dev/book/appendix/rutabaga_gfx.html)

source: Kernel Drivers: [Binder](https://lore.kernel.org/rust-for-linux/20231101-rust-binder-v1-0-08ba9197f637@google.com/)
fr_fr: Pilotes noyau : [Binder](https://lore.kernel.org/rust-for-linux/20231101-rust-binder-v1-0-08ba9197f637@google.com/)

source: Firmware: [pKVM firmware](https://security.googleblog.com/2023/10/bare-metal-rust-in-android.html)
fr_fr: Micrologiciel : [firmware pKVM](https://security.googleblog.com/2023/10/bare-metal-rust-in-android.html)

source: We will be using a Cuttlefish Android Virtual Device to test our code. Make sure you have access to one or create a new one with:
fr_fr: Nous allons utiliser un appareil virtuel Android Cuttlefish pour tester notre code. Assurez-vous d’y avoir accès ou créez-en un nouveau avec :

source: Please see the [Android Developer Codelab](https://source.android.com/docs/setup/start) for details.
fr_fr: Veuillez consulter le [Codelab des développeurs Android](https://source.android.com/docs/setup/start) pour plus de détails.

source: Cuttlefish is a reference Android device designed to work on generic Linux desktops. MacOS support is also planned.
fr_fr: Cuttlefish est un appareil Android de référence conçu pour fonctionner sur des postes Linux génériques. La prise en charge de macOS est également prévue.

source: The Cuttlefish system image maintains high fidelity to real devices, and is the ideal emulator to run many Rust use cases.
fr_fr: L’image système de Cuttlefish est très fidèle aux vrais appareils, ce qui en fait l’émulateur idéal pour de nombreux cas d’usage de Rust.

source: The Android build system (Soong) supports Rust via a number of modules:
fr_fr: Le système de compilation Android (Soong) prend en charge Rust via plusieurs types de modules :

source: Module Type
fr_fr: Type de module

source: Produces a Rust binary.
fr_fr: Produit un exécutable Rust.

source: Produces a Rust library, and provides both `rlib` and `dylib` variants.
fr_fr: Produit une bibliothèque Rust, avec des variantes `rlib` et `dylib`.

source: Produces a Rust C library usable by `cc` modules, and provides both static and shared variants.
fr_fr: Produit une bibliothèque C Rust utilisable par les modules `cc`, avec des variantes statiques et partagées.

source: Produces a `proc-macro` Rust library. These are analogous to compiler plugins.
fr_fr: Produit une bibliothèque Rust de type `proc-macro`. Ces bibliothèques sont analogues à des plugins de compilateur.

source: Produces a Rust test binary that uses the standard Rust test harness.
fr_fr: Produit un exécutable de test Rust utilisant l'infrastructure de test standard de Rust.

source: Produces a Rust fuzz binary leveraging `libfuzzer`.
fr_fr: Produit un binaire Rust de fuzzing basé sur `libfuzzer`.

source: Generates source and produces a Rust library that provides an interface for a particular protobuf.
fr_fr: Génère du code source et produit une bibliothèque Rust fournissant une interface pour un protobuf donné.

source: Generates source and produces a Rust library containing Rust bindings to C libraries.
fr_fr: Génère du code source et produit une bibliothèque Rust contenant des liaisons vers des bibliothèques C.

source: We will look at `rust_binary` and `rust_library` next.
fr_fr: Nous allons maintenant examiner `rust_binary` et `rust_library`.

source: Additional items speaker may mention:
fr_fr: Autres points que l’intervenant pourrait mentionner :

source: Cargo is not optimized for multi-language repos, and also downloads packages from the internet.
fr_fr: Cargo n’est pas optimisé pour les dépôts multilingues et télécharge aussi les paquets depuis Internet.

source: For compliance and performance, Android must have crates in-tree. It must also interop with C/C++/Java code. Soong fills that gap.
fr_fr: Pour des raisons de conformité et de performance, Android doit inclure les crates dans l’arborescence. Il doit aussi interagir avec du code C/C++/Java. Soong comble cette lacune.

source: Soong has many similarities to Bazel, which is the open-source variant of Blaze (used in google3).
fr_fr: Soong présente de nombreuses similarités avec Bazel, qui est la variante open source de Blaze (utilisé dans google3).

source: There is a plan to transition [Android](https://source.android.com/docs/setup/build/bazel/introduction), [ChromeOS](https://chromium.googlesource.com/chromiumos/bazel/), and [Fuchsia](https://source.android.com/docs/setup/build/bazel/introduction) to Bazel.
fr_fr: Un passage à Bazel est prévu pour [Android](https://source.android.com/docs/setup/build/bazel/introduction), [ChromeOS](https://chromium.googlesource.com/chromiumos/bazel/) et [Fuchsia](https://source.android.com/docs/setup/build/bazel/introduction).

source: Learning Bazel-like build rules is useful for all Rust OS developers.
fr_fr: Apprendre les règles de compilation de type Bazel est utile pour tout développeur Rust sur OS.

source: Fun fact: Data from Star Trek is a Soong-type Android.
fr_fr: Le saviez-vous ? Data de Star Trek est un Android de type Soong.

source: Rust Binaries
fr_fr: Binaires Rust

source: Let us start with a simple application. At the root of an AOSP checkout, create the following files:
fr_fr: Commençons par une application simple. À la racine d’un dépôt AOSP, créez les fichiers suivants :

source: //! Rust demo.
fr_fr: //! Démo Rust.
