Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: What about integer overflow? In C and C++ overflow of _signed_ integers is actually undefined, and might do different things on different platforms or compilers. In Rust, it's defined.
fr_fr: Qu’en est-il du dépassement d’entier ? En C et C++, le dépassement d’entiers _signés_ est en fait indéfini, et peut produire des comportements différents selon les plateformes ou les compilateurs. En Rust, ce comportement est défini.

source: Change the `i32`'s to `i16` to see an integer overflow, which panics (checked) in a debug build and wraps in a release build. There are other options, such as overflowing, saturating, and carrying. These are accessed with method syntax, e.g., `(a * b).saturating_add(b * c).saturating_add(c * a)`.
fr_fr: Changez les `i32` en `i16` pour provoquer un dépassement d’entier, ce qui provoque une panique (vérifiée) en mode debug et un débordement circulaire en mode release. D’autres options existent comme le débordement, la saturation et la propagation. Ces comportements sont accessibles via la syntaxe des méthodes, par exemple : `(a * b).saturating_add(b * c).saturating_add(c * a)`.

source: In fact, the compiler will detect overflow of constant expressions, which is why the example requires a separate function.
fr_fr: En fait, le compilateur détecte les dépassements dans les expressions constantes, c’est pourquoi l’exemple nécessite une fonction distincte.

source: Rust will look at how the variable is _used_ to determine the type:
fr_fr: Rust détermine le type d'une variable en observant comment elle est _utilisée_ :

source: This slide demonstrates how the Rust compiler infers types based on constraints given by variable declarations and usages.
fr_fr: Cette diapositive montre comment le compilateur Rust déduit les types à partir des contraintes issues des déclarations et usages des variables.

source: It is very important to emphasize that variables declared like this are not of some sort of dynamic "any type" that can hold any data. The machine code generated by such declaration is identical to the explicit declaration of a type. The compiler does the job for us and helps us write more concise code.
fr_fr: Il est important de souligner que les variables déclarées ainsi ne sont pas des variables dynamiques de type « any » pouvant contenir n’importe quelle donnée. Le code machine généré est identique à celui d’une déclaration explicite. Le compilateur fait simplement le travail à notre place et permet d’écrire un code plus concis.

source: When nothing constrains the type of an integer literal, Rust defaults to `i32`. This sometimes appears as `{integer}` in error messages. Similarly, floating-point literals default to `f64`.
fr_fr: Quand aucun élément ne contraint le type d’un littéral entier, Rust utilise par défaut `i32`. Cela peut parfois apparaître comme `{integer}` dans les messages d’erreur. De même, les littéraux flottants sont par défaut de type `f64`.

source: The first and second Fibonacci numbers are both `1`. For n>2, the n'th Fibonacci number is calculated recursively as the sum of the n-1'th and n-2'th Fibonacci numbers.
fr_fr: Les premier et deuxième nombres de Fibonacci valent tous deux `1`. Pour n > 2, le nième nombre de Fibonacci est calculé récursivement comme la somme des (n-1)ᵉ et (n-2)ᵉ nombres de Fibonacci.

source: Write a function `fib(n)` that calculates the n'th Fibonacci number. When will this function panic?
fr_fr: Écrivez une fonction `fib(n)` qui calcule le nième nombre de Fibonacci. Quand cette fonction peut-elle paniquer ?

source: // The base case.
fr_fr: // Le cas de base.

source: "Implement this"
fr_fr: "Implémenter ceci"

source: // The recursive case.
fr_fr: // Le cas récursif.

source: `if` expressions
fr_fr: Expressions `if`

source: You use [`if` expressions](https://doc.rust-lang.org/reference/expressions/if-expr.html#if-expressions) exactly like `if` statements in other languages:
fr_fr: On utilise les [`expressions if`](https://doc.rust-lang.org/reference/expressions/if-expr.html#if-expressions) exactement comme les instructions `if` dans d’autres langages :

source: In addition, you can use `if` as an expression. The last expression of each block becomes the value of the `if` expression:
fr_fr: Vous pouvez également utiliser `if` comme une expression. La dernière expression de chaque bloc devient la valeur de l’expression `if` :

source: Because `if` is an expression and must have a particular type, both of its branch blocks must have the same type. Show what happens if you add `;` after `"small"` in the second example.
fr_fr: Comme `if` est une expression et doit avoir un type défini, les deux blocs doivent retourner le même type. Montrez ce qui se passe si on ajoute un `;` après `"small"` dans le deuxième exemple.

source: When `if` is used in an expression, the expression must have a `;` to separate it from the next statement. Remove the `;` before `println!` to see the compiler error.
fr_fr: Lorsque `if` est utilisé dans une expression, celle-ci doit être suivie d’un `;` pour la séparer de l’instruction suivante. Supprimez le `;` avant `println!` pour voir l’erreur du compilateur.

source: There are three looping keywords in Rust: `while`, `loop`, and `for`:
fr_fr: Rust possède trois mots-clés de boucle : `while`, `loop` et `for` :

source: The [`while` keyword](https://doc.rust-lang.org/reference/expressions/loop-expr.html#predicate-loops) works much like in other languages, executing the loop body as long as the condition is true.
fr_fr: Le mot-clé [`while`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#predicate-loops) fonctionne comme dans d'autres langages : il exécute le corps de la boucle tant que la condition est vraie.

source: The [`for` loop](https://doc.rust-lang.org/std/keyword.for.html) iterates over ranges of values or the items in a collection:
fr_fr: La boucle [`for`](https://doc.rust-lang.org/std/keyword.for.html) permet d’itérer sur des plages de valeurs ou les éléments d’une collection :

source: Under the hood `for` loops use a concept called "iterators" to handle iterating over different kinds of ranges/collections. Iterators will be discussed in more detail later.
fr_fr: En interne, les boucles `for` utilisent un concept appelé "itérateurs" pour parcourir différents types de plages ou de collections. Les itérateurs seront abordés plus en détail plus tard.

source: Note that the `for` loop only iterates to `4`. Show the `1..=5` syntax for an inclusive range.
fr_fr: Notez que la boucle `for` s’arrête à `4`. Montrez la syntaxe `1..=5` pour une plage inclusive.

source: The [`loop` statement](https://doc.rust-lang.org/std/keyword.loop.html) just loops forever, until a `break`.
fr_fr: L’instruction [`loop`](https://doc.rust-lang.org/std/keyword.loop.html) répète une boucle indéfiniment jusqu’à ce qu’un `break` survienne.

source: If you want to immediately start the next iteration use [`continue`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#continue-expressions).
fr_fr: Pour passer immédiatement à l’itération suivante, utilisez [`continue`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#continue-expressions).

source: If you want to exit any kind of loop early, use [`break`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#break-expressions). For `loop`, this can take an optional expression that becomes the value of the `loop` expression.
fr_fr: Pour quitter prématurément n’importe quelle boucle, utilisez [`break`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#break-expressions). Pour `loop`, on peut fournir une expression optionnelle qui devient la valeur retournée par l’expression `loop`.

source: Both `continue` and `break` can optionally take a label argument which is used to break out of nested loops:
fr_fr: `continue` et `break` peuvent prendre un label en argument pour indiquer à quelle boucle imbriquée s’applique l’instruction :

source: "elements searched: {elements_searched}"
fr_fr: "éléments parcourus : {elements_searched}"

source: Note that `loop` is the only looping construct which returns a non-trivial value. This is because it's guaranteed to be entered at least once (unlike `while` and `for` loops).
fr_fr: Notez que `loop` est la seule structure de boucle qui peut retourner une valeur non triviale. C’est parce qu’elle est garantie d’être exécutée au moins une fois (contrairement aux boucles `while` et `for`).

source: Blocks
fr_fr: Blocs

source: A block in Rust contains a sequence of expressions, enclosed by braces `{}`. Each block has a value and a type, which are those of the last expression of the block:
fr_fr: Un bloc en Rust contient une suite d’expressions, délimitées par des accolades `{}`. Un bloc a une valeur et un type, ceux de sa dernière expression :

source: If the last expression ends with `;`, then the resulting value and type is `()`.
fr_fr: Si la dernière expression se termine par un `;`, alors la valeur retournée est de type `()`.

source: You can show how the value of the block changes by changing the last line in the block. For instance, adding/removing a semicolon or using a `return`.
fr_fr: Vous pouvez illustrer comment la valeur d’un bloc change en modifiant sa dernière ligne, par exemple en ajoutant ou retirant un point-virgule, ou en utilisant un `return`.

source: A variable's scope is limited to the enclosing block.
fr_fr: La portée d’une variable est limitée au bloc dans lequel elle est définie.

source: You can shadow variables, both those from outer scopes and variables from the same scope:
fr_fr: Il est possible de masquer des variables, qu’elles proviennent d’un bloc extérieur ou du même bloc :

source: "before: {a}"
fr_fr: "avant : {a}"

source: "inner scope: {a}"
fr_fr: "portée interne : {a}"

source: "shadowed in inner scope: {a}"
fr_fr: "masquée dans la portée interne : {a}"

source: "after: {a}"
fr_fr: "après : {a}"

source: Show that a variable's scope is limited by adding a `b` in the inner block in the last example, and then trying to access it outside that block.
fr_fr: Montrez que la portée d’une variable est limitée en ajoutant une variable `b` dans le bloc interne du dernier exemple, puis en essayant d’y accéder à l’extérieur de ce bloc.

source: Shadowing is different from mutation, because after shadowing both variable's memory locations exist at the same time. Both are available under the same name, depending where you use it in the code.
fr_fr: Le masquage (shadowing) est différent de la mutation, car après masquage, les emplacements mémoire des deux variables existent en même temps. Elles sont toutes deux accessibles sous le même nom, selon l’endroit du code où il est utilisé.

source: A shadowing variable can have a different type.
fr_fr: Une variable masquante peut avoir un type différent.

source: Shadowing looks obscure at first, but is convenient for holding on to values after `.unwrap()`.
fr_fr: Le masquage peut sembler obscur au début, mais il est pratique pour conserver les valeurs après un `.unwrap()`.

source: Declaration parameters are followed by a type (the reverse of some programming languages), then a return type.
fr_fr: Les paramètres dans une déclaration sont suivis d’un type (contrairement à certains langages), puis d’un type de retour.

source: The last expression in a function body (or any block) becomes the return value. Simply omit the `;` at the end of the expression. The `return` keyword can be used for early return, but the "bare value" form is idiomatic at the end of a function (refactor `gcd` to use a `return`).
fr_fr: La dernière expression dans le corps d’une fonction (ou de tout bloc) devient la valeur de retour. Il suffit de ne pas mettre de `;` à la fin de cette expression. Le mot-clé `return` peut être utilisé pour un retour anticipé, mais la forme sans `return` est idiomatique à la fin d’une fonction (refactorez `gcd` pour utiliser un `return`).

source: Some functions have no return value, and return the 'unit type', `()`. The compiler will infer this if the `-> ()` return type is omitted.
fr_fr: Certaines fonctions n’ont pas de valeur de retour, elles retournent le « type unité », `()`. Le compilateur l’infère si le type de retour `-> ()` est omis.

source: Overloading is not supported -- each function has a single implementation.
fr_fr: La surcharge n’est pas prise en charge — chaque fonction a une seule implémentation.

source: Always takes a fixed number of parameters. Default arguments are not supported. Macros can be used to support variadic functions.
fr_fr: Prend toujours un nombre fixe de paramètres. Les arguments par défaut ne sont pas pris en charge. Les macros peuvent être utilisées pour prendre en charge des fonctions à arguments variables.

source: Always takes a single set of parameter types. These types can be generic, which will be covered later.
fr_fr: Une fonction prend toujours un seul ensemble de types de paramètres. Ces types peuvent être génériques, ce que nous verrons plus tard.

source: Macros are expanded into Rust code during compilation, and can take a variable number of arguments. They are distinguished by a `!` at the end. The Rust standard library includes an assortment of useful macros.
fr_fr: Les macros sont transformées en code Rust lors de la compilation et peuvent prendre un nombre variable d’arguments. Elles se distinguent par un `!` à la fin. La bibliothèque standard de Rust contient plusieurs macros utiles.

source: `println!(format, ..)` prints a line to standard output, applying formatting described in [`std::fmt`](https://doc.rust-lang.org/std/fmt/index.html).
fr_fr: `println!(format, ..)` imprime une ligne sur la sortie standard, en appliquant la mise en forme décrite dans [`std::fmt`](https://doc.rust-lang.org/std/fmt/index.html).

source: `format!(format, ..)` works just like `println!` but returns the result as a string.
fr_fr: `format!(format, ..)` fonctionne comme `println!` mais retourne le résultat sous forme de chaîne.

source: `dbg!(expression)` logs the value of the expression and returns it.
fr_fr: `dbg!(expression)` affiche la valeur de l’expression dans les logs et la retourne.

source: `todo!()` marks a bit of code as not-yet-implemented. If executed, it will panic.
fr_fr: `todo!()` indique qu’un morceau de code n’est pas encore implémenté. Si exécuté, cela provoquera une panique.

source: `unreachable!()` marks a bit of code as unreachable. If executed, it will panic.
fr_fr: `unreachable!()` marque une portion de code comme inatteignable. Si elle est exécutée, cela provoquera une panique.

source: The takeaway from this section is that these common conveniences exist, and how to use them. Why they are defined as macros, and what they expand to, is not especially critical.
fr_fr: L’essentiel à retenir de cette section est que ces commodités courantes existent et comment les utiliser. Pourquoi elles sont définies comme des macros et en quoi elles se développent n’est pas particulièrement important.

source: The course does not cover defining macros, but a later section will describe use of derive macros.
fr_fr: Ce cours ne couvre pas la définition de macros, mais une section ultérieure expliquera l’utilisation des macros `derive`.

source: The [Collatz Sequence](https://en.wikipedia.org/wiki/Collatz_conjecture) is defined as follows, for an arbitrary n
fr_fr: La [suite de Collatz](https://fr.wikipedia.org/wiki/Conjecture_de_Collatz) est définie comme suit, pour un entier n arbitraire

source: greater than zero:
fr_fr: strictement supérieur à zéro :

source: If _n
fr_fr: Si _n

source: _ is 1, then the sequence terminates at _n
fr_fr: _ vaut 1, alors la suite se termine à _n

source: _ is even, then _n
fr_fr: _ est pair, alors _n

source: _ is odd, then _n
fr_fr: _ est impair, alors _n

source: For example, beginning with _n
fr_fr: Par exemple, en commençant avec _n

source: 3 is odd, so _n
fr_fr: 3 est impair, donc _n

source: 10 is even, so _n
fr_fr: 10 est pair, donc _n

source: 5 is odd, so _n
fr_fr: 5 est impair, donc _n

source: 16 is even, so _n
fr_fr: 16 est pair, donc _n

source: 8 is even, so _n
fr_fr: 8 est pair, donc _n

source: 4 is even, so _n
fr_fr: 4 est pair, donc _n

source: 2 is even, so _n
fr_fr: 2 est pair, donc _n

source: _ = 1; and
fr_fr: _ = 1 ; et

source: the sequence terminates.
fr_fr: la suite se termine.

source: Write a function to calculate the length of the collatz sequence for a given initial `n`.
fr_fr: Écrire une fonction qui calcule la longueur de la suite de Collatz pour une valeur initiale `n`.

source: /// Determine the length of the collatz sequence beginning at `n`.
fr_fr: /// Déterminer la longueur de la suite de Collatz qui commence à `n`.

source: Welcome Back
fr_fr: Bon retour

source: A value of the array type `[T; N]` holds `N` (a compile-time constant) elements of the same type `T`. Note that the length of the array is _part of its type_, which means that `[u8; 3]` and `[u8; 4]` are considered two different types. Slices, which have a size determined at runtime, are covered later.
fr_fr: Une valeur de type tableau `[T; N]` contient `N` éléments (constante connue à la compilation) de type `T`. Notez que la taille du tableau fait _partie de son type_, ce qui signifie que `[u8; 3]` et `[u8; 4]` sont considérés comme deux types différents. Les tranches (slices), dont la taille est déterminée à l’exécution, seront abordées plus tard.

source: Try accessing an out-of-bounds array element. Array accesses are checked at runtime. Rust can usually optimize these checks away, and they can be avoided using unsafe Rust.
fr_fr: Essayez d’accéder à un élément hors limites dans un tableau. Ces accès sont vérifiés à l’exécution. Rust peut souvent optimiser ces vérifications, et elles peuvent être contournées en utilisant du code Rust non sécurisé (`unsafe`).

source: We can use literals to assign values to arrays.
fr_fr: On peut utiliser des littéraux pour affecter des valeurs à des tableaux.

source: The `println!` macro asks for the debug implementation with the `?` format parameter: `{}` gives the default output, `{:?}` gives the debug output. Types such as integers and strings implement the default output, but arrays only implement the debug output. This means that we must use debug output here.
fr_fr: La macro `println!` demande l’implémentation de formatage debug avec le paramètre `?` : `{}` donne le format par défaut, `{:?}` donne le format debug. Des types comme les entiers et les chaînes implémentent le format par défaut, mais les tableaux implémentent uniquement le format debug. Il faut donc utiliser le format debug ici.

source: Adding `#`, eg `{a:#?}`, invokes a "pretty printing" format, which can be easier to read.
fr_fr: Ajouter `#`, par exemple `{a:#?}`, active un affichage formaté plus lisible, dit "joli affichage" (pretty printing).

source: Like arrays, tuples have a fixed length.
fr_fr: Comme les tableaux, les tuples ont une longueur fixe.

source: Tuples group together values of different types into a compound type.
fr_fr: Les tuples regroupent des valeurs de types différents en un type composé.

source: Fields of a tuple can be accessed by the period and the index of the value, e.g. `t.0`, `t.1`.
fr_fr: Les champs d’un tuple peuvent être accédés à l’aide du point et de l’index de la valeur, par exemple `t.0`, `t.1`.

source: The empty tuple `()` is referred to as the "unit type" and signifies absence of a return value, akin to `void` in other languages.
fr_fr: Le tuple vide `()` est appelé le « type unité » et représente l’absence de valeur de retour, comme `void` dans d’autres langages.

source: The `for` statement supports iterating over arrays (but not tuples).
fr_fr: L’instruction `for` permet d’itérer sur des tableaux (mais pas sur des tuples).

source: This functionality uses the `IntoIterator` trait, but we haven't covered that yet.
fr_fr: Cette fonctionnalité repose sur le trait `IntoIterator`, qui sera abordé plus tard.

source: The `assert_ne!` macro is new here. There are also `assert_eq!` and `assert!` macros. These are always checked while, debug-only variants like `debug_assert!` compile to nothing in release builds.
fr_fr: La macro `assert_ne!` est nouvelle ici. Il existe aussi les macros `assert_eq!` et `assert!`. Celles-ci sont toujours vérifiées, alors que les variantes spécifiques au débogage comme `debug_assert!` ne sont pas compilées dans les versions de production.

source: When working with tuples and other structured values it's common to want to extract the inner values into local variables. This can be done manually by directly accessing the inner values:
fr_fr: Lorsque l’on travaille avec des tuples ou d’autres structures, il est courant de vouloir extraire les valeurs internes dans des variables locales. Cela peut se faire manuellement en accédant directement aux valeurs internes :

source: "left: {left}, right: {right}"
fr_fr: "gauche : {left}, droite : {right}"

source: However, Rust also supports using pattern matching to destructure a larger value into its constituent parts:
fr_fr: Cependant, Rust permet également d'utiliser le pattern matching pour décomposer une valeur plus grande en ses parties constitutives :

source: The patterns used here are "irrefutable", meaning that the compiler can statically verify that the value on the right of `=` has the same structure as the pattern.
fr_fr: Les motifs utilisés ici sont « irréfutables », ce qui signifie que le compilateur peut vérifier statiquement que la valeur à droite de `=` a la même structure que le motif.

source: A variable name is an irrefutable pattern that always matches any value, hence why we can also use `let` to declare a single variable.
fr_fr: Un nom de variable est un motif irréfutable qui correspond toujours à une valeur, c'est pourquoi on peut aussi utiliser `let` pour déclarer une seule variable.

source: Rust also supports using patterns in conditionals, allowing for equality comparison and destructuring to happen at the same time. This form of pattern matching will be discussed in more detail later.
fr_fr: Rust permet également d'utiliser des motifs dans les instructions conditionnelles, ce qui autorise une comparaison et une déstructuration simultanées. Cette forme de pattern matching sera abordée plus en détail plus tard.

source: Edit the examples above to show the compiler error when the pattern doesn't match the value being matched on.
fr_fr: Modifiez les exemples ci-dessus pour faire apparaître l'erreur de compilation lorsque le motif ne correspond pas à la valeur correspondante.

source: Arrays can contain other arrays:
fr_fr: Les tableaux peuvent contenir d'autres tableaux :

source: What is the type of this variable?
fr_fr: Quel est le type de cette variable ?

source: Use an array such as the above to write a function `transpose` which will transpose a matrix (turn rows into columns):
fr_fr: Utilisez un tableau comme ci-dessus pour écrire une fonction `transpose` qui transposera une matrice (c’est-à-dire transformera les lignes en colonnes) :

source: Hard-code both functions to operate on 3 × 3 matrices.
fr_fr: Codez en dur les deux fonctions pour qu’elles opèrent sur des matrices 3 × 3.

source: Copy the code below to <https://play.rust-lang.org/> and implement the functions:
fr_fr: Copiez le code ci-dessous sur <https://play.rust-lang.org/> et implémentez les fonctions :

source: // TODO: remove this when you're done with your implementation.
fr_fr: // TODO : Supprimez ceci une fois que vous avez terminé votre implémentation.

source: // <-- the comment makes rustfmt add a newline
fr_fr: // <-- le commentaire fait ajouter une nouvelle ligne par rustfmt
