Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: Types implement [`From`](https://doc.rust-lang.org/std/convert/trait.From.html) and [`Into`](https://doc.rust-lang.org/std/convert/trait.Into.html) to facilitate type conversions:
fr_fr: Les types implémentent [`From`](https://doc.rust-lang.org/std/convert/trait.From.html) et [`Into`](https://doc.rust-lang.org/std/convert/trait.Into.html) afin de faciliter les conversions de type :

source: [`Into`](https://doc.rust-lang.org/std/convert/trait.Into.html) is automatically implemented when [`From`](https://doc.rust-lang.org/std/convert/trait.From.html) is implemented:
fr_fr: [`Into`](https://doc.rust-lang.org/std/convert/trait.Into.html) est implémenté automatiquement dès lors que [`From`](https://doc.rust-lang.org/std/convert/trait.From.html) l’est :

source: That's why it is common to only implement `From`, as your type will get `Into` implementation too.
fr_fr: C’est pourquoi il est courant de n’implémenter que `From`, puisque `Into` en découle automatiquement.

source: When declaring a function argument input type like "anything that can be converted into a `String`", the rule is opposite, you should use `Into`. Your function will accept types that implement `From` and those that _only_ implement `Into`.
fr_fr: Lorsqu’un argument de fonction doit accepter "n’importe quoi pouvant être converti en `String`", il faut utiliser `Into`. Cela permettra d’accepter les types qui implémentent `From`, mais aussi ceux qui n’implémentent que `Into`.

source: Rust has no _implicit_ type conversions, but does support explicit casts with `as`. These generally follow C semantics where those are defined.
fr_fr: Rust ne propose pas de conversions de type _implicites_, mais permet les conversions explicites avec `as`. Celles-ci suivent généralement les sémantiques du langage C lorsque celles-ci sont définies.

source: "as u16: {}"
fr_fr: "en u16 : {}"

source: "as i16: {}"
fr_fr: "en i16 : {}"

source: "as u8: {}"
fr_fr: "en u8 : {}"

source: The results of `as` are _always_ defined in Rust and consistent across platforms. This might not match your intuition for changing sign or casting to a smaller type -- check the docs, and comment for clarity.
fr_fr: Les résultats de `as` sont _toujours_ définis en Rust et cohérents sur toutes les plateformes. Cela peut aller à l’encontre de votre intuition (changement de signe ou réduction de taille) — consultez la documentation et commentez pour clarifier.

source: Casting with `as` is a relatively sharp tool that is easy to use incorrectly, and can be a source of subtle bugs as future maintenance work changes the types that are used or the ranges of values in types. Casts are best used only when the intent is to indicate unconditional truncation (e.g. selecting the bottom 32 bits of a `u64` with `as u32`, regardless of what was in the high bits).
fr_fr: Le cast avec `as` est un outil puissant mais risqué, facile à mal utiliser, et source de bugs subtils si les types changent ou si les plages de valeurs évoluent. Il est préférable de l’utiliser uniquement lorsqu’il est clair qu’on souhaite tronquer (ex. : sélectionner les 32 bits bas d’un `u64` via `as u32`).

source: For infallible casts (e.g. `u32` to `u64`), prefer using `From` or `Into` over `as` to confirm that the cast is in fact infallible. For fallible casts, `TryFrom` and `TryInto` are available when you want to handle casts that fit differently from those that don't.
fr_fr: Pour les conversions sans risque (par ex. `u32` vers `u64`), préférez `From` ou `Into` à `as`, pour confirmer que la conversion est sûre. Pour les conversions faillibles, utilisez `TryFrom` et `TryInto` si vous voulez gérer les cas qui passent et ceux qui échouent.

source: Consider taking a break after this slide.
fr_fr: Pensez à faire une pause après cette diapositive.

source: `as` is similar to a C++ static cast. Use of `as` in cases where data might be lost is generally discouraged, or at least deserves an explanatory comment.
fr_fr: `as` est similaire à un cast statique en C++. Son usage dans des cas où des données pourraient être perdues est déconseillé, ou nécessite au minimum un commentaire explicite.

source: This is common in casting integers to `usize` for use as an index.
fr_fr: Cela est fréquent lorsqu’on cast un entier vers `usize` pour l’utiliser comme index.

source: Using [`Read`](https://doc.rust-lang.org/std/io/trait.Read.html) and [`BufRead`](https://doc.rust-lang.org/std/io/trait.BufRead.html), you can abstract over `u8` sources:
fr_fr: Grâce à [`Read`](https://doc.rust-lang.org/std/io/trait.Read.html) et [`BufRead`](https://doc.rust-lang.org/std/io/trait.BufRead.html), on peut abstraire la lecture de sources de type `u8` :

source: "lines in slice: {}"
fr_fr: "lignes dans la tranche : {}"

source: "lines in file: {}"
fr_fr: "lignes dans le fichier : {}"

source: Similarly, [`Write`](https://doc.rust-lang.org/std/io/trait.Write.html) lets you abstract over `u8` sinks:
fr_fr: De même, [`Write`](https://doc.rust-lang.org/std/io/trait.Write.html) permet d’abstraire l’écriture vers des destinations `u8` :

source: "Logged: {:?}"
fr_fr: "Enregistré : {:?}"

source: The `Default` Trait
fr_fr: Le trait `Default`

source: [`Default`](https://doc.rust-lang.org/std/default/trait.Default.html) trait produces a default value for a type.
fr_fr: Le trait [`Default`](https://doc.rust-lang.org/std/default/trait.Default.html) permet de fournir une valeur par défaut pour un type.

source: "Y is set!"
fr_fr: "Y est défini !"

source: It can be implemented directly or it can be derived via `#[derive(Default)]`.
fr_fr: Il peut être implémenté manuellement ou automatiquement via `#[derive(Default)]`.

source: A derived implementation will produce a value where all fields are set to their default values.
fr_fr: Une implémentation dérivée produira une instance dont tous les champs seront initialisés à leur valeur par défaut.

source: This means all types in the struct must implement `Default` too.
fr_fr: Cela implique que tous les types présents dans la structure doivent eux aussi implémenter `Default`.

source: Standard Rust types often implement `Default` with reasonable values (e.g. `0`, `""`, etc).
fr_fr: Les types standards de Rust implémentent souvent `Default` avec des valeurs judicieuses (comme `0`, `""`, etc.).

source: The partial struct initialization works nicely with default.
fr_fr: L’initialisation partielle des structures fonctionne bien avec `Default`.

source: The Rust standard library is aware that types can implement `Default` and provides convenience methods that use it.
fr_fr: La bibliothèque standard de Rust reconnaît les types qui implémentent `Default` et propose des méthodes utilitaires qui l’exploitent.

source: The `..` syntax is called [struct update syntax](https://doc.rust-lang.org/book/ch05-01-defining-structs.html#creating-instances-from-other-instances-with-struct-update-syntax).
fr_fr: La syntaxe `..` est appelée [mise à jour de structure](https://doc.rust-lang.org/book/ch05-01-defining-structs.html#creating-instances-from-other-instances-with-struct-update-syntax).

source: Closures or lambda expressions have types which cannot be named. However, they implement special [`Fn`](https://doc.rust-lang.org/std/ops/trait.Fn.html), [`FnMut`](https://doc.rust-lang.org/std/ops/trait.FnMut.html), and [`FnOnce`](https://doc.rust-lang.org/std/ops/trait.FnOnce.html) traits:
fr_fr: Les fermetures (ou lambdas) ont des types anonymes, mais elles implémentent les traits spécifiques [`Fn`](https://doc.rust-lang.org/std/ops/trait.Fn.html), [`FnMut`](https://doc.rust-lang.org/std/ops/trait.FnMut.html) et [`FnOnce`](https://doc.rust-lang.org/std/ops/trait.FnOnce.html) :

source: "Calling function on {input}"
fr_fr: "Appel de la fonction sur {input}"

source: An `Fn` (e.g. `add_3`) neither consumes nor mutates captured values, or perhaps captures nothing at all. It can be called multiple times concurrently.
fr_fr: Un `Fn` (par ex. `add_3`) ne consomme ni ne modifie les valeurs capturées, voire ne capture rien. Il peut être appelé plusieurs fois simultanément.

source: An `FnMut` (e.g. `accumulate`) might mutate captured values. You can call it multiple times, but not concurrently.
fr_fr: Un `FnMut` (par ex. `accumulate`) peut modifier les valeurs capturées. Il peut être appelé plusieurs fois, mais pas en parallèle.

source: If you have an `FnOnce` (e.g. `multiply_sum`), you may only call it once. It might consume captured values.
fr_fr: Un `FnOnce` (par ex. `multiply_sum`) ne peut être appelé qu’une seule fois, car il peut consommer les valeurs capturées.

source: `FnMut` is a subtype of `FnOnce`. `Fn` is a subtype of `FnMut` and `FnOnce`. I.e. you can use an `FnMut` wherever an `FnOnce` is called for, and you can use an `Fn` wherever an `FnMut` or `FnOnce` is called for.
fr_fr: `FnMut` est un sous-type de `FnOnce`, et `Fn` est un sous-type de `FnMut` et `FnOnce`. Autrement dit, un `Fn` peut être utilisé partout où un `FnMut` ou un `FnOnce` est attendu, et un `FnMut` partout où un `FnOnce` est requis.

source: When you define a function that takes a closure, you should take `FnOnce` if you can (i.e. you call it once), or `FnMut` else, and last `Fn`. This allows the most flexibility for the caller.
fr_fr: Quand vous définissez une fonction prenant une fermeture, utilisez `FnOnce` si vous l’appelez une seule fois, sinon `FnMut`, et enfin `Fn`. Cela permet plus de flexibilité pour l’appelant.

source: In contrast, when you have a closure, the most flexible you can have is `Fn` (it can be passed everywhere), then `FnMut`, and lastly `FnOnce`.
fr_fr: À l’inverse, du côté des fermetures, la plus flexible est `Fn` (passe partout), suivie de `FnMut`, puis `FnOnce`.

source: The compiler also infers `Copy` (e.g. for `add_3`) and `Clone` (e.g. `multiply_sum`), depending on what the closure captures.
fr_fr: Le compilateur peut aussi inférer `Copy` (comme pour `add_3`) et `Clone` (comme pour `multiply_sum`), selon ce que la fermeture capture.

source: By default, closures will capture by reference if they can. The `move` keyword makes them capture by value.
fr_fr: Par défaut, les fermetures capturent par référence si possible. Le mot-clé `move` force une capture par valeur.

source: "Hi"
fr_fr: "Salut"

source: In this example, you will implement the classic ["ROT13" cipher](https://en.wikipedia.org/wiki/ROT13). Copy this code to the playground, and implement the missing bits. Only rotate ASCII alphabetic characters, to ensure the result is still valid UTF-8.
fr_fr: Dans cet exemple, vous implémenterez le chiffrement classique [ROT13](https://en.wikipedia.org/wiki/ROT13). Copiez le code dans le playground et complétez les parties manquantes. Ne chiffrez que les caractères alphabétiques ASCII pour garantir un résultat valide en UTF-8.

source: // Implement the `Read` trait for `RotDecoder`.
fr_fr: // Implémentez le trait `Read` pour `RotDecoder`.

source: What happens if you chain two `RotDecoder` instances together, each rotating by 13 characters?
fr_fr: Que se passe-t-il si vous enchaînez deux instances de `RotDecoder`, chacune tournant de 13 caractères ?

source: Welcome to Day 3
fr_fr: Bienvenue au jour 3

source: Today, we will cover:
fr_fr: Aujourd’hui, nous aborderons :

source: Memory management, lifetimes, and the borrow checker: how Rust ensures memory safety.
fr_fr: La gestion de la mémoire, les durées de vie (`lifetimes`) et le vérificateur d’emprunts (`borrow checker`) : comment Rust garantit la sécurité mémoire.

source: Smart pointers: standard library pointer types.
fr_fr: Pointeurs intelligents : les types de pointeurs de la bibliothèque standard.

source: Programs allocate memory in two ways:
fr_fr: Les programmes allouent la mémoire de deux manières :

source: Stack: Continuous area of memory for local variables.
fr_fr: Pile : zone continue de mémoire pour les variables locales.

source: Values have fixed sizes known at compile time.
fr_fr: Les valeurs ont des tailles fixes connues à la compilation.

source: Extremely fast: just move a stack pointer.
fr_fr: Extrêmement rapide : il suffit de déplacer un pointeur de pile.

source: Easy to manage: follows function calls.
fr_fr: Facile à gérer : suit les appels de fonction.

source: Great memory locality.
fr_fr: Excellente localité mémoire.

source: Heap: Storage of values outside of function calls.
fr_fr: Tas : stockage des valeurs en dehors des appels de fonction.

source: Values have dynamic sizes determined at runtime.
fr_fr: Les valeurs ont des tailles dynamiques déterminées à l'exécution.

source: Slightly slower than the stack: some book-keeping needed.
fr_fr: Un peu plus lent que la pile : nécessite un peu de gestion.

source: No guarantee of memory locality.
fr_fr: Aucune garantie de localité mémoire.

source: Creating a `String` puts fixed-sized metadata on the stack and dynamically sized data, the actual string, on the heap:
fr_fr: La création d'une `String` place des métadonnées de taille fixe sur la pile et les données de taille dynamique — la chaîne elle-même — sur le tas :

source: Mention that a `String` is backed by a `Vec`, so it has a capacity and length and can grow if mutable via reallocation on the heap.
fr_fr: Mentionnez qu’un `String` est basé sur un `Vec`, avec une capacité et une longueur, et peut croître s’il est mutable via une réallocation sur le tas.

source: If students ask about it, you can mention that the underlying memory is heap allocated using the [System Allocator](https://doc.rust-lang.org/std/alloc/struct.System.html) and custom allocators can be implemented using the [Allocator API](https://doc.rust-lang.org/std/alloc/index.html)
fr_fr: Si les étudiants posent la question, vous pouvez expliquer que la mémoire est allouée sur le tas via le [System Allocator](https://doc.rust-lang.org/std/alloc/struct.System.html), et qu’on peut implémenter des allocateurs personnalisés avec l’[Allocator API](https://doc.rust-lang.org/std/alloc/index.html).

source: We can inspect the memory layout with `unsafe` Rust. However, you should point out that this is rightfully unsafe!
fr_fr: On peut inspecter l’organisation mémoire avec du Rust `unsafe`. Cependant, insistez bien sur le fait que c’est à juste titre considéré comme dangereux !

source: "world"
fr_fr: "monde"

source: // DON'T DO THIS AT HOME! For educational purposes only. // String provides no guarantees about its layout, so this could lead to // undefined behavior.
fr_fr: // NE FAITES PAS ÇA CHEZ VOUS ! À des fins pédagogiques uniquement. // String ne garantit rien sur sa structure mémoire, cela pourrait // mener à un comportement indéfini.

source: "capacity = {capacity}, ptr = {ptr:#x}, len = {len}"
fr_fr: "capacité = {capacity}, ptr = {ptr:#x}, longueur = {len}"

source: Traditionally, languages have fallen into two broad categories:
fr_fr: Traditionnellement, les langages se répartissent en deux grandes catégories :

source: Full control via manual memory management: C, C++, Pascal, ...
fr_fr: Contrôle total via gestion manuelle de la mémoire : C, C++, Pascal, ...

source: Programmer decides when to allocate or free heap memory.
fr_fr: Le programmeur décide quand allouer ou libérer de la mémoire sur le tas.

source: Programmer must determine whether a pointer still points to valid memory.
fr_fr: Le programmeur doit déterminer si un pointeur pointe encore vers une mémoire valide.

source: Studies show, programmers make mistakes.
fr_fr: Les études montrent que les programmeurs font des erreurs.

source: Full safety via automatic memory management at runtime: Java, Python, Go, Haskell, ...
fr_fr: Sécurité maximale via gestion automatique de la mémoire à l'exécution : Java, Python, Go, Haskell, ...

source: A runtime system ensures that memory is not freed until it can no longer be referenced.
fr_fr: Un système d’exécution garantit que la mémoire n’est libérée que lorsqu’elle ne peut plus être référencée.

source: Typically implemented with reference counting, garbage collection, or RAII.
fr_fr: Typiquement implémenté via le comptage de références, le ramasse-miettes ou RAII.

source: Rust offers a new mix:
fr_fr: Rust propose une nouvelle approche hybride :

source: Full control _and_ safety via compile time enforcement of correct memory management.
fr_fr: Contrôle total _et_ sécurité assurée par la vérification, à la compilation, d’une gestion correcte de la mémoire.

source: It does this with an explicit ownership concept.
fr_fr: Cela repose sur un concept explicite de propriété.

source: This slide is intended to help students coming from other languages to put Rust in context.
fr_fr: Cette diapositive vise à aider les étudiants venant d’autres langages à situer Rust dans son contexte.

source: C must manage heap manually with `malloc` and `free`. Common errors include forgetting to call `free`, calling it multiple times for the same pointer, or dereferencing a pointer after the memory it points to has been freed.
fr_fr: En C, la gestion du tas se fait manuellement avec `malloc` et `free`. Les erreurs courantes incluent l’oubli d’un `free`, un double `free`, ou la déréférence d’un pointeur vers une mémoire déjà libérée.

source: C++ has tools like smart pointers (`unique_ptr`, `shared_ptr`) that take advantage of language guarantees about calling destructors to ensure memory is freed when a function returns. It is still quite easy to mis-use these tools and create similar bugs to C.
fr_fr: C++ offre des outils comme les pointeurs intelligents (`unique_ptr`, `shared_ptr`) qui s’appuient sur les garanties du langage pour appeler les destructeurs et libérer la mémoire. Il reste toutefois facile de mal les utiliser et de rencontrer les mêmes erreurs qu’en C.

source: Java, Go, and Python rely on the garbage collector to identify memory that is no longer reachable and discard it. This guarantees that any pointer can be dereferenced, eliminating use-after-free and other classes of bugs. But, GC has a runtime cost and is difficult to tune properly.
fr_fr: Java, Go et Python utilisent un ramasse-miettes pour détecter et libérer la mémoire devenue inaccessible. Cela garantit que les pointeurs sont toujours valides, éliminant les erreurs de type use-after-free. Mais le GC a un coût à l’exécution et peut être difficile à ajuster.

source: Rust's ownership and borrowing model can, in many cases, get the performance of C, with alloc and free operations precisely where they are required -- zero cost. It also provides tools similar to C++'s smart pointers. When required, other options such as reference counting are available, and there are even third-party crates available to support runtime garbage collection (not covered in this class).
fr_fr: Le modèle de possession et d’emprunt de Rust permet souvent d’atteindre les performances du C, avec des allocations/libérations exactement là où c’est nécessaire — sans surcoût. Rust fournit aussi des outils comparables aux pointeurs intelligents de C++. Quand il le faut, des solutions comme le comptage de références sont disponibles, voire des crates tierces pour intégrer un GC (non couvert ici).

source: All variable bindings have a _scope_ where they are valid and it is an error to use a variable outside its scope:
fr_fr: Toutes les liaisons de variables ont une _portée_ dans laquelle elles sont valides. Utiliser une variable hors de sa portée est une erreur :

source: We say that the variable _owns_ the value. Every Rust value has precisely one owner at all times.
fr_fr: On dit que la variable _possède_ la valeur. Chaque valeur en Rust a exactement un propriétaire à tout moment.

source: At the end of the scope, the variable is _dropped_ and the data is freed. A destructor can run here to free up resources.
fr_fr: À la fin de la portée, la variable est _abandonnée_ et les données sont libérées. Un destructeur peut s'exécuter à ce moment pour libérer des ressources.

source: Students familiar with garbage-collection implementations will know that a garbage collector starts with a set of "roots" to find all reachable memory. Rust's "single owner" principle is a similar idea.
fr_fr: Les étudiants familiers avec les ramasse-miettes savent qu’ils commencent avec un ensemble de « racines » pour retrouver toute la mémoire accessible. Le principe de Rust du « propriétaire unique » suit une logique similaire.

source: An assignment will transfer _ownership_ between variables:
fr_fr: Une affectation transfère la _propriété_ entre les variables :

source: "Hello!"
fr_fr: "Bonjour !"

source: The assignment of `s1` to `s2` transfers ownership.
fr_fr: L'affectation de `s1` à `s2` transfère la propriété.

source: When `s1` goes out of scope, nothing happens: it does not own anything.
fr_fr: Lorsque `s1` sort de sa portée, rien ne se passe : il ne possède plus rien.

source: When `s2` goes out of scope, the string data is freed.
fr_fr: Lorsque `s2` sort de sa portée, les données de la chaîne sont libérées.

source: Before move to `s2`:
fr_fr: Avant le transfert vers `s2` :

source: After move to `s2`:
fr_fr: Après le transfert vers `s2` :

source: ```bob Stack Heap .- - - - - - - - - - - - - -. .- - - - - - - - - - - - - - - - - - -. : : : : : s1 "(inaccessible)" : : : : +-----------+-------+ : : +----+----+----+----+----+----+ : : | ptr | o---+---+--+--+-->| H | e | l | l | o | ! | : : | len | 6 | : | : +----+----+----+----+----+----+ : : | capacity | 6 | : | : : : +-----------+-------+ : | : : : : | `- - - - - - - - - - - - - - - - - - -' : s2 : | : +-----------+-------+ : | : | ptr | o---+---+--' : | len | 6 | : : | capacity | 6 | : : +-----------+-------+ : : : `- - - - - - - - - - - - - -' ```
fr_fr: ```bob Pile Tas .- - - - - - - - - - - - - -. .- - - - - - - - - - - - - - - - - - -. : : : : : s1 "(inaccessible)" : : : : +-----------+-------+ : : +----+----+----+----+----+----+ : : | ptr | o---+---+--+--+-->| H | e | l | l | o | ! | : : | len | 6 | : | : +----+----+----+----+----+----+ : : | capacity | 6 | : | : : : +-----------+-------+ : | : : : : | `- - - - - - - - - - - - - - - - - - -' : s2 : | : +-----------+-------+ : | : | ptr | o---+---+--' : | len | 6 | : : | capacity | 6 | : : +-----------+-------+ : : : `- - - - - - - - - - - - - -' ```

source: When you pass a value to a function, the value is assigned to the function parameter. This transfers ownership:
fr_fr: Lorsque vous passez une valeur à une fonction, celle-ci est affectée au paramètre de la fonction. Cela transfère la propriété :

source: "Hello {name}"
fr_fr: "Bonjour {name}"

source: Mention that this is the opposite of the defaults in C++, which copies by value unless you use `std::move` (and the move constructor is defined!).
fr_fr: Préciser que cela est à l'opposé du comportement par défaut en C++, où la copie par valeur est utilisée sauf si on emploie `std::move` (et que le constructeur de déplacement est défini !).

source: It is only the ownership that moves. Whether any machine code is generated to manipulate the data itself is a matter of optimization, and such copies are aggressively optimized away.
fr_fr: Seule la possession est déplacée. Le compilateur peut ou non générer du code pour manipuler les données elles-mêmes, selon les optimisations.

source: Simple values (such as integers) can be marked `Copy` (see later slides).
fr_fr: Les valeurs simples (comme les entiers) peuvent être marquées `Copy` (voir plus loin).

source: In Rust, clones are explicit (by using `clone`).
fr_fr: En Rust, les clones sont explicites (via l'utilisation de `clone`).

source: In the `say_hello` example:
fr_fr: Dans l’exemple `say_hello` :

source: With the first call to `say_hello`, `main` gives up ownership of `name`. Afterwards, `name` cannot be used anymore within `main`.
fr_fr: Lors du premier appel à `say_hello`, `main` cède la propriété de `name`. Par la suite, `name` ne peut plus être utilisé dans `main`.
