Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: [Rust for Embedded C Programmers](https://docs.opentitan.org/doc/ug/rust_for_c/): covers Rust from the perspective of developers who write firmware in C.
fr_fr: \[Rust pour Programmeurs C Embarqué\] (https://docs.opentitan.org/doc/ug/rust_for_c/) : couvre Rust du point de vue des développeurs qui écrivent des firmwares en C.

source: [Rust for professionals](https://overexact.com/rust-for-professionals/): covers the syntax of Rust using side-by-side comparisons with other languages such as C, C++, Java, JavaScript, and Python.
fr_fr: [Rust for professionals](https://overexact.com/rust-for-professionals/) : couvre la syntaxe de Rust au moyen de comparaisons côte à côte avec d’autres langages comme C, C++, Java, JavaScript et Python.

source: [Rust on Exercism](https://exercism.org/tracks/rust): 100+ exercises to help you learn Rust.
fr_fr: [Rust sur Exercism](https://exercism.org/tracks/rust) : plus de 100 exercices pour apprendre Rust.

source: [Ferrous Teaching Material](https://ferrous-systems.github.io/teaching-material/index.html): a series of small presentations covering both basic and advanced part of the Rust language. Other topics such as WebAssembly, and async/await are also covered.
fr_fr: \[Matériel de Ferrous Teaching\] (https://ferrous-systems.github.io/teaching-material/index.html) : un série de petites présentations couvrant à la fois la partie de base et avancée de Rust. D'autres sujets tels que WebAssembly et async/wait sont également couvert.

source: [Beginner's Series to Rust](https://docs.microsoft.com/en-us/shows/beginners-series-to-rust/) and [Take your first steps with Rust](https://docs.microsoft.com/en-us/learn/paths/rust-first-steps/): two Rust guides aimed at new developers. The first is a set of 35 videos and the second is a set of 11 modules which covers Rust syntax and basic constructs.
fr_fr: [Beginner's Series to Rust](https://docs.microsoft.com/en-us/shows/beginners-series-to-rust/) et [Take your first steps with Rust](https://docs.microsoft.com/en-us/learn/paths/rust-first-steps/) : deux guides Rust destinés aux débutants. Le premier est une série de 35 vidéos, et le second un parcours de 11 modules couvrant la syntaxe de Rust et ses constructions de base.

source: [Learn Rust With Entirely Too Many Linked Lists](https://rust-unofficial.github.io/too-many-lists/): in-depth exploration of Rust's memory management rules, through implementing a few different types of list structures.
fr_fr: [Learn Rust With Entirely Too Many Linked Lists](https://rust-unofficial.github.io/too-many-lists/) : exploration approfondie des règles de gestion mémoire de Rust, via l’implémentation de plusieurs types de listes chaînées.

source: Please see the [Little Book of Rust Books](https://lborb.github.io/book/) for even more Rust books.
fr_fr: Consultez le [Little Book of Rust Books](https://lborb.github.io/book/) pour découvrir encore plus de livres sur Rust.

source: The material here builds on top of the many great sources of Rust documentation. See the page on [other resources](other-resources.md) for a full list of useful resources.
fr_fr: Le contenu présenté ici s’appuie sur de nombreuses excellentes sources de documentation Rust. Consultez la page [autres ressources](other-resources.md) pour une liste complète.

source: The material of Comprehensive Rust is licensed under the terms of the Apache 2.0 license, please see [`LICENSE`](https://github.com/google/comprehensive-rust/blob/main/LICENSE) for details.
fr_fr: Le contenu du cours Comprehensive Rust est sous licence Apache 2.0. Consultez le fichier [`LICENSE`](https://github.com/google/comprehensive-rust/blob/main/LICENSE) pour plus d’informations.

source: Some examples and exercises have been copied and adapted from [Rust by Example](https://doc.rust-lang.org/rust-by-example/). Please see the `third_party/rust-by-example/` directory for details, including the license terms.
fr_fr: Certains exemples et exercices ont été copiés et adaptés de [Rust by Example](https://doc.rust-lang.org/rust-by-example/). Voir le répertoire `third_party/rust-by-example/` pour plus de détails, y compris les conditions de licence.

source: Rust on Exercism
fr_fr: Rust sur Exercism

source: Some exercises have been copied and adapted from [Rust on Exercism](https://exercism.org/tracks/rust). Please see the `third_party/rust-on-exercism/` directory for details, including the license terms.
fr_fr: Certains exercices ont été copiés et adaptés de \[Rust on Exercism\] (https://exercism.org/tracks/rust). Veuillez consulter le Répertoire `third_party/rust-on-exercism/` pour plus de détails, y compris les conditions de la licence.

source: The [Interoperability with C++](android/interoperability/cpp.md) section uses an image from [CXX](https://cxx.rs/). Please see the `third_party/cxx/` directory for details, including the license terms.
fr_fr: La section [Interopérabilité avec C++](android/interoperability/cpp.md) utilise une image provenant de [CXX](https://cxx.rs/). Consultez le répertoire `third_party/cxx/` pour plus d’informations, y compris les termes de la licence.
