Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: If `cargo add` fails with `error: no such subcommand`, then please edit the `Cargo.toml` file by hand. Add the dependencies listed below.
fr_fr: Si `cargo add` échoue avec `error: no such subcommand`, veuillez modifier manuellement le fichier `Cargo.toml`. Ajoutez-y les dépendances ci-dessous.

source: The `cargo add` calls will update the `Cargo.toml` file to look like this:
fr_fr: Les appels à `cargo add` mettront à jour le fichier `Cargo.toml` pour qu’il ressemble à ceci :

source: You can now download the start page. Try with a small site such as `https://www.google.org/`.
fr_fr: Vous pouvez maintenant télécharger la page de départ. Essayez avec un petit site comme `https://www.google.org/`.

source: Your `src/main.rs` file should look something like this:
fr_fr: Votre fichier `src/main.rs` devrait ressembler à ceci :

source: "request error: {0}"
fr_fr: "erreur de requête : {0}"

source: "bad http response: {0}"
fr_fr: "réponse HTTP invalide : {0}"

source: "Checking {:#}"
fr_fr: "Vérification de {:#}"

source: "On {base_url:#}: ignored unparsable {href:?}: {err}"
fr_fr: "Sur {base_url:#} : lien non analysable ignoré {href:?} : {err}"

source: "Links: {links:#?}"
fr_fr: "Liens : {links:#?}"

source: "Could not extract links: {err:#}"
fr_fr: "Impossible d’extraire les liens : {err:#}"

source: Run the code in `src/main.rs` with
fr_fr: Exécutez le code dans `src/main.rs` avec

source: Use threads to check the links in parallel: send the URLs to be checked to a channel and let a few threads check the URLs in parallel.
fr_fr: Utilisez des threads pour vérifier les liens en parallèle : envoyez les URL à vérifier dans un canal, et laissez quelques threads les traiter simultanément.

source: Extend this to recursively extract links from all pages on the `www.google.org` domain. Put an upper limit of 100 pages or so so that you don't end up being blocked by the site.
fr_fr: Étendez le programme pour qu’il explore récursivement les liens sur toutes les pages du domaine `www.google.org`. Fixez une limite d’environ 100 pages pour éviter d’être bloqué par le site.

source: Concurrency Morning Exercise
fr_fr: Exercice du matin : Concurrence

source: ([back to exercise](dining-philosophers.md))
fr_fr: ([retour à l’exercice](dining-philosophers.md))

source: "{} is trying to eat"
fr_fr: "{} essaie de manger"

source: // To avoid a deadlock, we have to break the symmetry // somewhere. This will swap the forks without deinitializing // either of them.
fr_fr: // Pour éviter un interblocage, il faut briser la symétrie // quelque part. Cela échange les fourchettes sans désinitialiser // aucune d’entre elles.

source: Link Checker
fr_fr: Vérificateur de liens

source: ([back to exercise](link-checker.md))
fr_fr: ([retour à l’exercice](link-checker.md))

source: /// Determine whether links within the given page should be extracted.
fr_fr: /// Déterminer si les liens de la page donnée doivent être extraits.

source: /// Mark the given page as visited, returning false if it had already /// been visited.
fr_fr: // Marque la page donnée comme visitée, renvoie false si elle l’avait déjà /// été.

source: // The sender got dropped. No more commands coming in.
fr_fr: // L’émetteur a été supprimé. Plus aucune commande n’arrivera.

source: "Got crawling error: {:#}"
fr_fr: "Erreur lors de l'exploration : {:#}"

source: "Bad URLs: {:#?}"
fr_fr: "URLs invalides : {:#?}"

source: Async Rust
fr_fr: Rust asynchrone

source: "Async" is a concurrency model where multiple tasks are executed concurrently by executing each task until it would block, then switching to another task that is ready to make progress. The model allows running a larger number of tasks on a limited number of threads. This is because the per-task overhead is typically very low and operating systems provide primitives for efficiently identifying I/O that is able to proceed.
fr_fr: « Async » est un modèle de concurrence dans lequel plusieurs tâches sont exécutées en parallèle en les exécutant chacune jusqu'à ce qu'elles bloquent, puis en passant à une autre tâche prête à progresser. Ce modèle permet d’exécuter un grand nombre de tâches avec un nombre limité de threads, car la surcharge par tâche est très faible et les systèmes d’exploitation fournissent des primitives permettant d’identifier efficacement les opérations d’E/S prêtes à s’exécuter.

source: Rust's asynchronous operation is based on "futures", which represent work that may be completed in the future. Futures are "polled" until they signal that they are complete.
fr_fr: L’asynchronisme en Rust repose sur les « futures », qui représentent un travail susceptible de se terminer ultérieurement. Les futures sont interrogées (« polled ») jusqu’à ce qu’elles indiquent être terminées.

source: Futures are polled by an async runtime, and several different runtimes are available.
fr_fr: Les futures sont interrogées par un runtime asynchrone, et plusieurs runtimes sont disponibles.

source: Python has a similar model in its `asyncio`. However, its `Future` type is callback-based, and not polled. Async Python programs require a "loop", similar to a runtime in Rust.
fr_fr: Python propose un modèle similaire avec `asyncio`. Cependant, son type `Future` repose sur des callbacks, et non sur une interrogation. Les programmes async en Python nécessitent une « boucle » (event loop), similaire à un runtime en Rust.

source: JavaScript's `Promise` is similar, but again callback-based. The language runtime implements the event loop, so many of the details of Promise resolution are hidden.
fr_fr: Les `Promise` de JavaScript sont similaires, mais elles reposent aussi sur des callbacks. La boucle d’événements est gérée par le runtime du langage, ce qui cache beaucoup de détails de leur résolution.

source: At a high level, async Rust code looks very much like "normal" sequential code:
fr_fr: À un haut niveau, le code async en Rust ressemble fortement à du code séquentiel « normal » :

source: "Count is: {i}!"
fr_fr: "Le compteur est à : {i} !"

source: Note that this is a simplified example to show the syntax. There is no long running operation or any real concurrency in it!
fr_fr: Notez que cet exemple est simplifié pour illustrer la syntaxe. Il ne comporte aucune opération longue ni véritable concurrence !

source: What is the return type of an async call?
fr_fr: Quel est le type de retour d’un appel async ?

source: Use `let future: () = async_main(10);` in `main` to see the type.
fr_fr: Utilisez `let future: () = async_main(10);` dans `main` pour voir le type.

source: The "async" keyword is syntactic sugar. The compiler replaces the return type with a future.
fr_fr: Le mot-clé `async` est du sucre syntaxique. Le compilateur remplace le type de retour par un future.

source: You cannot make `main` async, without additional instructions to the compiler on how to use the returned future.
fr_fr: On ne peut pas rendre `main` async sans fournir des instructions supplémentaires au compilateur sur la manière d’exécuter le future retourné.

source: You need an executor to run async code. `block_on` blocks the current thread until the provided future has run to completion.
fr_fr: Un exécuteur est nécessaire pour exécuter du code async. `block_on` bloque le thread courant jusqu’à ce que le future fourni soit terminé.

source: `.await` asynchronously waits for the completion of another operation. Unlike `block_on`, `.await` doesn't block the current thread.
fr_fr: `.await` attend de manière asynchrone la fin d’une autre opération. Contrairement à `block_on`, `.await` ne bloque pas le thread courant.

source: `.await` can only be used inside an `async` function (or block; these are introduced later).
fr_fr: `.await` ne peut être utilisé que dans une fonction (ou un bloc) `async` (ceux-ci seront présentés plus tard).

source: [`Future`](https://doc.rust-lang.org/std/future/trait.Future.html) is a trait, implemented by objects that represent an operation that may not be complete yet. A future can be polled, and `poll` returns a [`Poll`](https://doc.rust-lang.org/std/task/enum.Poll.html).
fr_fr: Un [`Future`](https://doc.rust-lang.org/std/future/trait.Future.html) est un trait, implémenté par des objets représentant une opération qui peut ne pas être encore terminée. Un future peut être interrogé avec `poll`, qui renvoie un [`Poll`](https://doc.rust-lang.org/std/task/enum.Poll.html).

source: An async function returns an `impl Future`. It's also possible (but uncommon) to implement `Future` for your own types. For example, the `JoinHandle` returned from `tokio::spawn` implements `Future` to allow joining to it.
fr_fr: Une fonction async retourne un `impl Future`. Il est également possible (mais peu courant) d’implémenter `Future` pour vos propres types. Par exemple, le `JoinHandle` retourné par `tokio::spawn` implémente `Future` afin de permettre l'attente de sa fin.

source: The `.await` keyword, applied to a Future, causes the current async function to pause until that Future is ready, and then evaluates to its output.
fr_fr: Le mot-clé `.await`, appliqué à un Future, fait suspendre la fonction async en cours jusqu’à ce que le Future soit prêt, puis évalue sa sortie.

source: The `Future` and `Poll` types are implemented exactly as shown; click the links to show the implementations in the docs.
fr_fr: Les types `Future` et `Poll` sont implémentés exactement comme montré ; cliquez sur les liens pour consulter leur implémentation dans la documentation.

source: We will not get to `Pin` and `Context`, as we will focus on writing async code, rather than building new async primitives. Briefly:
fr_fr: Nous ne traiterons pas de `Pin` ni de `Context`, car nous nous concentrerons sur l’écriture de code async plutôt que sur la création de primitives asynchrones. En bref :

source: `Context` allows a Future to schedule itself to be polled again when an event occurs.
fr_fr: `Context` permet à un Future de demander à être interrogé à nouveau lorsqu’un événement se produit.

source: `Pin` ensures that the Future isn't moved in memory, so that pointers into that future remain valid. This is required to allow references to remain valid after an `.await`.
fr_fr: `Pin` garantit qu’un Future ne sera pas déplacé en mémoire, de sorte que les pointeurs vers celui-ci restent valides. Cela est nécessaire pour conserver des références valides après un `.await`.

source: A _runtime_ provides support for performing operations asynchronously (a _reactor_) and is responsible for executing futures (an _executor_). Rust does not have a "built-in" runtime, but several options are available:
fr_fr: Un _runtime_ permet l'exécution d'opérations asynchrones (un _réacteur_) et est responsable de l’exécution des futures (un _exécuteur_). Rust ne fournit pas de runtime intégré, mais plusieurs options sont disponibles :

source: [Tokio](https://tokio.rs/): performant, with a well-developed ecosystem of functionality like [Hyper](https://hyper.rs/) for HTTP or [Tonic](https://github.com/hyperium/tonic) for gRPC.
fr_fr: [Tokio](https://tokio.rs/) : performant, avec un écosystème riche comprenant des bibliothèques comme [Hyper](https://hyper.rs/) pour HTTP ou [Tonic](https://github.com/hyperium/tonic) pour gRPC.

source: [async-std](https://async.rs/): aims to be a "std for async", and includes a basic runtime in `async::task`.
fr_fr: [async-std](https://async.rs/) : vise à être un équivalent de la bibliothèque standard pour l’asynchrone, avec un runtime de base dans `async::task`.

source: [smol](https://docs.rs/smol/latest/smol/): simple and lightweight
fr_fr: [smol](https://docs.rs/smol/latest/smol/) : simple et léger

source: Several larger applications have their own runtimes. For example, [Fuchsia](https://fuchsia.googlesource.com/fuchsia/+/refs/heads/main/src/lib/fuchsia-async/src/lib.rs) already has one.
fr_fr: Plusieurs grandes applications possèdent leur propre runtime. Par exemple, [Fuchsia](https://fuchsia.googlesource.com/fuchsia/+/refs/heads/main/src/lib/fuchsia-async/src/lib.rs) en propose un.

source: Note that of the listed runtimes, only Tokio is supported in the Rust playground. The playground also does not permit any I/O, so most interesting async things can't run in the playground.
fr_fr: Notez que parmi les runtimes listés, seul Tokio est supporté dans le Rust Playground. De plus, ce dernier ne permet pas les E/S, ce qui empêche d’exécuter la plupart des exemples async intéressants.

source: Futures are "inert" in that they do not do anything (not even start an I/O operation) unless there is an executor polling them. This differs from JS Promises, for example, which will run to completion even if they are never used.
fr_fr: Les futures sont « inertes » : elles ne font rien (même pas démarrer une opération d’E/S) tant qu’un exécuteur ne les interroge pas. Cela diffère, par exemple, des Promises de JavaScript, qui s’exécutent jusqu’à leur terme même si elles ne sont jamais utilisées.

source: Tokio provides:
fr_fr: Tokio propose :

source: A multi-threaded runtime for executing asynchronous code.
fr_fr: Un runtime multithreadé pour exécuter du code asynchrone.

source: An asynchronous version of the standard library.
fr_fr: Une version asynchrone de la bibliothèque standard.

source: A large ecosystem of libraries.
fr_fr: Un vaste écosystème de bibliothèques.

source: "Count in task: {i}!"
fr_fr: "Décompte dans la tâche : {i} !"

source: "Main task: {i}"
fr_fr: "Tâche principale : {i}"

source: With the `tokio::main` macro we can now make `main` async.
fr_fr: Avec la macro `tokio::main`, on peut désormais rendre la fonction `main` asynchrone.

source: The `spawn` function creates a new, concurrent "task".
fr_fr: La fonction `spawn` crée une nouvelle « tâche » concurrente.

source: Note: `spawn` takes a `Future`, you don't call `.await` on `count_to`.
fr_fr: Remarque : `spawn` prend un `Future` en argument ; il ne faut pas appeler `.await` sur `count_to`.

source: **Further exploration:**
fr_fr: **Pour aller plus loin :**

source: Why does `count_to` not (usually) get to 10? This is an example of async cancellation. `tokio::spawn` returns a handle which can be awaited to wait until it finishes.
fr_fr: Pourquoi `count_to` n’atteint-il (en général) pas 10 ? C’est un exemple d’annulation asynchrone. `tokio::spawn` retourne un handle qui peut être attendu pour suivre la fin de la tâche.

source: Try `count_to(10).await` instead of spawning.
fr_fr: Essayez `count_to(10).await` au lieu de passer par `spawn`.

source: Try awaiting the task returned from `tokio::spawn`.
fr_fr: Essayez d’attendre la tâche retournée par `tokio::spawn`.

source: Rust has a task system, which is a form of lightweight threading.
fr_fr: Rust dispose d’un système de tâches, une forme de multitâche léger.

source: A task has a single top-level future which the executor polls to make progress. That future may have one or more nested futures that its `poll` method polls, corresponding loosely to a call stack. Concurrency within a task is possible by polling multiple child futures, such as racing a timer and an I/O operation.
fr_fr: Une tâche contient un future principal que l’exécuteur interroge pour faire avancer l’exécution. Ce future peut encapsuler d’autres futures internes, interrogés via sa méthode `poll`, formant une pile d’appels implicite. La concurrence à l’intérieur d’une tâche est possible en interrogeant plusieurs futures enfants, comme un minuteur et une opération d’E/S.

source: "listening on port {}"
fr_fr: "à l’écoute sur le port {}"

source: "connection from {addr:?}"
fr_fr: "connexion depuis {addr:?}"

source: b"Who are you?\n"
fr_fr: b"Qui êtes-vous ?\n"

source: "socket error"
fr_fr: "erreur de socket"

source: "Thanks for dialing in, {name}!\n"
fr_fr: "Merci pour votre appel, {name} !\n"

source: Copy this example into your prepared `src/main.rs` and run it from there.
fr_fr: Copiez cet exemple dans votre `src/main.rs` préparé et exécutez-le depuis ce fichier.

source: Try connecting to it with a TCP connection tool like [nc](https://www.unix.com/man-page/linux/1/nc/) or [telnet](https://www.unix.com/man-page/linux/1/telnet/).
fr_fr: Essayez de vous y connecter avec un outil comme [nc](https://www.unix.com/man-page/linux/1/nc/) ou [telnet](https://www.unix.com/man-page/linux/1/telnet/).

source: Ask students to visualize what the state of the example server would be with a few connected clients. What tasks exist? What are their Futures?
fr_fr: Demandez aux étudiants d’imaginer l’état du serveur avec quelques clients connectés. Quelles tâches existent ? Quels sont leurs Futures ?

source: This is the first time we've seen an `async` block. This is similar to a closure, but does not take any arguments. Its return value is a Future, similar to an `async fn`.
fr_fr: C’est la première fois que nous voyons un bloc `async`. Il est similaire à une closure, mais sans prendre d’arguments. Sa valeur de retour est un Future, comme pour une `async fn`.

source: Refactor the async block into a function, and improve the error handling using `?`.
fr_fr: Refactorisez le bloc `async` en une fonction, et améliorez la gestion des erreurs avec l’opérateur `?`.

source: Several crates have support for asynchronous channels. For instance `tokio`:
fr_fr: Plusieurs crates prennent en charge les canaux asynchrones. Par exemple `tokio` :

source: "Received {count} pings so far."
fr_fr: "{count} pings reçus jusqu’à présent."

source: "ping_handler complete"
fr_fr: "ping_handler terminé"

source: "Failed to send ping."
fr_fr: "Échec de l’envoi du ping."

source: "Sent {} pings so far."
fr_fr: "{} pings envoyés jusqu’à présent."

source: "Something went wrong in ping handler task."
fr_fr: "Un problème est survenu dans la tâche de gestion des pings."

source: Change the channel size to `3` and see how it affects the execution.
fr_fr: Modifiez la taille du canal à `3` et observez l’impact sur l’exécution.

source: Overall, the interface is similar to the `sync` channels as seen in the [morning class](concurrency/channels.md).
fr_fr: Globalement, l’interface est similaire à celle des canaux synchrones vus dans le [cours du matin](concurrency/channels.md).

source: Try removing the `std::mem::drop` call. What happens? Why?
fr_fr: Essayez de supprimer l’appel à `std::mem::drop`. Que se passe-t-il ? Pourquoi ?

source: The [Flume](https://docs.rs/flume/latest/flume/) crate has channels that implement both `sync` and `async` `send` and `recv`. This can be convenient for complex applications with both IO and heavy CPU processing tasks.
fr_fr: La crate [Flume](https://docs.rs/flume/latest/flume/) propose des canaux qui implémentent à la fois les opérations `send` et `recv` synchrones et asynchrones. Cela peut être pratique pour des applications complexes combinant E/S et tâches CPU lourdes.

source: What makes working with `async` channels preferable is the ability to combine them with other `future`s to combine them and create complex control flow.
fr_fr: Ce qui rend les canaux `async` intéressants, c’est leur capacité à être combinés avec d’autres `Future` afin de créer des logiques de contrôle complexes.

source: Futures Control Flow
fr_fr: Contrôle de flux des `Future`

source: Futures can be combined together to produce concurrent compute flow graphs. We have already seen tasks, that function as independent threads of execution.
fr_fr: Les futures peuvent être combinés pour former des graphes d’exécution concurrente. Nous avons déjà vu les tâches, qui fonctionnent comme des fils d’exécution indépendants.

source: A join operation waits until all of a set of futures are ready, and returns a collection of their results. This is similar to `Promise.all` in JavaScript or `asyncio.gather` in Python.
fr_fr: Une opération `join` attend que tous les futures d’un ensemble soient terminés, et retourne une collection de leurs résultats. Cela correspond à `Promise.all` en JavaScript ou `asyncio.gather` en Python.

source: "BAD_URL"
fr_fr: "MAUVAISE_URL"

source: For multiple futures of disjoint types, you can use `std::future::join!` but you must know how many futures you will have at compile time. This is currently in the `futures` crate, soon to be stabilised in `std::future`.
fr_fr: Pour plusieurs futures de types distincts, vous pouvez utiliser `std::future::join!`, mais vous devez connaître le nombre de futures à la compilation. Cette macro est actuellement dans la crate `futures`, et sera bientôt stabilisée dans `std::future`.

source: The risk of `join` is that one of the futures may never resolve, this would cause your program to stall.
fr_fr: Le risque avec `join`, c’est qu’un des futures ne se termine jamais, ce qui bloquerait votre programme indéfiniment.

source: You can also combine `join_all` with `join!` for instance to join all requests to an http service as well as a database query. Try adding a `tokio::time::sleep` to the future, using `futures::join!`. This is not a timeout (that requires `select!`, explained in the next chapter), but demonstrates `join!`.
fr_fr: Vous pouvez aussi combiner `join_all` avec `join!`, par exemple pour attendre à la fois plusieurs requêtes HTTP et une requête base de données. Essayez d’ajouter un `tokio::time::sleep` à un future, via `futures::join!`. Ce n’est pas un timeout (cela nécessite `select!`, présenté dans le chapitre suivant), mais cela illustre bien le fonctionnement de `join!`.

source: A select operation waits until any of a set of futures is ready, and responds to that future's result. In JavaScript, this is similar to `Promise.race`. In Python, it compares to `asyncio.wait(task_set, return_when=asyncio.FIRST_COMPLETED)`.
fr_fr: Une opération `select` attend que l’un quelconque des futures soit prêt, puis réagit au résultat de ce future. En JavaScript, cela ressemble à `Promise.race`. En Python, cela s’apparente à `asyncio.wait(task_set, return_when=asyncio.FIRST_COMPLETED)`.

source: Similar to a match statement, the body of `select!` has a number of arms, each of the form `pattern = future => statement`. When a `future` is ready, its return value is destructured by the `pattern`. The `statement` is then run with the resulting variables. The `statement` result becomes the result of the `select!` macro.
fr_fr: Comme un `match`, le corps de `select!` est composé de branches, chacune de la forme `pattern = future => instruction`. Lorsqu’un `future` est prêt, son résultat est déconstruit selon le `pattern`. L’instruction est ensuite exécutée avec les variables obtenues, et sa valeur devient le résultat de la macro `select!`.

source: "Felix"
fr_fr: "Félix"

source: "Failed to send cat."
fr_fr: "Échec de l’envoi du chat."

source: "Failed to send dog."
fr_fr: "Échec de l’envoi du chien."

source: "Failed to receive winner"
fr_fr: "Échec de la réception du gagnant"

source: "Winner is {winner:?}"
fr_fr: "Le gagnant est {winner:?}"

source: In this example, we have a race between a cat and a dog. `first_animal_to_finish_race` listens to both channels and will pick whichever arrives first. Since the dog takes 50ms, it wins against the cat that take 500ms.
fr_fr: Dans cet exemple, une course oppose un chat et un chien. `first_animal_to_finish_race` écoute les deux canaux et choisit celui qui arrive en premier. Comme le chien met 50 ms, il gagne contre le chat qui met 500 ms.

source: You can use `oneshot` channels in this example as the channels are supposed to receive only one `send`.
fr_fr: Vous pouvez utiliser des canaux `oneshot` dans cet exemple, puisque chaque canal ne doit recevoir qu’un seul `send`.

source: Try adding a deadline to the race, demonstrating selecting different sorts of futures.
fr_fr: Essayez d’ajouter une date limite à la course pour illustrer la sélection entre plusieurs types de futures.
