Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: If it were running in a VM, this can lead to cache coherency issues. The problem is that the VM is accessing memory directly with the cache disabled, while the host has cacheable aliases to the same memory. Even if the host doesn't explicitly access the memory, speculative accesses can lead to cache fills, and then changes from one or the other will get lost. Again this is alright in this particular case (running directly on the hardware with no hypervisor), but isn't a good pattern in general.
fr_fr: Dans une machine virtuelle, cela pourrait provoquer des incohérences de cache. Le problème vient du fait que la VM accède à la mémoire avec le cache désactivé, alors que l’hôte possède des alias cacheables vers cette même mémoire. Même sans accès explicite de l’hôte, des accès spéculatifs peuvent provoquer des remplissages de cache, et les modifications d’un côté ou de l’autre risquent d’être perdues. Cela ne pose pas problème ici (exécution directe sur le matériel sans hyperviseur), mais c’est un mauvais modèle à suivre en général.

source: Useful crates
fr_fr: Crates utiles

source: We'll go over a few crates which solve some common problems in bare-metal programming.
fr_fr: Nous allons passer en revue quelques crates qui résolvent des problèmes courants en programmation bare-metal.

source: The [`zerocopy`](https://docs.rs/zerocopy/) crate (from Fuchsia) provides traits and macros for safely converting between byte sequences and other types.
fr_fr: Le crate [`zerocopy`](https://docs.rs/zerocopy/) (issu du projet Fuchsia) fournit des traits et des macros pour convertir de manière sûre des séquences d’octets en d’autres types.

source: This is not suitable for MMIO (as it doesn't use volatile reads and writes), but can be useful for working with structures shared with hardware e.g. by DMA, or sent over some external interface.
fr_fr: Ce n’est pas adapté aux accès MMIO (car il n’utilise pas de lectures/écritures volatiles), mais il peut être utile pour manipuler des structures partagées avec le matériel, par exemple via DMA ou une interface externe.

source: `FromBytes` can be implemented for types for which any byte pattern is valid, and so can safely be converted from an untrusted sequence of bytes.
fr_fr: `FromBytes` peut être implémenté pour les types où n’importe quelle séquence d’octets est valide, et peut donc être converti en toute sécurité à partir de données non fiables.

source: Attempting to derive `FromBytes` for these types would fail, because `RequestType` doesn't use all possible u32 values as discriminants, so not all byte patterns are valid.
fr_fr: Tenter de dériver `FromBytes` pour ces types échouera, car `RequestType` n’utilise pas toutes les valeurs possibles de `u32` comme discriminants — certaines séquences d’octets seraient donc invalides.

source: `zerocopy::byteorder` has types for byte-order aware numeric primitives.
fr_fr: `zerocopy::byteorder` fournit des types numériques sensibles à l’ordre des octets.

source: Run the example with `cargo run` under `src/bare-metal/useful-crates/zerocopy-example/`. (It won't run in the Playground because of the crate dependency.)
fr_fr: Exécutez l’exemple avec `cargo run` dans `src/bare-metal/useful-crates/zerocopy-example/`. (Il ne fonctionnera pas dans le terrain de jeu à cause de la dépendance à la crate.)

source: The [`aarch64-paging`](https://crates.io/crates/aarch64-paging) crate lets you create page tables according to the AArch64 Virtual Memory System Architecture.
fr_fr: Le crate [`aarch64-paging`](https://crates.io/crates/aarch64-paging) permet de créer des tables de pages conformes à l’architecture mémoire virtuelle AArch64.

source: // Create a new page table with identity mapping.
fr_fr: // Créer une nouvelle table de pages avec mappage identique.

source: // Map a 2 MiB region of memory as read-only.
fr_fr: // Mapper une région mémoire de 2 Mio en lecture seule.

source: // Set `TTBR0_EL1` to activate the page table.
fr_fr: // Définir `TTBR0_EL1` pour activer la table de pages.

source: For now it only supports EL1, but support for other exception levels should be straightforward to add.
fr_fr: Actuellement, seul le niveau d’exception EL1 est pris en charge, mais l’ajout d’autres niveaux devrait être relativement simple.

source: This is used in Android for the [Protected VM Firmware](https://cs.android.com/android/platform/superproject/+/master:packages/modules/Virtualization/pvmfw/).
fr_fr: Cela est utilisé dans Android pour le [micrologiciel des machines virtuelles protégées](https://cs.android.com/android/platform/superproject/+/master:packages/modules/Virtualization/pvmfw/).

source: There's no easy way to run this example, as it needs to run on real hardware or under QEMU.
fr_fr: Il n’existe pas de moyen simple d’exécuter cet exemple, car il nécessite un matériel réel ou QEMU.

source: [`buddy_system_allocator`](https://crates.io/crates/buddy_system_allocator) is a third-party crate implementing a basic buddy system allocator. It can be used both for [`LockedHeap`](https://docs.rs/buddy_system_allocator/0.9.0/buddy_system_allocator/struct.LockedHeap.html) implementing [`GlobalAlloc`](https://doc.rust-lang.org/core/alloc/trait.GlobalAlloc.html) so you can use the standard `alloc` crate (as we saw [before](../alloc.md)), or for allocating other address space. For example, we might want to allocate MMIO space for PCI BARs:
fr_fr: [`buddy_system_allocator`](https://crates.io/crates/buddy_system_allocator) est un crate tiers implémentant un allocateur de mémoire basé sur le système des « buddies ». Il peut être utilisé à la fois comme [`LockedHeap`](https://docs.rs/buddy_system_allocator/0.9.0/buddy_system_allocator/struct.LockedHeap.html) implémentant [`GlobalAlloc`](https://doc.rust-lang.org/core/alloc/trait.GlobalAlloc.html) — ce qui permet d’utiliser le crate standard `alloc` (comme vu [précédemment](../alloc.md)) — ou pour gérer un autre espace mémoire, par exemple pour allouer une zone MMIO pour des BARs PCI :

source: PCI BARs always have alignment equal to their size.
fr_fr: Les BARs PCI ont toujours un alignement égal à leur taille.

source: Run the example with `cargo run` under `src/bare-metal/useful-crates/allocator-example/`. (It won't run in the Playground because of the crate dependency.)
fr_fr: Exécutez l’exemple avec `cargo run` dans `src/bare-metal/useful-crates/allocator-example/`. (Il ne fonctionnera pas dans le terrain de jeu à cause de la dépendance à la crate.)

source: Sometimes you want something which can be resized like a `Vec`, but without heap allocation. [`tinyvec`](https://crates.io/crates/tinyvec) provides this: a vector backed by an array or slice, which could be statically allocated or on the stack, which keeps track of how many elements are used and panics if you try to use more than are allocated.
fr_fr: Parfois, on souhaite une structure redimensionnable comme un `Vec`, mais sans allocation sur le tas. Le crate [`tinyvec`](https://crates.io/crates/tinyvec) répond à ce besoin : il propose un vecteur basé sur un tableau ou une tranche, alloué statiquement ou sur la pile, qui suit le nombre d’éléments utilisés et déclenche une panique si on dépasse la capacité allouée.

source: `tinyvec` requires that the element type implement `Default` for initialisation.
fr_fr: `tinyvec` exige que le type des éléments implémente `Default` pour pouvoir les initialiser.

source: The Rust Playground includes `tinyvec`, so this example will run fine inline.
fr_fr: Le Rust Playground inclut `tinyvec`, donc cet exemple peut y être exécuté directement.

source: `std::sync::Mutex` and the other synchronisation primitives from `std::sync` are not available in `core` or `alloc`. How can we manage synchronisation or interior mutability, such as for sharing state between different CPUs?
fr_fr: `std::sync::Mutex` et les autres primitives de synchronisation de `std::sync` ne sont pas disponibles dans `core` ni dans `alloc`. Comment alors gérer la synchronisation ou la mutabilité interne, par exemple pour partager un état entre différents processeurs ?

source: The [`spin`](https://crates.io/crates/spin) crate provides spinlock-based equivalents of many of these primitives.
fr_fr: Le crate [`spin`](https://crates.io/crates/spin) fournit des équivalents basés sur les verrous actifs (spinlocks) pour plusieurs de ces primitives.

source: Be careful to avoid deadlock if you take locks in interrupt handlers.
fr_fr: Faites attention à éviter les interblocages si vous utilisez des verrous dans des gestionnaires d’interruptions.

source: `spin` also has a ticket lock mutex implementation; equivalents of `RwLock`, `Barrier` and `Once` from `std::sync`; and `Lazy` for lazy initialisation.
fr_fr: `spin` propose aussi une implémentation de mutex avec ticket ; des équivalents de `RwLock`, `Barrier`, `Once` de `std::sync` ; ainsi que `Lazy` pour l’initialisation paresseuse.

source: The [`once_cell`](https://crates.io/crates/once_cell) crate also has some useful types for late initialisation with a slightly different approach to `spin::once::Once`.
fr_fr: La crate [`once_cell`](https://crates.io/crates/once_cell) propose également des types utiles pour une initialisation tardive, selon une approche un peu différente de `spin::once::Once`.

source: The Rust Playground includes `spin`, so this example will run fine inline.
fr_fr: Le Rust Playground inclut `spin`, donc cet exemple s’exécutera sans problème en ligne.

source: To build a bare-metal Rust binary in AOSP, you need to use a `rust_ffi_static` Soong rule to build your Rust code, then a `cc_binary` with a linker script to produce the binary itself, and then a `raw_binary` to convert the ELF to a raw binary ready to be run.
fr_fr: Pour compiler un binaire Rust bare-metal dans AOSP, il faut utiliser une règle Soong `rust_ffi_static` pour compiler le code Rust, puis une règle `cc_binary` avec un script de linkage pour générer le binaire, et enfin une règle `raw_binary` pour convertir le fichier ELF en un binaire brut prêt à être exécuté.

source: For VMs running under crosvm on aarch64, the [vmbase](https://android.googlesource.com/platform/packages/modules/Virtualization/+/refs/heads/master/vmbase/) library provides a linker script and useful defaults for the build rules, along with an entry point, UART console logging and more.
fr_fr: Pour les machines virtuelles exécutées sous crosvm sur aarch64, la bibliothèque [vmbase](https://android.googlesource.com/platform/packages/modules/Virtualization/+/refs/heads/master/vmbase/) fournit un script de liaison et des valeurs par défaut utiles pour les règles de compilation, ainsi qu’un point d’entrée, un système de journalisation via la console UART, et plus encore.

source: The `main!` macro marks your main function, to be called from the `vmbase` entry point.
fr_fr: La macro `main!` désigne votre fonction principale, appelée depuis le point d’entrée de `vmbase`.

source: The `vmbase` entry point handles console initialisation, and issues a PSCI_SYSTEM_OFF to shutdown the VM if your main function returns.
fr_fr: Le point d’entrée de `vmbase` gère l’initialisation de la console et envoie une commande `PSCI_SYSTEM_OFF` pour éteindre la machine virtuelle si votre fonction principale se termine.

source: We will write a driver for the PL031 real-time clock device.
fr_fr: Nous allons écrire un pilote pour le composant d’horloge temps réel PL031.

source: After looking at the exercises, you can look at the [solutions](solutions-afternoon.md) provided.
fr_fr: Après avoir consulté les exercices, vous pouvez lire les [solutions](solutions-afternoon.md) proposées.

source: RTC driver
fr_fr: Pilote RTC

source: The QEMU aarch64 virt machine has a [PL031](https://developer.arm.com/documentation/ddi0224/c) real-time clock at 0x9010000. For this exercise, you should write a driver for it.
fr_fr: La machine virtuelle QEMU aarch64 `virt` intègre une horloge temps réel [PL031](https://developer.arm.com/documentation/ddi0224/c) à l’adresse 0x9010000. Pour cet exercice, vous devez écrire un pilote pour ce composant.

source: Use it to print the current time to the serial console. You can use the [`chrono`](https://crates.io/crates/chrono) crate for date/time formatting.
fr_fr: Utilisez-le pour afficher l’heure actuelle sur la console série. Vous pouvez utiliser la crate [`chrono`](https://crates.io/crates/chrono) pour formater la date et l’heure.

source: Use the match register and raw interrupt status to busy-wait until a given time, e.g. 3 seconds in the future. (Call [`core::hint::spin_loop`](https://doc.rust-lang.org/core/hint/fn.spin_loop.html) inside the loop.)
fr_fr: Utilisez le registre de correspondance et le statut brut d’interruption pour effectuer une attente active jusqu’à une heure donnée, par ex. 3 secondes plus tard. (Appelez [`core::hint::spin_loop`](https://doc.rust-lang.org/core/hint/fn.spin_loop.html) dans la boucle.)

source: _Extension if you have time:_ Enable and handle the interrupt generated by the RTC match. You can use the driver provided in the [`arm-gic`](https://docs.rs/arm-gic/) crate to configure the Arm Generic Interrupt Controller.
fr_fr: _Extension si vous avez le temps :_ activez et gérez l’interruption générée par le RTC. Vous pouvez utiliser le pilote fourni par la crate [`arm-gic`](https://docs.rs/arm-gic/) pour configurer le contrôleur d’interruptions générique Arm.

source: Use the RTC interrupt, which is wired to the GIC as `IntId::spi(2)`.
fr_fr: Utilisez l’interruption du RTC, reliée au GIC sous l’identifiant `IntId::spi(2)`.

source: Once the interrupt is enabled, you can put the core to sleep via `arm_gic::wfi()`, which will cause the core to sleep until it receives an interrupt.
fr_fr: Une fois l’interruption activée, vous pouvez mettre le cœur en veille via `arm_gic::wfi()`, ce qui le fera dormir jusqu’à la réception d’une interruption.

source: Download the [exercise template](../../comprehensive-rust-exercises.zip) and look in the `rtc` directory for the following files.
fr_fr: Téléchargez le [modèle d’exercice](../../comprehensive-rust-exercises.zip) et consultez le dossier `rtc`, qui contient les fichiers suivants.

source: _src/exceptions.rs_ (you should only need to change this for the 3rd part of the exercise):
fr_fr: _src/exceptions.rs_ (vous ne devrez modifier ce fichier que pour la 3e partie de l’exercice) :

source: _src/logger.rs_ (you shouldn't need to change this):
fr_fr: _src/logger.rs_ (vous ne devriez pas avoir besoin de le modifier) :

source: _src/pl011.rs_ (you shouldn't need to change this):
fr_fr: _src/pl011.rs_ (vous ne devriez pas avoir besoin de le modifier) :

source: _build.rs_ (you shouldn't need to change this):
fr_fr: _build.rs_ (vous ne devriez pas avoir besoin de le modifier) :

source: _entry.S_ (you shouldn't need to change this):
fr_fr: _entry.S_ (vous ne devriez pas avoir besoin de le modifier) :

source: _exceptions.S_ (you shouldn't need to change this):
fr_fr: _exceptions.S_ (vous ne devriez pas avoir besoin de le modifier) :

source: _idmap.S_ (you shouldn't need to change this):
fr_fr: _idmap.S_ (vous ne devriez pas avoir besoin de le modifier) :

source: _image.ld_ (you shouldn't need to change this):
fr_fr: _image.ld_ (vous ne devriez pas avoir besoin de le modifier) :

source: _Makefile_ (you shouldn't need to change this):
fr_fr: _Makefile_ (vous ne devriez pas avoir besoin de le modifier) :

source: Run the code in QEMU with `make qemu`.
fr_fr: Exécutez le code dans QEMU avec la commande `make qemu`.

source: Bare Metal Rust Afternoon
fr_fr: Bare Metal Rust Après-midi

source: ([back to exercise](rtc.md))
fr_fr: ([retour à l’exercice](rtc.md))

source: /// Base addresses of the GICv3.
fr_fr: /// Adresses de base du GICv3.

source: /// Base address of the PL031 RTC.
fr_fr: /// Adresse de base du RTC PL031.

source: /// The IRQ used by the PL031 RTC.
fr_fr: /// L’IRQ utilisée par le RTC PL031.

source: // Safe because `GICD_BASE_ADDRESS` and `GICR_BASE_ADDRESS` are the base // addresses of a GICv3 distributor and redistributor respectively, and // nothing else accesses those address ranges.
fr_fr: // Sûr car `GICD_BASE_ADDRESS` et `GICR_BASE_ADDRESS` sont les adresses de // base d’un distributeur et d’un redistibuteur GICv3, et aucune autre // entité n’accède à ces plages mémoire.

source: // Safe because `PL031_BASE_ADDRESS` is the base address of a PL031 device, // and nothing else accesses that address range.
fr_fr: // Sûr car `PL031_BASE_ADDRESS` est l’adresse de base d’un périphérique PL031, // et aucun autre accès n’est effectué sur cette plage mémoire.

source: // Wait for 3 seconds, without interrupts.
fr_fr: // Attendre 3 secondes, sans interruptions.

source: "Waiting for {}"
fr_fr: "Attente de {}"

source: "matched={}, interrupt_pending={}"
fr_fr: "correspondance={}, interruption_en_attente={}"

source: "Finished waiting"
fr_fr: "Attente terminée"

source: // Wait another 3 seconds for an interrupt.
fr_fr: // Attendre encore 3 secondes pour une interruption.

source: /// Data register
fr_fr: /// Registre de données

source: /// Match register
fr_fr: /// Registre de correspondance

source: /// Load register
fr_fr: /// Registre de chargement

source: /// Control register
fr_fr: /// Registre de contrôle

source: /// Interrupt Mask Set or Clear register
fr_fr: /// Registre de masque d’interruption (activer/désactiver)

source: /// Raw Interrupt Status
fr_fr: /// Statut brut d’interruption

source: /// Masked Interrupt Status
fr_fr: /// Statut masqué d’interruption

source: /// Interrupt Clear Register
fr_fr: /// Registre d’effacement d’interruption

source: /// Driver for a PL031 real-time clock.
fr_fr: /// Pilote pour une horloge temps réel PL031.

source: /// Constructs a new instance of the RTC driver for a PL031 device at the /// given base address. /// /// # Safety /// /// The given base address must point to the MMIO control registers of a /// PL031 device, which must be mapped into the address space of the process /// as device memory and not have any other aliases.
fr_fr: /// Construit une nouvelle instance du pilote RTC pour un périphérique PL031 /// à l’adresse de base donnée. /// /// # Sécurité /// /// L’adresse de base fournie doit pointer vers les registres MMIO de contrôle /// d’un PL031, qui doivent être mappés comme mémoire de périphérique et ne /// doivent pas être accessibles par d’autres alias.

source: /// Reads the current RTC value.
fr_fr: /// Lit la valeur actuelle du RTC.

source: // Safe because we know that self.registers points to the control // registers of a PL031 device which is appropriately mapped.
fr_fr: // Sûr car self.registers pointe vers les registres de contrôle d’un // périphérique PL031 qui sont correctement mappés.

source: /// Writes a match value. When the RTC value matches this then an interrupt /// will be generated (if it is enabled).
fr_fr: /// Écrit une valeur de correspondance. Quand la valeur du RTC correspond, /// une interruption est générée (si elle est activée).

source: /// Returns whether the match register matches the RTC value, whether or not /// the interrupt is enabled.
fr_fr: /// Indique si la valeur du registre de correspondance correspond à celle du RTC, /// que l’interruption soit activée ou non.

source: /// Returns whether there is currently an interrupt pending. /// /// This should be true if and only if `matched` returns true and the /// interrupt is masked.
fr_fr: /// Indique si une interruption est actuellement en attente. /// /// Cela devrait être vrai si et seulement si `matched` renvoie vrai et /// que l’interruption est masquée.

source: /// Sets or clears the interrupt mask. /// /// When the mask is true the interrupt is enabled; when it is false the /// interrupt is disabled.
fr_fr: /// Active ou désactive le masque d’interruption. /// /// Si le masque est à true, l’interruption est activée ; sinon, /// elle est désactivée.

source: /// Clears a pending interrupt, if any.
fr_fr: /// Réinitialise une interruption en attente, s’il y en a.

source: Welcome to Concurrency in Rust
fr_fr: Bienvenue dans la programmation concurrente avec Rust

source: Rust has full support for concurrency using OS threads with mutexes and channels.
fr_fr: Rust prend entièrement en charge la concurrence en utilisant les threads du système d’exploitation avec des mutex et des canaux.

source: The Rust type system plays an important role in making many concurrency bugs compile time bugs. This is often referred to as _fearless concurrency_ since you can rely on the compiler to ensure correctness at runtime.
fr_fr: Le système de types de Rust joue un rôle essentiel en transformant de nombreux bugs de concurrence en erreurs de compilation. On parle alors souvent de _concurrence sans crainte_, car le compilateur garantit la sûreté à l’exécution.

source: Rust lets us access OS concurrency toolkit: threads, sync. primitives, etc.
fr_fr: Rust permet d'accéder aux outils de concurrence du système d'exploitation : threads, primitives de synchronisation, etc.

source: The type system gives us safety for concurrency without any special features.
fr_fr: Le système de types garantit la sûreté de la concurrence sans fonctionnalités particulières.

source: The same tools that help with "concurrent" access in a single thread (e.g., a called function that might mutate an argument or save references to it to read later) save us from multi-threading issues.
fr_fr: Les mêmes outils qui permettent de gérer un accès « concurrent » dans un seul thread (par exemple, une fonction appelée qui pourrait modifier un argument ou conserver une référence pour une lecture ultérieure) nous protègent aussi des problèmes liés au multi-threading.

source: Rust threads work similarly to threads in other languages:
fr_fr: Les threads Rust fonctionnent de manière similaire à ceux des autres langages :

source: "Count in thread: {i}!"
fr_fr: "Comptage dans le thread : {i}!"

source: "Main thread: {i}"
fr_fr: "Thread principal : {i}"

source: Threads are all daemon threads, the main thread does not wait for them.
fr_fr: Tous les threads sont des threads démons, le thread principal ne les attend pas.

source: Thread panics are independent of each other.
fr_fr: Les paniques dans les threads sont indépendantes les unes des autres.

source: Panics can carry a payload, which can be unpacked with `downcast_ref`.
fr_fr: Les paniques peuvent contenir une valeur (payload), qui peut être extraite avec `downcast_ref`.

source: Rust thread APIs look not too different from e.g. C++ ones.
fr_fr: Les API de threads en Rust ne sont pas très différentes de celles de C++, par exemple.

source: Run the example.
fr_fr: Exécutez l’exemple.

source: 5ms timing is loose enough that main and spawned threads stay mostly in lockstep.
fr_fr: Une temporisation de 5 ms est suffisamment large pour que le thread principal et les threads créés restent globalement synchronisés.

source: Notice that the program ends before the spawned thread reaches 10!
fr_fr: Remarquez que le programme se termine avant que le thread secondaire n’atteigne 10 !

source: This is because main ends the program and spawned threads do not make it persist.
fr_fr: Cela arrive parce que le thread principal termine le programme, et les threads secondaires ne le maintiennent pas en vie.

source: Compare to pthreads/C++ std::thread/boost::thread if desired.
fr_fr: Comparez avec pthreads / C++ std::thread / boost::thread si vous le souhaitez.

source: How do we wait around for the spawned thread to complete?
fr_fr: Comment attendre que le thread secondaire se termine ?

source: [`thread::spawn`](https://doc.rust-lang.org/std/thread/fn.spawn.html) returns a `JoinHandle`. Look at the docs.
fr_fr: [`thread::spawn`](https://doc.rust-lang.org/std/thread/fn.spawn.html) retourne un `JoinHandle`. Consultez la documentation.
