Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: Standard library types like [`Option`](https://doc.rust-lang.org/stable/std/option/enum.Option.html) or [`BinaryHeap`](https://doc.rust-lang.org/stable/std/collections/struct.BinaryHeap.html).
fr_fr: Des types de la bibliothèque standard comme [`Option`](https://doc.rust-lang.org/stable/std/option/enum.Option.html) ou [`BinaryHeap`](https://doc.rust-lang.org/stable/std/collections/struct.BinaryHeap.html).

source: In fact, you can document your own code:
fr_fr: En fait, vous pouvez documenter votre propre code :

source: /// Determine whether the first argument is divisible by the second argument. /// /// If the second argument is zero, the result is false.
fr_fr: /// Détermine si le premier argument est divisible par le second. /// /// Si le second argument vaut zéro, le résultat est false.

source: The contents are treated as Markdown. All published Rust library crates are automatically documented at [`docs.rs`](https://docs.rs) using the [rustdoc](https://doc.rust-lang.org/rustdoc/what-is-rustdoc.html) tool. It is idiomatic to document all public items in an API using this pattern.
fr_fr: Le contenu est interprété comme du Markdown. Toutes les crates Rust publiées sont automatiquement documentées sur [`docs.rs`](https://docs.rs) à l'aide de l'outil [rustdoc](https://doc.rust-lang.org/rustdoc/what-is-rustdoc.html). Il est considéré comme idiomatique de documenter tous les éléments publics d’une API en suivant ce modèle.

source: To document an item from inside the item (such as inside a module), use `//!` or `/*! .. */`, called "inner doc comments":
fr_fr: Pour documenter un élément depuis son intérieur (comme dans un module), utilisez `//!` ou `/*! .. */`, appelés « commentaires de documentation internes » :

source: //! This module contains functionality relating to divisibility of integers.
fr_fr: //! Ce module contient des fonctionnalités liées à la divisibilité des entiers.

source: Show students the generated docs for the `rand` crate at <https://docs.rs/rand>.
fr_fr: Montrez aux étudiants la documentation générée pour la crate `rand` à l'adresse <https://docs.rs/rand>.

source: We have already seen some use of `Option<T>`. It stores either a value of type `T` or nothing. For example, [`String::find`](https://doc.rust-lang.org/stable/std/string/struct.String.html#method.find) returns an `Option<usize>`.
fr_fr: Nous avons déjà vu l’usage de `Option<T>`. Il stocke soit une valeur de type `T`, soit rien. Par exemple, [`String::find`](https://doc.rust-lang.org/stable/std/string/struct.String.html#method.find) retourne un `Option<usize>`.

source: "find returned {position:?}"
fr_fr: "find a retourné {position:?}"

source: "Character not found"
fr_fr: "Caractère non trouvé"

source: `Option` is widely used, not just in the standard library.
fr_fr: `Option` est largement utilisé, et pas seulement dans la bibliothèque standard.

source: `unwrap` will return the value in an `Option`, or panic. `expect` is similar but takes an error message.
fr_fr: `unwrap` retourne la valeur contenue dans un `Option`, ou panique. `expect` est similaire mais prend un message d’erreur.

source: You can panic on None, but you can't "accidentally" forget to check for None.
fr_fr: Vous pouvez faire panic sur None, mais vous ne pouvez pas « oublier accidentellement » de vérifier un None.

source: It's common to `unwrap`/`expect` all over the place when hacking something together, but production code typically handles `None` in a nicer fashion.
fr_fr: Il est courant d’utiliser `unwrap` ou `expect` un peu partout lors d’un prototype, mais dans du code de production, on gère généralement les `None` de façon plus élégante.

source: The niche optimization means that `Option<T>` often has the same size in memory as `T`.
fr_fr: L’optimisation de niche signifie que `Option<T>` a souvent la même taille en mémoire que `T`.

source: `Result` is similar to `Option`, but indicates the success or failure of an operation, each with a different type. This is similar to the `Res` defined in the expression exercise, but generic: `Result<T, E>` where `T` is used in the `Ok` variant and `E` appears in the `Err` variant.
fr_fr: `Result` est similaire à `Option`, mais indique le succès ou l’échec d’une opération, chacun avec un type différent. Cela ressemble au `Res` défini dans l’exercice sur les expressions, mais de manière générique : `Result<T, E>` où `T` est utilisé dans la variante `Ok` et `E` dans `Err`.

source: "Dear diary: {contents} ({bytes} bytes)"
fr_fr: "Cher journal : {contents} ({bytes} octets)"

source: "Could not read file content"
fr_fr: "Impossible de lire le contenu du fichier"

source: "The diary could not be opened: {err}"
fr_fr: "Le journal n’a pas pu être ouvert : {err}"

source: As with `Option`, the successful value sits inside of `Result`, forcing the developer to explicitly extract it. This encourages error checking. In the case where an error should never happen, `unwrap()` or `expect()` can be called, and this is a signal of the developer intent too.
fr_fr: Comme pour `Option`, la valeur de succès est contenue dans `Result`, forçant le développeur à l’extraire explicitement. Cela encourage la vérification des erreurs. Dans les cas où une erreur ne devrait jamais se produire, on peut utiliser `unwrap()` ou `expect()`, ce qui indique également une intention explicite du développeur.

source: `Result` documentation is a recommended read. Not during the course, but it is worth mentioning. It contains a lot of convenience methods and functions that help functional-style programming.
fr_fr: La documentation de `Result` est une lecture vivement recommandée. Pas nécessairement durant le cours, mais elle mérite d’être mentionnée. Elle contient de nombreuses méthodes et fonctions pratiques qui facilitent une approche de programmation fonctionnelle.

source: `Result` is the standard type to implement error handling as we will see on Day 4.
fr_fr: `Result` est le type standard pour implémenter la gestion des erreurs, comme nous le verrons le jour 4.

source: [`String`](https://doc.rust-lang.org/std/string/struct.String.html) is the standard heap-allocated growable UTF-8 string buffer:
fr_fr: [`String`](https://doc.rust-lang.org/std/string/struct.String.html) est le tampon de chaîne UTF-8 évolutif standard alloué par tas :

source: "s1: len = {}, capacity = {}"
fr_fr: "s1 : longueur = {}, capacité = {}"

source: "s2: len = {}, capacity = {}"
fr_fr: "s2 : longueur = {}, capacité = {}"

source: "s3: len = {}, number of chars = {}"
fr_fr: "s3 : longueur = {}, nombre de caractères = {}"

source: `String` implements [`Deref<Target = str>`](https://doc.rust-lang.org/std/string/struct.String.html#deref-methods-str), which means that you can call all `str` methods on a `String`.
fr_fr: `String` implémente [`Deref<Target = str>`](https://doc.rust-lang.org/std/string/struct.String.html#deref-methods-str), ce qui signifie que l’on peut appeler toutes les méthodes de `str` sur une `String`.

source: `String::new` returns a new empty string, use `String::with_capacity` when you know how much data you want to push to the string.
fr_fr: `String::new` retourne une chaîne vide. Utilisez `String::with_capacity` si vous savez combien de données vous allez y ajouter.

source: `String::len` returns the size of the `String` in bytes (which can be different from its length in characters).
fr_fr: `String::len` retourne la taille de la chaîne en octets (ce qui peut différer du nombre de caractères).

source: `String::chars` returns an iterator over the actual characters. Note that a `char` can be different from what a human will consider a "character" due to [grapheme clusters](https://docs.rs/unicode-segmentation/latest/unicode_segmentation/struct.Graphemes.html).
fr_fr: `String::chars` retourne un itérateur sur les caractères. Notez qu’un `char` peut être différent de ce qu’un humain considère comme un « caractère » en raison des [groupes de graphèmes](https://docs.rs/unicode-segmentation/latest/unicode_segmentation/struct.Graphemes.html).

source: When people refer to strings they could either be talking about `&str` or `String`.
fr_fr: Quand on parle de chaînes en Rust, cela peut désigner aussi bien `&str` que `String`.

source: When a type implements `Deref<Target = T>`, the compiler will let you transparently call methods from `T`.
fr_fr: Lorsqu’un type implémente `Deref<Target = T>`, le compilateur permet d’appeler automatiquement les méthodes de `T`.

source: We haven't discussed the `Deref` trait yet, so at this point this mostly explains the structure of the sidebar in the documentation.
fr_fr: Le trait `Deref` n’a pas encore été abordé, cela sert surtout ici à expliquer l’organisation de la documentation.

source: `String` implements `Deref<Target = str>` which transparently gives it access to `str`'s methods.
fr_fr: `String` implémente `Deref<Target = str>`, ce qui lui donne automatiquement accès aux méthodes de `str`.

source: Write and compare `let s3 = s1.deref();` and `let s3 = &*s1;`.
fr_fr: Écrivez et comparez `let s3 = s1.deref();` et `let s3 = &*s1;`.

source: `String` is implemented as a wrapper around a vector of bytes, many of the operations you see supported on vectors are also supported on `String`, but with some extra guarantees.
fr_fr: `String` est implémenté comme une enveloppe autour d’un vecteur d’octets ; de nombreuses opérations valides sur `Vec` le sont aussi sur `String`, avec des garanties supplémentaires.

source: Compare the different ways to index a `String`:
fr_fr: Comparez les différentes façons d’indexer une `String` :

source: To a character by using `s3.chars().nth(i).unwrap()` where `i` is in-bound, out-of-bounds.
fr_fr: Pour accéder à un caractère : utilisez `s3.chars().nth(i).unwrap()` (avec `i` dans les limites ou non).

source: To a substring by using `s3[0..4]`, where that slice is on character boundaries or not.
fr_fr: Pour accéder à une sous-chaîne : utilisez `s3[0..4]`, en respectant ou non les frontières de caractères.

source: Many types can be converted to a string with the [`to_string`](https://doc.rust-lang.org/std/string/trait.ToString.html#tymethod.to_string) method. This trait is automatically implemented for all types that implement `Display`, so anything that can be formatted can also be converted to a string.
fr_fr: Beaucoup de types peuvent être convertis en chaîne avec [`to_string`](https://doc.rust-lang.org/std/string/trait.ToString.html#tymethod.to_string). Ce trait est automatiquement implémenté pour tous les types qui implémentent `Display`, donc tout ce qui peut être affiché peut aussi être converti en chaîne.

source: [`Vec`](https://doc.rust-lang.org/std/vec/struct.Vec.html) is the standard resizable heap-allocated buffer:
fr_fr: [`Vec`](https://doc.rust-lang.org/std/vec/struct.Vec.html) est le tampon standard alloué sur le tas et redimensionnable :

source: "v1: len = {}, capacity = {}"
fr_fr: "v1 : longueur = {}, capacité = {}"

source: "v2: len = {}, capacity = {}"
fr_fr: "v2 : longueur = {}, capacité = {}"

source: // Canonical macro to initialize a vector with elements.
fr_fr: // Macro canonique pour initialiser un vecteur avec des éléments.

source: // Retain only the even elements.
fr_fr: // Ne conserver que les éléments pairs.

source: // Remove consecutive duplicates.
fr_fr: // Supprimer les doublons consécutifs.

source: `Vec` implements [`Deref<Target = [T]>`](https://doc.rust-lang.org/std/vec/struct.Vec.html#deref-methods-%5BT%5D), which means that you can call slice methods on a `Vec`.
fr_fr: `Vec` implémente [`Deref<Target = [T]>`](https://doc.rust-lang.org/std/vec/struct.Vec.html#deref-methods-%5BT%5D), ce qui signifie que l’on peut utiliser les méthodes des tranches (`slice`) sur un `Vec`.

source: `Vec` is a type of collection, along with `String` and `HashMap`. The data it contains is stored on the heap. This means the amount of data doesn't need to be known at compile time. It can grow or shrink at runtime.
fr_fr: `Vec` est un type de collection, tout comme `String` et `HashMap`. Les données sont stockées sur le tas (heap), ce qui signifie que la taille n’a pas besoin d’être connue à la compilation. Elle peut varier à l’exécution.

source: Notice how `Vec<T>` is a generic type too, but you don't have to specify `T` explicitly. As always with Rust type inference, the `T` was established during the first `push` call.
fr_fr: Notez que `Vec<T>` est un type générique également, mais vous n’avez pas besoin de spécifier `T` explicitement. Comme toujours en Rust, l’inférence de type a déterminé `T` à la première insertion (`push`).

source: `vec![...]` is a canonical macro to use instead of `Vec::new()` and it supports adding initial elements to the vector.
fr_fr: `vec![...]` est une macro canonique à utiliser à la place de `Vec::new()` et permet d’ajouter des éléments initiaux au vecteur.

source: To index the vector you use `[` `]`, but they will panic if out of bounds. Alternatively, using `get` will return an `Option`. The `pop` function will remove the last element.
fr_fr: Pour indexer un vecteur, utilisez les crochets `[ ]`, mais attention : un indice hors limites provoquera une panique. En alternative, utilisez `get` pour obtenir un `Option`. La fonction `pop` retire le dernier élément.

source: Slices are covered on day 3. For now, students only need to know that a value of type `Vec` gives access to all of the documented slice methods, too.
fr_fr: Les tranches (`slice`) seront abordées au jour 3. Pour l’instant, il suffit de savoir qu’un `Vec` permet aussi d’accéder à toutes les méthodes disponibles pour les slices.

source: Standard hash map with protection against HashDoS attacks:
fr_fr: Table de hachage standard avec protection contre les attaques HashDoS :

source: "Adventures of Huckleberry Finn"
fr_fr: "Les Aventures de Huckleberry Finn"

source: "Grimms' Fairy Tales"
fr_fr: "Contes de Grimm"

source: "Pride and Prejudice"
fr_fr: "Orgueil et Préjugés"

source: "We know about {} books, but not Les Misérables."
fr_fr: "Nous connaissons {} livres, mais pas Les Misérables."

source: "Alice's Adventure in Wonderland"
fr_fr: "Les Aventures d’Alice au pays des merveilles"

source: "{book} is unknown."
fr_fr: "{book} est inconnu."

source: // Use the .entry() method to insert a value if nothing is found.
fr_fr: // Utiliser la méthode .entry() pour insérer une valeur si aucune n’est trouvée.

source: `HashMap` is not defined in the prelude and needs to be brought into scope.
fr_fr: `HashMap` n’est pas inclus par défaut dans le prélude et doit être importé explicitement.

source: Try the following lines of code. The first line will see if a book is in the hashmap and if not return an alternative value. The second line will insert the alternative value in the hashmap if the book is not found.
fr_fr: Essayez les lignes de code suivantes. La première vérifie si un livre est présent dans la hashmap, sinon elle retourne une valeur alternative. La seconde insère cette valeur alternative si le livre n’est pas trouvé.

source: "Harry Potter and the Sorcerer's Stone"
fr_fr: "Harry Potter à l’école des sorciers"

source: "The Hunger Games"
fr_fr: "Hunger Games"

source: Unlike `vec!`, there is unfortunately no standard `hashmap!` macro.
fr_fr: Contrairement à `vec!`, il n’existe malheureusement pas de macro standard `hashmap!`.

source: Although, since Rust 1.56, HashMap implements [`From<[(K, V); N]>`](https://doc.rust-lang.org/std/collections/hash_map/struct.HashMap.html#impl-From%3C%5B(K,+V);+N%5D%3E-for-HashMap%3CK,+V,+RandomState%3E), which allows us to easily initialize a hash map from a literal array:
fr_fr: Cependant, depuis Rust 1.56, `HashMap` implémente [`From<[(K, V); N]>`](https://doc.rust-lang.org/std/collections/hash_map/struct.HashMap.html#impl-From%3C%5B(K,+V);+N%5D%3E-for-HashMap%3CK,+V,+RandomState%3E), ce qui permet d’initialiser facilement une hashmap à partir d’un tableau littéral :

source: Alternatively HashMap can be built from any `Iterator` which yields key-value tuples.
fr_fr: Alternativement, on peut construire un `HashMap` à partir de n’importe quel `Iterator` produisant des couples clé-valeur.

source: We are showing `HashMap<String, i32>`, and avoid using `&str` as key to make examples easier. Using references in collections can, of course, be done, but it can lead into complications with the borrow checker.
fr_fr: Nous utilisons `HashMap<String, i32>` pour simplifier les exemples, en évitant `&str` comme clé. L’utilisation de références dans des collections est possible, mais peut entraîner des complications avec le vérificateur d’emprunts.

source: Try removing `to_string()` from the example above and see if it still compiles. Where do you think we might run into issues?
fr_fr: Essayez de retirer `to_string()` de l’exemple ci-dessus et voyez si cela compile encore. Où pensez-vous que des problèmes pourraient survenir ?

source: This type has several "method-specific" return types, such as `std::collections::hash_map::Keys`. These types often appear in searches of the Rust docs. Show students the docs for this type, and the helpful link back to the `keys` method.
fr_fr: Ce type possède plusieurs types de retour « spécifiques à des méthodes », comme `std::collections::hash_map::Keys`. Ces types apparaissent souvent dans les recherches de documentation Rust. Montrez aux étudiants la documentation de ce type et le lien utile vers la méthode `keys`.

source: In this exercise you will take a very simple data structure and make it generic. It uses a [`std::collections::HashMap`](https://doc.rust-lang.org/stable/std/collections/struct.HashMap.html) to keep track of which values have been seen and how many times each one has appeared.
fr_fr: Dans cet exercice, vous allez rendre générique une structure de données très simple. Elle utilise une [`std::collections::HashMap`](https://doc.rust-lang.org/stable/std/collections/struct.HashMap.html) pour suivre les valeurs vues et compter combien de fois chacune est apparue.

source: The initial version of `Counter` is hard coded to only work for `u32` values. Make the struct and its methods generic over the type of value being tracked, that way `Counter` can track any type of value.
fr_fr: La version initiale de `Counter` est codée en dur pour ne fonctionner qu’avec des valeurs `u32`. Rendez la structure et ses méthodes génériques sur le type de valeur suivi, afin que `Counter` puisse fonctionner avec tout type de valeur.

source: If you finish early, try using the [`entry`](https://doc.rust-lang.org/stable/std/collections/struct.HashMap.html#method.entry) method to halve the number of hash lookups required to implement the `count` method.
fr_fr: Si vous terminez rapidement, essayez d’utiliser la méthode [`entry`](https://doc.rust-lang.org/stable/std/collections/struct.HashMap.html#method.entry) pour réduire de moitié le nombre d’accès au hachage nécessaires pour la méthode `count`.

source: /// Counter counts the number of times each value of type T has been seen.
fr_fr: /// Counter compte le nombre de fois où chaque valeur de type T a été observée.

source: /// Create a new Counter.
fr_fr: /// Crée un nouveau Counter.

source: /// Count an occurrence of the given value.
fr_fr: /// Compte une occurrence de la valeur donnée.

source: /// Return the number of times the given value has been seen.
fr_fr: /// Retourne le nombre de fois où la valeur a été observée.

source: "saw {} values equal to {}"
fr_fr: "{} valeurs égales à {} vues"

source: "apple"
fr_fr: "pomme"

source: "got {} apples"
fr_fr: "{} pommes obtenues"

source: As with the standard-library types, spend time reviewing the documentation for each trait.
fr_fr: Comme pour les types de la bibliothèque standard, prenez le temps de consulter la documentation de chaque trait.

source: This section is long. Take a break midway through.
fr_fr: Cette section est longue. Faites une pause à mi-chemin.

source: These traits support comparisons between values. All traits can be derived for types containing fields that implement these traits.
fr_fr: Ces traits permettent de comparer des valeurs. Tous peuvent être dérivés pour des types contenant des champs qui les implémentent.

source: `PartialEq` and `Eq`
fr_fr: `PartialEq` et `Eq`

source: `PartialEq` is a partial equivalence relation, with required method `eq` and provided method `ne`. The `==` and `!=` operators will call these methods.
fr_fr: `PartialEq` est une relation d’équivalence partielle, avec la méthode obligatoire `eq` et la méthode fournie `ne`. Les opérateurs `==` et `!=` utilisent ces méthodes.

source: `Eq` is a full equivalence relation (reflexive, symmetric, and transitive) and implies `PartialEq`. Functions that require full equivalence will use `Eq` as a trait bound.
fr_fr: `Eq` est une relation d’équivalence complète (réflexive, symétrique et transitive) et implique `PartialEq`. Les fonctions nécessitant une équivalence complète utiliseront `Eq` comme contrainte de trait.

source: `PartialOrd` and `Ord`
fr_fr: `PartialOrf` et `Ord`

source: `PartialOrd` defines a partial ordering, with a `partial_cmp` method. It is used to implement the `<`, `<=`, `>=`, and `>` operators.
fr_fr: `PartialOrd` définit un ordre partiel, via la méthode `partial_cmp`. Il est utilisé pour implémenter les opérateurs `<`, `<=`, `>=` et `>`.

source: `Ord` is a total ordering, with `cmp` returning `Ordering`.
fr_fr: `Ord` est un ordre total, avec la méthode `cmp` retournant un `Ordering`.

source: `PartialEq` can be implemented between different types, but `Eq` cannot, because it is reflexive:
fr_fr: `PartialEq` peut être implémenté entre types différents, mais pas `Eq`, car celui-ci est réflexif :

source: In practice, it's common to derive these traits, but uncommon to implement them.
fr_fr: En pratique, ces traits sont souvent dérivés automatiquement, mais rarement implémentés manuellement.

source: Operator overloading is implemented via traits in [`std::ops`](https://doc.rust-lang.org/std/ops/index.html):
fr_fr: La surcharge des opérateurs est implémentée via des traits dans [`std::ops`](https://doc.rust-lang.org/std/ops/index.html) :

source: Discussion points:
fr_fr: Points de discussion :

source: You could implement `Add` for `&Point`. In which situations is that useful?
fr_fr: On peut implémenter `Add` pour `&Point`. Dans quelles situations cela est-il utile ?

source: Answer: `Add:add` consumes `self`. If type `T` for which you are overloading the operator is not `Copy`, you should consider overloading the operator for `&T` as well. This avoids unnecessary cloning on the call site.
fr_fr: Réponse : `Add::add` consomme `self`. Si le type `T` pour lequel on surcharge l’opérateur n’est pas `Copy`, il est pertinent d’implémenter également l’opérateur pour `&T`. Cela permet d’éviter des clonages inutiles au moment de l’appel.

source: Why is `Output` an associated type? Could it be made a type parameter of the method?
fr_fr: Pourquoi `Output` est-il un type associé ? Pourrait-on en faire un paramètre de type de méthode ?

source: Short answer: Function type parameters are controlled by the caller, but associated types (like `Output`) are controlled by the implementer of a trait.
fr_fr: Réponse courte : les paramètres de type des fonctions sont choisis par l’appelant, tandis que les types associés (comme `Output`) sont définis par l’implémenteur du trait.

source: You could implement `Add` for two different types, e.g. `impl Add<(i32, i32)> for Point` would add a tuple to a `Point`.
fr_fr: On peut implémenter `Add` pour deux types différents, par exemple `impl Add<(i32, i32)> for Point` permettrait d’ajouter un tuple à un `Point`.
