Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: For this training, we will mostly explore the Rust language through examples which can be executed through your browser. This makes the setup much easier and ensures a consistent experience for everyone.
fr_fr: Pour cette formation, nous allons surtout explorer le langage Rust à travers des exemples qui peuvent être exécuté via votre navigateur. Cela rend la configuration beaucoup plus facile et assure une expérience cohérente pour chacun.

source: Installing Cargo is still encouraged: it will make it easier for you to do the exercises. On the last day, we will do a larger exercise which shows you how to work with dependencies and for that you need Cargo.
fr_fr: L'installation de Cargo est tout de même encouragée : elle vous facilitera la tâche pour les exercices. Le dernier jour, nous ferons un exercice plus conséquent qui vous montrera comment travailler avec des dépendances et, pour cela, vous avez besoin de Cargo.

source: The code blocks in this course are fully interactive:
fr_fr: Les blocs de code de ce cours sont entièrement interactifs :

source: "Edit me!"
fr_fr: "Modifiez-moi !"

source: You can use
fr_fr: Vous pouvez utiliser

source: to execute the code when focus is in the text box.
fr_fr: pour exécuter le code lorsque le focus est dans la zone de texte.

source: Most code samples are editable like shown above. A few code samples are not editable for various reasons:
fr_fr: La plupart des exemples de code sont modifiables comme indiqué ci-dessus. Quelques exemples de code ne sont pas modifiables pour diverses raisons :

source: The embedded playgrounds cannot execute unit tests. Copy-paste the code and open it in the real Playground to demonstrate unit tests.
fr_fr: Les environnements d'exécution intégrés ne peuvent pas exécuter de tests unitaires. Copiez-collez le code et ouvrez-le dans l'environnement d'exécution complet pour valider les tests unitaires.

source: The embedded playgrounds lose their state the moment you navigate away from the page! This is the reason that the students should solve the exercises using a local Rust installation or via the Playground.
fr_fr: Les environnements d'exécution intégrés sont réinitialisés dès que vous quittez la page! C'est la raison pour laquelle les élèves doivent résoudre les exercices en utilisant une installation Rust locale ou via l'environnement d'exécution complet.

source: Running Code Locally with Cargo
fr_fr: Exécuter du code localement avec Cargo

source: If you want to experiment with the code on your own system, then you will need to first install Rust. Do this by following the [instructions in the Rust Book](https://doc.rust-lang.org/book/ch01-01-installation.html). This should give you a working `rustc` and `cargo`. At the time of writing, the latest stable Rust release has these version numbers:
fr_fr: Si vous souhaitez expérimenter le code sur votre propre système, il vous faudra d'abord installer Rust. Pour ce faire, suivez les [instructions dans le livre Rust - en anglais](https://doc.rust-lang.org/book/ch01-01-installation.html). Vous disposerez alors de `rustc` et `cargo`. Au moment de l'écriture, la dernière version stable de Rust a ces numéros de version :

source: You can use any later version too since Rust maintains backwards compatibility.
fr_fr: N'importe quelle version plus récente peut également être utilisée, étant donné que les versions de Rust sont rétrocompatibles.

source: With this in place, follow these steps to build a Rust binary from one of the examples in this training:
fr_fr: Suivez ensuite ces étapes pour créer un binaire Rust à partir d'un des exemples dans cette formation :

source: Click the "Copy to clipboard" button on the example you want to copy.
fr_fr: Cliquez sur le bouton "Copy to clipboard" sur l'exemple que vous souhaitez copier.

source: Use `cargo new exercise` to create a new `exercise/` directory for your code:
fr_fr: Exécutez `cargo new exercise` pour créer un nouveau répertoire `exercise/` pour héberger votre code :

source: Navigate into `exercise/` and use `cargo run` to build and run your binary:
fr_fr: Rendez vous dans le répertoire `exercise/` et exécutez `cargo run` pour compiler et exécuter votre binaire :

source: Replace the boiler-plate code in `src/main.rs` with your own code. For example, using the example on the previous page, make `src/main.rs` look like
fr_fr: Remplacez le code standard sous `src/main.rs` par votre propre code. Par exemple, en suivant l'exemple de la page précédente, modifiez `src/main.rs` comme ceci

source: Use `cargo run` to build and run your updated binary:
fr_fr: Exécutez `cargo run` pour compiler et exécuter votre binaire mis à jour :

source: Use `cargo check` to quickly check your project for errors, use `cargo build` to compile it without running it. You will find the output in `target/debug/` for a normal debug build. Use `cargo build --release` to produce an optimized release build in `target/release/`.
fr_fr: Exécutez `cargo check` afin de rapidement déterminer si votre projet contient des erreurs. Exécutez `cargo build` pour le compiler sans l'exécuter. Pour une compilation normale en mode debug, le résultat se trouvera dans le répertoire `target/debug/`. Enfin, vous pouvez exécuter `cargo build --release` pour générer un binaire optimisé qui se trouvera dans le répertoire `target/release/`.

source: You can add dependencies for your project by editing `Cargo.toml`. When you run `cargo` commands, it will automatically download and compile missing dependencies for you.
fr_fr: Vous pouvez déclarer des dépendances pour votre projet dans le fichier `Cargo.toml`. Quand vous lancez des commandes `cargo`, Cargo se charge de télécharger et compiler les dépendances manquantes.

source: Try to encourage the class participants to install Cargo and use a local editor. It will make their life easier since they will have a normal development environment.
fr_fr: Essayez d'encourager les participants à installer Cargo et à utiliser un éditeur local. Cela leur facilitera la vie puisqu'ils auront un environnement de développement normal.

source: Welcome to Day 1
fr_fr: Bienvenue au jour 1

source: This is the first day of Rust Fundamentals. We will cover a lot of ground today:
fr_fr: C'est le premier jour des Fondamentaux de Rust. Nous allons couvrir beaucoup de terrain aujourd'hui :

source: Basic Rust syntax: variables, scalar and compound types, enums, structs, references, functions, and methods.
fr_fr: Syntaxe de base de Rust : variables, types scalaires et composés, énumérations, structures, références, fonctions et méthodes.

source: Types and type inference.
fr_fr: Types et inférence de types.

source: Control flow constructs: loops, conditionals, and so on.
fr_fr: Structures de contrôle : boucles, conditions, etc.

source: User-defined types: structs and enums.
fr_fr: Types définis par l'utilisateur : `struct` et `enum`.

source: Pattern matching: destructuring enums, structs, and arrays.
fr_fr: Filtrage par motif : déstructuration des énumérations, structures et tableaux.

source: Schedule
fr_fr: Programme

source: Please remind the students that:
fr_fr: Veuillez rappeler aux élèves que :

source: They should ask questions when they get them, don't save them to the end.
fr_fr: Ils doivent poser leurs questions dès qu'elles surgissent, sans attendre la fin.

source: The class is meant to be interactive and discussions are very much encouraged!
fr_fr: Le cours se veut interactif, et les discussions sont vivement encouragées !

source: As an instructor, you should try to keep the discussions relevant, i.e., keep the discussions related to how Rust does things vs some other language. It can be hard to find the right balance, but err on the side of allowing discussions since they engage people much more than one-way communication.
fr_fr: En tant qu'instructeur, vous devez veiller à ce que les discussions restent pertinentes, c'est-à-dire liées à la manière dont Rust fonctionne par rapport à d'autres langages. Il peut être difficile de trouver le bon équilibre, mais mieux vaut favoriser les discussions, car elles suscitent davantage l'engagement que la communication unilatérale.

source: The questions will likely mean that we talk about things ahead of the slides.
fr_fr: Les questions amèneront probablement à aborder des sujets en avance sur les diapositives.

source: This is perfectly okay! Repetition is an important part of learning. Remember that the slides are just a support and you are free to skip them as you like.
fr_fr: C'est tout à fait normal ! La répétition est une composante essentielle de l'apprentissage. Gardez en tête que les diapositives ne sont qu'un support et que vous êtes libre de les ignorer ou de les adapter à votre rythme.

source: The idea for the first day is to show the "basic" things in Rust that should have immediate parallels in other languages. The more advanced parts of Rust come on the subsequent days.
fr_fr: L'idée du premier jour est de présenter les éléments « basiques » de Rust, qui possèdent des équivalents immédiats dans d'autres langages. Les aspects plus avancés sont abordés les jours suivants.

source: If you're teaching this in a classroom, this is a good place to go over the schedule. Note that there is an exercise at the end of each segment, followed by a break. Plan to cover the exercise solution after the break. The times listed here are a suggestion in order to keep the course on schedule. Feel free to be flexible and adjust as necessary!
fr_fr: Si vous enseignez cela en classe, c'est un bon moment pour présenter le programme. Notez qu’un exercice est prévu à la fin de chaque segment, suivi d’une pause. Prévoyez de corriger l’exercice après la pause. Les horaires donnés ici sont indicatifs pour garder le rythme du cours. N'hésitez pas à adapter en fonction du contexte !

source: Rust is a new programming language which had its [1.0 release in 2015](https://blog.rust-lang.org/2015/05/15/Rust-1.0.html):
fr_fr: Rust est un nouveau langage de programmation qui a eu sa [version 1.0 en 2015](https://blog.rust-lang.org/2015/05/15/Rust-1.0.html) :

source: Rust is a statically compiled language in a similar role as C++
fr_fr: Rust est un langage compilé statiquement, jouant un rôle similaire à celui de C++

source: `rustc` uses LLVM as its backend.
fr_fr: `rustc` utilise LLVM comme moteur de compilation.

source: Rust supports many [platforms and architectures](https://doc.rust-lang.org/nightly/rustc/platform-support.html):
fr_fr: Rust prend en charge de nombreuses [plateformes et architectures](https://doc.rust-lang.org/nightly/rustc/platform-support.html) :

source: Rust is used for a wide range of devices:
fr_fr: Rust est utilisé pour une large gamme d'appareils :

source: firmware and boot loaders,
fr_fr: firmwares et chargeurs d’amorçage,

source: smart displays,
fr_fr: écrans intelligents,

source: mobile phones,
fr_fr: téléphones mobiles,

source: desktops,
fr_fr: ordinateurs de bureau,

source: servers.
fr_fr: serveurs.

source: Rust fits in the same area as C++:
fr_fr: Rust s'inscrit dans le même domaine que C++ :

source: High flexibility.
fr_fr: Grande flexibilité.

source: High level of control.
fr_fr: Haut niveau de contrôle.

source: Can be scaled down to very constrained devices such as microcontrollers.
fr_fr: Peut être réduit pour fonctionner sur des appareils très contraints comme les microcontrôleurs.

source: Has no runtime or garbage collection.
fr_fr: N'a pas de temps d'exécution ou de récupération d'ordures.

source: Focuses on reliability and safety without sacrificing performance.
fr_fr: Se concentre sur la fiabilité et la sécurité sans sacrifier les performances.

source: Some unique selling points of Rust:
fr_fr: Quelques arguments de vente uniques à Rust :

source: _Compile time memory safety_ - whole classes of memory bugs are prevented at compile time
fr_fr: _Sécurité mémoire à la compilation_ – des classes entières d’erreurs mémoire sont éliminées à la compilation

source: No uninitialized variables.
fr_fr: Aucune variable non initialisée.

source: No double-frees.
fr_fr: Pas de double libération de mémoire.

source: No use-after-free.
fr_fr: Aucune utilisation après la libération.

source: No `NULL` pointers.
fr_fr: Pas de pointeurs `NULL`.

source: No forgotten locked mutexes.
fr_fr: Pas de mutex verrouillés oubliés.

source: No data races between threads.
fr_fr: Pas de courses de données entre les threads.

source: No iterator invalidation.
fr_fr: Aucune invalidation d'itérateur.

source: _No undefined runtime behavior_ - what a Rust statement does is never left unspecified
fr_fr: _Aucun comportement indéfini à l’exécution_ – le comportement d’une instruction Rust est toujours bien défini

source: Array access is bounds checked.
fr_fr: L’accès aux tableaux est vérifié pour éviter les dépassements de limites.

source: Integer overflow is defined (panic or wrap-around).
fr_fr: Le dépassement d'entier est défini (déclenchement d’une panique ou repli circulaire).

source: _Modern language features_ - as expressive and ergonomic as higher-level languages
fr_fr: _Fonctionnalités modernes_ – aussi expressif et ergonomique que les langages de plus haut niveau

source: Enums and pattern matching.
fr_fr: Énumérations et filtrage par motif.

source: Generics.
fr_fr: Génériques.

source: No overhead FFI.
fr_fr: Interopérabilité avec d’autres langages sans surcoût.

source: Zero-cost abstractions.
fr_fr: Abstractions sans surcoût.

source: Great compiler errors.
fr_fr: Messages d’erreur du compilateur très clairs.

source: Built-in dependency manager.
fr_fr: Gestionnaire de dépendances intégré.

source: Built-in support for testing.
fr_fr: Prise en charge native des tests.

source: Excellent Language Server Protocol support.
fr_fr: Excellente prise en charge du protocole LSP (Language Server Protocol).

source: Do not spend much time here. All of these points will be covered in more depth later.
fr_fr: Ne passez pas trop de temps ici. Tous ces points seront développés plus tard.

source: Make sure to ask the class which languages they have experience with. Depending on the answer you can highlight different features of Rust:
fr_fr: Assurez-vous de demander à la classe dans quels langages ils ont de l'expérience. Selon la réponse, vous pouvez mettre en évidence différentes fonctionnalités de Rust :

source: Experience with C or C++: Rust eliminates a whole class of _runtime errors_ via the borrow checker. You get performance like in C and C++, but you don't have the memory unsafety issues. In addition, you get a modern language with constructs like pattern matching and built-in dependency management.
fr_fr: Expérience avec C ou C++ : Rust élimine toute une classe d'_erreurs d'exécution_ via le vérificateur d'emprunt. On obtient des performances comme en C et C++, mais sans problèmes d'insécurité de la mémoire. De plus, Rust est un langage moderne avec des constructions telles que le filtrage par motif et la gestion intégrée des dépendances.

source: Experience with Java, Go, Python, JavaScript...: You get the same memory safety as in those languages, plus a similar high-level language feeling. In addition you get fast and predictable performance like C and C++ (no garbage collector) as well as access to low-level hardware (should you need it)
fr_fr: Expérience avec Java, Go, Python, JavaScript... : On bénéficie de la même sécurité mémoire que dans ces langages, plus un sentiment de langage de haut niveau similaire. En outre on obtient des performances rapides et prévisibles comme C et C++ (pas de ramassage d'ordures) ainsi que l'accès au matériel de bas niveau (si l'on en a besoin).

source: The [Rust Playground](https://play.rust-lang.org/) provides an easy way to run short Rust programs, and is the basis for the examples and exercises in this course. Try running the "hello-world" program it starts with. It comes with a few handy features:
fr_fr: Le [Rust Playground](https://play.rust-lang.org/) offre un moyen simple d’exécuter de petits programmes Rust, et constitue la base des exemples et exercices de ce cours. Essayez d’exécuter le programme "hello-world" fourni par défaut. Il propose quelques fonctionnalités pratiques :

source: Under "Tools", use the `rustfmt` option to format your code in the "standard" way.
fr_fr: Sous "Tools", utilisez l’option `rustfmt` pour formater votre code de manière "standard".

source: Rust has two main "profiles" for generating code: Debug (extra runtime checks, less optimization) and Release (fewer runtime checks, lots of optimization). These are accessible under "Debug" at the top.
fr_fr: Rust propose deux principaux "profils" de compilation : Debug (vérifications supplémentaires à l’exécution, moins d’optimisation) et Release (moins de vérifications, forte optimisation). Ils sont accessibles sous "Debug" en haut.

source: If you're interested, use "ASM" under "..." to see the generated assembly code.
fr_fr: Si cela vous intéresse, utilisez "ASM" sous "..." pour voir le code assembleur généré.

source: As students head into the break, encourage them to open up the playground and experiment a little. Encourage them to keep the tab open and try things out during the rest of the course. This is particularly helpful for advanced students who want to know more about Rust's optimizations or generated assembly.
fr_fr: À l’approche de la pause, encouragez les étudiants à ouvrir le Playground et à expérimenter un peu. Suggérez-leur de garder l’onglet ouvert pour tester des choses pendant le reste du cours. Cela est particulièrement utile pour les étudiants avancés intéressés par les optimisations ou le code assembleur généré par Rust.

source: Let us jump into the simplest possible Rust program, a classic Hello World program:
fr_fr: Passons au programme Rust le plus simple possible, un Bonjour Monde classique programme:

source: What you see:
fr_fr: Ce que tu vois:

source: Functions are introduced with `fn`.
fr_fr: Les fonctions sont introduites avec `fn`.

source: Blocks are delimited by curly braces like in C and C++.
fr_fr: Les blocs sont délimités par des accolades comme en C et C++.

source: The `main` function is the entry point of the program.
fr_fr: La fonction `main` est le point d'entrée du programme.

source: Rust has hygienic macros, `println!` is an example of this.
fr_fr: Rust a des macros hygiéniques, `println!` en est un exemple.

source: Rust strings are UTF-8 encoded and can contain any Unicode character.
fr_fr: Les strings Rust sont encodées en UTF-8 et peuvent contenir n'importe quel caractère Unicode.

source: This slide tries to make the students comfortable with Rust code. They will see a ton of it over the next four days so we start small with something familiar.
fr_fr: Cette diapositive vise à familiariser les étudiants avec le code Rust. Ils vont en voir énormément durant les quatre prochains jours, alors nous commençons doucement avec quelque chose de familier.

source: Rust is very much like other languages in the C/C++/Java tradition. It is imperative and it doesn't try to reinvent things unless absolutely necessary.
fr_fr: Rust ressemble fortement aux langages issus de la tradition C/C++/Java. Il est impératif et n’essaie de réinventer les choses que lorsque c’est absolument nécessaire.

source: Rust is modern with full support for things like Unicode.
fr_fr: Rust est moderne et prend entièrement en charge des éléments comme Unicode.

source: Rust uses macros for situations where you want to have a variable number of arguments (no function [overloading](../control-flow-basics/functions.md)).
fr_fr: Rust utilise des macros dans les cas où un nombre variable d’arguments est nécessaire (pas de [surcharge de fonctions](../control-flow-basics/functions.md)).

source: Macros being 'hygienic' means they don't accidentally capture identifiers from the scope they are used in. Rust macros are actually only [partially hygienic](https://veykril.github.io/tlborm/decl-macros/minutiae/hygiene.html).
fr_fr: Le fait que les macros soient « hygiéniques » signifie qu’elles ne capturent pas accidentellement les identifiants de la portée dans laquelle elles sont utilisées. Les macros de Rust ne sont toutefois [que partiellement hygiéniques](https://veykril.github.io/tlborm/decl-macros/minutiae/hygiene.html).

source: Rust is multi-paradigm. For example, it has powerful [object-oriented programming features](https://doc.rust-lang.org/book/ch17-00-oop.html), and, while it is not a functional language, it includes a range of [functional concepts](https://doc.rust-lang.org/book/ch13-00-functional-features.html).
fr_fr: Rust est multi-paradigme. Par exemple, il dispose de puissantes [fonctionnalités orientées objet](https://doc.rust-lang.org/book/ch17-00-oop.html), et bien qu’il ne soit pas un langage fonctionnel, il intègre de nombreux [concepts fonctionnels](https://doc.rust-lang.org/book/ch13-00-functional-features.html).

source: Rust provides type safety via static typing. Variable bindings are made with `let`:
fr_fr: Rust garantit la sécurité des types grâce au typage statique. Les variables sont déclarées avec `let` :

source: Uncomment the `x = 20` to demonstrate that variables are immutable by default. Add the `mut` keyword to allow changes.
fr_fr: Décommentez `x = 20` pour montrer que les variables sont immuables par défaut. Ajoutez le mot-clé `mut` pour autoriser les modifications.

source: The `i32` here is the type of the variable. This must be known at compile time, but type inference (covered later) allows the programmer to omit it in many cases.
fr_fr: Le `i32` ici est le type de la variable. Celui-ci doit être connu à la compilation, mais l’inférence de type (vue plus tard) permet de l’omettre dans de nombreux cas.

source: Here are some basic built-in types, and the syntax for literal values of each type.
fr_fr: Voici quelques types de base intégrés, ainsi que la syntaxe pour leurs valeurs littérales respectives.

source: Literals
fr_fr: Littéraux

source: Signed integers
fr_fr: Entiers signés

source: Unsigned integers
fr_fr: Entiers non signés

source: Floating point numbers
fr_fr: Nombres à virgule flottante

source: Unicode scalar values
fr_fr: Valeurs scalaires Unicode

source: Booleans
fr_fr: Booléens

source: The types have widths as follows:
fr_fr: Les types ont les largeurs suivantes :

source: `iN`, `uN`, and `fN` are _N_ bits wide,
fr_fr: `iN`, `uN` et `fN` ont une largeur de _N_ bits,

source: `isize` and `usize` are the width of a pointer,
fr_fr: `isize` et `usize` ont la largeur d’un pointeur,

source: `char` is 32 bits wide,
fr_fr: `char` a une largeur de 32 bits,

source: `bool` is 8 bits wide.
fr_fr: `bool` a une largeur de 8 bits.

source: There are a few syntaxes which are not shown above:
fr_fr: Certaines syntaxes ne sont pas montrées ci-dessus :

source: All underscores in numbers can be left out, they are for legibility only. So `1_000` can be written as `1000` (or `10_00`), and `123_i64` can be written as `123i64`.
fr_fr: Les traits de soulignement dans les nombres peuvent être omis, ils servent uniquement à la lisibilité. Ainsi, `1_000` peut s’écrire `1000` (ou `10_00`), et `123_i64` peut s’écrire `123i64`.

source: This is the first time we've seen a function other than `main`, but the meaning should be clear: it takes three integers, and returns an integer. Functions will be covered in more detail later.
fr_fr: C’est la première fois que nous voyons une fonction autre que `main`, mais son sens devrait être clair : elle prend trois entiers et retourne un entier. Les fonctions seront abordées plus en détail plus tard.

source: Arithmetic is very similar to other languages, with similar precedence.
fr_fr: L’arithmétique est très proche de celle des autres langages, avec des priorités similaires.
