Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: The heap memory allocated for `name` will be freed at the end of the `say_hello` function.
fr_fr: La mémoire du tas allouée pour `name` sera libérée à la fin de la fonction `say_hello`.

source: `main` can retain ownership if it passes `name` as a reference (`&name`) and if `say_hello` accepts a reference as a parameter.
fr_fr: `main` peut conserver la propriété s'il passe `name` comme référence (`&name`) et si `say_hello` accepte une référence comme paramètre.

source: Alternatively, `main` can pass a clone of `name` in the first call (`name.clone()`).
fr_fr: Alternativement, `main` peut passer un clone de `name` dans le premier appel (`name.clone()`).

source: Rust makes it harder than C++ to inadvertently create copies by making move semantics the default, and by forcing programmers to make clones explicit.
fr_fr: Rust rend plus difficile que C++ la création de copies par inadvertance en faisant de la sémantique de déplacement la valeur par défaut et en forçant les programmeurs à rendre les clones explicites.

source: Defensive Copies in Modern C++
fr_fr: Copies défensives en C++ moderne

source: Modern C++ solves this differently:
fr_fr: Le C++ moderne résout cela différemment :

source: // Duplicate the data in s1.
fr_fr: // Dupliquer les données de s1.

source: The heap data from `s1` is duplicated and `s2` gets its own independent copy.
fr_fr: Les données de tas de `s1` sont dupliquées et `s2` obtient sa propre copie indépendante.

source: When `s1` and `s2` go out of scope, they each free their own memory.
fr_fr: Lorsque `s1` et `s2` sortent de la portée, ils libèrent chacun leur propre mémoire.

source: Before copy-assignment:
fr_fr: Avant l'affectation de copie :

source: After copy-assignment:
fr_fr: Après l'affectation de copie :

source: C++ has made a slightly different choice than Rust. Because `=` copies data, the string data has to be cloned. Otherwise we would get a double-free when either string goes out of scope.
fr_fr: C++ a fait un choix légèrement différent de Rust. L’opérateur `=` copie les données, donc les chaînes doivent être clonées, sinon on risque un double `free` à la sortie de portée.

source: C++ also has [`std::move`](https://en.cppreference.com/w/cpp/utility/move), which is used to indicate when a value may be moved from. If the example had been `s2 = std::move(s1)`, no heap allocation would take place. After the move, `s1` would be in a valid but unspecified state. Unlike Rust, the programmer is allowed to keep using `s1`.
fr_fr: C++ propose également [`std::move`](https://en.cppreference.com/w/cpp/utility/move), qui indique qu’une valeur peut être déplacée. Dans un exemple comme `s2 = std::move(s1)`, aucune allocation ne se produirait. Après le move, `s1` serait dans un état valide mais indéfini. Contrairement à Rust, l’utilisation de `s1` reste autorisée.

source: Unlike Rust, `=` in C++ can run arbitrary code as determined by the type which is being copied or moved.
fr_fr: Contrairement à Rust, l’opérateur `=` en C++ peut exécuter du code arbitraire selon le type copié ou déplacé.

source: Sometimes you _want_ to make a copy of a value. The `Clone` trait accomplishes this.
fr_fr: Parfois, vous _voulez_ copier une valeur. Le trait `Clone` permet cela.

source: The idea of `Clone` is to make it easy to spot where heap allocations are occurring. Look for `.clone()` and a few others like `Vec::new` or `Box::new`.
fr_fr: L’idée de `Clone` est de repérer facilement où ont lieu les allocations sur le tas. Cherchez les `.clone()` ou `Vec::new`, `Box::new`.

source: It's common to "clone your way out" of problems with the borrow checker, and return later to try to optimize those clones away.
fr_fr: Il est courant de "résoudre" les problèmes avec le vérificateur d’emprunts en utilisant `.clone()`, puis d’optimiser cela ensuite.

source: While move semantics are the default, certain types are copied by default:
fr_fr: Bien que la sémantique de déplacement soit la valeur par défaut, certains types sont copiés par défaut :

source: These types implement the `Copy` trait.
fr_fr: Ces types implémentent le trait `Copy`.

source: You can opt-in your own types to use copy semantics:
fr_fr: Vous pouvez activer vos propres types pour utiliser la sémantique de copie :

source: After the assignment, both `p1` and `p2` own their own data.
fr_fr: Après l'affectation, `p1` et `p2` possèdent leurs propres données.

source: We can also use `p1.clone()` to explicitly copy the data.
fr_fr: Nous pouvons également utiliser `p1.clone()` pour copier explicitement les données.

source: Copying and cloning are not the same thing:
fr_fr: La copie et le clonage ne sont pas la même chose :

source: Copying refers to bitwise copies of memory regions and does not work on arbitrary objects.
fr_fr: La copie fait référence à des copies bit à bit de régions mémoire et ne fonctionne pas avec des objets arbitraires.

source: Copying does not allow for custom logic (unlike copy constructors in C++).
fr_fr: La copie ne permet pas de logique personnalisée (contrairement aux constructeurs de copie en C++).

source: Cloning is a more general operation and also allows for custom behavior by implementing the `Clone` trait.
fr_fr: Le clonage est une opération plus générale et permet également un comportement personnalisé en implémentant le trait `Clone`.

source: Copying does not work on types that implement the `Drop` trait.
fr_fr: La copie ne fonctionne pas pour les types qui implémentent le trait `Drop`.

source: In the above example, try the following:
fr_fr: Dans l'exemple ci-dessus, essayez ce qui suit :

source: Add a `String` field to `struct Point`. It will not compile because `String` is not a `Copy` type.
fr_fr: Ajoutez un champ `String` à `struct Point`. Il ne compilera pas car `String` n’est pas un type `Copy`.

source: Remove `Copy` from the `derive` attribute. The compiler error is now in the `println!` for `p1`.
fr_fr: Supprimez `Copy` de l’attribut `derive`. L’erreur du compilateur apparaîtra maintenant dans le `println!` de `p1`.

source: Show that it works if you clone `p1` instead.
fr_fr: Montrez que cela fonctionne si vous clonez `p1` à la place.

source: The `Drop` Trait
fr_fr: Le trait `Drop`

source: Values which implement [`Drop`](https://doc.rust-lang.org/std/ops/trait.Drop.html) can specify code to run when they go out of scope:
fr_fr: Les valeurs qui implémentent [`Drop`](https://doc.rust-lang.org/std/ops/trait.Drop.html) peuvent spécifier du code à exécuter lorsqu'elles sortent de leur portée :

source: "Dropping {}"
fr_fr: "Destruction de {}"

source: "Exiting block B"
fr_fr: "Sortie du bloc B"

source: "Exiting block A"
fr_fr: "Sortie du bloc A"

source: "Exiting main"
fr_fr: "Sortie de main"

source: Note that `std::mem::drop` is not the same as `std::ops::Drop::drop`.
fr_fr: Notez que `std::mem::drop` n’est pas équivalent à `std::ops::Drop::drop`.

source: Values are automatically dropped when they go out of scope.
fr_fr: Les valeurs sont automatiquement détruites lorsqu’elles sortent de portée.

source: When a value is dropped, if it implements `std::ops::Drop` then its `Drop::drop` implementation will be called.
fr_fr: Lorsqu’une valeur est détruite et implémente `std::ops::Drop`, la méthode `drop` correspondante est appelée.

source: All its fields will then be dropped too, whether or not it implements `Drop`.
fr_fr: Tous ses champs seront ensuite détruits, qu’ils implémentent ou non `Drop`.

source: `std::mem::drop` is just an empty function that takes any value. The significance is that it takes ownership of the value, so at the end of its scope it gets dropped. This makes it a convenient way to explicitly drop values earlier than they would otherwise go out of scope.
fr_fr: `std::mem::drop` est une fonction vide qui prend possession d’une valeur. À la fin de sa portée, la valeur est détruite, ce qui permet de la détruire explicitement plus tôt que prévu.

source: This can be useful for objects that do some work on `drop`: releasing locks, closing files, etc.
fr_fr: Cela est utile pour les objets qui effectuent des actions lors de leur destruction : libérer un verrou, fermer un fichier, etc.

source: Why doesn't `Drop::drop` take `self`?
fr_fr: Pourquoi `Drop::drop` ne prend-il pas `self` ?

source: Short-answer: If it did, `std::mem::drop` would be called at the end of the block, resulting in another call to `Drop::drop`, and a stack overflow!
fr_fr: Réponse courte : si c'était le cas, `std::mem::drop` serait appelé à la fin du bloc, entraînant un autre appel à `Drop::drop`, et un débordement de pile !

source: Try replacing `drop(a)` with `a.drop()`.
fr_fr: Essayez de remplacer `drop(a)` par `a.drop()`.

source: In this example, we will implement a complex data type that owns all of its data. We will use the "builder pattern" to support building a new value piece-by-piece, using convenience functions.
fr_fr: Dans cet exemple, nous allons implémenter un type de données complexe qui possède l’ensemble de ses données. Nous utiliserons le « builder pattern » pour construire une valeur étape par étape à l’aide de fonctions pratiques.

source: Fill in the missing pieces.
fr_fr: Complétez les parties manquantes.

source: /// A representation of a software package.
fr_fr: /// Représentation d’un paquet logiciel.

source: /// Return a representation of this package as a dependency, for use in /// building other packages.
fr_fr: /// Retourne une représentation de ce paquet comme dépendance, pour l’utiliser dans d’autres paquets.

source: /// A builder for a Package. Use `build()` to create the `Package` itself.
fr_fr: /// Constructeur pour un `Package`. Utiliser `build()` pour créer le `Package` final.

source: /// Set the package version.
fr_fr: /// Définit la version du paquet.

source: /// Set the package authors.
fr_fr: /// Définit les auteurs du paquet.

source: /// Add an additional dependency.
fr_fr: /// Ajoute une dépendance supplémentaire.

source: /// Set the language. If not set, language defaults to None.
fr_fr: /// Définit le langage. Par défaut, il vaut None.

source: [`Box`](https://doc.rust-lang.org/std/boxed/struct.Box.html) is an owned pointer to data on the heap:
fr_fr: [`Box`](https://doc.rust-lang.org/std/boxed/struct.Box.html) est un pointeur propriétaire vers des données sur le tas :

source: "five: {}"
fr_fr: "cinq : {}"

source: `Box<T>` implements `Deref<Target = T>`, which means that you can [call methods from `T` directly on a `Box<T>`](https://doc.rust-lang.org/std/ops/trait.Deref.html#more-on-deref-coercion).
fr_fr: `Box<T>` implémente `Deref<Target = T>`, ce qui signifie que vous pouvez [appeler les méthodes de `T` directement sur une `Box<T>`](https://doc.rust-lang.org/std/ops/trait.Deref.html#more-on-deref-coercion).

source: Recursive data types or data types with dynamic sizes need to use a `Box`:
fr_fr: Les types de données récursifs ou avec des tailles dynamiques doivent utiliser une `Box` :

source: /// A non-empty list: first element and the rest of the list.
fr_fr: /// Une liste non vide : premier élément et reste de la liste.

source: /// An empty list.
fr_fr: /// Une liste vide.

source: ```bob Stack Heap .- - - - - - - - - - - - - - . .- - - - - - - - - - - - - - - - - - - - - - - - -. : : : : : list : : : : +---------+----+----+ : : +---------+----+----+ +------+----+----+ : : | Element | 1 | o--+----+-----+--->| Element | 2 | o--+--->| Nil | // | // | : : +---------+----+----+ : : +---------+----+----+ +------+----+----+ : : : : : : : : : '- - - - - - - - - - - - - - ' '- - - - - - - - - - - - - - - - - - - - - - - - -' ```
fr_fr: ```bob Pile Tas .- - - - - - - - - - - - - - . .- - - - - - - - - - - - - - - - - - - - - - - - -. : : : : : list : : : : +---------+----+----+ : : +---------+----+----+ +------+----+----+ : : | Élément | 1 | o--+----+-----+--->| Élément | 2 | o--+--->| Nil | // | // | : : +---------+----+----+ : : +---------+----+----+ +------+----+----+ : : : : : : : : : '- - - - - - - - - - - - - - ' '- - - - - - - - - - - - - - - - - - - - - - - - -' ```

source: `Box` is like `std::unique_ptr` in C++, except that it's guaranteed to be not null.
fr_fr: `Box` est comme `std::unique_ptr` en C++, sauf qu’il est garanti non nul.

source: A `Box` can be useful when you:
fr_fr: Une `Box` peut être utile lorsque vous :

source: have a type whose size that can't be known at compile time, but the Rust compiler wants to know an exact size.
fr_fr: avez un type dont la taille ne peut pas être connue à la compilation, mais le compilateur Rust exige une taille exacte.

source: want to transfer ownership of a large amount of data. To avoid copying large amounts of data on the stack, instead store the data on the heap in a `Box` so only the pointer is moved.
fr_fr: voulez transférer la propriété d'une grande quantité de données. Pour éviter de copier beaucoup de données sur la pile, stockez-les sur le tas dans une `Box`, de sorte que seul le pointeur soit déplacé.

source: If `Box` was not used and we attempted to embed a `List` directly into the `List`, the compiler would not be able to compute a fixed size for the struct in memory (the `List` would be of infinite size).
fr_fr: Si on n’utilise pas de `Box` et qu’on tente d’imbriquer une `List` dans une autre `List`, le compilateur ne pourra pas déterminer une taille fixe pour la structure en mémoire (la `List` aurait une taille infinie).

source: `Box` solves this problem as it has the same size as a regular pointer and just points at the next element of the `List` in the heap.
fr_fr: `Box` résout ce problème car elle a la même taille qu’un pointeur normal et pointe simplement vers le prochain élément de la `List` dans le tas.

source: Remove the `Box` in the List definition and show the compiler error. We get the message "recursive without indirection", because for data recursion, we have to use indirection, a `Box` or reference of some kind, instead of storing the value directly.
fr_fr: Supprimez la `Box` dans la définition de la `List` et affichez l’erreur du compilateur. On obtient le message « recursive without indirection », car pour les structures récursives, on doit utiliser une indirection, comme une `Box` ou une référence, au lieu de stocker la valeur directement.

source: Niche Optimization
fr_fr: Optimisation niche

source: Though `Box` looks like `std::unique_ptr` in C++, it cannot be empty/null. This makes `Box` one of the types that allow the compiler to optimize storage of some enums.
fr_fr: Même si `Box` ressemble à `std::unique_ptr` en C++, il ne peut pas être nul. Cela permet au compilateur d’optimiser le stockage de certains énumérations.

source: For example, `Option<Box<T>>` has the same size, as just `Box<T>`, because compiler uses NULL-value to discriminate variants instead of using explicit tag (["Null Pointer Optimization"](https://doc.rust-lang.org/std/option/#representation)):
fr_fr: Par exemple, `Option<Box<T>>` a la même taille que `Box<T>`, car le compilateur utilise une valeur nulle pour distinguer les variantes au lieu d’un tag explicite ([« Null Pointer Optimization »](https://doc.rust-lang.org/std/option/#representation)) :

source: "Just box"
fr_fr: "Juste box"

source: "Optional box"
fr_fr: "Box optionnelle"

source: "Size of just_box: {}"
fr_fr: "Taille de just_box : {}"

source: "Size of optional_box: {}"
fr_fr: "Taille de optional_box : {}"

source: "Size of none: {}"
fr_fr: "Taille de none : {}"

source: [`Rc`](https://doc.rust-lang.org/std/rc/struct.Rc.html) is a reference-counted shared pointer. Use this when you need to refer to the same data from multiple places:
fr_fr: [`Rc`](https://doc.rust-lang.org/std/rc/struct.Rc.html) est un pointeur partagé avec comptage de références. Utilisez-le lorsque vous devez référencer les mêmes données depuis plusieurs endroits :

source: See [`Arc`](../concurrency/shared_state/arc.md) and [`Mutex`](https://doc.rust-lang.org/std/sync/struct.Mutex.html) if you are in a multi-threaded context.
fr_fr: Voir [`Arc`](../concurrency/shared_state/arc.md) et [`Mutex`](https://doc.rust-lang.org/std/sync/struct.Mutex.html) si vous êtes dans un contexte multi-threadé.

source: You can _downgrade_ a shared pointer into a [`Weak`](https://doc.rust-lang.org/std/rc/struct.Weak.html) pointer to create cycles that will get dropped.
fr_fr: Vous pouvez _rétrograder_ un pointeur partagé en un pointeur [`Weak`](https://doc.rust-lang.org/std/rc/struct.Weak.html) afin de créer des cycles qui pourront être libérés.

source: `Rc`'s count ensures that its contained value is valid for as long as there are references.
fr_fr: Le compteur de `Rc` garantit que la valeur contenue reste valide tant qu’il existe des références.

source: `Rc` in Rust is like `std::shared_ptr` in C++.
fr_fr: `Rc` en Rust est comme `std::shared_ptr` en C++.

source: `Rc::clone` is cheap: it creates a pointer to the same allocation and increases the reference count. Does not make a deep clone and can generally be ignored when looking for performance issues in code.
fr_fr: `Rc::clone` est peu coûteux : il crée un pointeur vers la même allocation et augmente le compteur de références. Il ne crée pas de clonage profond et peut généralement être ignoré lorsqu'on recherche des problèmes de performance dans le code.

source: `make_mut` actually clones the inner value if necessary ("clone-on-write") and returns a mutable reference.
fr_fr: `make_mut` clone en réalité la valeur interne si nécessaire ("clone-on-write") et renvoie une référence mutable.

source: Use `Rc::strong_count` to check the reference count.
fr_fr: Utilisez `Rc::strong_count` pour vérifier le compteur de références.

source: `Rc::downgrade` gives you a _weakly reference-counted_ object to create cycles that will be dropped properly (likely in combination with `RefCell`).
fr_fr: `Rc::downgrade` vous donne un objet _faiblement compté en référence_ pour créer des cycles qui seront correctement supprimés (souvent en combinaison avec `RefCell`).

source: Trait objects allow for values of different types, for instance in a collection:
fr_fr: Les objets de trait permettent d’avoir des valeurs de différents types, par exemple dans une collection :

source: "Miau!"
fr_fr: "Miaou !"

source: "Hello, who are you? {}"
fr_fr: "Bonjour, qui es-tu ? {}"

source: Memory layout after allocating `pets`:
fr_fr: Disposition mémoire après allocation de `pets` :

source: ```bob Stack Heap .- - - - - - - - - - - - - -. .- - - - - - - - - - - - - - - - - - - - - - -. : : : : : "pets: Vec<dyn Pet>" : : "data: Cat" +----+----+----+----+ : : +-----------+-------+ : : +-------+-------+ | F | i | d | o | : : | ptr | o---+---+--. : | lives | 9 | +----+----+----+----+ : : | len | 2 | : | : +-------+-------+ ^ : : | capacity | 2 | : | : ^ | : : +-----------+-------+ : | : | '-------. : : : | : | data:"Dog"| : : : | : | +-------+--|-------+ : `- - - - - - - - - - - - - -' | : +---|-+-----+ | name | o, 4, 4 | : `--+-->| o o | o o-|----->| age | 5 | : : +-|---+-|---+ +-------+----------+ : : | | : `- - -| - - |- - - - - - - - - - - - - - - - -' | | | | "Program text" .- - -| - - |- - - - - - - - - - - - - - - - -. : | | vtable : : | | +----------------------+ : : | `----->| "<Dog as Pet>::talk" | : : | +----------------------+ : : | vtable : : | +----------------------+ : : '----------->| "<Cat as Pet>::talk" | : : +----------------------+ : : : '- - - - - - - - - - - - - - - - - - - - - - -' ```
fr_fr: ```bob Pile Tas .- - - - - - - - - - - - - -. .- - - - - - - - - - - - - - - - - - - - - - -. : : : : : "pets: Vec<dyn Pet>" : : "data: Cat" +----+----+----+----+ : : +-----------+-------+ : : +-------+-------+ | F | i | d | o | : : | ptr | o---+---+--. : | lives | 9 | +----+----+----+----+ : : | len | 2 | : | : +-------+-------+ ^ : : | capacity | 2 | : | : ^ | : : +-----------+-------+ : | : | '-------. : : : | : | data:"Dog"| : : : | : | +-------+--|-------+ : `- - - - - - - - - - - - - -' | : +---|-+-----+ | name | o, 4, 4 | : `--+-->| o o | o o-|----->| age | 5 | : : +-|---+-|---+ +-------+----------+ : : | | : `- - -| - - |- - - - - - - - - - - - - - - - -' | | | | "Texte du programme" .- - -| - - |- - - - - - - - - - - - - - - - -. : | | table virtuelle : : | | +----------------------+ : : | `----->| "<Dog as Pet>::talk" | : : | +----------------------+ : : | table virtuelle : : | +----------------------+ : : '----------->| "<Cat as Pet>::talk" | : : +----------------------+ : : : '- - - - - - - - - - - - - - - - - - - - - - -' ```

source: Types that implement a given trait may be of different sizes. This makes it impossible to have things like `Vec<dyn Pet>` in the example above.
fr_fr: Les types qui implémentent un même trait peuvent avoir des tailles différentes. C’est pourquoi on ne peut pas avoir directement un `Vec<dyn Pet>`.

source: `dyn Pet` is a way to tell the compiler about a dynamically sized type that implements `Pet`.
fr_fr: `dyn Pet` permet d’indiquer au compilateur un type de taille dynamique qui implémente `Pet`.

source: In the example, `pets` is allocated on the stack and the vector data is on the heap. The two vector elements are _fat pointers_:
fr_fr: Dans l’exemple, `pets` est alloué sur la pile et les données du vecteur sur le tas. Les deux éléments sont des _pointeurs larges_ (fat pointers) :

source: A fat pointer is a double-width pointer. It has two components: a pointer to the actual object and a pointer to the [virtual method table](https://en.wikipedia.org/wiki/Virtual_method_table) (vtable) for the `Pet` implementation of that particular object.
fr_fr: Un pointeur large contient deux parties : un pointeur vers l’objet et un autre vers la [table virtuelle des méthodes](https://en.wikipedia.org/wiki/Virtual_method_table) (vtable) de l’implémentation du trait `Pet`.

source: The data for the `Dog` named Fido is the `name` and `age` fields. The `Cat` has a `lives` field.
fr_fr: Le `Dog` nommé Fido possède les champs `name` et `age`. Le `Cat` possède le champ `lives`.

source: Compare these outputs in the above example:
fr_fr: Comparer les sorties dans l’exemple ci-dessus :

source: A binary tree is a tree-type data structure where every node has two children (left and right). We will create a tree where each node stores a value. For a given node N, all nodes in a N's left subtree contain smaller values, and all nodes in N's right subtree will contain larger values.
fr_fr: Un arbre binaire est une structure dans laquelle chaque nœud a deux enfants (gauche et droite). On souhaite construire un arbre tel que pour un nœud N, tous les nœuds à gauche contiennent une valeur plus petite, et tous les nœuds à droite une valeur plus grande.

source: Implement the following types, so that the given tests pass.
fr_fr: Implémentez les types suivants de façon à faire passer les tests.

source: Extra Credit: implement an iterator over a binary tree that returns the values in order.
fr_fr: Bonus : implémentez un itérateur sur l’arbre binaire qui renvoie les valeurs dans l’ordre.

source: /// A node in the binary tree.
fr_fr: /// Un nœud de l’arbre binaire.

source: /// A possibly-empty subtree.
fr_fr: /// Une sous-arborescence potentiellement vide.

source: /// A container storing a set of values, using a binary tree. /// /// If the same value is added multiple times, it is only stored once.
fr_fr: /// Conteneur de valeurs stockées sous forme d’arbre binaire. /// /// Si une même valeur est ajoutée plusieurs fois, elle n’est stockée qu’une seule fois.

source: // Implement `new`, `insert`, `len`, and `has`.
fr_fr: // Implémentez `new`, `insert`, `len` et `has`.

source: // not a unique item
fr_fr: // pas un élément unique
