Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: As we saw before, instead of transferring ownership when calling a function, you can let a function _borrow_ the value:
fr_fr: Comme nous l'avons vu précédemment, au lieu de transférer la propriété lors de l'appel à une fonction, vous pouvez laisser la fonction _emprunter_ la valeur :

source: The `add` function _borrows_ two points and returns a new point.
fr_fr: La fonction `add` _emprunte_ deux points et renvoie un nouveau point.

source: The caller retains ownership of the inputs.
fr_fr: L'appelant conserve la propriété des valeurs passées en entrée.

source: This slide is a review of the material on references from day 1, expanding slightly to include function arguments and return values.
fr_fr: Cette diapositive est une révision des références vues au jour 1, en y ajoutant les arguments et valeurs de retour des fonctions.

source: Notes on stack returns:
fr_fr: Remarques sur les valeurs retournées par la pile :

source: Demonstrate that the return from `add` is cheap because the compiler can eliminate the copy operation. Change the above code to print stack addresses and run it on the [Playground](https://play.rust-lang.org/?version=stable&mode=release&edition=2021&gist=0cb13be1c05d7e3446686ad9947c4671) or look at the assembly in [Godbolt](https://rust.godbolt.org/). In the "DEBUG" optimization level, the addresses should change, while they stay the same when changing to the "RELEASE" setting:
fr_fr: Montrez que le retour de la fonction `add` est peu coûteux, car le compilateur peut éliminer la copie. Modifiez le code pour afficher les adresses en pile, puis exécutez-le dans le [Playground](https://play.rust-lang.org/?version=stable&mode=release&edition=2021&gist=0cb13be1c05d7e3446686ad9947c4671) ou visualisez l’assembleur dans [Godbolt](https://rust.godbolt.org/). En mode DEBUG, les adresses devraient changer, alors qu’elles restent les mêmes en mode RELEASE :

source: The Rust compiler can do return value optimization (RVO).
fr_fr: Le compilateur Rust effectue une optimisation de retour de valeur (RVO).

source: In C++, copy elision has to be defined in the language specification because constructors can have side effects. In Rust, this is not an issue at all. If RVO did not happen, Rust will always perform a simple and efficient `memcpy` copy.
fr_fr: En C++, l’évitement de copie doit être spécifié dans le langage, car les constructeurs peuvent avoir des effets de bord. En Rust, ce n’est pas un problème. Si RVO ne s’applique pas, Rust effectuera une copie par `memcpy`, simple et efficace.

source: Rust's _borrow checker_ puts constraints on the ways you can borrow values. For a given value, at any time:
fr_fr: Le _vérificateur d’emprunts_ de Rust impose des contraintes sur la manière dont vous pouvez emprunter des valeurs. Pour une valeur donnée, à un moment donné :

source: You can have one or more shared references to the value, _or_
fr_fr: Vous pouvez avoir une ou plusieurs références partagées à la valeur, _ou_

source: You can have exactly one exclusive reference to the value.
fr_fr: Vous pouvez avoir exactement une seule référence exclusive à la valeur.

source: Note that the requirement is that conflicting references not _exist_ at the same point. It does not matter where the reference is dereferenced.
fr_fr: Il est interdit que des références conflictuelles _existent_ au même moment, même si elles ne sont pas déréférencées.

source: The above code does not compile because `a` is borrowed as mutable (through `c`) and as immutable (through `b`) at the same time.
fr_fr: Le code ci-dessus ne compile pas car `a` est emprunté comme mutable (via `c`) et comme immuable (via `b`) en même temps.

source: Move the `println!` statement for `b` before the scope that introduces `c` to make the code compile.
fr_fr: Déplacez l'instruction `println!` pour `b` avant la portée qui introduit `c` pour que le code compile.

source: After that change, the compiler realizes that `b` is only ever used before the new mutable borrow of `a` through `c`. This is a feature of the borrow checker called "non-lexical lifetimes".
fr_fr: Après ce changement, le compilateur comprend que `b` est uniquement utilisé avant le nouvel emprunt mutable de `a` via `c`. Il s'agit d'une fonctionnalité du vérificateur d'emprunts appelée "durées de vie non lexicales".

source: The exclusive reference constraint is quite strong. Rust uses it to ensure that data races do not occur. Rust also _relies_ on this constraint to optimize code. For example, a value behind a shared reference can be safely cached in a register for the lifetime of that reference.
fr_fr: La contrainte d’unicité d’une référence exclusive est forte. Rust l’utilise pour garantir l’absence de data race, et aussi pour optimiser : par exemple, une valeur partagée peut être mise en cache dans un registre pendant toute la durée de vie de la référence.

source: The borrow checker is designed to accommodate many common patterns, such as taking exclusive references to different fields in a struct at the same time. But, there are some situations where it doesn't quite "get it" and this often results in "fighting with the borrow checker."
fr_fr: Le vérificateur d’emprunts (borrow checker) accepte de nombreux cas courants, comme emprunter plusieurs champs d’une structure de manière exclusive. Mais il y a des cas où il échoue, et cela donne l’impression de « se battre contre le borrow checker ».

source: In some situations, it's necessary to modify data behind a shared (read-only) reference. For example, a shared data structure might have an internal cache, and wish to update that cache from read-only methods.
fr_fr: Dans certains cas, il faut modifier des données via une référence partagée (lecture seule). Par exemple, une structure partagée peut avoir un cache interne qu’elle souhaite mettre à jour depuis une méthode en lecture.

source: The "interior mutability" pattern allows exclusive (mutable) access behind a shared reference. The standard library provides several ways to do this, all while still ensuring safety, typically by performing a runtime check.
fr_fr: Le motif de « mutabilité interne » permet une modification exclusive via une référence partagée. La bibliothèque standard offre plusieurs outils sûrs pour cela, souvent via des vérifications à l’exécution.

source: "graph: {root:#?}"
fr_fr: "graphe : {root:#?}"

source: "graph sum: {}"
fr_fr: "somme du graphe : {}"

source: `Cell` wraps a value and allows getting or setting the value, even with a shared reference to the `Cell`. However, it does not allow any references to the value. Since there are no references, borrowing rules cannot be broken.
fr_fr: `Cell` encapsule une valeur et permet de la lire ou modifier même via une référence partagée vers la `Cell`. Cependant, il ne donne pas de références à la valeur, donc les règles d’emprunt ne peuvent pas être enfreintes.

source: The main thing to take away from this slide is that Rust provides _safe_ ways to modify data behind a shared reference. There are a variety of ways to ensure that safety, and `RefCell` and `Cell` are two of them.
fr_fr: À retenir : Rust permet de modifier _de façon sûre_ des données derrière une référence partagée. `RefCell` et `Cell` sont deux des moyens proposés pour cela.

source: `RefCell` enforces Rust's usual borrowing rules (either multiple shared references or a single exclusive reference) with a runtime check. In this case, all borrows are very short and never overlap, so the checks always succeed.
fr_fr: `RefCell` applique les règles d’emprunt de Rust (plusieurs lectures ou une seule écriture) via une vérification à l’exécution. Dans ce cas, tous les emprunts sont courts et non superposés, donc ça fonctionne.

source: `Rc` only allows shared (read-only) access to its contents, since its purpose is to allow (and count) many references. But we want to modify the value, so we need interior mutability.
fr_fr: `Rc` ne permet que des accès partagés en lecture. Pour modifier la valeur, il faut donc utiliser une mutabilité interne.

source: `Cell` is a simpler means to ensure safety: it has a `set` method that takes `&self`. This needs no runtime check, but requires moving values, which can have its own cost.
fr_fr: `Cell` garantit la sûreté de façon simple : sa méthode `set` prend un `&self`. Cela évite la vérification à l’exécution, mais implique des mouvements de valeur.

source: Demonstrate that reference loops can be created by adding `root` to `subtree.children`.
fr_fr: Montrez qu’on peut créer une boucle de références en ajoutant `root` à `subtree.children`.

source: To demonstrate a runtime panic, add a `fn inc(&mut self)` that increments `self.value` and calls the same method on its children. This will panic in the presence of the reference loop, with `thread 'main' panicked at 'already borrowed: BorrowMutError'`.
fr_fr: Pour provoquer une panique à l’exécution, ajoutez une méthode `inc(&mut self)` qui incrémente `self.value` et appelle la même méthode sur les enfants. Cela plantera si une boucle de références est présente, avec l’erreur : `already borrowed: BorrowMutError`.

source: You're working on implementing a health-monitoring system. As part of that, you need to keep track of users' health statistics.
fr_fr: Vous travaillez à la mise en place d’un système de surveillance de la santé. Dans ce cadre, vous devez suivre les statistiques de santé des utilisateurs.

source: You'll start with a stubbed function in an `impl` block as well as a `User` struct definition. Your goal is to implement the stubbed out method on the `User` `struct` defined in the `impl` block.
fr_fr: Vous commencerez avec une fonction incomplète dans un bloc `impl` ainsi qu’une définition de structure `User`. Votre objectif est d’implémenter la méthode laissée en attente dans la structure `User` définie dans ce bloc `impl`.

source: Copy the code below to <https://play.rust-lang.org/> and fill in the missing method:
fr_fr: Copiez le code ci-dessous sur <https://play.rust-lang.org/> et complétez la méthode manquante :

source: "Update a user's statistics based on measurements from a visit to the doctor"
fr_fr: "Mettre à jour les statistiques d’un utilisateur à partir des mesures prises lors d’une visite médicale"

source: "I'm {} and my age is {}"
fr_fr: "Je suis {} et j’ai {} ans"

source: A reference has a _lifetime_, which must not "outlive" the value it refers to. This is verified by the borrow checker.
fr_fr: Une référence possède une _durée de vie_, qui ne peut pas dépasser celle de la valeur référencée. Ceci est vérifié par le vérificateur d’emprunts (borrow checker).

source: The lifetime can be implicit - this is what we have seen so far. Lifetimes can also be explicit: `&'a Point`, `&'document str`. Lifetimes start with `'` and `'a` is a typical default name. Read `&'a Point` as "a borrowed `Point` which is valid for at least the lifetime `a`".
fr_fr: La durée de vie peut être implicite — c’est ce que nous avons vu jusqu’ici. Elle peut aussi être explicite : `&'a Point`, `&'document str`. Les durées de vie commencent par `'` et `'a` est un nom par défaut courant. Lisez `&'a Point` comme « un `Point` emprunté qui est valide pendant au moins la durée de vie `'a` ».

source: Lifetimes are always inferred by the compiler: you cannot assign a lifetime yourself. Explicit lifetime annotations create constraints where there is ambiguity; the compiler verifies that there is a valid solution.
fr_fr: Les durées de vie sont toujours inférées par le compilateur : on ne peut pas les assigner manuellement. Les annotations explicites permettent de lever les ambiguïtés et sont validées par le compilateur.

source: Lifetimes become more complicated when considering passing values to and returning values from functions.
fr_fr: Les durées de vie deviennent plus complexes lorsqu’on passe ou retourne des références dans des fonctions.

source: // What is the lifetime of p3?
fr_fr: // Quelle est la durée de vie de p3 ?

source: In this example, the compiler does not know what lifetime to infer for `p3`. Looking inside the function body shows that it can only safely assume that `p3`'s lifetime is the shorter of `p1` and `p2`. But just like types, Rust requires explicit annotations of lifetimes on function arguments and return values.
fr_fr: Dans cet exemple, le compilateur ne sait pas quelle durée de vie déduire pour `p3`. En analysant le corps de la fonction, il ne peut que supposer que la durée de vie de `p3` est la plus courte entre celles de `p1` et `p2`. Mais comme pour les types, Rust exige des annotations explicites pour les durées de vie dans les arguments et les valeurs de retour.

source: Add `'a` appropriately to `left_most`:
fr_fr: Ajoutez `'a` de manière appropriée à `left_most` :

source: This says, "given p1 and p2 which both outlive `'a`, the return value lives for at least `'a`.
fr_fr: Cela signifie : « étant donné que `p1` et `p2` vivent au moins aussi longtemps que `'a`, la valeur retournée vivra au moins aussi longtemps ».

source: In common cases, lifetimes can be elided, as described on the next slide.
fr_fr: Dans les cas courants, les durées de vie peuvent être omises, comme expliqué dans la diapositive suivante.

source: Lifetimes in Function Calls
fr_fr: Durées de vie dans les appels de fonction

source: Lifetimes for function arguments and return values must be fully specified, but Rust allows lifetimes to be elided in most cases with [a few simple rules](https://doc.rust-lang.org/nomicon/lifetime-elision.html). This is not inference -- it is just a syntactic shorthand.
fr_fr: Les durées de vie des arguments et des valeurs de retour doivent être entièrement spécifiées, mais Rust permet de les omettre dans la plupart des cas selon [quelques règles simples](https://doc.rust-lang.org/nomicon/lifetime-elision.html). Il ne s’agit pas d’inférence, mais d’une abréviation syntaxique.

source: Each argument which does not have a lifetime annotation is given one.
fr_fr: Chaque argument sans annotation reçoit automatiquement une durée de vie.

source: If there is only one argument lifetime, it is given to all un-annotated return values.
fr_fr: S’il y a une seule durée de vie dans les arguments, elle est attribuée à toutes les valeurs de retour non annotées.

source: If there are multiple argument lifetimes, but the first one is for `self`, that lifetime is given to all un-annotated return values.
fr_fr: S’il y a plusieurs durées de vie, mais que la première concerne `self`, elle est attribuée à toutes les valeurs de retour non annotées.

source: In this example, `cab_distance` is trivially elided.
fr_fr: Dans cet exemple, la durée de vie dans `cab_distance` est élidée de manière triviale.

source: The `nearest` function provides another example of a function with multiple references in its arguments that requires explicit annotation.
fr_fr: La fonction `nearest` fournit un autre exemple de fonction avec plusieurs références dans ses arguments qui nécessite une annotation explicite.

source: Try adjusting the signature to "lie" about the lifetimes returned:
fr_fr: Essayez de modifier la signature pour « mentir » sur les durées de vie retournées :

source: This won't compile, demonstrating that the annotations are checked for validity by the compiler. Note that this is not the case for raw pointers (unsafe), and this is a common source of errors with unsafe Rust.
fr_fr: Cela ne compilera pas, montrant que le compilateur vérifie la validité des annotations. Ce n’est pas le cas pour les pointeurs bruts (`unsafe`), ce qui constitue une source fréquente d’erreurs en Rust non sécurisé.

source: Students may ask when to use lifetimes. Rust borrows _always_ have lifetimes. Most of the time, elision and type inference mean these don't need to be written out. In more complicated cases, lifetime annotations can help resolve ambiguity. Often, especially when prototyping, it's easier to just work with owned data by cloning values where necessary.
fr_fr: Les étudiants peuvent demander quand utiliser des durées de vie. Les emprunts en Rust ont _toujours_ une durée de vie. La plupart du temps, l’élision et l’inférence suffisent. Dans les cas plus complexes, les annotations peuvent lever les ambiguïtés. Il est souvent plus simple, notamment lors du prototypage, de travailler avec des données possédées, en clonant si nécessaire.

source: Lifetimes in Data Structures
fr_fr: Durées de vie dans les structures de données

source: If a data type stores borrowed data, it must be annotated with a lifetime:
fr_fr: Si un type de données contient des données empruntées, il doit être annoté avec une durée de vie :

source: "Bye {text}!"
fr_fr: "Au revoir {text} !"

source: "The quick brown fox jumps over the lazy dog."
fr_fr: "Le vif renard brun saute par-dessus le chien paresseux."

source: In the above example, the annotation on `Highlight` enforces that the data underlying the contained `&str` lives at least as long as any instance of `Highlight` that uses that data.
fr_fr: Dans l’exemple ci-dessus, l’annotation sur `Highlight` impose que les données sous-jacentes au `&str` contenu vivent au moins aussi longtemps que n’importe quelle instance de `Highlight` qui les utilise.

source: If `text` is consumed before the end of the lifetime of `fox` (or `dog`), the borrow checker throws an error.
fr_fr: Si `text` est consommé avant la fin de la durée de vie de `fox` (ou `dog`), le vérificateur d’emprunts génère une erreur.

source: Types with borrowed data force users to hold on to the original data. This can be useful for creating lightweight views, but it generally makes them somewhat harder to use.
fr_fr: Les types contenant des données empruntées obligent les utilisateurs à conserver les données originales. Cela peut être utile pour créer des vues légères, mais cela rend leur usage généralement un peu plus complexe.

source: When possible, make data structures own their data directly.
fr_fr: Dans la mesure du possible, faites en sorte que les structures de données possèdent directement leurs données.

source: Some structs with multiple references inside can have more than one lifetime annotation. This can be necessary if there is a need to describe lifetime relationships between the references themselves, in addition to the lifetime of the struct itself. Those are very advanced use cases.
fr_fr: Certaines structures contenant plusieurs références peuvent avoir plus d’une annotation de durée de vie. Cela peut être nécessaire pour décrire les relations de durée de vie entre les références elles-mêmes, en plus de la durée de vie de la structure elle-même. Ce sont des cas d’utilisation très avancés.

source: In this exercise, you will build a parser for the [protobuf binary encoding](https://protobuf.dev/programming-guides/encoding/). Don't worry, it's simpler than it seems! This illustrates a common parsing pattern, passing slices of data. The underlying data itself is never copied.
fr_fr: Dans cet exercice, vous allez construire un analyseur pour l’encodage binaire [protobuf](https://protobuf.dev/programming-guides/encoding/). Rassurez-vous, c’est plus simple qu’il n’y paraît ! Cela illustre un motif courant d’analyse, en utilisant des tranches de données. Les données sous-jacentes ne sont jamais copiées.

source: Fully parsing a protobuf message requires knowing the types of the fields, indexed by their field numbers. That is typically provided in a `proto` file. In this exercise, we'll encode that information into `match` statements in functions that get called for each field.
fr_fr: Pour analyser complètement un message protobuf, il faut connaître les types des champs, identifiés par leur numéro. Cela provient habituellement d’un fichier `.proto`. Dans cet exercice, cette information est codée dans des instructions `match` dans des fonctions appelées pour chaque champ.

source: We'll use the following proto:
fr_fr: Nous utiliserons le proto suivant :

source: A proto message is encoded as a series of fields, one after the next. Each is implemented as a "tag" followed by the value. The tag contains a field number (e.g., `2` for the `id` field of a `Person` message) and a wire type defining how the payload should be determined from the byte stream.
fr_fr: Un message protobuf est encodé comme une série de champs successifs. Chacun est composé d’un « tag » suivi de la valeur. Le tag contient un numéro de champ (ex. `2` pour le champ `id` d’un message `Person`) et un type d’encodage indiquant comment lire la valeur dans le flux binaire.

source: Integers, including the tag, are represented with a variable-length encoding called VARINT. Luckily, `parse_varint` is defined for you below. The given code also defines callbacks to handle `Person` and `PhoneNumber` fields, and to parse a message into a series of calls to those callbacks.
fr_fr: Les entiers, y compris les tags, sont encodés avec un format à longueur variable appelé VARINT. Heureusement, la fonction `parse_varint` est déjà fournie. Le code inclut aussi des callbacks pour traiter les champs `Person` et `PhoneNumber`, et pour analyser un message en les appelant successivement.

source: What remains for you is to implement the `parse_field` function and the `ProtoMessage` trait for `Person` and `PhoneNumber`.
fr_fr: Il vous reste à implémenter la fonction `parse_field` ainsi que le trait `ProtoMessage` pour `Person` et `PhoneNumber`.

source: "Invalid varint"
fr_fr: "Varint invalide"

source: "Invalid wire-type"
fr_fr: "Type d’encodage invalide"

source: "Unexpected EOF"
fr_fr: "Fin de fichier inattendue"

source: "Invalid length"
fr_fr: "Longueur invalide"

source: "Unexpected wire-type)"
fr_fr: "Type d’encodage inattendu"

source: "Invalid string (not UTF-8)"
fr_fr: "Chaîne invalide (non UTF-8)"

source: /// A wire type as seen on the wire.
fr_fr: /// Un type d’encodage tel qu’il est vu dans le flux.

source: /// The Varint WireType indicates the value is a single VARINT.
fr_fr: /// Le type Varint indique que la valeur est un seul VARINT.

source: //I64, -- not needed for this exercise /// The Len WireType indicates that the value is a length represented as a /// VARINT followed by exactly that number of bytes.
fr_fr: //I64, -- pas nécessaire pour cet exercice /// Le type Len indique que la valeur est une longueur représentée par un /// VARINT, suivi exactement de ce nombre d’octets.

source: /// The I32 WireType indicates that the value is precisely 4 bytes in /// little-endian order containing a 32-bit signed integer.
fr_fr: /// Le type I32 indique que la valeur occupe exactement 4 octets en /// ordre little-endian représentant un entier signé 32 bits.

source: /// A field's value, typed based on the wire type.
fr_fr: /// La valeur d’un champ, typée selon le type d’encodage.

source: //I64(i64), -- not needed for this exercise
fr_fr: //I64(i64), -- pas nécessaire pour cet exercice

source: /// A field, containing the field number and its value.
fr_fr: /// Un champ, contenant le numéro de champ et sa valeur.

source: //1 => WireType::I64, -- not needed for this exercise
fr_fr: //1 => WireType::I64, -- pas nécessaire pour cet exercice

source: /// Parse a VARINT, returning the parsed value and the remaining bytes.
fr_fr: /// Analyse un VARINT, renvoie la valeur extraite et les octets restants.

source: // This is the last byte of the VARINT, so convert it to // a u64 and return it.
fr_fr: // C’est le dernier octet du VARINT, on le convertit // en u64 et on le retourne.

source: // More than 7 bytes is invalid.
fr_fr: // Plus de 7 octets est invalide.

source: /// Convert a tag into a field number and a WireType.
fr_fr: /// Convertit un tag en numéro de champ et en type d’encodage.

source: /// Parse a field, returning the remaining bytes
fr_fr: /// Analyse un champ, renvoie les octets restants
