Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: When writing code in Rust, your choices are:
fr_fr: Lorsque vous écrivez du code Rust, vous avez plusieurs options :

source: Use `gn` and `ninja` with the help of the templates from `//build/rust/*.gni` (e.g. `rust_static_library` that we'll meet later). This uses Chromium's audited toolchain and crates.
fr_fr: Utiliser `gn` et `ninja` avec les modèles fournis dans `//build/rust/*.gni` (par exemple `rust_static_library` que nous verrons plus tard). Cela utilise l’outil de compilation et les crates audités de Chromium.

source: Use `cargo`, but [restrict yourself to Chromium's audited toolchain and crates](https://chromium.googlesource.com/chromium/src/+/refs/heads/main/docs/rust.md#Using-cargo)
fr_fr: Utiliser `cargo`, mais en [vous limitant à l’outil de compilation et aux crates audités par Chromium](https://chromium.googlesource.com/chromium/src/+/refs/heads/main/docs/rust.md#Using-cargo)

source: Use `cargo`, trusting a [toolchain](https://rustup.rs/) and/or [crates downloaded from the internet](https://crates.io/)
fr_fr: Utiliser `cargo`, en faisant confiance à une [chaîne d’outils](https://rustup.rs/) et/ou à des [crates téléchargées depuis internet](https://crates.io/)

source: From here on we'll be focusing on `gn` and `ninja`, because this is how Rust code can be built into the Chromium browser. At the same time, Cargo is an important part of the Rust ecosystem and you should keep it in your toolbox.
fr_fr: À partir de maintenant, nous allons nous concentrer sur `gn` et `ninja`, car ce sont les outils utilisés pour intégrer du code Rust dans Chromium. Cela dit, `cargo` reste un outil essentiel dans l’écosystème Rust, et vous devriez le garder dans votre boîte à outils.

source: Mini exercise
fr_fr: Mini-exercice

source: Split into small groups and:
fr_fr: Divisez-vous en petits groupes et :

source: Brainstorm scenarios where `cargo` may offer an advantage and assess the risk profile of these scenarios.
fr_fr: Faites un remue-méninges sur les situations où `cargo` pourrait offrir un avantage, et évaluez les risques associés à ces cas.

source: Discuss which tools, libraries, and groups of people need to be trusted when using `gn` and `ninja`, offline `cargo`, etc.
fr_fr: Discutez des outils, bibliothèques et groupes de personnes auxquels il faut faire confiance lorsqu’on utilise `gn`, `ninja`, `cargo` hors ligne, etc.

source: Ask students to avoid peeking at the speaker notes before completing the exercise. Assuming folks taking the course are physically together, ask them to discuss in small groups of 3-4 people.
fr_fr: Demandez aux étudiant·e·s d’éviter de consulter les notes de présentation avant d’avoir terminé l’exercice. S’ils/elles suivent le cours en présentiel, invitez-les à discuter en petits groupes de 3 à 4 personnes.

source: Notes/hints related to the first part of the exercise ("scenarios where Cargo may offer an advantage"):
fr_fr: Notes/indices liés à la première partie de l’exercice (« scénarios où Cargo peut offrir un avantage ») :

source: It's fantastic that when writing a tool, or prototyping a part of Chromium, one has access to the rich ecosystem of crates.io libraries. There is a crate for almost anything and they are usually quite pleasant to use. (`clap` for command-line parsing, `serde` for serializing/deserializing to/from various formats, `itertools` for working with iterators, etc.).
fr_fr: C’est formidable que lorsqu’on développe un outil ou un prototype pour Chromium, on ait accès à l’écosystème riche de crates.io. Il existe une crate pour presque tout, et elles sont généralement agréables à utiliser (`clap` pour le parsing de ligne de commande, `serde` pour la sérialisation/désérialisation de divers formats, `itertools` pour manipuler des itérateurs, etc.).

source: `cargo` makes it easy to try a library (just add a single line to `Cargo.toml` and start writing code)
fr_fr: `cargo` facilite l’essai d’une bibliothèque (il suffit d’ajouter une ligne dans `Cargo.toml` et de commencer à coder)

source: It may be worth comparing how CPAN helped make `perl` a popular choice. Or comparing with `python` + `pip`.
fr_fr: Il peut être pertinent de comparer cela à l’impact de CPAN sur la popularité de `perl`, ou à l’usage de `python` avec `pip`.

source: Development experience is made really nice not only by core Rust tools (e.g. using `rustup` to switch to a different `rustc` version when testing a crate that needs to work on nightly, current stable, and older stable) but also by an ecosystem of third-party tools (e.g. Mozilla provides `cargo vet` for streamlining and sharing security audits; `criterion` crate gives a streamlined way to run benchmarks).
fr_fr: L’expérience de développement est agréable non seulement grâce aux outils Rust de base (comme `rustup` qui permet de changer facilement de version de `rustc` pour tester une crate sur nightly, stable actuelle ou plus ancienne), mais aussi grâce à l’écosystème d’outils tiers (par exemple, Mozilla fournit `cargo vet` pour faciliter et partager les audits de sécurité ; la crate `criterion` permet de réaliser des benchmarks de manière fluide).

source: `cargo` makes it easy to add a tool via `cargo install --locked cargo-vet`.
fr_fr: `cargo` permet d’ajouter facilement un outil avec `cargo install --locked cargo-vet`.

source: It may be worth comparing with Chrome Extensions or VScode extensions.
fr_fr: Il peut être utile de comparer cela aux extensions Chrome ou aux extensions VS Code.

source: Broad, generic examples of projects where `cargo` may be the right choice:
fr_fr: Exemples larges et génériques de projets où `cargo` peut être le bon choix :

source: Perhaps surprisingly, Rust is becoming increasingly popular in the industry for writing command line tools. The breadth and ergonomics of libraries is comparable to Python, while being more robust (thanks to the rich typesystem) and running faster (as a compiled, rather than interpreted language).
fr_fr: Assez étonnamment, Rust devient de plus en plus populaire dans l’industrie pour écrire des outils en ligne de commande. L’étendue et l’ergonomie des bibliothèques sont comparables à Python, tout en étant plus robustes (grâce à un système de types riche) et plus rapides (Rust est compilé, contrairement à Python qui est interprété).

source: Participating in the Rust ecosystem requires using standard Rust tools like Cargo. Libraries that want to get external contributions, and want to be used outside of Chromium (e.g. in Bazel or Android/Soong build environments) should probably use Cargo.
fr_fr: Participer à l’écosystème Rust nécessite l’usage des outils standards comme Cargo. Les bibliothèques qui souhaitent recevoir des contributions externes ou être utilisées hors de Chromium (par exemple dans les environnements de compilation Bazel ou Android/Soong) devraient probablement utiliser Cargo.

source: Examples of Chromium-related projects that are `cargo`\-based:
fr_fr: Exemples de projets liés à Chromium qui utilisent `cargo` :

source: `serde_json_lenient` (experimented with in other parts of Google which resulted in PRs with performance improvements)
fr_fr: `serde_json_lenient` (testé dans d’autres parties de Google, ce qui a conduit à des PRs avec des améliorations de performance)

source: Fontations libraries like `font-types`
fr_fr: Les bibliothèques Fontations comme `font-types`

source: `gnrt` tool (we will meet it later in the course) which depends on `clap` for command-line parsing and on `toml` for configuration files.
fr_fr: L’outil `gnrt` (que nous découvrirons plus tard dans le cours) qui dépend de `clap` pour le parsing en ligne de commande et de `toml` pour les fichiers de configuration.

source: Disclaimer: a unique reason for using `cargo` was unavailability of `gn` when building and bootstrapping Rust standard library when building Rust toolchain.
fr_fr: Remarque : une raison unique d’utiliser `cargo` fut l’indisponibilité de `gn` lors de la compilation et du bootstrap de la bibliothèque standard Rust dans la chaîne d’outils Rust.

source: `run_gnrt.py` uses Chromium's copy of `cargo` and `rustc`. `gnrt` depends on third-party libraries downloaded from the internet, but `run_gnrt.py` asks `cargo` that only `--locked` content is allowed via `Cargo.lock`.)
fr_fr: `run_gnrt.py` utilise la copie de `cargo` et `rustc` fournie par Chromium. `gnrt` dépend de bibliothèques tierces téléchargées depuis internet, mais `run_gnrt.py` impose à `cargo` de n’autoriser que du contenu verrouillé (`--locked`) via `Cargo.lock`.

source: Students may identify the following items as being implicitly or explicitly trusted:
fr_fr: Les étudiants peuvent identifier les éléments suivants comme étant implicitement ou explicitement approuvés :

source: `rustc` (the Rust compiler) which in turn depends on the LLVM libraries, the Clang compiler, the `rustc` sources (fetched from GitHub, reviewed by Rust compiler team), binary Rust compiler downloaded for bootstrapping
fr_fr: `rustc` (le compilateur Rust), qui dépend des bibliothèques LLVM, du compilateur Clang, des sources de `rustc` (téléchargées depuis GitHub et examinées par l’équipe Rust), et du binaire Rust utilisé pour le bootstrap

source: `rustup` (it may be worth pointing out that `rustup` is developed under the umbrella of the https://github.com/rust-lang/ organization - same as `rustc`)
fr_fr: `rustup` (il peut être utile de souligner que `rustup` est développé sous l’égide de l’organisation https://github.com/rust-lang/, tout comme `rustc`)

source: Various internal infrastructure (bots that build `rustc`, system for distributing the prebuilt toolchain to Chromium engineers, etc.)
fr_fr: Diverses infrastructures internes (bots qui compilent `rustc`, système de distribution de la toolchain précompilée pour les ingénieurs Chromium, etc.)

source: Cargo tools like `cargo audit`, `cargo vet`, etc.
fr_fr: Outils Cargo comme `cargo audit`, `cargo vet`, etc.

source: Rust libraries vendored into `//third_party/rust` (audited by security@chromium.org)
fr_fr: Bibliothèques Rust incluses dans `//third_party/rust` (auditées par security@chromium.org)

source: Other Rust libraries (some niche, some quite popular and commonly used)
fr_fr: D’autres bibliothèques Rust (certaines de niche, d’autres très populaires et couramment utilisées)

source: Chromium Rust policy
fr_fr: Politique Rust de Chromium

source: Chromium does not yet allow first-party Rust except in rare cases as approved by Chromium's [Area Tech Leads](https://source.chromium.org/chromium/chromium/src/+/main:ATL_OWNERS).
fr_fr: Chromium n’autorise pas encore le Rust de première main, sauf dans de rares cas approuvés par les [Area Tech Leads](https://source.chromium.org/chromium/chromium/src/+/main:ATL_OWNERS) de Chromium.

source: Chromium's policy on third party libraries is outlined [here](https://chromium.googlesource.com/chromium/src/+/main/docs/adding_to_third_party.md#rust) - Rust is allowed for third party libraries under various circumstances, including if they're the best option for performance or for security.
fr_fr: La politique de Chromium concernant les bibliothèques tierces est décrite [ici](https://chromium.googlesource.com/chromium/src/+/main/docs/adding_to_third_party.md#rust) : Rust est autorisé pour les bibliothèques tierces dans divers cas, notamment s’il constitue la meilleure option en termes de performance ou de sécurité.

source: Very few Rust libraries directly expose a C/C++ API, so that means that nearly all such libraries will require a small amount of first-party glue code.
fr_fr: Très peu de bibliothèques Rust exposent directement une API C/C++, ce qui signifie que la plupart nécessiteront un petit morceau de code d’interface de première main.

source: ```bob "C++" Rust .- - - - - - - - - -. .- - - - - - - - - - - - - - - - - - - - - - -. : : : : : Existing Chromium : : Chromium Rust Existing Rust : : "C++" : : "wrapper" crate : : +---------------+ : : +----------------+ +-------------+ : : | | : : | | | | : : | o-----+-+-----------+-+-> o-+----------+--> | : : | | : Language : | | Crate | | : : +---------------+ : boundary : +----------------+ API +-------------+ : : : : : `- - - - - - - - - -' `- - - - - - - - - - - - - - - - - - - - - - -' ```
fr_fr: ```bob "C++" Rust .- - - - - - - - - -. .- - - - - - - - - - - - - - - - - - - - - - -. : : : : : Chromium existant : : Rust de Chromium Crate Rust : : "C++" : : "wrapper" existant : : +---------------+ : : +----------------+ +-------------+ : : | | : : | | | | : : | o-----+-+-----------+-+-> o-+----------+--> | : : | | : Limite : | | Crate | | : : +---------------+ : langage : +----------------+ API +-------------+ : : : : : `- - - - - - - - - -' `- - - - - - - - - - - - - - - - - - - - - - -' ```

source: First-party Rust glue code for a particular third-party crate should normally be kept in `third_party/rust/<crate>/<version>/wrapper`.
fr_fr: Le code d’interface Rust de première main pour une crate tierce donnée doit normalement être placé dans `third_party/rust/<crate>/<version>/wrapper`.

source: Because of this, today's course will be heavily focused on:
fr_fr: En conséquence, le cours d’aujourd’hui sera fortement axé sur :

source: Bringing in third-party Rust libraries ("crates")
fr_fr: L’intégration de bibliothèques Rust tierces (« crates »)

source: Writing glue code to be able to use those crates from Chromium C++.
fr_fr: Écrire du code d’interface pour pouvoir utiliser ces crates depuis le C++ de Chromium.

source: If this policy changes over time, the course will evolve to keep up.
fr_fr: Si cette politique évolue, le cours sera mis à jour en conséquence.

source: Build rules
fr_fr: Règles de compilation

source: Rust code is usually built using `cargo`. Chromium builds with `gn` and `ninja` for efficiency --- its static rules allow maximum parallelism. Rust is no exception.
fr_fr: Le code Rust est habituellement compilé avec `cargo`. Chromium utilise `gn` et `ninja` pour des raisons d’efficacité — leurs règles statiques permettent un parallélisme maximal. Rust n’échappe pas à cette logique.

source: Adding Rust code to Chromium
fr_fr: Ajouter du code Rust à Chromium

source: In some existing Chromium `BUILD.gn` file, declare a `rust_static_library`:
fr_fr: Dans un fichier `BUILD.gn` existant de Chromium, déclarez une cible `rust_static_library` :

source: You can also add `deps` on other Rust targets. Later we'll use this to depend upon third party code.
fr_fr: Vous pouvez également ajouter des dépendances (`deps`) à d'autres cibles Rust. Nous verrons plus tard comment l’utiliser pour intégrer du code tiers.

source: You must specify _both_ the crate root, _and_ a full list of sources. The `crate_root` is the file given to the Rust compiler representing the root file of the compilation unit --- typically `lib.rs`. `sources` is a complete list of all source files which `ninja` needs in order to determine when rebuilds are necessary.
fr_fr: Il faut spécifier _à la fois_ la racine de la crate et la liste complète des fichiers sources. Le `crate_root` est le fichier transmis au compilateur Rust comme racine de l’unité de compilation — typiquement `lib.rs`. `sources` doit contenir la liste exhaustive des fichiers nécessaires à `ninja` pour déclencher une recompilation.

source: (There's no such thing as a Rust `source_set`, because in Rust, an entire crate is a compilation unit. A `static_library` is the smallest unit.)
fr_fr: (Il n’existe pas de `source_set` en Rust, car toute crate constitue une unité de compilation. Une `static_library` est donc l’unité minimale.)

source: Students might be wondering why we need a gn template, rather than using [gn's built-in support for Rust static libraries](https://gn.googlesource.com/gn/+/main/docs/reference.md#func_static_library). The answer is that this template provides support for CXX interop, Rust features, and unit tests, some of which we'll use later.
fr_fr: Les étudiants peuvent se demander pourquoi on utilise un template GN au lieu du [support intégré de GN pour les bibliothèques Rust statiques](https://gn.googlesource.com/gn/+/main/docs/reference.md#func_static_library). La réponse est que ce template prend en charge l’interopérabilité C++/Rust, des fonctionnalités spécifiques à Rust, et les tests unitaires — certains seront utilisés plus tard.

source: Including `unsafe` Rust Code
fr_fr: Inclure du code Rust `unsafe`

source: Unsafe Rust code is forbidden in `rust_static_library` by default --- it won't compile. If you need unsafe Rust code, add `allow_unsafe = true` to the gn target. (Later in the course we'll see circumstances where this is necessary.)
fr_fr: Par défaut, le code Rust `unsafe` est interdit dans une `rust_static_library` — il ne se compilera pas. Si vous en avez besoin, ajoutez `allow_unsafe = true` à la cible GN. (Nous verrons plus tard dans le cours dans quels cas cela devient nécessaire.)

source: Simply add the above target to the `deps` of some Chromium C++ target.
fr_fr: Il suffit d’ajouter la cible ci-dessus aux `deps` d’une cible C++ de Chromium.

source: Types are elided in Rust code, which makes a good IDE even more useful than for C++. Visual Studio code works well for Rust in Chromium. To use it,
fr_fr: Les types sont souvent omis dans le code Rust, ce qui rend un bon IDE encore plus utile qu’en C++. Visual Studio Code fonctionne très bien pour Rust dans Chromium. Pour l’utiliser,

source: Ensure your VSCode has the `rust-analyzer` extension, not earlier forms of Rust support
fr_fr: Assurez-vous que VSCode possède l’extension `rust-analyzer`, et non une ancienne extension Rust

source: `gn gen out/Debug --export-rust-project` (or equivalent for your output directory)
fr_fr: `gn gen out/Debug --export-rust-project` (ou l’équivalent pour votre répertoire de sortie)

source: A demo of some of the code annotation and exploration features of rust-analyzer might be beneficial if the audience are naturally skeptical of IDEs.
fr_fr: Une démonstration des fonctions d’annotation et d’exploration de code de rust-analyzer peut être utile si le public est naturellement sceptique à propos des IDE.

source: The following steps may help with the demo (but feel free to instead use a piece of Chromium-related Rust that you are most familiar with):
fr_fr: Les étapes suivantes peuvent aider pour la démonstration (mais n’hésitez pas à utiliser à la place un fichier Rust de Chromium que vous maîtrisez mieux) :

source: Open `components/qr_code_generator/qr_code_generator_ffi_glue.rs`
fr_fr: Ouvrez `components/qr_code_generator/qr_code_generator_ffi_glue.rs`

source: Place the cursor over the `QrCode::new` call (around line 26) in \`qr_code_generator_ffi_glue.rs
fr_fr: Placez le curseur sur l’appel à `QrCode::new` (vers la ligne 26) dans `qr_code_generator_ffi_glue.rs`

source: Demo **show documentation** (typical bindings: vscode = ctrl k i; vim/CoC = K).
fr_fr: Démonstration **afficher documentation** (touches typiques : vscode = ctrl k i ; vim/CoC = K).

source: Demo **go to definition** (typical bindings: vscode = F12; vim/CoC = g d). (This will take you to `//third_party/rust/.../qr_code-.../src/lib.rs`.)
fr_fr: Démonstration **aller à la définition** (touches typiques : vscode = F12 ; vim/CoC = g d). (Cela vous mènera à `//third_party/rust/.../qr_code-.../src/lib.rs`.)

source: Demo **outline** and navigate to the `QrCode::with_bits` method (around line 164; the outline is in the file explorer pane in vscode; typical vim/CoC bindings = space o)
fr_fr: Démonstration **vue d’ensemble** et navigation vers la méthode `QrCode::with_bits` (environ ligne 164 ; la vue d’ensemble se trouve dans le panneau de l’explorateur de fichiers dans VSCode ; raccourci habituel dans vim/CoC = espace o)

source: Demo **type annotations** (there are quote a few nice examples in the `QrCode::with_bits` method)
fr_fr: Démonstration **annotations de types** (il y a plusieurs exemples intéressants dans la méthode `QrCode::with_bits`)

source: It may be worth pointing out that `gn gen ... --export-rust-project` will need to be rerun after editing `BUILD.gn` files (which we will do a few times throughout the exercises in this session).
fr_fr: Il est bon de rappeler que `gn gen ... --export-rust-project` devra être relancé après chaque modification des fichiers `BUILD.gn` (ce que nous ferons plusieurs fois pendant les exercices de cette session).

source: Build rules exercise
fr_fr: Exercice : règles de compilation

source: In your Chromium build, add a new Rust target to `//ui/base/BUILD.gn` containing:
fr_fr: Dans votre build Chromium, ajoutez une nouvelle cible Rust dans `//ui/base/BUILD.gn` contenant :

source: **Important**: note that `no_mangle` here is considered a type of unsafety by the Rust compiler, so you'll need to allow unsafe code in your `gn` target.
fr_fr: **Important** : notez que `no_mangle` est considéré comme une forme d’insécurité par le compilateur Rust ; vous devrez donc autoriser le code non sûr dans votre cible `gn`.

source: Add this new Rust target as a dependency of `//ui/base:base`. Declare this function at the top of `ui/base/resource/resource_bundle.cc` (later, we'll see how this can be automated by bindings generation tools):
fr_fr: Ajoutez cette nouvelle cible Rust comme dépendance de `//ui/base:base`. Déclarez cette fonction en haut du fichier `ui/base/resource/resource_bundle.cc` (nous verrons plus tard comment cela peut être automatisé via des outils de génération de bindings) :

source: Call this function from somewhere in `ui/base/resource/resource_bundle.cc` - we suggest the top of `ResourceBundle::MaybeMangleLocalizedString`. Build and run Chromium, and ensure that "Hello from Rust!" is printed lots of times.
fr_fr: Appelez cette fonction quelque part dans `ui/base/resource/resource_bundle.cc` — nous suggérons le début de `ResourceBundle::MaybeMangleLocalizedString`. Compilez et lancez Chromium, et assurez-vous que « Hello from Rust! » est affiché de nombreuses fois.

source: If you use VSCode, now set up Rust to work well in VSCode. It will be useful in subsequent exercises. If you've succeeded, you will be able to use right-click "Go to definition" on `println!`.
fr_fr: Si vous utilisez VSCode, configurez-le dès maintenant pour qu’il prenne bien en charge Rust. Cela vous sera utile pour les exercices suivants. Une configuration réussie vous permettra d’utiliser le clic droit « Go to definition » sur `println!`.

source: Where to find help
fr_fr: Où trouver de l’aide

source: The options available to the [`rust_static_library` gn template](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/rust_static_library.gni;l=16)
fr_fr: Les options disponibles pour le template GN [`rust_static_library`](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/rust_static_library.gni;l=16)

source: Information about [`#[no_mangle]`](https://doc.rust-lang.org/beta/reference/abi.html#the-no_mangle-attribute)
fr_fr: Informations à propos de [`#[no_mangle]`](https://doc.rust-lang.org/beta/reference/abi.html#the-no_mangle-attribute)

source: Information about [`extern "C"`](https://doc.rust-lang.org/std/keyword.extern.html)
fr_fr: Informations à propos de [`extern "C"`](https://doc.rust-lang.org/std/keyword.extern.html)

source: Information about gn's [`--export-rust-project`](https://gn.googlesource.com/gn/+/main/docs/reference.md#compilation-database) switch
fr_fr: Informations sur l’option GN [`--export-rust-project`](https://gn.googlesource.com/gn/+/main/docs/reference.md#compilation-database)

source: [How to install rust-analyzer in VSCode](https://code.visualstudio.com/docs/languages/rust)
fr_fr: [Comment installer rust-analyzer dans VSCode](https://code.visualstudio.com/docs/languages/rust)
