Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: Test the above code on the [Rust Playground](https://play.rust-lang.org/?version=stable&mode=debug&edition=2021&gist=3ce2ad13ea1302f6572cb15cd96becf0).
fr_fr: Testez le code ci-dessus sur le [Rust Playground](https://play.rust-lang.org/?version=stable&mode=debug&edition=2021&gist=3ce2ad13ea1302f6572cb15cd96becf0).

source: The Rust compiler produces fantastic error messages, as well as helpful built-in lints. [Clippy](https://doc.rust-lang.org/clippy/) provides even more lints, organized into groups that can be enabled per-project.
fr_fr: Le compilateur Rust produit d’excellents messages d’erreur et des lints intégrés utiles. [Clippy](https://doc.rust-lang.org/clippy/) en fournit encore plus, regroupés en catégories activables par projet.

source: "X probably fits in a u16, right? {}"
fr_fr: "X rentre probablement dans un u16, non ? {}"

source: Run the code sample and examine the error message. There are also lints visible here, but those will not be shown once the code compiles. Switch to the Playground site to show those lints.
fr_fr: Exécutez l'exemple de code et examinez le message d'erreur. Certains lints sont visibles ici, mais ils ne s'afficheront plus une fois que le code compilera. Rendez-vous sur le Playground pour les voir.

source: After resolving the lints, run `clippy` on the playground site to show clippy warnings. Clippy has extensive documentation of its lints, and adds new lints (including default-deny lints) all the time.
fr_fr: Après avoir corrigé les lints, exécutez `clippy` sur le site Playground pour afficher les avertissements. Clippy est bien documenté et enrichi régulièrement avec de nouveaux lints (y compris des lints refusés par défaut).

source: Note that errors or warnings with `help: ...` can be fixed with `cargo fix` or via your editor.
fr_fr: Notez que les erreurs ou avertissements contenant `help: ...` peuvent être corrigés avec `cargo fix` ou via votre éditeur.

source: Luhn Algorithm
fr_fr: Algorithme de Luhn

source: The [Luhn algorithm](https://en.wikipedia.org/wiki/Luhn_algorithm) is used to validate credit card numbers. The algorithm takes a string as input and does the following to validate the credit card number:
fr_fr: L’[algorithme de Luhn](https://en.wikipedia.org/wiki/Luhn_algorithm) est utilisé pour valider les numéros de cartes de crédit. Il prend une chaîne en entrée et procède comme suit pour valider le numéro :

source: Ignore all spaces. Reject number with fewer than two digits.
fr_fr: Ignorer tous les espaces. Rejeter les numéros comportant moins de deux chiffres.

source: Moving from **right to left**, double every second digit: for the number `1234`, we double `3` and `1`. For the number `98765`, we double `6` and `8`.
fr_fr: En allant **de droite à gauche**, doubler chaque deuxième chiffre : pour le numéro `1234`, on double `3` et `1`. Pour le numéro `98765`, on double `6` et `8`.

source: After doubling a digit, sum the digits if the result is greater than 9. So doubling `7` becomes `14` which becomes `1 + 4 = 5`.
fr_fr: Après avoir doublé un chiffre, additionnez les chiffres si le résultat est supérieur à 9. Ainsi, doubler `7` donne `14`, ce qui devient `1 + 4 = 5`.

source: Sum all the undoubled and doubled digits.
fr_fr: Additionnez tous les chiffres doublés et non doublés.

source: The credit card number is valid if the sum ends with `0`.
fr_fr: Le numéro de carte de crédit est valide si la somme se termine par `0`.

source: The provided code provides a buggy implementation of the luhn algorithm, along with two basic unit tests that confirm that most the algorithm is implemented correctly.
fr_fr: Le code fourni contient une implémentation erronée de l’algorithme de Luhn, accompagnée de deux tests unitaires de base qui confirment que la plupart de l’algorithme est bien implémentée.

source: Copy the code below to <https://play.rust-lang.org/> and write additional tests to uncover bugs in the provided implementation, fixing any bugs you find.
fr_fr: Copiez le code ci-dessous sur <https://play.rust-lang.org/> et écrivez des tests supplémentaires pour détecter les bogues dans l’implémentation fournie, en corrigeant tous ceux que vous trouvez.

source: // This is the buggy version that appears in the problem.
fr_fr: // Ceci est la version erronée présentée dans l'énoncé.

source: // This is the solution and passes all of the tests below.
fr_fr: // Ceci est la solution qui passe tous les tests ci-dessous.

source: "Is {cc_number} a valid credit card number? {}"
fr_fr: "Le numéro {cc_number} est-il valide ? {}"

source: "yes"
fr_fr: "oui"

source: "no"
fr_fr: "non"

source: Rust handles fatal errors with a "panic".
fr_fr: Rust gère les erreurs fatales avec une "panique" (`panic`).

source: Rust will trigger a panic if a fatal error happens at runtime:
fr_fr: Rust déclenchera une panique si une erreur fatale survient à l'exécution :

source: Panics are for unrecoverable and unexpected errors.
fr_fr: Les paniques concernent des erreurs irréparables et inattendues.

source: Panics are symptoms of bugs in the program.
fr_fr: Les paniques sont le symptôme de bugs dans le programme.

source: Runtime failures like failed bounds checks can panic
fr_fr: Les échecs d’exécution, comme un dépassement d’index, peuvent provoquer une panique

source: Assertions (such as `assert!`) panic on failure
fr_fr: Les assertions (comme `assert!`) provoquent une panique en cas d’échec

source: Purpose-specific panics can use the `panic!` macro.
fr_fr: Les paniques spécifiques peuvent utiliser la macro `panic!`.

source: A panic will "unwind" the stack, dropping values just as if the functions had returned.
fr_fr: Une panique entraîne le déroulement de la pile, libérant les ressources comme si les fonctions s’étaient terminées normalement.

source: Use non-panicking APIs (such as `Vec::get`) if crashing is not acceptable.
fr_fr: Utilisez des API sans panique (comme `Vec::get`) si un crash est inacceptable.

source: By default, a panic will cause the stack to unwind. The unwinding can be caught:
fr_fr: Par défaut, une panique provoquera un déroulement de la pile. Ce déroulement peut être capturé :

source: "No problem here!"
fr_fr: "Pas de problème ici !"

source: "oh no!"
fr_fr: "oh non !"

source: Catching is unusual; do not attempt to implement exceptions with `catch_unwind`!
fr_fr: Attraper une panique est inhabituel ; n’essayez pas d’implémenter des exceptions avec `catch_unwind` !

source: This can be useful in servers which should keep running even if a single request crashes.
fr_fr: Cela peut être utile pour des serveurs qui doivent rester fonctionnels même si une requête individuelle échoue.

source: This does not work if `panic = 'abort'` is set in your `Cargo.toml`.
fr_fr: Cela ne fonctionne pas si `panic = 'abort'` est défini dans votre `Cargo.toml`.

source: Runtime errors like connection-refused or file-not-found are handled with the `Result` type, but matching this type on every call can be cumbersome. The try-operator `?` is used to return errors to the caller. It lets you turn the common
fr_fr: Les erreurs d’exécution comme "connexion refusée" ou "fichier introuvable" sont gérées avec le type `Result`, mais l’utilisation de `match` à chaque appel peut être lourde. L’opérateur `?` permet de renvoyer les erreurs à l’appelant de façon concise. Il transforme ainsi le cas courant

source: into the much simpler
fr_fr: en une version bien plus simple

source: We can use this to simplify our error handling code:
fr_fr: Nous pouvons utiliser cela pour simplifier notre code de gestion des erreurs :

source: "username or error: {username:?}"
fr_fr: "nom d’utilisateur ou erreur : {username:?}"

source: Simplify the `read_username` function to use `?`.
fr_fr: Simplifier la fonction `read_username` pour utiliser `?`.

source: The `username` variable can be either `Ok(string)` or `Err(error)`.
fr_fr: La variable `username` peut être soit `Ok(string)` soit `Err(error)`.

source: Use the `fs::write` call to test out the different scenarios: no file, empty file, file with username.
fr_fr: Utilisez l’appel à `fs::write` pour tester les différents scénarios : aucun fichier, fichier vide, fichier contenant un nom d’utilisateur.

source: Note that `main` can return a `Result<(), E>` as long as it implements `std::process::Termination`. In practice, this means that `E` implements `Debug`. The executable will print the `Err` variant and return a nonzero exit status on error.
fr_fr: Notez que `main` peut retourner un `Result<(), E>` tant que `E` implémente `std::process::Termination`. En pratique, cela signifie que `E` doit implémenter `Debug`. L’exécutable affichera la variante `Err` et renverra un code de sortie non nul en cas d’erreur.

source: The effective expansion of `?` is a little more complicated than previously indicated:
fr_fr: L’expansion réelle de `?` est un peu plus complexe que ce qui a été indiqué précédemment :

source: works the same as
fr_fr: fonctionne de la même manière que

source: The `From::from` call here means we attempt to convert the error type to the type returned by the function. This makes it easy to encapsulate errors into higher-level errors.
fr_fr: L’appel à `From::from` signifie ici que nous tentons de convertir le type d’erreur dans celui renvoyé par la fonction. Cela facilite l’encapsulation des erreurs dans des erreurs de plus haut niveau.

source: "IO error: {e}"
fr_fr: "Erreur d’E/S : {e}"

source: "Found no username in {path}"
fr_fr: "Aucun nom d’utilisateur trouvé dans {path}"

source: The `?` operator must return a value compatible with the return type of the function. For `Result`, it means that the error types have to be compatible. A function that returns `Result<T, ErrorOuter>` can only use `?` on a value of type `Result<U, ErrorInner>` if `ErrorOuter` and `ErrorInner` are the same type or if `ErrorOuter` implements `From<ErrorInner>`.
fr_fr: L’opérateur `?` doit retourner une valeur compatible avec le type de retour de la fonction. Pour `Result`, cela signifie que les types d’erreur doivent être compatibles. Une fonction qui retourne `Result<T, ErrorOuter>` ne peut utiliser `?` sur une valeur de type `Result<U, ErrorInner>` que si `ErrorOuter` et `ErrorInner` sont identiques ou si `ErrorOuter` implémente `From<ErrorInner>`.

source: A common alternative to a `From` implementation is `Result::map_err`, especially when the conversion only happens in one place.
fr_fr: Une alternative courante à une implémentation de `From` est `Result::map_err`, surtout si la conversion n’a lieu qu’à un seul endroit.

source: There is no compatibility requirement for `Option`. A function returning `Option<T>` can use the `?` operator on `Option<U>` for arbitrary `T` and `U` types.
fr_fr: Il n’y a pas d’exigence de compatibilité pour `Option`. Une fonction retournant `Option<T>` peut utiliser `?` sur `Option<U>` pour n’importe quels types `T` et `U`.

source: A function that returns `Result` cannot use `?` on `Option` and vice versa. However, `Option::ok_or` converts `Option` to `Result` whereas `Result::ok` turns `Result` into `Option`.
fr_fr: Une fonction qui retourne un `Result` ne peut pas utiliser `?` sur un `Option` et inversement. Cependant, `Option::ok_or` convertit un `Option` en `Result`, tandis que `Result::ok` transforme un `Result` en `Option`.

source: Dynamic Error Types
fr_fr: Types d'erreurs dynamiques

source: Sometimes we want to allow any type of error to be returned without writing our own enum covering all the different possibilities. The `std::error::Error` trait makes it easy to create a trait object that can contain any error.
fr_fr: Parfois, on souhaite autoriser le retour de n’importe quel type d’erreur sans devoir écrire une énumération couvrant toutes les possibilités. Le trait `std::error::Error` permet de créer facilement un objet trait capable de contenir n’importe quelle erreur.

source: "Count: {count}"
fr_fr: "Nombre : {count}"

source: "Error: {err}"
fr_fr: "Erreur : {err}"

source: The `read_count` function can return `std::io::Error` (from file operations) or `std::num::ParseIntError` (from `String::parse`).
fr_fr: La fonction `read_count` peut retourner une `std::io::Error` (issue des opérations sur les fichiers) ou une `std::num::ParseIntError` (provenant de `String::parse`).

source: Boxing errors saves on code, but gives up the ability to cleanly handle different error cases differently in the program. As such it's generally not a good idea to use `Box<dyn Error>` in the public API of a library, but it can be a good option in a program where you just want to display the error message somewhere.
fr_fr: Encapsuler les erreurs dans une `Box` permet de réduire le code, mais cela empêche de gérer proprement les différents cas d’erreur dans le programme. Ainsi, il est généralement déconseillé d’utiliser `Box<dyn Error>` dans l’API publique d’une bibliothèque, mais cela peut être une bonne solution dans un programme où l’on souhaite simplement afficher un message d’erreur quelque part.

source: Make sure to implement the `std::error::Error` trait when defining a custom error type so it can be boxed. But if you need to support the `no_std` attribute, keep in mind that the `std::error::Error` trait is currently compatible with `no_std` in [nightly](https://github.com/rust-lang/rust/issues/103765) only.
fr_fr: Veillez à implémenter le trait `std::error::Error` lors de la définition d’un type d’erreur personnalisé pour qu’il puisse être encapsulé. Toutefois, si vous devez prendre en charge l’attribut `no_std`, notez que le trait `std::error::Error` n’est compatible avec `no_std` que sur la version [nightly](https://github.com/rust-lang/rust/issues/103765).

source: The [`thiserror`](https://docs.rs/thiserror/) and [`anyhow`](https://docs.rs/anyhow/) crates are widely used to simplify error handling.
fr_fr: Les crates [`thiserror`](https://docs.rs/thiserror/) et [`anyhow`](https://docs.rs/anyhow/) sont largement utilisées pour simplifier la gestion des erreurs.

source: `thiserror` is often used in libraries to create custom error types that implement `From<T>`.
fr_fr: `thiserror` est souvent utilisé dans les bibliothèques pour créer des types d’erreurs personnalisés qui implémentent `From<T>`.

source: `anyhow` is often used by applications to help with error handling in functions, including adding contextual information to your errors.
fr_fr: `anyhow` est souvent utilisé par les applications pour faciliter la gestion des erreurs dans les fonctions, y compris pour ajouter des informations contextuelles aux erreurs.

source: "Found no username in {0}"
fr_fr: "Aucun nom d’utilisateur trouvé dans {0}"

source: "Failed to open {path}"
fr_fr: "Échec de l’ouverture de {path}"

source: "Failed to read"
fr_fr: "Échec de la lecture"

source: "Username: {username}"
fr_fr: "Nom d’utilisateur : {username}"

source: "Error: {err:?}"
fr_fr: "Erreur : {err:?}"

source: The `Error` derive macro is provided by `thiserror`, and has lots of useful attributes to help define error types in a compact way.
fr_fr: Le derive macro `Error` est fourni par `thiserror`, et comporte de nombreux attributs utiles pour définir des types d’erreurs de manière concise.

source: The `std::error::Error` trait is derived automatically.
fr_fr: Le trait `std::error::Error` est dérivé automatiquement.

source: The message from `#[error]` is used to derive the `Display` trait.
fr_fr: Le message de `#[error]` est utilisé pour dériver le trait `Display`.

source: `anyhow::Error` is essentially a wrapper around `Box<dyn Error>`. As such it's again generally not a good choice for the public API of a library, but is widely used in applications.
fr_fr: `anyhow::Error` est essentiellement un emballage autour de `Box<dyn Error>`. En tant que tel, ce n’est généralement pas un bon choix pour l’API publique d’une bibliothèque, mais il est largement utilisé dans les applications.

source: `anyhow::Result<V>` is a type alias for `Result<V, anyhow::Error>`.
fr_fr: `anyhow::Result<V>` est un alias de type pour `Result<V, anyhow::Error>`.

source: Actual error type inside of it can be extracted for examination if necessary.
fr_fr: Le type d’erreur réel qu’il contient peut être extrait pour examen si nécessaire.

source: Functionality provided by `anyhow::Result<T>` may be familiar to Go developers, as it provides similar usage patterns and ergonomics to `(T, error)` from Go.
fr_fr: La fonctionnalité fournie par `anyhow::Result<T>` peut sembler familière aux développeurs Go, car elle adopte des modèles d’usage et une ergonomie similaires à `(T, error)` en Go.

source: `anyhow::Context` is a trait implemented for the standard `Result` and `Option` types. `use anyhow::Context` is necessary to enable `.context()` and `.with_context()` on those types.
fr_fr: `anyhow::Context` est un trait implémenté pour les types standard `Result` et `Option`. Il faut faire `use anyhow::Context` pour activer `.context()` et `.with_context()` sur ces types.

source: Exercise: Rewriting with Result
fr_fr: Exercice : Réécriture avec `Result`

source: The following implements a very simple parser for an expression language. However, it handles errors by panicking. Rewrite it to instead use idiomatic error handling and propagate errors to a return from `main`. Feel free to use `thiserror` and `anyhow`.
fr_fr: Le code suivant implémente un analyseur très simple pour un langage d’expressions. Cependant, il gère les erreurs en provoquant des paniques. Réécrivez-le pour utiliser une gestion idiomatique des erreurs et les propager via la valeur de retour de `main`. Vous pouvez utiliser `thiserror` et `anyhow`.

source: HINT: start by fixing error handling in the `parse` function. Once that is working correctly, update `Tokenizer` to implement `Iterator<Item=Result<Token, TokenizerError>>` and handle that in the parser.
fr_fr: INDICE : commencez par corriger la gestion des erreurs dans la fonction `parse`. Une fois cela en place, modifiez `Tokenizer` pour implémenter `Iterator<Item=Result<Token, TokenizerError>>` et gérez cela dans l’analyseur.

source: /// An arithmetic operator.
fr_fr: /// Un opérateur arithmétique.

source: /// A token in the expression language.
fr_fr: /// Un jeton dans le langage d'expressions.

source: /// An expression in the expression language.
fr_fr: /// Une expression dans le langage d'expressions.

source: /// A reference to a variable.
fr_fr: /// Une référence à une variable.

source: /// A literal number.
fr_fr: /// Un nombre littéral.

source: /// A binary operation.
fr_fr: /// Une opération binaire.

source: "Unexpected character {c}"
fr_fr: "Caractère inattendu {c}"

source: "Unexpected end of input"
fr_fr: "Fin d'entrée inattendue"

source: "Invalid 32-bit integer'"
fr_fr: "Entier 32 bits invalide"

source: "Unexpected token {tok:?}"
fr_fr: "Jeton inattendu {tok:?}"

source: // Look ahead to parse a binary operation if present.
fr_fr: // Anticiper pour analyser une opération binaire si présente.

source: "Unexpected character '{0}' in input"
fr_fr: "Caractère inattendu '{0}' dans l'entrée"

source: "Tokenizer error: {0}"
fr_fr: "Erreur du tokenizer : {0}"

source: "Unexpected token {0:?}"
fr_fr: "Jeton inattendu {0:?}"

source: "Invalid number"
fr_fr: "Nombre invalide"

source: The Rust language has two parts:
fr_fr: Le langage Rust comporte deux volets :

source: **Safe Rust:** memory safe, no undefined behavior possible.
fr_fr: **Rust sûr :** sécurité mémoire garantie, aucun comportement indéfini possible.

source: **Unsafe Rust:** can trigger undefined behavior if preconditions are violated.
fr_fr: **Rust non sûr :** peut entraîner un comportement indéfini si les conditions préalables ne sont pas respectées.

source: We saw mostly safe Rust in this course, but it's important to know what Unsafe Rust is.
fr_fr: Nous avons principalement vu du Rust sûr dans ce cours, mais il est important de savoir ce qu’est Rust non sûr.

source: Unsafe code is usually small and isolated, and its correctness should be carefully documented. It is usually wrapped in a safe abstraction layer.
fr_fr: Le code non sûr est généralement petit et isolé, et sa correction doit être soigneusement documentée. Il est en général encapsulé dans une couche d’abstraction sûre.

source: Unsafe Rust gives you access to five new capabilities:
fr_fr: Rust non sûr donne accès à cinq nouvelles capacités :

source: Dereference raw pointers.
fr_fr: Déréférencer des pointeurs bruts.

source: Access or modify mutable static variables.
fr_fr: Accéder ou modifier des variables statiques mutables.

source: Access `union` fields.
fr_fr: Accéder aux champs d’une `union`.

source: Call `unsafe` functions, including `extern` functions.
fr_fr: Appeler des fonctions `unsafe`, y compris les fonctions `extern`.

source: Implement `unsafe` traits.
fr_fr: Implémenter des traits `unsafe`.

source: We will briefly cover unsafe capabilities next. For full details, please see [Chapter 19.1 in the Rust Book](https://doc.rust-lang.org/book/ch19-01-unsafe-rust.html) and the [Rustonomicon](https://doc.rust-lang.org/nomicon/).
fr_fr: Nous couvrirons brièvement les capacités non sûres. Pour plus de détails, voir le [chapitre 19.1 du Rust Book](https://doc.rust-lang.org/book/ch19-01-unsafe-rust.html) et le [Rustonomicon](https://doc.rust-lang.org/nomicon/).

source: Unsafe Rust does not mean the code is incorrect. It means that developers have turned off some compiler safety features and have to write correct code by themselves. It means the compiler no longer enforces Rust's memory-safety rules.
fr_fr: Rust non sûr ne signifie pas que le code est incorrect. Cela signifie que les développeurs ont désactivé certaines protections du compilateur et doivent garantir eux-mêmes la validité du code. Le compilateur n’impose alors plus les règles de sécurité mémoire de Rust.

source: Creating pointers is safe, but dereferencing them requires `unsafe`:
fr_fr: Créer des pointeurs est sûr, mais leur déréférencement nécessite `unsafe` :

source: "careful!"
fr_fr: "attention !"

source: // Safe because r1 and r2 were obtained from references and so are // guaranteed to be non-null and properly aligned, the objects underlying // the references from which they were obtained are live throughout the // whole unsafe block, and they are not accessed either through the // references or concurrently through any other pointers.
fr_fr: // Sûr car r1 et r2 proviennent de références et sont donc // garantis non nuls et correctement alignés, les objets référencés // sont vivants pendant tout le bloc unsafe, et ils ne sont pas // accédés ni par les références ni par d'autres pointeurs en parallèle.

source: "r1 is: {}"
fr_fr: "r1 vaut : {}"

source: "uhoh"
fr_fr: "oups"

source: "r2 is: {}"
fr_fr: "r2 vaut : {}"

source: // NOT SAFE. DO NOT DO THIS. /* let r3: &String = unsafe { &*r1 }; drop(s); println!("r3 is: {}", *r3); */
fr_fr: // NON SÉCURISÉ. NE FAITES PAS CELA. /* let r3: &String = unsafe { &*r1 }; drop(s); println!(\r3 vaut : {}\, *r3); */

source: It is good practice (and required by the Android Rust style guide) to write a comment for each `unsafe` block explaining how the code inside it satisfies the safety requirements of the unsafe operations it is doing.
fr_fr: Il est recommandé (et requis par le guide de style Android Rust) d’écrire un commentaire pour chaque bloc `unsafe`, expliquant en quoi le code qu’il contient satisfait aux exigences de sécurité des opérations non sûres qu’il exécute.

source: In the case of pointer dereferences, this means that the pointers must be [_valid_](https://doc.rust-lang.org/std/ptr/index.html#safety), i.e.:
fr_fr: Dans le cas du déréférencement de pointeurs, cela signifie que les pointeurs doivent être [_valides_](https://doc.rust-lang.org/std/ptr/index.html#safety), c’est-à-dire :

source: The pointer must be non-null.
fr_fr: Le pointeur ne doit pas être nul.
