Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: Unaligned accesses will fault. We build the Rust code for the `aarch64-unknown-none` target which sets `+strict-align` to prevent the compiler generating unaligned accesses, so it should be fine in this case, but this is not necessarily the case in general.
fr_fr: Les accès non alignés généreront une erreur. Le code Rust est compilé pour la cible `aarch64-unknown-none` qui active `+strict-align`, empêchant le compilateur de générer des accès non alignés — cela fonctionne donc ici, mais ce n’est pas garanti dans tous les cas.

source: If it were running in a VM, this can lead to cache coherency issues. The problem is that the VM is accessing memory directly with the cache disabled, while the host has cacheable aliases to the same memory. Even if the host doesn't explicitly access the memory, speculative accesses can lead to cache fills, and then changes from one or the other will get lost when the cache is cleaned or the VM enables the cache. (Cache is keyed by physical address, not VA or IPA.)
fr_fr: Si le système tourne dans une machine virtuelle, cela peut poser des problèmes de cohérence de cache. La VM accède à la mémoire sans cache, alors que l’hôte a des alias cacheables vers cette même mémoire. Même sans accès explicite de l’hôte, des accès spéculatifs peuvent remplir le cache, et les modifications de l’un ou l’autre peuvent être perdues lorsque le cache est vidé ou que la VM active le cache. (Le cache est indexé par adresse physique, non par VA ou IPA.)

source: For simplicity, we just use a hardcoded pagetable (see `idmap.S`) which identity maps the first 1 GiB of address space for devices, the next 1 GiB for DRAM, and another 1 GiB higher up for more devices. This matches the memory layout that QEMU uses.
fr_fr: Par simplicité, on utilise une table de pages codée en dur (voir `idmap.S`) qui effectue une translation identité pour le premier Gio (périphériques), le suivant pour la DRAM, et encore un Gio plus haut pour d’autres périphériques. Cela correspond à l’agencement mémoire utilisé par QEMU.

source: We also set up the exception vector (`vbar_el1`), which we'll see more about later.
fr_fr: On configure également le vecteur d’exception (`vbar_el1`), que nous étudierons plus en détail plus tard.

source: All examples this afternoon assume we will be running at exception level 1 (EL1). If you need to run at a different exception level you'll need to modify `entry.S` accordingly.
fr_fr: Tous les exemples de cet après-midi supposent une exécution au niveau d’exception 1 (EL1). Si vous devez exécuter au niveau d’exception différent, vous devrez adapter `entry.S` en conséquence.

source: Inline assembly
fr_fr: Assembleur en ligne

source: Sometimes we need to use assembly to do things that aren't possible with Rust code. For example, to make an HVC (hypervisor call) to tell the firmware to power off the system:
fr_fr: Parfois, il est nécessaire d’utiliser de l’assembleur pour effectuer des opérations impossibles en Rust. Par exemple, pour effectuer un appel HVC (hypervisor call) afin d’indiquer au micrologiciel d’éteindre le système :

source: // Safe because this only uses the declared registers and doesn't do // anything with memory.
fr_fr: // Sûr car cela n’utilise que les registres déclarés et n’interagit pas avec la mémoire.

source: (If you actually want to do this, use the [`smccc`](https://crates.io/crates/smccc) crate which has wrappers for all these functions.)
fr_fr: (Si vous souhaitez vraiment faire cela, utilisez la crate [`smccc`](https://crates.io/crates/smccc) qui fournit des wrappers pour toutes ces fonctions.)

source: PSCI is the Arm Power State Coordination Interface, a standard set of functions to manage system and CPU power states, among other things. It is implemented by EL3 firmware and hypervisors on many systems.
fr_fr: PSCI (Power State Coordination Interface) est une interface standard d’Arm permettant, entre autres, de gérer les états d’alimentation du système et des cœurs CPU. Elle est implémentée par le firmware EL3 et les hyperviseurs sur de nombreux systèmes.

source: The `0 => _` syntax means initialise the register to 0 before running the inline assembly code, and ignore its contents afterwards. We need to use `inout` rather than `in` because the call could potentially clobber the contents of the registers.
fr_fr: La syntaxe `0 => _` signifie que le registre est initialisé à 0 avant l’exécution du code assembleur en ligne, et que son contenu est ignoré ensuite. On utilise `inout` au lieu de `in` car l’appel peut modifier le contenu des registres.

source: This `main` function needs to be `#[no_mangle]` and `extern "C"` because it is called from our entry point in `entry.S`.
fr_fr: La fonction `main` doit être annotée avec `#[no_mangle]` et `extern "C"` car elle est appelée depuis notre point d’entrée défini dans `entry.S`.

source: `_x0`–`_x3` are the values of registers `x0`–`x3`, which are conventionally used by the bootloader to pass things like a pointer to the device tree. According to the standard aarch64 calling convention (which is what `extern "C"` specifies to use), registers `x0`–`x7` are used for the first 8 arguments passed to a function, so `entry.S` doesn't need to do anything special except make sure it doesn't change these registers.
fr_fr: `_x0` à `_x3` représentent les registres `x0` à `x3`, qui sont traditionnellement utilisés par le chargeur de démarrage pour transmettre des informations comme un pointeur vers l’arborescence des périphériques. D’après la convention d’appel standard aarch64 (spécifiée par `extern "C"`), les registres `x0` à `x7` sont utilisés pour les huit premiers arguments d’une fonction. Ainsi, `entry.S` n’a rien de spécial à faire si ce n’est préserver ces registres.

source: Run the example in QEMU with `make qemu_psci` under `src/bare-metal/aps/examples`.
fr_fr: Exécutez l'exemple dans QEMU avec `make qemu_psci` dans le dossier `src/bare-metal/aps/examples`.

source: Volatile memory access for MMIO
fr_fr: Accès mémoire volatile pour MMIO

source: Use `pointer::read_volatile` and `pointer::write_volatile`.
fr_fr: Utiliser `pointer::read_volatile` et `pointer::write_volatile`.

source: Never hold a reference.
fr_fr: Ne jamais conserver de référence.

source: `addr_of!` lets you get fields of structs without creating an intermediate reference.
fr_fr: La macro `addr_of!` permet d’obtenir des champs de structures sans créer de référence intermédiaire.

source: Volatile access: read or write operations may have side-effects, so prevent the compiler or hardware from reordering, duplicating or eliding them.
fr_fr: Accès volatile : les opérations de lecture ou d’écriture peuvent avoir des effets de bord, il faut donc empêcher le compilateur ou le matériel de les réordonner, dupliquer ou supprimer.

source: Usually if you write and then read, e.g. via a mutable reference, the compiler may assume that the value read is the same as the value just written, and not bother actually reading memory.
fr_fr: En général, si l’on écrit puis lit une valeur, par exemple via une référence mutable, le compilateur peut supposer que la valeur lue est celle qui a été écrite juste avant, et ne pas effectuer de lecture effective en mémoire.

source: Some existing crates for volatile access to hardware do hold references, but this is unsound. Whenever a reference exist, the compiler may choose to dereference it.
fr_fr: Certaines crates existantes pour l’accès matériel en mode volatile conservent des références, mais cela n’est pas sûr. Dès qu’une référence existe, le compilateur peut choisir de la déréférencer.

source: Use the `addr_of!` macro to get struct field pointers from a pointer to the struct.
fr_fr: Utilisez la macro `addr_of!` pour obtenir les pointeurs vers des champs d’une structure à partir d’un pointeur vers la structure.

source: Let's write a UART driver
fr_fr: Écrivons un pilote UART

source: The QEMU 'virt' machine has a [PL011](https://developer.arm.com/documentation/ddi0183/g) UART, so let's write a driver for that.
fr_fr: La machine 'virt' de QEMU dispose d’un UART [PL011](https://developer.arm.com/documentation/ddi0183/g), écrivons donc un pilote pour celui-ci.

source: /// Minimal driver for a PL011 UART.
fr_fr: /// Pilote minimal pour un UART PL011.

source: /// Constructs a new instance of the UART driver for a PL011 device at the /// given base address. /// /// # Safety /// /// The given base address must point to the 8 MMIO control registers of a /// PL011 device, which must be mapped into the address space of the process /// as device memory and not have any other aliases.
fr_fr: /// Construit une nouvelle instance du pilote UART pour un périphérique PL011 à l'adresse de base donnée. /// /// # Sécurité /// /// L'adresse de base donnée doit pointer vers les 8 registres de contrôle MMIO d’un /// périphérique PL011, /// comme mémoire périphérique et sans autre alias.

source: /// Writes a single byte to the UART.
fr_fr: /// Écrit un seul octet sur l’UART.

source: // Wait until there is room in the TX buffer.
fr_fr: // Attendre qu’il y ait de la place dans le tampon TX.

source: // Safe because we know that the base address points to the control // registers of a PL011 device which is appropriately mapped.
fr_fr: // Sûr car l’adresse de base pointe vers les registres de contrôle // d’un périphérique PL011 mappé correctement.

source: // Write to the TX buffer.
fr_fr: // Écrire dans le tampon TX.

source: // Wait until the UART is no longer busy.
fr_fr: // Attendre que l’UART ne soit plus occupé.

source: Note that `Uart::new` is unsafe while the other methods are safe. This is because as long as the caller of `Uart::new` guarantees that its safety requirements are met (i.e. that there is only ever one instance of the driver for a given UART, and nothing else aliasing its address space), then it is always safe to call `write_byte` later because we can assume the necessary preconditions.
fr_fr: Notez que `Uart::new` est une fonction marquée `unsafe`, tandis que les autres méthodes sont sûres. Cela s’explique par le fait que tant que l’appelant garantit les conditions de sécurité nécessaires (c’est-à-dire qu’il n’existe qu’une seule instance du pilote pour un UART donné, sans autre alias sur l’espace mémoire), alors il est toujours sûr d’appeler `write_byte` par la suite, car les préconditions sont considérées comme respectées.

source: We could have done it the other way around (making `new` safe but `write_byte` unsafe), but that would be much less convenient to use as every place that calls `write_byte` would need to reason about the safety
fr_fr: Nous aurions pu faire l’inverse (rendre `new` sûr et `write_byte` non sûr), mais cela aurait été beaucoup moins pratique, car chaque appel à `write_byte` devrait alors se soucier des garanties de sécurité

source: This is a common pattern for writing safe wrappers of unsafe code: moving the burden of proof for soundness from a large number of places to a smaller number of places.
fr_fr: Il s’agit d’un schéma courant pour écrire des wrappers sûrs autour de code `unsafe` : on déplace la responsabilité des garanties de sûreté depuis un grand nombre d’endroits vers un seul point centralisé.

source: More traits
fr_fr: D’autres traits

source: We derived the `Debug` trait. It would be useful to implement a few more traits too.
fr_fr: Nous avons dérivé le trait `Debug`. Il serait aussi utile d’implémenter quelques autres traits.

source: // Safe because it just contains a pointer to device memory, which can be // accessed from any context.
fr_fr: // Sûr car cela ne contient qu’un pointeur vers la mémoire du périphérique, accessible depuis n’importe quel contexte.

source: Implementing `Write` lets us use the `write!` and `writeln!` macros with our `Uart` type.
fr_fr: L’implémentation du trait `Write` permet d’utiliser les macros `write!` et `writeln!` avec notre type `Uart`.

source: Run the example in QEMU with `make qemu_minimal` under `src/bare-metal/aps/examples`.
fr_fr: Exécutez l’exemple dans QEMU avec `make qemu_minimal` dans `src/bare-metal/aps/examples`.

source: A better UART driver
fr_fr: Un meilleur pilote UART

source: The PL011 actually has [a bunch more registers](https://developer.arm.com/documentation/ddi0183/g/programmers-model/summary-of-registers), and adding offsets to construct pointers to access them is error-prone and hard to read. Plus, some of them are bit fields which would be nice to access in a structured way.
fr_fr: Le PL011 dispose en réalité [de nombreux registres supplémentaires](https://developer.arm.com/documentation/ddi0183/g/programmers-model/summary-of-registers), et ajouter manuellement des décalages pour construire les pointeurs d’accès est source d’erreurs et difficile à lire. En outre, certains sont des champs de bits, qu’il serait préférable de manipuler de manière structurée.

source: Offset
fr_fr: Décalage

source: Register name
fr_fr: Nom du registre

source: Width
fr_fr: Largeur

source: There are also some ID registers which have been omitted for brevity.
fr_fr: Il existe également certains registres d’identification qui ont été omis pour des raisons de concision.

source: The [`bitflags`](https://crates.io/crates/bitflags) crate is useful for working with bitflags.
fr_fr: Le crate [`bitflags`](https://crates.io/crates/bitflags) est utile pour manipuler des indicateurs binaires (bitflags).

source: /// Flags from the UART flag register.
fr_fr: /// Drapeaux issus du registre de statut de l’UART.

source: /// Clear to send.
fr_fr: /// Prêt à émettre (CTS).

source: /// Data set ready.
fr_fr: /// Données prêtes (DSR).

source: /// Data carrier detect.
fr_fr: /// Détection de porteuse (DCD).

source: /// UART busy transmitting data.
fr_fr: /// UART occupé à transmettre des données.

source: /// Receive FIFO is empty.
fr_fr: /// Le FIFO de réception est vide.

source: /// Transmit FIFO is full.
fr_fr: /// Le FIFO de transmission est plein.

source: /// Receive FIFO is full.
fr_fr: /// Le FIFO de réception est plein.

source: /// Transmit FIFO is empty.
fr_fr: /// Le FIFO de transmission est vide.

source: /// Ring indicator.
fr_fr: /// Indicateur d’appel (RI).

source: The `bitflags!` macro creates a newtype something like `Flags(u16)`, along with a bunch of method implementations to get and set flags.
fr_fr: La macro `bitflags!` crée un nouveau type, par exemple `Flags(u16)`, accompagné de nombreuses méthodes pour lire et modifier les indicateurs.

source: Multiple registers
fr_fr: Registres multiples

source: We can use a struct to represent the memory layout of the UART's registers.
fr_fr: On peut utiliser une structure (`struct`) pour représenter l’agencement mémoire des registres du UART.

source: [`#[repr(C)]`](https://doc.rust-lang.org/reference/type-layout.html#the-c-representation) tells the compiler to lay the struct fields out in order, following the same rules as C. This is necessary for our struct to have a predictable layout, as default Rust representation allows the compiler to (among other things) reorder fields however it sees fit.
fr_fr: L’attribut [`#[repr(C)]`](https://doc.rust-lang.org/reference/type-layout.html#the-c-representation) indique au compilateur de disposer les champs de la structure selon les règles du langage C. C’est nécessaire pour garantir un agencement mémoire prévisible, car en Rust, la représentation par défaut permet au compilateur, entre autres, de réorganiser les champs.

source: Now let's use the new `Registers` struct in our driver.
fr_fr: Utilisons maintenant la nouvelle structure `Registers` dans notre pilote.

source: /// Driver for a PL011 UART.
fr_fr: /// Pilote pour un UART PL011.

source: // Safe because we know that self.registers points to the control // registers of a PL011 device which is appropriately mapped.
fr_fr: // Sûr car self.registers pointe vers les registres de contrôle d’un périphérique PL011 mappé correctement.

source: /// Reads and returns a pending byte, or `None` if nothing has been /// received.
fr_fr: /// Lit et retourne un octet en attente, ou `None` s’il n’y a rien à lire.

source: // TODO: Check for error conditions in bits 8-11.
fr_fr: // TODO : Vérifier les conditions d’erreur dans les bits 8 à 11.

source: Note the use of `addr_of!` / `addr_of_mut!` to get pointers to individual fields without creating an intermediate reference, which would be unsound.
fr_fr: Notez l’usage de `addr_of!` / `addr_of_mut!` pour obtenir des pointeurs vers des champs individuels sans créer de référence intermédiaire, ce qui serait incorrect d’un point de vue mémoire.

source: Using it
fr_fr: Utilisation

source: Let's write a small program using our driver to write to the serial console, and echo incoming bytes.
fr_fr: Écrivons un petit programme qui utilise notre pilote pour écrire sur la console série et faire un écho des octets entrants.

source: /// Base address of the primary PL011 UART.
fr_fr: /// Adresse de base de l’UART PL011 principal.

source: // Safe because `PL011_BASE_ADDRESS` is the base address of a PL011 device, // and nothing else accesses that address range.
fr_fr: // Sûr car `PL011_BASE_ADDRESS` est l’adresse de base d’un périphérique PL011, et aucune autre entité n’accède à cette plage.

source: As in the [inline assembly](../inline-assembly.md) example, this `main` function is called from our entry point code in `entry.S`. See the speaker notes there for details.
fr_fr: Comme dans l’exemple [assembleur en ligne](../inline-assembly.md), cette fonction `main` est appelée depuis le code du point d’entrée défini dans `entry.S`. Voir les notes du formateur pour plus de détails.

source: Run the example in QEMU with `make qemu` under `src/bare-metal/aps/examples`.
fr_fr: Exécutez l’exemple dans QEMU avec `make qemu` dans `src/bare-metal/aps/examples`.

source: It would be nice to be able to use the logging macros from the [`log`](https://crates.io/crates/log) crate. We can do this by implementing the `Log` trait.
fr_fr: Ce serait pratique de pouvoir utiliser les macros de journalisation du crate [`log`](https://crates.io/crates/log). Pour cela, il suffit d’implémenter le trait `Log`.

source: /// Initialises UART logger.
fr_fr: /// Initialise le logger UART.

source: The unwrap in `log` is safe because we initialise `LOGGER` before calling `set_logger`.
fr_fr: L’appel à `unwrap` dans `log` est sûr car `LOGGER` est initialisé avant l’appel à `set_logger`.

source: We need to initialise the logger before we use it.
fr_fr: Il faut initialiser le logger avant de l’utiliser.

source: Note that our panic handler can now log details of panics.
fr_fr: Notez que notre gestionnaire de panique peut désormais consigner les détails des erreurs.

source: Run the example in QEMU with `make qemu_logger` under `src/bare-metal/aps/examples`.
fr_fr: Lancez l’exemple dans QEMU avec `make qemu_logger` dans `src/bare-metal/aps/examples`.

source: AArch64 defines an exception vector table with 16 entries, for 4 types of exceptions (synchronous, IRQ, FIQ, SError) from 4 states (current EL with SP0, current EL with SPx, lower EL using AArch64, lower EL using AArch32). We implement this in assembly to save volatile registers to the stack before calling into Rust code:
fr_fr: AArch64 définit une table de vecteurs d’exception comportant 16 entrées, pour 4 types d’exceptions (synchronous, IRQ, FIQ, SError) provenant de 4 états (EL courant avec SP0, EL courant avec SPx, EL inférieur en AArch64, EL inférieur en AArch32). Nous l’implémentons en assembleur pour sauvegarder les registres volatiles sur la pile avant d’appeler du code Rust :

source: EL is exception level; all our examples this afternoon run in EL1.
fr_fr: EL signifie « exception level » (niveau d’exception) ; tous nos exemples de l’après-midi s’exécutent en EL1.

source: For simplicity we aren't distinguishing between SP0 and SPx for the current EL exceptions, or between AArch32 and AArch64 for the lower EL exceptions.
fr_fr: Par souci de simplicité, nous ne distinguons pas SP0 de SPx pour les exceptions du niveau d’exception actuel, ni AArch32 de AArch64 pour celles provenant d’un niveau inférieur.

source: For this example we just log the exception and power down, as we don't expect any of them to actually happen.
fr_fr: Dans cet exemple, nous nous contentons de journaliser l’exception et d’éteindre le système, car nous ne nous attendons pas à ce qu’elle se produise réellement.

source: We can think of exception handlers and our main execution context more or less like different threads. [`Send` and `Sync`](../../concurrency/send-sync.md) will control what we can share between them, just like with threads. For example, if we want to share some value between exception handlers and the rest of the program, and it's `Send` but not `Sync`, then we'll need to wrap it in something like a `Mutex` and put it in a static.
fr_fr: On peut considérer les gestionnaires d’exceptions et le contexte principal d’exécution comme des threads distincts. Les traits [`Send` et `Sync`](../../concurrency/send-sync.md) régissent ce que l’on peut partager entre eux, comme pour les threads. Par exemple, pour partager une valeur entre un gestionnaire d’exception et le reste du programme, si le type est `Send` mais pas `Sync`, il faudra l’encapsuler dans une structure comme un `Mutex` et le placer dans une variable `static`.

source: "coreboot without the C"
fr_fr: « coreboot sans le C »

source: Supports x86, aarch64 and RISC-V.
fr_fr: Compatible avec x86, aarch64 et RISC-V.

source: Relies on LinuxBoot rather than having many drivers itself.
fr_fr: S’appuie sur LinuxBoot plutôt que de fournir de nombreux pilotes intégrés.

source: [Rust RaspberryPi OS tutorial](https://github.com/rust-embedded/rust-raspberrypi-OS-tutorials)
fr_fr: [Tutoriel Rust pour Raspberry Pi OS](https://github.com/rust-embedded/rust-raspberrypi-OS-tutorials)

source: Initialisation, UART driver, simple bootloader, JTAG, exception levels, exception handling, page tables
fr_fr: Initialisation, pilote UART, chargeur de démarrage simple, JTAG, niveaux d’exception, gestion des exceptions, tables de pages

source: Some dodginess around cache maintenance and initialisation in Rust, not necessarily a good example to copy for production code.
fr_fr: Certains aspects comme la gestion du cache et l’initialisation en Rust sont un peu douteux — ce n’est pas forcément un bon exemple à suivre pour du code en production.

source: Static analysis to determine maximum stack usage.
fr_fr: Analyse statique pour déterminer l’utilisation maximale de la pile.

source: The RaspberryPi OS tutorial runs Rust code before the MMU and caches are enabled. This will read and write memory (e.g. the stack). However:
fr_fr: Le tutoriel RaspberryPi OS exécute du code Rust avant l’activation du MMU et des caches. Cela implique des lectures et écritures en mémoire (par ex. la pile). Toutefois :

source: Without the MMU and cache, unaligned accesses will fault. It builds with `aarch64-unknown-none` which sets `+strict-align` to prevent the compiler generating unaligned accesses so it should be alright, but this is not necessarily the case in general.
fr_fr: Sans MMU ni cache, les accès non alignés provoquent une faute. Le binaire est compilé avec la cible `aarch64-unknown-none` qui active `+strict-align` pour empêcher le compilateur de générer de tels accès, donc cela devrait aller ici, mais ce n’est pas garanti de manière générale.
