Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: Because `static` variables are accessible from any thread, they must be `Sync`. Interior mutability is possible through a [`Mutex`](https://doc.rust-lang.org/std/sync/struct.Mutex.html), atomic or similar.
fr_fr: Puisque les variables `static` sont accessibles depuis n’importe quel thread, elles doivent implémenter le trait `Sync`. La mutabilité interne est possible via un [`Mutex`](https://doc.rust-lang.org/std/sync/struct.Mutex.html), un type atomique ou équivalent.

source: Thread-local data can be created with the macro `std::thread_local`.
fr_fr: Les données locales à un thread peuvent être créées à l’aide de la macro `std::thread_local`.

source: Constants are evaluated at compile time and their values are inlined wherever they are used:
fr_fr: Les constantes sont évaluées à la compilation et leurs valeurs sont insérées à chaque utilisation :

source: According to the [Rust RFC Book](https://rust-lang.github.io/rfcs/0246-const-vs-static.html) these are inlined upon use.
fr_fr: Selon le [Rust RFC Book](https://rust-lang.github.io/rfcs/0246-const-vs-static.html), ces constantes sont intégrées (inlinées) lors de leur utilisation.

source: Only functions marked `const` can be called at compile time to generate `const` values. `const` functions can however be called at runtime.
fr_fr: Seules les fonctions marquées `const` peuvent être appelées à la compilation pour produire des valeurs `const`. Elles peuvent néanmoins être appelées à l’exécution.

source: Mention that `const` behaves semantically similar to C++'s `constexpr`
fr_fr: Mentionner que `const` se comporte de manière sémantique comme `constexpr` en C++

source: It isn't super common that one would need a runtime evaluated constant, but it is helpful and safer than using a static.
fr_fr: Il est rare d’avoir besoin d’une constante évaluée à l’exécution, mais cela peut être utile et plus sûr que d’utiliser une variable `static`.

source: A type alias creates a name for another type. The two types can be used interchangeably.
fr_fr: Un alias de type crée un nom pour un autre type. Les deux types peuvent être utilisés de manière interchangeable.

source: // Aliases are more useful with long, complex types:
fr_fr: // les alias sont plus utiles avec des types longs et complexes.

source: C programmers will recognize this as similar to a `typedef`.
fr_fr: Les programmeurs en C reconnaîtront une similarité avec l’instruction `typedef`.

source: We will create a data structure to represent an event in an elevator control system. It is up to you to define the types and functions to construct various events. Use `#[derive(Debug)]` to allow the types to be formatted with `{:?}`.
fr_fr: Nous allons créer une structure de données pour représenter un événement dans un système de contrôle d’ascenseur. C’est à vous de définir les types et fonctions nécessaires pour construire divers événements. Utilisez `#[derive(Debug)]` pour permettre le formatage des types avec `{:?}`.

source: This exercise only requires creating and populating data structures so that `main` runs without errors. The next part of the course will cover getting data out of these structures.
fr_fr: Cet exercice consiste uniquement à créer et remplir des structures de données de façon à ce que `main` s’exécute sans erreur. La suite du cours expliquera comment extraire des données de ces structures.

source: /// An event in the elevator system that the controller must react to.
fr_fr: /// Un événement dans le système d’ascenseur auquel le contrôleur doit réagir.

source: // TODO: add required variants
fr_fr: // TODO : ajouter les variantes nécessaires

source: /// A direction of travel.
fr_fr: /// Une direction de déplacement.

source: /// The car has arrived on the given floor.
fr_fr: /// La cabine est arrivée à l’étage donné.

source: /// The car doors have opened.
fr_fr: /// Les portes de la cabine se sont ouvertes.

source: /// The car doors have closed.
fr_fr: /// Les portes de la cabine se sont fermées.

source: /// A directional button was pressed in an elevator lobby on the given floor.
fr_fr: /// Un bouton directionnel a été pressé dans le hall de l’ascenseur à l’étage donné.

source: /// A floor button was pressed in the elevator car.
fr_fr: /// Un bouton d’étage a été pressé dans la cabine de l’ascenseur.

source: "A ground floor passenger has pressed the up button: {:?}"
fr_fr: "Un passager au rez-de-chaussée a appuyé sur le bouton de montée : {:?}"

source: "The car has arrived on the ground floor: {:?}"
fr_fr: "La cabine est arrivée au rez-de-chaussée : {:?}"

source: "The car door opened: {:?}"
fr_fr: "La porte de la cabine s’est ouverte : {:?}"

source: "A passenger has pressed the 3rd floor button: {:?}"
fr_fr: "Un passager a appuyé sur le bouton du 3e étage : {:?}"

source: "The car door closed: {:?}"
fr_fr: "La porte de la cabine s’est fermée : {:?}"

source: "The car has arrived on the 3rd floor: {:?}"
fr_fr: "La cabine est arrivée au 3e étage : {:?}"

source: /// A button was pressed.
fr_fr: /// Un bouton a été pressé.

source: /// The car has arrived at the given floor.
fr_fr: /// La cabine est arrivée à l’étage donné.

source: /// The car's doors have opened.
fr_fr: /// Les portes de la cabine se sont ouvertes.

source: /// The car's doors have closed.
fr_fr: /// Les portes de la cabine se sont fermées.

source: /// A floor is represented as an integer.
fr_fr: /// Un étage est représenté par un entier.

source: /// A user-accessible button.
fr_fr: /// Un bouton accessible à l’utilisateur.

source: /// A button in the elevator lobby on the given floor.
fr_fr: /// Un bouton dans le hall d’ascenseur à l’étage donné.

source: /// A floor button within the car.
fr_fr: /// Un bouton d’étage situé dans la cabine.

source: Welcome to Day 2
fr_fr: Bienvenue au jour 2

source: Now that we have seen a fair amount of Rust, today will focus on Rust's type system:
fr_fr: Maintenant que nous avons vu une bonne partie de Rust, nous allons aujourd’hui nous concentrer sur son système de types :

source: Pattern matching: extracting data from structures.
fr_fr: Filtrage par motif : extraction de données depuis des structures.

source: Methods: associating functions with types.
fr_fr: Méthodes : associer des fonctions à des types.

source: Traits: behaviors shared by multiple types.
fr_fr: Traits : comportements partagés entre plusieurs types.

source: Generics: parameterizing types on other types.
fr_fr: Génériques : paramétrer des types sur d’autres types.

source: Standard library types and traits: a tour of Rust's rich standard library.
fr_fr: Types et traits de la bibliothèque standard : un aperçu de la riche bibliothèque standard de Rust.

source: The `match` keyword lets you match a value against one or more _patterns_. The comparisons are done from top to bottom and the first match wins.
fr_fr: Le mot-clé `match` permet de comparer une valeur à un ou plusieurs _motifs_. Les comparaisons se font de haut en bas et le premier motif correspondant l’emporte.

source: The patterns can be simple values, similarly to `switch` in C and C++:
fr_fr: Les motifs peuvent être de simples valeurs, comme dans une instruction `switch` en C ou C++ :

source: "Quitting"
fr_fr: "Fermeture"

source: "Moving around"
fr_fr: "Déplacement"

source: "Number input"
fr_fr: "Saisie numérique"

source: "Lowercase: {key}"
fr_fr: "Minuscule : {key}"

source: "Something else"
fr_fr: "Autre chose"

source: The `_` pattern is a wildcard pattern which matches any value. The expressions _must_ be exhaustive, meaning that it covers every possibility, so `_` is often used as the final catch-all case.
fr_fr: Le motif `_` est un motif générique qui correspond à n’importe quelle valeur. Les expressions doivent _impérativement_ être exhaustives, couvrant toutes les possibilités : `_` est donc souvent utilisé comme dernier cas attrape-tout.

source: Match can be used as an expression. Just like `if`, each match arm must have the same type. The type is the last expression of the block, if any. In the example above, the type is `()`.
fr_fr: `match` peut être utilisé comme une expression. Tout comme pour `if`, chaque branche de `match` doit avoir le même type. Ce type est déterminé par la dernière expression du bloc, s’il y en a une. Dans l’exemple ci-dessus, le type est `()`.

source: A variable in the pattern (`key` in this example) will create a binding that can be used within the match arm.
fr_fr: Une variable dans le motif (comme `key` dans cet exemple) crée une liaison réutilisable dans la branche du `match`.

source: A match guard causes the arm to match only if the condition is true.
fr_fr: Un garde de correspondance fait en sorte que la branche ne corresponde que si la condition est vraie.

source: You might point out how some specific characters are being used when in a pattern
fr_fr: Vous pouvez faire remarquer l’usage de certains caractères spécifiques dans les motifs

source: `|` as an `or`
fr_fr: `|` comme un « ou » logique

source: `..` can expand as much as it needs to be
fr_fr: `..` peut s’étendre sur autant d’éléments que nécessaire

source: `1..=5` represents an inclusive range
fr_fr: `1..=5` représente une plage inclusive

source: `_` is a wild card
fr_fr: `_` est un joker

source: Match guards as a separate syntax feature are important and necessary when we wish to concisely express more complex ideas than patterns alone would allow.
fr_fr: Les gardes de correspondance sont une construction syntaxique essentielle lorsqu’on souhaite exprimer de manière concise des conditions plus complexes que ce que permettent les motifs seuls.

source: They are not the same as separate `if` expression inside of the match arm. An `if` expression inside of the branch block (after `=>`) happens after the match arm is selected. Failing the `if` condition inside of that block won't result in other arms of the original `match` expression being considered.
fr_fr: Elles ne sont pas équivalentes à une instruction `if` située dans le bloc du bras de `match` (après `=>`) : celle-ci est exécutée **après** la sélection du bras. Si la condition `if` échoue, aucun autre bras du `match` ne sera envisagé.

source: The condition defined in the guard applies to every expression in a pattern with an `|`.
fr_fr: La condition de garde s’applique à **chaque** motif d’un motif combiné avec `|`.

source: Like tuples, structs and enums can also be destructured by matching:
fr_fr: Comme les tuples, les structures et les énumérations peuvent également être déstructurées via un `match` :

source: Structs
fr_fr: Structures

source: "y = {y}, other fields were ignored"
fr_fr: "y = {y}, les autres champs ont été ignorés"

source: Patterns can also be used to bind variables to parts of your values. This is how you inspect the structure of your types. Let us start with a simple `enum` type:
fr_fr: Les motifs permettent également de lier des variables à certaines parties de vos valeurs. C’est ainsi que l’on inspecte la structure de ses types. Commençons avec une simple énumération (`enum`) :

source: "cannot divide {n} into two equal parts"
fr_fr: "impossible de diviser {n} en deux parties égales"

source: "{n} divided in two is {half}"
fr_fr: "{n} divisé par deux donne {half}"

source: "sorry, an error happened: {msg}"
fr_fr: "désolé, une erreur est survenue : {msg}"

source: Here we have used the arms to _destructure_ the `Result` value. In the first arm, `half` is bound to the value inside the `Ok` variant. In the second arm, `msg` is bound to the error message.
fr_fr: Ici, nous avons utilisé les bras pour _déstructurer_ la valeur `Result`. Dans le premier bras, `half` est lié à la valeur contenue dans la variante `Ok`. Dans le second, `msg` est lié au message d’erreur.

source: Change the literal values in `foo` to match with the other patterns.
fr_fr: Modifiez les valeurs littérales dans `foo` pour qu’elles correspondent aux autres motifs.

source: Add a new field to `Foo` and make changes to the pattern as needed.
fr_fr: Ajoutez un nouveau champ à `Foo` et adaptez le motif en conséquence.

source: The distinction between a capture and a constant expression can be hard to spot. Try changing the `2` in the second arm to a variable, and see that it subtly doesn't work. Change it to a `const` and see it working again.
fr_fr: La différence entre une capture et une expression constante peut être difficile à voir. Essayez de remplacer le `2` dans la seconde branche par une variable : cela ne fonctionnera pas. Remplacez-la par une `const` et cela fonctionnera à nouveau.

source: The `if`/`else` expression is returning an enum that is later unpacked with a `match`.
fr_fr: L’expression `if`/`else` renvoie une énumération qui est ensuite déstructurée avec un `match`.

source: You can try adding a third variant to the enum definition and displaying the errors when running the code. Point out the places where your code is now inexhaustive and how the compiler tries to give you hints.
fr_fr: Vous pouvez essayer d’ajouter une troisième variante à la définition de l’énumération et afficher les erreurs lors de l’exécution du code. Relevez les endroits où le code devient non exhaustif et comment le compilateur vous avertit.

source: The values in the enum variants can only be accessed after being pattern matched.
fr_fr: Les valeurs contenues dans les variantes d’une énumération ne sont accessibles qu’après avoir été extraites via une correspondance de motif.

source: Demonstrate what happens when the search is inexhaustive. Note the advantage the Rust compiler provides by confirming when all cases are handled.
fr_fr: Montrez ce qu’il se passe lorsque le `match` n’est pas exhaustif. Soulignez l’intérêt du compilateur Rust, qui s’assure que tous les cas sont couverts.

source: Save the result of `divide_in_two` in the `result` variable and `match` it in a loop. That won't compile because `msg` is consumed when matched. To fix it, match `&result` instead of `result`. That will make `msg` a reference so it won't be consumed. This ["match ergonomics"](https://rust-lang.github.io/rfcs/2005-match-ergonomics.html) appeared in Rust 2018. If you want to support older Rust, replace `msg` with `ref msg` in the pattern.
fr_fr: Stockez le résultat de `divide_in_two` dans la variable `result` et utilisez un `match` dans une boucle. Cela ne compilera pas car `msg` est consommé lors de la correspondance. Pour corriger cela, utilisez `&result` au lieu de `result`. Ainsi, `msg` sera une référence et ne sera pas consommée. Cette [`ergonomie du match`](https://rust-lang.github.io/rfcs/2005-match-ergonomics.html) a été introduite avec Rust 2018. Pour prendre en charge les versions plus anciennes, utilisez `ref msg` dans le motif.

source: Rust has a few control flow constructs which differ from other languages. They are used for pattern matching:
fr_fr: Rust possède quelques structures de contrôle de flux différentes des autres langages. Elles sont utilisées pour le filtrage par motif :

source: `if let` expressions
fr_fr: Expressions `if let`

source: `while let` expressions
fr_fr: Expressions `while let`

source: `match` expressions
fr_fr: Expressions `match`

source: The [`if let` expression](https://doc.rust-lang.org/reference/expressions/if-expr.html#if-let-expressions) lets you execute different code depending on whether a value matches a pattern:
fr_fr: L’expression [`if let`](https://doc.rust-lang.org/reference/expressions/if-expr.html#if-let-expressions) permet d’exécuter un code différent selon qu’une valeur correspond ou non à un motif :

source: "slept for {:?}"
fr_fr: "a dormi pendant {:?}"

source: `let else` expressions
fr_fr: Expressions `let else`

source: For the common case of matching a pattern and returning from the function, use [`let else`](https://doc.rust-lang.org/rust-by-example/flow_control/let_else.html). The "else" case must diverge (`return`, `break`, or panic - anything but falling off the end of the block).
fr_fr: Pour le cas courant où l’on souhaite faire correspondre un motif et retourner depuis une fonction, on peut utiliser [`let else`](https://doc.rust-lang.org/rust-by-example/flow_control/let_else.html). Le cas "else" doit diverger (`return`, `break` ou `panic` — tout sauf sortir simplement du bloc).

source: "got None"
fr_fr: "a obtenu None"

source: "got empty string"
fr_fr: "a obtenu une chaîne vide"

source: "not a hex digit"
fr_fr: "n’est pas un chiffre hexadécimal"

source: "result: {:?}"
fr_fr: "résultat : {:?}"

source: Like with `if let`, there is a [`while let`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#predicate-pattern-loops) variant which repeatedly tests a value against a pattern:
fr_fr: Comme avec `if let`, il existe une variante [`while let`](https://doc.rust-lang.org/reference/expressions/loop-expr.html#predicate-pattern-loops) qui permet de tester à plusieurs reprises une valeur contre un motif :

source: Here [`String::pop`](https://doc.rust-lang.org/stable/std/string/struct.String.html#method.pop) returns `Some(c)` until the string is empty, after which it will return `None`. The `while let` lets us keep iterating through all items.
fr_fr: Ici, [`String::pop`](https://doc.rust-lang.org/stable/std/string/struct.String.html#method.pop) renvoie `Some(c)` tant que la chaîne n’est pas vide, puis `None`. L’instruction `while let` permet de parcourir tous les éléments jusqu’à la fin.

source: Unlike `match`, `if let` does not have to cover all branches. This can make it more concise than `match`.
fr_fr: Contrairement à `match`, `if let` ne doit pas couvrir tous les cas. Cela le rend parfois plus concis que `match`.

source: A common usage is handling `Some` values when working with `Option`.
fr_fr: Un usage courant est de traiter les valeurs `Some` lorsqu’on travaille avec le type `Option`.

source: Unlike `match`, `if let` does not support guard clauses for pattern matching.
fr_fr: Contrairement à `match`, `if let` ne prend pas en charge les clauses de garde pour le filtrage par motif.

source: `if-let`s can pile up, as shown. The `let-else` construct supports flattening this nested code. Rewrite the awkward version for students, so they can see the transformation.
fr_fr: Les `if-let` peuvent s’accumuler, comme illustré. La construction `let-else` permet d’aplatir ce code imbriqué. Réécrivez la version maladroite pour que les étudiants puissent observer la transformation.

source: The rewritten version is:
fr_fr: La version réécrite est :

source: Point out that the `while let` loop will keep going as long as the value matches the pattern.
fr_fr: Soulignez que la boucle `while let` continue tant que la valeur correspond au motif.

source: You could rewrite the `while let` loop as an infinite loop with an if statement that breaks when there is no value to unwrap for `name.pop()`. The `while let` provides syntactic sugar for the above scenario.
fr_fr: On pourrait réécrire la boucle `while let` comme une boucle infinie avec une instruction `if` qui interrompt la boucle lorsqu'il n'y a plus de valeur à extraire via `name.pop()`. L'instruction `while let` est un sucre syntaxique pour ce cas.

source: Let's write a simple recursive evaluator for arithmetic expressions.
fr_fr: Écrivons un évaluateur récursif simple pour des expressions arithmétiques.

source: The `Box` type here is a smart pointer, and will be covered in detail later in the course. An expression can be "boxed" with `Box::new` as seen in the tests. To evaluate a boxed expression, use the deref operator (`*`) to "unbox" it: `eval(*boxed_expr)`.
fr_fr: Le type `Box` ici est un pointeur intelligent, qui sera abordé plus en détail plus tard dans le cours. Une expression peut être « boxée » avec `Box::new`, comme illustré dans les tests. Pour évaluer une expression boxée, utilisez l’opérateur de déréférencement (`*`) : `eval(*boxed_expr)`.

source: Some expressions cannot be evaluated and will return an error. The standard [`Result<Value, String>`](https://doc.rust-lang.org/std/result/enum.Result.html) type is an enum that represents either a successful value (`Ok(Value)`) or an error (`Err(String)`). We will cover this type in detail later.
fr_fr: Certaines expressions ne peuvent pas être évaluées et renverront une erreur. Le type standard [`Result<Value, String>`](https://doc.rust-lang.org/std/result/enum.Result.html) est une énumération qui représente soit une valeur réussie (`Ok(Value)`), soit une erreur (`Err(String)`). Ce type sera étudié en détail plus tard.

source: Copy and paste the code into the Rust playground, and begin implementing `eval`. The final product should pass the tests. It may be helpful to use `todo!()` and get the tests to pass one-by-one. You can also skip a test temporarily with `#[ignore]`:
fr_fr: Copiez et collez le code dans le Rust Playground, puis commencez à implémenter `eval`. Le résultat final doit réussir les tests. Il peut être utile d’utiliser `todo!()` pour faire passer les tests un par un. Vous pouvez aussi ignorer temporairement un test avec `#[ignore]` :

source: If you finish early, try writing a test that results in division by zero or integer overflow. How could you handle this with `Result` instead of a panic?
fr_fr: Si vous terminez rapidement, essayez d’écrire un test qui conduit à une division par zéro ou à un dépassement d’entier. Comment pourriez-vous gérer cela avec `Result` au lieu d’un panic ?

source: /// An operation to perform on two subexpressions.
fr_fr: /// Une opération à effectuer sur deux sous-expressions.

source: /// An expression, in tree form.
fr_fr: /// Une expression sous forme d’arbre.

source: /// An operation on two subexpressions.
fr_fr: /// Une opération sur deux sous-expressions.

source: /// A literal value
fr_fr: /// Une valeur littérale

source: "division by zero"
fr_fr: "division par zéro"

source: "expr: {:?}"
fr_fr: "expression : {:?}"

source: Rust allows you to associate functions with your new types. You do this with an `impl` block:
fr_fr: Rust permet d’associer des fonctions à vos nouveaux types. Cela se fait à l’aide d’un bloc `impl` :

source: // No receiver, a static method
fr_fr: // Pas de récepteur, méthode statique

source: // Exclusive borrowed read-write access to self
fr_fr: // Emprunt exclusif avec accès en lecture-écriture à self

source: // Shared and read-only borrowed access to self
fr_fr: // Emprunt partagé avec accès en lecture seule à self

source: "Recorded {} laps for {}:"
fr_fr: "{} tours enregistrés pour {} :"

source: "Lap {idx}: {lap} sec"
fr_fr: "Tour {idx} : {lap} sec"

source: // Exclusive ownership of self
fr_fr: // Possession exclusive de self

source: "Race {} is finished, total lap time: {}"
fr_fr: "La course {} est terminée, temps total : {}"

source: "Monaco Grand Prix"
fr_fr: "Grand Prix de Monaco"

source: The `self` arguments specify the "receiver" - the object the method acts on. There are several common receivers for a method:
fr_fr: Les arguments `self` indiquent le « récepteur » — l’objet sur lequel agit la méthode. Il existe plusieurs récepteurs courants :

source: `&self`: borrows the object from the caller using a shared and immutable reference. The object can be used again afterwards.
fr_fr: `&self` : emprunte l’objet à l’appelant via une référence partagée et immuable. L’objet peut être réutilisé ensuite.

source: `&mut self`: borrows the object from the caller using a unique and mutable reference. The object can be used again afterwards.
fr_fr: `&mut self` : emprunte l’objet via une référence exclusive et mutable. L’objet peut être réutilisé ensuite.
