Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: /// Prints a greeting to standard output.
fr_fr: /// Affiche un message de salutation sur la sortie standard.

source: "Hello from Rust!"
fr_fr: "Bonjour depuis Rust !"

source: You can now build, push, and run the binary:
fr_fr: Vous pouvez maintenant compiler, transférer et exécuter le binaire :

source: Rust Libraries
fr_fr: Bibliothèques Rust

source: You use `rust_library` to create a new Rust library for Android.
fr_fr: Vous utilisez `rust_library` pour créer une nouvelle bibliothèque Rust pour Android.

source: Here we declare a dependency on two libraries:
fr_fr: Ici, nous déclarons une dépendance à deux bibliothèques :

source: `libgreeting`, which we define below,
fr_fr: `libgreeting`, que nous définissons ci-dessous,

source: `libtextwrap`, which is a crate already vendored in [`external/rust/crates/`](https://cs.android.com/android/platform/superproject/+/master:external/rust/crates/).
fr_fr: `libtextwrap`, qui est une crate déjà intégrée dans [`external/rust/crates/`](https://cs.android.com/android/platform/superproject/+/master:external/rust/crates/).

source: // Need this to avoid dynamic link error.
fr_fr: // Requis pour éviter une erreur de lien dynamique.

source: //! Greeting library.
fr_fr: //! Bibliothèque de salutations.

source: /// Greet `name`.
fr_fr: /// Salue `name`.

source: "Hello {name}, it is very nice to meet you!"
fr_fr: "Bonjour {name}, ravi de vous rencontrer !"

source: You build, push, and run the binary like before:
fr_fr: Vous compilez, transférez et exécutez le binaire comme précédemment :

source: The [Android Interface Definition Language (AIDL)](https://developer.android.com/guide/components/aidl) is supported in Rust:
fr_fr: Le [langage de définition d’interface Android (AIDL)](https://developer.android.com/guide/components/aidl) est pris en charge dans Rust :

source: Rust code can call existing AIDL servers,
fr_fr: Le code Rust peut appeler des serveurs AIDL existants,

source: You can create new AIDL servers in Rust.
fr_fr: Vous pouvez créer de nouveaux serveurs AIDL en Rust.

source: To illustrate how to use Rust with Binder, we're going to walk through the process of creating a Binder interface. We're then going to both implement the described service and write client code that talks to that service.
fr_fr: Pour illustrer l’utilisation de Rust avec Binder, nous allons suivre les étapes de création d’une interface Binder. Ensuite, nous implémenterons le service décrit et écrirons un client qui communique avec ce service.

source: AIDL Interfaces
fr_fr: Interfaces AIDL

source: You declare the API of your service using an AIDL interface:
fr_fr: Vous déclarez l’API de votre service à l’aide d’une interface AIDL :

source: /** Birthday service interface. */
fr_fr: /** Interface du service d'anniversaire. */

source: /** Generate a Happy Birthday message. */
fr_fr: /** Génère un message de joyeux anniversaire. */

source: // Rust is not enabled by default
fr_fr: // Rust n’est pas activé par défaut

source: Note that the directory structure under the `aidl/` directory needs to match the package name used in the AIDL file, i.e. the package is `com.example.birthdayservice` and the file is at `aidl/com/example/IBirthdayService.aidl`.
fr_fr: Notez que la structure des dossiers sous `aidl/` doit correspondre au nom du package utilisé dans le fichier AIDL, c’est-à-dire que le package est `com.example.birthdayservice` et le fichier se trouve à `aidl/com/example/IBirthdayService.aidl`.

source: Generated Service API
fr_fr: API du service générée

source: Binder generates a trait corresponding to the interface definition. trait to talk to the service.
fr_fr: Binder génère un trait correspondant à la définition de l’interface. Ce trait permet de communiquer avec le service.

source: _Generated trait_:
fr_fr: _Trait généré_ :

source: Your service will need to implement this trait, and your client will use this trait to talk to the service.
fr_fr: Votre service devra implémenter ce trait, et votre client l’utilisera pour communiquer avec le service.

source: The generated bindings can be found at `out/soong/.intermediates/<path to module>/`.
fr_fr: Les liaisons générées se trouvent dans `out/soong/.intermediates/<chemin vers le module>/`.

source: Point out how the generated function signature, specifically the argument and return types, correspond the interface definition.
fr_fr: Soulignez comment la signature de la fonction générée, en particulier les types d’arguments et de retour, correspond à la définition de l’interface.

source: `String` for an argument results in a different Rust type than `String` as a return type.
fr_fr: Un `String` en tant qu’argument donne un type Rust différent de `String` comme type de retour.

source: Service Implementation
fr_fr: Implémentation du service

source: We can now implement the AIDL service:
fr_fr: Nous pouvons maintenant implémenter le service AIDL :

source: /// The `IBirthdayService` implementation.
fr_fr: /// L'implémentation de `IBirthdayService`.

source: "Happy Birthday {name}, congratulations with the {years} years!"
fr_fr: "Joyeux anniversaire {name}, félicitations pour ces {years} ans !"

source: Point out the path to the generated `IBirthdayService` trait, and explain why each of the segments is necessary.
fr_fr: Indiquez le chemin vers le trait `IBirthdayService` généré, et expliquez pourquoi chaque segment est nécessaire.

source: TODO: What does the `binder::Interface` trait do? Are there methods to override? Where source?
fr_fr: TODO : À quoi sert le trait `binder::Interface` ? Y a-t-il des méthodes à surcharger ? Où est le code source ?

source: AIDL Server
fr_fr: Serveur AIDL

source: Finally, we can create a server which exposes the service:
fr_fr: Enfin, nous pouvons créer un serveur qui expose le service :

source: //! Birthday service.
fr_fr: //! Service d'anniversaire.

source: /// Entry point for birthday service.
fr_fr: /// Point d'entrée pour le service d'anniversaire.

source: "Failed to register service"
fr_fr: "Échec de l'enregistrement du service"

source: // To avoid dynamic link error.
fr_fr: // Pour éviter une erreur de lien dynamique.

source: The process for taking a user-defined service implementation (in this case the `BirthdayService` type, which implements the `IBirthdayService`) and starting it as a Binder service has multiple steps, and may appear more complicated than students are used to if they've used Binder from C++ or another language. Explain to students why each step is necessary.
fr_fr: Le processus pour prendre une implémentation de service définie par l'utilisateur (dans ce cas le type `BirthdayService`, qui implémente `IBirthdayService`) et la démarrer en tant que service Binder comporte plusieurs étapes. Cela peut sembler plus complexe que ce à quoi les étudiants sont habitués s’ils ont utilisé Binder en C++ ou dans un autre langage. Expliquez pourquoi chaque étape est nécessaire.

source: Create an instance of your service type (`BirthdayService`).
fr_fr: Créez une instance de votre type de service (`BirthdayService`).

source: Wrap the service object in corresponding `Bn*` type (`BnBirthdayService` in this case). This type is generated by Binder and provides the common Binder functionality that would be provided by the `BnBinder` base class in C++. We don't have inheritance in Rust, so instead we use composition, putting our `BirthdayService` within the generated `BnBinderService`.
fr_fr: Encapsulez l'objet service dans le type `Bn*` correspondant (`BnBirthdayService` dans ce cas). Ce type est généré par Binder et fournit les fonctionnalités communes que la classe de base `BnBinder` fournirait en C++. Rust n'ayant pas d'héritage, on utilise la composition en plaçant notre `BirthdayService` dans le `BnBinderService` généré.

source: Call `add_service`, giving it a service identifier and your service object (the `BnBirthdayService` object in the example).
fr_fr: Appelez `add_service` en lui fournissant un identifiant de service et votre objet service (`BnBirthdayService` dans l'exemple).

source: Call `join_thread_pool` to add the current thread to Binder's thread pool and start listening for connections.
fr_fr: Appelez `join_thread_pool` pour ajouter le thread courant au pool de threads de Binder et commencer à écouter les connexions.

source: We can now build, push, and start the service:
fr_fr: Nous pouvons maintenant compiler, transférer et démarrer le service :

source: In another terminal, check that the service runs:
fr_fr: Dans un autre terminal, vérifiez que le service fonctionne :

source: You can also call the service with `service call`:
fr_fr: Vous pouvez également appeler le service avec `service call` :

source: AIDL Client
fr_fr: Client AIDL

source: Finally, we can create a Rust client for our new service.
fr_fr: Enfin, nous pouvons créer un client Rust pour notre nouveau service.

source: /// Call the birthday service.
fr_fr: /// Appelle le service d'anniversaire.

source: "Failed to connect to BirthdayService"
fr_fr: "Échec de connexion au BirthdayService"

source: // Call the service.
fr_fr: // Appelle le service.

source: Notice that the client does not depend on `libbirthdayservice`.
fr_fr: Notez que le client ne dépend pas de `libbirthdayservice`.

source: Build, push, and run the client on your device:
fr_fr: Compilez, transférez et exécutez le client sur votre appareil :

source: `Strong<dyn IBirthdayService>` is the trait object representing the service that the client has connected to.
fr_fr: `Strong<dyn IBirthdayService>` est l’objet trait représentant le service auquel le client est connecté.

source: `Strong` is a custom smart pointer type for Binder. It handles both an in-process ref count for the service trait object, and the global Binder ref count that tracks how many processes have a reference to the object.
fr_fr: `Strong` est un type de pointeur intelligent personnalisé pour Binder. Il gère à la fois un compteur de références local au processus pour l’objet trait, et un compteur global Binder qui suit combien de processus y ont une référence.

source: Note that the trait object that the client uses to talk to the service uses the exact same trait that the server implements. For a given Binder interface, there is a single Rust trait generated that both client and server use.
fr_fr: Notez que l’objet trait que le client utilise pour parler au service utilise exactement le même trait que celui implémenté par le serveur. Pour une interface Binder donnée, un seul trait Rust est généré, utilisé à la fois côté client et serveur.

source: Use the same service identifier used when registering the service. This should ideally be defined in a common crate that both the client and server can depend on.
fr_fr: Utilisez le même identifiant de service que celui utilisé lors de l’enregistrement du service. Idéalement, il devrait être défini dans un crate commun utilisé à la fois par le client et le serveur.

source: Let us extend the API with more functionality: we want to let clients specify a list of lines for the birthday card:
fr_fr: Étendons l’API avec plus de fonctionnalités : nous voulons permettre aux clients de spécifier une liste de lignes pour la carte d’anniversaire :

source: This results in an updated trait definition for `IBirthdayService`:
fr_fr: Cela entraîne une mise à jour de la définition du trait `IBirthdayService` :

source: Note how the `String[]` in the AIDL definition is translated as a `&[String]` in Rust, i.e. that idiomatic Rust types are used in the generated bindings wherever possible:
fr_fr: Notez que le `String[]` dans la définition AIDL est traduit en `&[String]` en Rust, c’est-à-dire que des types Rust idiomatiques sont utilisés dans les liaisons générées dès que possible :

source: `in` array arguments are translated to slices.
fr_fr: Les arguments tableau `in` sont traduits en slices.

source: `out` and `inout` args are translated to `&mut Vec<T>`.
fr_fr: Les arguments `out` et `inout` sont traduits en `&mut Vec<T>`.

source: Return values are translated to returning a `Vec<T>`.
fr_fr: Les valeurs de retour sont traduites par un retour de type `Vec<T>`.

source: Updating Client and Service
fr_fr: Mise à jour du client et du service

source: Update the client and server code to account for the new API.
fr_fr: Mettez à jour le code du client et du serveur pour tenir compte de la nouvelle API.

source: "Habby birfday to yuuuuu"
fr_fr: "Joyeux annifversaire à toiiiiii"

source: "And also: many more"
fr_fr: "Et aussi : plein d'autres encore"

source: TODO: Move code snippets into project files where they'll actually be built?
fr_fr: TODO : Déplacer les extraits de code dans des fichiers de projet où ils seront réellement compilés ?

source: Working With AIDL Types
fr_fr: Travailler avec les types AIDL

source: AIDL types translate into the appropriate idiomatic Rust type:
fr_fr: Les types AIDL sont traduits en types Rust idiomatiques correspondants :

source: Primitive types map (mostly) to idiomatic Rust types.
fr_fr: Les types primitifs sont (en général) mappés vers les types Rust idiomatiques.

source: Collection types like slices, `Vec`s and string types are supported.
fr_fr: Les types de collection comme les slices, `Vec` et chaînes de caractères sont pris en charge.

source: References to AIDL objects and file handles can be sent between clients and services.
fr_fr: Des références vers des objets AIDL et des descripteurs de fichiers peuvent être échangées entre clients et services.

source: File handles and parcelables are fully supported.
fr_fr: Les descripteurs de fichiers et les parcelables sont entièrement pris en charge.

source: Primitive types map (mostly) idiomatically:
fr_fr: Les types primitifs sont (généralement) traduits de manière idiomatique :

source: AIDL Type
fr_fr: Type AIDL

source: Rust Type
fr_fr: Type Rust

source: Note
fr_fr: Remarque

source: Note that bytes are signed.
fr_fr: Notez que les octets sont signés.

source: Note the usage of `u16`, NOT `u32`.
fr_fr: Remarquez l'utilisation de `u16`, et non `u32`.

source: The array types (`T[]`, `byte[]`, and `List<T>`) get translated to the appropriate Rust array type depending on how they are used in the function signature:
fr_fr: Les types de tableaux (`T[]`, `byte[]` et `List<T>`) sont traduits en types Rust appropriés selon leur utilisation dans la signature de la fonction :

source: `in` argument
fr_fr: argument `in`

source: `out`/`inout` argument
fr_fr: argument `out`/`inout`

source: Return
fr_fr: Retour

source: In Android 13 or higher, fixed-size arrays are supported, i.e. `T[N]` becomes `[T; N]`. Fixed-size arrays can have multiple dimensions (e.g. int\[3\]\[4\]). In the Java backend, fixed-size arrays are represented as array types.
fr_fr: À partir d’Android 13, les tableaux de taille fixe sont pris en charge, c’est-à-dire que `T[N]` devient `[T; N]`. Ces tableaux peuvent avoir plusieurs dimensions (par ex. int\[3\]\[4\]). En backend Java, ils sont représentés comme des types de tableaux.

source: Arrays in parcelable fields always get translated to `Vec<T>`.
fr_fr: Les tableaux dans les champs `parcelable` sont toujours traduits en `Vec<T>`.

source: AIDL objects can be sent either as a concrete AIDL type or as the type-erased `IBinder` interface:
fr_fr: Les objets AIDL peuvent être envoyés soit en tant que type AIDL concret, soit sous forme de l’interface effacée `IBinder` :

source: /** The same thing, but using a binder object. */
fr_fr: /** La même chose, mais avec un objet binder. */

source: /** The same thing, but using `IBinder`. */
fr_fr: /** La même chose, mais avec `IBinder`. */

source: /// Rust struct implementing the `IBirthdayInfoProvider` interface.
fr_fr: /// Structure Rust implémentant l'interface `IBirthdayInfoProvider`.

source: // Create a binder object for the `IBirthdayInfoProvider` interface.
fr_fr: // Crée un objet binder pour l'interface `IBirthdayInfoProvider`.

source: // Send the binder object to the service.
fr_fr: // Envoie l'objet binder au service.

source: // Perform the same operation but passing the provider as an `SpIBinder`.
fr_fr: // Effectue la même opération mais en passant le provider en tant que `SpIBinder`.

source: Note the usage of `BnBirthdayInfoProvider`. This serves the same purpose as `BnBirthdayService` that we saw previously.
fr_fr: Notez l'utilisation de `BnBirthdayInfoProvider`. Cela remplit le même rôle que `BnBirthdayService`, vu précédemment.

source: Binder for Rust supports sending parcelables directly:
fr_fr: Binder pour Rust prend en charge l’envoi direct de parcelables :

source: /** The same thing, but with a parcelable. */
fr_fr: /** La même chose, mais avec un parcelable. */

source: Files can be sent between Binder clients/servers using the `ParcelFileDescriptor` type:
fr_fr: Des fichiers peuvent être envoyés entre clients et serveurs Binder à l’aide du type `ParcelFileDescriptor` :

source: /** The same thing, but loads info from a file. */
fr_fr: /** La même chose, mais en chargeant les informations depuis un fichier. */

source: // Open a file and put the birthday info in it.
fr_fr: // Ouvre un fichier et y inscrit les informations d'anniversaire.

source: // Create a `ParcelFileDescriptor` from the file and send it.
fr_fr: // Crée un `ParcelFileDescriptor` à partir du fichier et l'envoie.

source: // Convert the file descriptor to a `File`. `ParcelFileDescriptor` wraps // an `OwnedFd`, which can be cloned and then used to create a `File` // object.
fr_fr: // Convertit le descripteur de fichier en `File`. `ParcelFileDescriptor` encapsule // un `OwnedFd`, qui peut être cloné et utilisé pour créer un objet `File`.

source: "Invalid file handle"
fr_fr: "Descripteur de fichier invalide"

source: `ParcelFileDescriptor` wraps an `OwnedFd`, and so can be created from a `File` (or any other type that wraps an `OwnedFd`), and can be used to create a new `File` handle on the other side.
fr_fr: `ParcelFileDescriptor` encapsule un `OwnedFd`, et peut donc être créé à partir d’un `File` (ou de tout autre type enveloppant un `OwnedFd`), et peut être utilisé pour recréer un handle de fichier de l’autre côté.

source: Other types of file descriptors can be wrapped and sent, e.g. TCP, UDP, and UNIX sockets.
fr_fr: D’autres types de descripteurs de fichier peuvent être encapsulés et envoyés, par exemple des sockets TCP, UDP ou UNIX.

source: Testing in Android
fr_fr: Tests sous Android

source: Building on [Testing](../testing.md), we will now look at how unit tests work in AOSP. Use the `rust_test` module for your unit tests:
fr_fr: En complément du [chapitre sur les tests](../testing.md), voyons comment fonctionnent les tests unitaires dans AOSP. Utilisez le module `rust_test` pour vos tests unitaires :

source: //! Left-padding library.
fr_fr: //! Bibliothèque d’alignement à gauche.

source: /// Left-pad `s` to `width`.
fr_fr: /// Aligne `s` à gauche sur une largeur `width`.

source: You can now run the test with
fr_fr: Vous pouvez maintenant exécuter le test avec

source: The output looks like this:
fr_fr: La sortie ressemble à ceci :

source: Notice how you only mention the root of the library crate. Tests are found recursively in nested modules.
fr_fr: Notez que vous mentionnez uniquement la racine du crate bibliothèque. Les tests sont retrouvés récursivement dans les modules imbriqués.

source: The [GoogleTest](https://docs.rs/googletest/) crate allows for flexible test assertions using _matchers_:
fr_fr: Le crate [GoogleTest](https://docs.rs/googletest/) permet d'écrire des assertions de test flexibles en utilisant des _matchers_ :

source: If we change the last element to `"!"`, the test fails with a structured error message pin-pointing the error:
fr_fr: Si l’on change le dernier élément par `"!"`, le test échoue avec un message d’erreur structuré pointant précisément l’erreur :

source: GoogleTest is not part of the Rust Playground, so you need to run this example in a local environment. Use `cargo add googletest` to quickly add it to an existing Cargo project.
fr_fr: GoogleTest n’est pas disponible dans le Rust Playground. Exécutez cet exemple en local. Utilisez `cargo add googletest` pour l’ajouter rapidement à un projet Cargo existant.

source: The `use googletest::prelude::*;` line imports a number of [commonly used macros and types](https://docs.rs/googletest/latest/googletest/prelude/index.html).
fr_fr: La ligne `use googletest::prelude::*;` importe un ensemble de [macros et types courants](https://docs.rs/googletest/latest/googletest/prelude/index.html).

source: This just scratches the surface, there are many builtin matchers.
fr_fr: Ce n’est qu’un aperçu : il existe de nombreux matchers intégrés.

source: A particularly nice feature is that mismatches in multi-line strings are shown as a diff:
fr_fr: Une fonctionnalité appréciable est l’affichage des différences entre chaînes multilignes sous forme de diff :

source: "Memory safety found,\n\ Rust's strong typing guides the way,\n\ Secure code you'll write."
fr_fr: "\Sécurité mémoire trouvée,\n\ Le typage fort de Rust montre la voie,\n\ Tu écriras du code sûr."

source: "Memory safety found,\n\ Rust's silly humor guides the way,\n\ Secure code you'll write."
fr_fr: "\Sécurité mémoire trouvée,\n\ L'humour absurde de Rust montre la voie,\n\ Tu écriras du code sûr."

source: shows a color-coded diff (colors not shown here):
fr_fr: affiche un diff avec code couleur (non visible ici) :

source: The crate is a Rust port of [GoogleTest for C++](https://google.github.io/googletest/).
fr_fr: Ce crate est un portage Rust de [GoogleTest pour C++](https://google.github.io/googletest/).

source: For mocking, [Mockall](https://docs.rs/mockall/) is a widely used library. You need to refactor your code to use traits, which you can then quickly mock:
fr_fr: Pour le mocking, [Mockall](https://docs.rs/mockall/) est une bibliothèque très utilisée. Il faut refactorer le code pour utiliser des traits, qu’on peut ensuite facilement simuler :

source: Mockall is the recommended mocking library in Android (AOSP). There are other [mocking libraries available on crates.io](https://crates.io/keywords/mock), in particular in the area of mocking HTTP services. The other mocking libraries work in a similar fashion as Mockall, meaning that they make it easy to get a mock implementation of a given trait.
fr_fr: Mockall est la bibliothèque de simulation recommandée dans Android (AOSP). Il existe d’autres [librairies de mocking sur crates.io](https://crates.io/keywords/mock), notamment pour simuler des services HTTP. Elles fonctionnent de façon similaire à Mockall en fournissant facilement des implémentations fictives de traits.

source: Note that mocking is somewhat _controversial_: mocks allow you to completely isolate a test from its dependencies. The immediate result is faster and more stable test execution. On the other hand, the mocks can be configured wrongly and return output different from what the real dependencies would do.
fr_fr: Notez que le mocking est parfois _controversé_ : il permet d’isoler complètement un test de ses dépendances, ce qui le rend plus rapide et stable. Mais une mauvaise configuration des mocks peut entraîner des résultats incohérents avec les vraies dépendances.

source: If at all possible, it is recommended that you use the real dependencies. As an example, many databases allow you to configure an in-memory backend. This means that you get the correct behavior in your tests, plus they are fast and will automatically clean up after themselves.
fr_fr: Si possible, il est conseillé d’utiliser les vraies dépendances. Par exemple, beaucoup de bases de données proposent un backend en mémoire. Cela permet d’avoir un comportement réaliste, rapide, et sans résidus.
