Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: `JoinHandle` has a [`.join()`](https://doc.rust-lang.org/std/thread/struct.JoinHandle.html#method.join) method that blocks.
fr_fr: `JoinHandle` possède une méthode [`.join()`](https://doc.rust-lang.org/std/thread/struct.JoinHandle.html#method.join) qui bloque jusqu'à la fin du thread.

source: Use `let handle = thread::spawn(...)` and later `handle.join()` to wait for the thread to finish and have the program count all the way to 10.
fr_fr: Utilisez `let handle = thread::spawn(...)`, puis `handle.join()` pour attendre la fin du thread et faire en sorte que le programme compte jusqu’à 10.

source: Now what if we want to return a value?
fr_fr: Et si l'on veut retourner une valeur ?

source: Look at docs again:
fr_fr: Regardons à nouveau la documentation :

source: [`thread::spawn`](https://doc.rust-lang.org/std/thread/fn.spawn.html)'s closure returns `T`
fr_fr: La fermeture passée à [`thread::spawn`](https://doc.rust-lang.org/std/thread/fn.spawn.html) retourne une valeur de type `T`

source: `JoinHandle` [`.join()`](https://doc.rust-lang.org/std/thread/struct.JoinHandle.html#method.join) returns `thread::Result<T>`
fr_fr: `JoinHandle` [`.join()`](https://doc.rust-lang.org/std/thread/struct.JoinHandle.html#method.join) retourne un `thread::Result<T>`

source: Use the `Result` return value from `handle.join()` to get access to the returned value.
fr_fr: Utilisez la valeur de retour `Result` de `handle.join()` pour accéder à la valeur retournée.

source: Ok, what about the other case?
fr_fr: D’accord, et pour l’autre cas ?

source: Trigger a panic in the thread. Note that this doesn't panic `main`.
fr_fr: Déclenchez une panique dans le thread. Notez que cela n’affecte pas la fonction `main`.

source: Access the panic payload. This is a good time to talk about [`Any`](https://doc.rust-lang.org/std/any/index.html).
fr_fr: Accédez à la valeur transmise lors de la panique. C’est un bon moment pour aborder le trait [`Any`](https://doc.rust-lang.org/std/any/index.html).

source: Now we can return values from threads! What about taking inputs?
fr_fr: Nous pouvons maintenant retourner des valeurs depuis les threads ! Et pour leur passer des entrées ?

source: Capture something by reference in the thread closure.
fr_fr: Capturer une variable par référence dans la fermeture du thread.

source: An error message indicates we must move it.
fr_fr: Un message d’erreur nous indique qu’il faut déplacer la valeur (move).

source: Move it in, see we can compute and then return a derived value.
fr_fr: En la déplaçant, on peut effectuer un calcul puis retourner une valeur dérivée.

source: If we want to borrow?
fr_fr: Et si l’on veut emprunter ?

source: Main kills child threads when it returns, but another function would just return and leave them running.
fr_fr: Le thread principal tue les threads enfants quand il se termine, mais une autre fonction se contenterait de retourner, laissant les threads tourner.

source: That would be stack use-after-return, which violates memory safety!
fr_fr: Cela conduirait à un accès à la pile après retour, ce qui compromet la sécurité mémoire !

source: How do we avoid this? see next slide.
fr_fr: Comment éviter cela ? Voir la diapositive suivante.

source: Normal threads cannot borrow from their environment:
fr_fr: Les threads classiques ne peuvent pas emprunter depuis leur environnement :

source: However, you can use a [scoped thread](https://doc.rust-lang.org/std/thread/fn.scope.html) for this:
fr_fr: Cependant, vous pouvez utiliser un [thread à portée limitée](https://doc.rust-lang.org/std/thread/fn.scope.html) pour cela :

source: The reason for that is that when the `thread::scope` function completes, all the threads are guaranteed to be joined, so they can return borrowed data.
fr_fr: La raison en est que lorsque la fonction `thread::scope` se termine, tous les threads sont garantis comme étant terminés, ce qui permet de retourner des données empruntées.

source: Normal Rust borrowing rules apply: you can either borrow mutably by one thread, or immutably by any number of threads.
fr_fr: Les règles d’emprunt classiques de Rust s’appliquent : un seul thread peut emprunter mutablement, ou plusieurs threads peuvent emprunter immuablement.

source: Rust channels have two parts: a `Sender<T>` and a `Receiver<T>`. The two parts are connected via the channel, but you only see the end-points.
fr_fr: Les canaux Rust sont composés de deux parties : un `Sender<T>` et un `Receiver<T>`. Ils sont connectés via le canal, mais seuls les points d’extrémité sont visibles.

source: "Received: {:?}"
fr_fr: "Reçu : {:?}"

source: `mpsc` stands for Multi-Producer, Single-Consumer. `Sender` and `SyncSender` implement `Clone` (so you can make multiple producers) but `Receiver` does not.
fr_fr: `mpsc` signifie Multi-Producteur, Consommateur Unique. `Sender` et `SyncSender` implémentent `Clone` (ce qui permet d’avoir plusieurs producteurs), mais `Receiver` ne le fait pas.

source: `send()` and `recv()` return `Result`. If they return `Err`, it means the counterpart `Sender` or `Receiver` is dropped and the channel is closed.
fr_fr: `send()` et `recv()` retournent un `Result`. Si c’est `Err`, cela signifie que le `Sender` ou le `Receiver` correspondant a été abandonné et que le canal est fermé.

source: You get an unbounded and asynchronous channel with `mpsc::channel()`:
fr_fr: Vous obtenez un canal non borné et asynchrone avec `mpsc::channel()` :

source: "{thread_id:?}: sent Message {i}"
fr_fr: "{thread_id:?} : a envoyé Message {i}"

source: "{thread_id:?}: done"
fr_fr: "{thread_id:?} : terminé"

source: "Main: got {msg}"
fr_fr: "Principal : reçu {msg}"

source: With bounded (synchronous) channels, `send` can block the current thread:
fr_fr: Avec les canaux bornés (synchrones), `send` peut bloquer le thread en cours :

source: Calling `send` will block the current thread until there is space in the channel for the new message. The thread can be blocked indefinitely if there is nobody who reads from the channel.
fr_fr: `send` bloque le thread courant jusqu'à ce qu'il y ait de la place dans le canal pour le nouveau message. Le thread peut rester bloqué indéfiniment si personne ne lit depuis le canal.

source: A call to `send` will abort with an error (that is why it returns `Result`) if the channel is closed. A channel is closed when the receiver is dropped.
fr_fr: Un appel à `send` échoue avec une erreur (d’où le `Result` en retour) si le canal est fermé. Un canal est fermé quand le récepteur est détruit (dropped).

source: A bounded channel with a size of zero is called a "rendezvous channel". Every send will block the current thread until another thread calls `recv`.
fr_fr: Un canal borné de taille zéro est appelé « canal de rendez-vous ». Chaque `send` bloque le thread courant jusqu'à ce qu’un autre thread appelle `recv`.

source: How does Rust know to forbid shared access across threads? The answer is in two traits:
fr_fr: Comment Rust fait-il pour interdire l’accès partagé entre threads ? La réponse tient en deux traits :

source: [`Send`](https://doc.rust-lang.org/std/marker/trait.Send.html): a type `T` is `Send` if it is safe to move a `T` across a thread boundary.
fr_fr: [`Send`](https://doc.rust-lang.org/std/marker/trait.Send.html) : un type `T` est `Send` s’il peut être déplacé en toute sécurité d’un thread à un autre.

source: [`Sync`](https://doc.rust-lang.org/std/marker/trait.Sync.html): a type `T` is `Sync` if it is safe to move a `&T` across a thread boundary.
fr_fr: [`Sync`](https://doc.rust-lang.org/std/marker/trait.Sync.html) : un type `T` est `Sync` s’il est sûr de partager une référence `&T` entre plusieurs threads.

source: `Send` and `Sync` are [unsafe traits](../unsafe/unsafe-traits.md). The compiler will automatically derive them for your types as long as they only contain `Send` and `Sync` types. You can also implement them manually when you know it is valid.
fr_fr: `Send` et `Sync` sont des [traits `unsafe`](../unsafe/unsafe-traits.md). Le compilateur les dérive automatiquement pour vos types tant qu’ils ne contiennent que des types eux-mêmes `Send` et `Sync`. Vous pouvez aussi les implémenter manuellement si vous êtes certain qu’ils sont sûrs.

source: One can think of these traits as markers that the type has certain thread-safety properties.
fr_fr: On peut considérer ces traits comme des indicateurs de sécurité pour l’accès concurrent.

source: They can be used in the generic constraints as normal traits.
fr_fr: Ils peuvent être utilisés dans les contraintes génériques comme n’importe quel autre trait.

source: A type `T` is [`Send`](https://doc.rust-lang.org/std/marker/trait.Send.html) if it is safe to move a `T` value to another thread.
fr_fr: Un type `T` est [`Send`](https://doc.rust-lang.org/std/marker/trait.Send.html) s’il est sûr de déplacer une valeur `T` vers un autre thread.

source: The effect of moving ownership to another thread is that _destructors_ will run in that thread. So the question is when you can allocate a value in one thread and deallocate it in another.
fr_fr: Déplacer la possession d’un objet vers un autre thread implique que son _destructeur_ s’y exécutera. La vraie question est donc de savoir quand il est sûr d’allouer une valeur dans un thread et de la libérer dans un autre.

source: As an example, a connection to the SQLite library must only be accessed from a single thread.
fr_fr: Par exemple, une connexion à la bibliothèque SQLite ne doit être utilisée que depuis un seul thread.

source: A type `T` is [`Sync`](https://doc.rust-lang.org/std/marker/trait.Sync.html) if it is safe to access a `T` value from multiple threads at the same time.
fr_fr: Un type `T` est [`Sync`](https://doc.rust-lang.org/std/marker/trait.Sync.html) s’il est sûr d’accéder à une valeur `T` depuis plusieurs threads simultanément.

source: More precisely, the definition is:
fr_fr: Plus précisément, la définition est :

source: `T` is `Sync` if and only if `&T` is `Send`
fr_fr: `T` est `Sync` si et seulement si `&T` est `Send`

source: This statement is essentially a shorthand way of saying that if a type is thread-safe for shared use, it is also thread-safe to pass references of it across threads.
fr_fr: Autrement dit, si un type est sûr pour un usage partagé entre threads, alors il est aussi sûr d’en partager des références.

source: This is because if a type is Sync it means that it can be shared across multiple threads without the risk of data races or other synchronization issues, so it is safe to move it to another thread. A reference to the type is also safe to move to another thread, because the data it references can be accessed from any thread safely.
fr_fr: En effet, si un type est `Sync`, cela signifie qu’il peut être partagé entre plusieurs threads sans risque de conditions de course ni de problèmes de synchronisation. Une référence vers ce type peut donc aussi être déplacée en toute sécurité vers un autre thread, puisque les données référencées peuvent être accédées sans danger.

source: Most types you come across are `Send + Sync`:
fr_fr: La plupart des types que vous rencontrerez sont `Send + Sync` :

source: `Arc<T>`: Explicitly thread-safe via atomic reference count.
fr_fr: `Arc<T>` : Thread-safe explicite via un compteur de références atomique.

source: `Mutex<T>`: Explicitly thread-safe via internal locking.
fr_fr: `Mutex<T>` : Thread-safe explicite via un verrouillage interne.

source: `mpsc::Sender<T>`: As of 1.72.0.
fr_fr: `mpsc::Sender<T>` : depuis la version 1.72.0.

source: `AtomicBool`, `AtomicU8`, ...: Uses special atomic instructions.
fr_fr: `AtomicBool`, `AtomicU8`, ... : Utilise des instructions atomiques spécifiques.

source: The generic types are typically `Send + Sync` when the type parameters are `Send + Sync`.
fr_fr: Les types génériques sont généralement `Send + Sync` lorsque leurs paramètres de type le sont aussi.

source: These types can be moved to other threads, but they're not thread-safe. Typically because of interior mutability:
fr_fr: Ces types peuvent être déplacés vers d'autres threads, mais ils ne sont pas sûrs pour un accès concurrent. C’est souvent dû à de la mutabilité interne :

source: These types are thread-safe, but they cannot be moved to another thread:
fr_fr: Ces types sont sûrs pour un accès concurrent, mais ne peuvent pas être déplacés vers un autre thread :

source: `MutexGuard<T: Sync>`: Uses OS level primitives which must be deallocated on the thread which created them.
fr_fr: `MutexGuard<T: Sync>` : utilise des primitives système qui doivent être désallouées dans le thread qui les a créées.

source: These types are not thread-safe and cannot be moved to other threads:
fr_fr: Ces types ne sont pas sûrs pour un accès concurrent et ne peuvent pas être déplacés vers d'autres threads :

source: `Rc<T>`: each `Rc<T>` has a reference to an `RcBox<T>`, which contains a non-atomic reference count.
fr_fr: `Rc<T>` : chaque `Rc<T>` référence un `RcBox<T>`, qui contient un compteur de références non atomique.

source: `*const T`, `*mut T`: Rust assumes raw pointers may have special concurrency considerations.
fr_fr: `*const T`, `*mut T` : Rust suppose que les pointeurs bruts peuvent nécessiter des précautions particulières en contexte concurrent.

source: Rust uses the type system to enforce synchronization of shared data. This is primarily done via two types:
fr_fr: Rust utilise le système de types pour imposer la synchronisation des données partagées. Cela passe principalement par deux types :

source: [`Arc<T>`](https://doc.rust-lang.org/std/sync/struct.Arc.html), atomic reference counted `T`: handles sharing between threads and takes care to deallocate `T` when the last reference is dropped,
fr_fr: [`Arc<T>`](https://doc.rust-lang.org/std/sync/struct.Arc.html), compteur de références atomique pour `T` : permet le partage entre threads et désalloue `T` lorsque la dernière référence est supprimée,

source: [`Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html): ensures mutually exclusive access to the `T` value.
fr_fr: [`Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html) : garantit un accès exclusif à la valeur `T`.

source: [`Arc<T>`](https://doc.rust-lang.org/std/sync/struct.Arc.html) allows shared read-only access via `Arc::clone`:
fr_fr: [`Arc<T>`](https://doc.rust-lang.org/std/sync/struct.Arc.html) permet un accès partagé en lecture via `Arc::clone` :

source: `Arc` stands for "Atomic Reference Counted", a thread safe version of `Rc` that uses atomic operations.
fr_fr: `Arc` signifie « Atomic Reference Counted » (compteur de références atomique), c’est une version thread-safe de `Rc` utilisant des opérations atomiques.

source: `Arc<T>` implements `Clone` whether or not `T` does. It implements `Send` and `Sync` if and only if `T` implements them both.
fr_fr: `Arc<T>` implémente `Clone`, que `T` le fasse ou non. Il implémente `Send` et `Sync` si et seulement si `T` les implémente aussi tous les deux.

source: `Arc::clone()` has the cost of atomic operations that get executed, but after that the use of the `T` is free.
fr_fr: `Arc::clone()` entraîne le coût d'opérations atomiques, mais ensuite, l'utilisation de `T` ne coûte rien.

source: Beware of reference cycles, `Arc` does not use a garbage collector to detect them.
fr_fr: Attention aux cycles de références : `Arc` n'utilise pas de ramasse-miettes pour les détecter.

source: `std::sync::Weak` can help.
fr_fr: `std::sync::Weak` peut aider.

source: [`Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html) ensures mutual exclusion _and_ allows mutable access to `T` behind a read-only interface (another form of [interior mutability](../../borrowing/interior-mutability)):
fr_fr: [`Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html) garantit l'exclusion mutuelle _et_ permet un accès mutable à `T` à travers une interface en lecture seule (une autre forme de [mutabilité interne](../../borrowing/interior-mutability)) :

source: Notice how we have a [`impl<T: Send> Sync for Mutex<T>`](https://doc.rust-lang.org/std/sync/struct.Mutex.html#impl-Sync-for-Mutex%3CT%3E) blanket implementation.
fr_fr: Remarquez que nous avons une implémentation générale [`impl<T: Send> Sync for Mutex<T>`] (https://doc.rust-lang.org/std/sync/struct.Mutex.html#impl-Sync-for-Mutex%3CT%3E).

source: `Mutex` in Rust looks like a collection with just one element --- the protected data.
fr_fr: `Mutex` dans Rust ressemble à une collection contenant un seul élément : les données protégées.

source: It is not possible to forget to acquire the mutex before accessing the protected data.
fr_fr: Il est impossible d'accéder aux données protégées sans avoir acquis le mutex au préalable.

source: You can get an `&mut T` from an `&Mutex<T>` by taking the lock. The `MutexGuard` ensures that the `&mut T` doesn't outlive the lock being held.
fr_fr: Vous pouvez obtenir un `&mut T` à partir d'un `&Mutex<T>` en prenant le verrou. Le `MutexGuard` garantit que le `&mut T` ne dépasse pas la durée de vie du verrou.

source: `Mutex<T>` implements both `Send` and `Sync` iff (if and only if) `T` implements `Send`.
fr_fr: `Mutex<T>` implémente `Send` et `Sync` si et seulement si `T` implémente `Send`.

source: A read-write lock counterpart: `RwLock`.
fr_fr: Son équivalent en lecture/écriture : `RwLock`.

source: Why does `lock()` return a `Result`?
fr_fr: Pourquoi `lock()` retourne-t-il un `Result` ?

source: If the thread that held the `Mutex` panicked, the `Mutex` becomes "poisoned" to signal that the data it protected might be in an inconsistent state. Calling `lock()` on a poisoned mutex fails with a [`PoisonError`](https://doc.rust-lang.org/std/sync/struct.PoisonError.html). You can call `into_inner()` on the error to recover the data regardless.
fr_fr: Si le thread qui détenait le `Mutex` a paniqué, le `Mutex` devient « empoisonné » pour indiquer que les données qu’il protégeait pourraient être dans un état incohérent. Appeler `lock()` sur un mutex empoisonné échoue avec une [`PoisonError`](https://doc.rust-lang.org/std/sync/struct.PoisonError.html). Vous pouvez cependant appeler `into_inner()` sur l’erreur pour récupérer les données malgré tout.

source: Let us see `Arc` and `Mutex` in action:
fr_fr: Voyons `Arc` et `Mutex` en action :

source: Possible solution:
fr_fr: Solution possible :

source: Notable parts:
fr_fr: Éléments notables :

source: `v` is wrapped in both `Arc` and `Mutex`, because their concerns are orthogonal.
fr_fr: `v` est enveloppé à la fois dans un `Arc` et un `Mutex`, car leurs responsabilités sont orthogonales.

source: Wrapping a `Mutex` in an `Arc` is a common pattern to share mutable state between threads.
fr_fr: Emballer un `Mutex` dans un `Arc` est un schéma courant pour partager un état mutable entre threads.

source: `v: Arc<_>` needs to be cloned as `v2` before it can be moved into another thread. Note `move` was added to the lambda signature.
fr_fr: `v: Arc<_>` doit être cloné en `v2` avant de pouvoir être déplacé dans un autre thread. Notez que le mot-clé `move` a été ajouté à la signature de la fermeture.

source: Blocks are introduced to narrow the scope of the `LockGuard` as much as possible.
fr_fr: Des blocs sont introduits pour restreindre autant que possible la portée du `LockGuard`.

source: Let us practice our new concurrency skills with
fr_fr: Mettons en pratique nos nouvelles compétences en concurrence avec

source: Dining philosophers: a classic problem in concurrency.
fr_fr: Les philosophes dînant : un problème classique en concurrence.

source: Multi-threaded link checker: a larger project where you'll use Cargo to download dependencies and then check links in parallel.
fr_fr: Vérificateur de liens multithread : un projet plus ambitieux où vous utiliserez Cargo pour télécharger les dépendances puis vérifier les liens en parallèle.

source: The dining philosophers problem is a classic problem in concurrency:
fr_fr: Le problème des philosophes dînant est un classique en programmation concurrente :

source: Five philosophers dine together at the same table. Each philosopher has their own place at the table. There is a fork between each plate. The dish served is a kind of spaghetti which has to be eaten with two forks. Each philosopher can only alternately think and eat. Moreover, a philosopher can only eat their spaghetti when they have both a left and right fork. Thus two forks will only be available when their two nearest neighbors are thinking, not eating. After an individual philosopher finishes eating, they will put down both forks.
fr_fr: Cinq philosophes dînent ensemble à la même table. Chacun a sa propre place. Il y a une fourchette entre chaque assiette. Le plat servi est un type de spaghetti qui nécessite deux fourchettes. Chaque philosophe alterne entre penser et manger. Un philosophe ne peut manger que s’il possède les deux fourchettes à sa gauche et à sa droite. Les fourchettes ne sont donc disponibles que lorsque les deux voisins ne mangent pas. Après avoir mangé, un philosophe repose les deux fourchettes.

source: You will need a local [Cargo installation](../../cargo/running-locally.md) for this exercise. Copy the code below to a file called `src/main.rs`, fill out the blanks, and test that `cargo run` does not deadlock:
fr_fr: Vous aurez besoin d'une [installation locale de Cargo](../../cargo/running-locally.md) pour cet exercice. Copiez le code ci-dessous dans un fichier nommé `src/main.rs`, complétez les parties manquantes, et vérifiez que `cargo run` ne provoque pas de blocage (deadlock) :

source: "Eureka! {} has a new idea!"
fr_fr: "Eurêka ! {} a une nouvelle idée !"

source: // Pick up forks...
fr_fr: // Prendre les fourchettes...

source: "{} is eating..."
fr_fr: "{} est en train de manger..."

source: "Socrates"
fr_fr: "Socrate"

source: "Hypatia"
fr_fr: "Hypatie"

source: "Plato"
fr_fr: "Platon"

source: "Aristotle"
fr_fr: "Aristote"

source: "Pythagoras"
fr_fr: "Pythagore"

source: // Create forks
fr_fr: // Créer les fourchettes

source: // Create philosophers
fr_fr: // Créer les philosophes

source: // Make each of them think and eat 100 times
fr_fr: // Faire penser et manger chacun 100 fois

source: // Output their thoughts
fr_fr: // Afficher leurs pensées

source: You can use the following `Cargo.toml`:
fr_fr: Vous pouvez utiliser le fichier `Cargo.toml` suivant :

source: Let us use our new knowledge to create a multi-threaded link checker. It should start at a webpage and check that links on the page are valid. It should recursively check other pages on the same domain and keep doing this until all pages have been validated.
fr_fr: Utilisons nos nouvelles connaissances pour créer un vérificateur de liens multithread. Il doit commencer par une page web, vérifier que les liens sur la page sont valides, et explorer récursivement les autres pages du même domaine jusqu'à ce que toutes les pages soient vérifiées.

source: For this, you will need an HTTP client such as [`reqwest`](https://docs.rs/reqwest/). You will also need a way to find links, we can use [`scraper`](https://docs.rs/scraper/). Finally, we'll need some way of handling errors, we will use [`thiserror`](https://docs.rs/thiserror/).
fr_fr: Pour cela, vous aurez besoin d’un client HTTP tel que [`reqwest`](https://docs.rs/reqwest/). Vous aurez également besoin d’un moyen de trouver les liens — nous utiliserons [`scraper`](https://docs.rs/scraper/). Enfin, pour la gestion des erreurs, nous utiliserons [`thiserror`](https://docs.rs/thiserror/).

source: Create a new Cargo project and `reqwest` it as a dependency with:
fr_fr: Créez un nouveau projet Cargo et ajoutez `reqwest` comme dépendance avec :
