Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: `self`: takes ownership of the object and moves it away from the caller. The method becomes the owner of the object. The object will be dropped (deallocated) when the method returns, unless its ownership is explicitly transmitted. Complete ownership does not automatically mean mutability.
fr_fr: `self` : prend possession de l’objet et le déplace depuis l’appelant. La méthode devient propriétaire de l’objet. Celui-ci sera détruit à la fin de la méthode, sauf si sa propriété est transférée. Le fait de posséder un objet ne signifie pas qu’il est mutable.

source: `mut self`: same as above, but the method can mutate the object.
fr_fr: `mut self` : identique à `self`, mais l’objet peut être modifié par la méthode.

source: No receiver: this becomes a static method on the struct. Typically used to create constructors which are called `new` by convention.
fr_fr: Sans récepteur : cela devient une méthode statique sur la structure. Ce type de méthode est souvent utilisé pour créer des constructeurs nommés `new`, par convention.

source: It can be helpful to introduce methods by comparing them to functions.
fr_fr: Il peut être utile d’introduire les méthodes en les comparant aux fonctions.

source: Methods are called on an instance of a type (such as a struct or enum), the first parameter represents the instance as `self`.
fr_fr: Les méthodes sont appelées sur une instance d’un type (comme une `struct` ou une `enum`), et le premier paramètre représente cette instance sous le nom `self`.

source: Developers may choose to use methods to take advantage of method receiver syntax and to help keep them more organized. By using methods we can keep all the implementation code in one predictable place.
fr_fr: Les développeurs peuvent préférer utiliser des méthodes pour tirer parti de la syntaxe avec récepteur (`self`) et organiser leur code de manière plus structurée. Cela permet de centraliser l’implémentation dans un emplacement prévisible.

source: Point out the use of the keyword `self`, a method receiver.
fr_fr: Soulignez l’usage du mot-clé `self`, qui désigne le récepteur d’une méthode.

source: Show that it is an abbreviated term for `self: Self` and perhaps show how the struct name could also be used.
fr_fr: Montrez qu’il s’agit d’un raccourci pour `self: Self` et expliquez que le nom explicite de la structure pourrait aussi être utilisé.

source: Explain that `Self` is a type alias for the type the `impl` block is in and can be used elsewhere in the block.
fr_fr: Expliquez que `Self` est un alias pour le type auquel appartient le bloc `impl`, et qu’on peut l’utiliser ailleurs dans ce même bloc.

source: Note how `self` is used like other structs and dot notation can be used to refer to individual fields.
fr_fr: Notez que `self` s’utilise comme n’importe quelle structure, et que la notation pointée (`.`) permet d’accéder à ses champs.

source: This might be a good time to demonstrate how the `&self` differs from `self` by trying to run `finish` twice.
fr_fr: C’est peut-être le bon moment pour montrer la différence entre `&self` et `self` en tentant d’exécuter `finish` deux fois.

source: Beyond variants on `self`, there are also [special wrapper types](https://doc.rust-lang.org/reference/special-types-and-traits.html) allowed to be receiver types, such as `Box<Self>`.
fr_fr: Au-delà des variantes de `self`, certains [types enveloppe spéciaux](https://doc.rust-lang.org/reference/special-types-and-traits.html) peuvent également être utilisés comme récepteurs, comme `Box<Self>`.

source: Rust lets you abstract over types with traits. They're similar to interfaces:
fr_fr: Rust permet d'abstraire les types à l'aide de traits, similaires aux interfaces :

source: /// Return a sentence from this pet.
fr_fr: /// Retourne une phrase de cet animal.

source: /// Print a string to the terminal greeting this pet.
fr_fr: /// Affiche une salutation pour cet animal dans le terminal.

source: A trait defines a number of methods that types must have in order to implement the trait.
fr_fr: Un trait définit un ensemble de méthodes qu’un type doit posséder pour implémenter ce trait.

source: In the "Generics" segment, next, we will see how to build functionality that is generic over all types implementing a trait.
fr_fr: Dans la section « Génériques » suivante, nous verrons comment construire des fonctionnalités génériques sur tous les types implémentant un trait.

source: "Oh you're a cutie! What's your name? {}"
fr_fr: "Oh, tu es trop mignon ! Quel est ton nom ? {}"

source: "Woof, my name is {}!"
fr_fr: "Ouaf, je m’appelle {} !"

source: To implement `Trait` for `Type`, you use an `impl Trait for Type { .. }` block.
fr_fr: Pour implémenter un `Trait` pour un `Type`, on utilise un bloc `impl Trait for Type { .. }`.

source: Unlike Go interfaces, just having matching methods is not enough: a `Cat` type with a `talk()` method would not automatically satisfy `Pet` unless it is in an `impl Pet` block.
fr_fr: Contrairement aux interfaces en Go, il ne suffit pas d’avoir les bonnes méthodes : un type `Cat` avec une méthode `talk()` ne satisfera pas automatiquement le trait `Pet` sans bloc `impl Pet`.

source: Traits may provide default implementations of some methods. Default implementations can rely on all the methods of the trait. In this case, `greet` is provided, and relies on `talk`.
fr_fr: Les traits peuvent fournir des implémentations par défaut de certaines méthodes. Celles-ci peuvent s'appuyer sur toutes les autres méthodes du trait. Dans cet exemple, la méthode `greet` est fournie et s'appuie sur `talk`.

source: A trait can require that types implementing it also implement other traits, called _supertraits_. Here, any type implementing `Pet` must implement `Animal`.
fr_fr: Un trait peut exiger que les types qui l’implémentent implémentent aussi d’autres traits, appelés _supertraits_. Ici, tout type implémentant `Pet` doit aussi implémenter `Animal`.

source: "{} has {} legs"
fr_fr: "{} a {} pattes"

source: This is sometimes called "trait inheritance" but students should not expect this to behave like OO inheritance. It just specifies an additional requirement on implementations of a trait.
fr_fr: Cela est parfois appelé « héritage de traits », mais il ne faut pas s’attendre à un comportement similaire à l’héritage en POO. Cela exprime simplement une exigence supplémentaire pour l’implémentation du trait.

source: Associated types are placeholder types which are supplied by the trait implementation.
fr_fr: Les types associés sont des types génériques fournis par l’implémentation du trait.

source: Associated types are sometimes also called "output types". The key observation is that the implementer, not the caller, chooses this type.
fr_fr: Les types associés sont parfois appelés « types de sortie ». L’idée principale est que c’est l’implémentation, et non l’appelant, qui choisit ce type.

source: Many standard library traits have associated types, including arithmetic operators and `Iterator`.
fr_fr: De nombreux traits de la bibliothèque standard utilisent des types associés, notamment les opérateurs arithmétiques et le trait `Iterator`.

source: Supported traits can be automatically implemented for your custom types, as follows:
fr_fr: Certains traits peuvent être automatiquement dérivés pour vos types personnalisés, comme suit :

source: // Default trait adds `default` constructor.
fr_fr: // Le trait Default ajoute un constructeur `default`.

source: // Clone trait adds `clone` method.
fr_fr: // Le trait Clone ajoute la méthode `clone`.

source: // Debug trait adds support for printing with `{:?}`.
fr_fr: // Le trait Debug permet l’affichage via `{:?}`.

source: Derivation is implemented with macros, and many crates provide useful derive macros to add useful functionality. For example, `serde` can derive serialization support for a struct using `#[derive(Serialize)]`.
fr_fr: La dérivation est mise en œuvre via des macros, et de nombreux crates proposent des macros derive utiles. Par exemple, `serde` permet de dériver la sérialisation pour une structure avec `#[derive(Serialize)]`.

source: Exercise: Logger Trait
fr_fr: Exercice : Le trait Logger

source: Let's design a simple logging utility, using a trait `Logger` with a `log` method. Code which might log its progress can then take an `&impl Logger`. In testing, this might put messages in the test logfile, while in a production build it would send messages to a log server.
fr_fr: Concevons un utilitaire de journalisation simple, basé sur un trait `Logger` avec une méthode `log`. Le code pouvant journaliser sa progression pourra recevoir une référence vers un `impl Logger`. En test, cela peut écrire dans un fichier journal, tandis qu’en production cela enverra les messages à un serveur.

source: However, the `StderrLogger` given below logs all messages, regardless of verbosity. Your task is to write a `VerbosityFilter` type that will ignore messages above a maximum verbosity.
fr_fr: Cependant, le `StderrLogger` ci-dessous journalise tous les messages, quel que soit le niveau de verbosité. Votre tâche est d’écrire un type `VerbosityFilter` qui ignorera les messages dépassant une verbosité maximale.

source: This is a common pattern: a struct wrapping a trait implementation and implementing that same trait, adding behavior in the process. What other kinds of wrappers might be useful in a logging utility?
fr_fr: C’est un schéma fréquent : une structure encapsule une implémentation de trait et implémente ce même trait, en ajoutant un comportement. Quels autres types d’enveloppes pourraient être utiles dans un utilitaire de journalisation ?

source: /// Log a message at the given verbosity level.
fr_fr: /// Journalise un message avec le niveau de verbosité donné.

source: "verbosity={verbosity}: {message}"
fr_fr: "verbosité={verbosity} : {message}"

source: // TODO: Define and implement `VerbosityFilter`.
fr_fr: // TODO : définir et implémenter `VerbosityFilter`.

source: /// Only log messages up to the given verbosity level.
fr_fr: /// Ne journalise que les messages dont la verbosité est inférieure ou égale au niveau donné.

source: Rust supports generics, which lets you abstract algorithms or data structures (such as sorting or a binary tree) over the types used or stored.
fr_fr: Rust prend en charge les génériques, ce qui permet d'abstraire des algorithmes ou des structures de données (comme le tri ou les arbres binaires) indépendamment des types utilisés.

source: /// Pick `even` or `odd` depending on the value of `n`.
fr_fr: /// Choisit `even` ou `odd` en fonction de la valeur de `n`.

source: "picked a number: {:?}"
fr_fr: "nombre choisi : {:?}"

source: "picked a tuple: {:?}"
fr_fr: "tuple choisi : {:?}"

source: "dog"
fr_fr: "chien"

source: "cat"
fr_fr: "chat"

source: Rust infers a type for T based on the types of the arguments and return value.
fr_fr: Rust déduit le type de `T` à partir des types des arguments et de la valeur de retour.

source: This is similar to C++ templates, but Rust partially compiles the generic function immediately, so that function must be valid for all types matching the constraints. For example, try modifying `pick` to return `even + odd` if `n == 0`. Even if only the `pick` instantiation with integers is used, Rust still considers it invalid. C++ would let you do this.
fr_fr: Cela ressemble aux templates C++, mais Rust compile partiellement la fonction générique immédiatement, de sorte qu’elle doit être valide pour tous les types respectant les contraintes. Par exemple, essayez de modifier `pick` pour qu’elle retourne `even + odd` si `n == 0`. Même si seule l’instanciation avec des entiers est utilisée, Rust considérera cela comme invalide. C++ l’autoriserait.

source: Generic code is turned into non-generic code based on the call sites. This is a zero-cost abstraction: you get exactly the same result as if you had hand-coded the data structures without the abstraction.
fr_fr: Le code générique est transformé en code non générique en fonction des appels. Il s'agit d'une abstraction sans surcoût : le résultat est identique à celui d'un code écrit à la main sans utilisation de génériques.

source: You can use generics to abstract over the concrete field type:
fr_fr: On peut utiliser des génériques pour abstraire le type concret des champs :

source: "{integer:?} and {float:?}"
fr_fr: "{integer:?} et {float:?}"

source: "coords: {:?}"
fr_fr: "coordonnées : {:?}"

source: _Q:_ Why `T` is specified twice in `impl<T> Point<T> {}`? Isn't that redundant?
fr_fr: _Q :_ Pourquoi `T` est-il spécifié deux fois dans `impl<T> Point<T> {}` ? N’est-ce pas redondant ?

source: This is because it is a generic implementation section for generic type. They are independently generic.
fr_fr: C'est parce qu'il s'agit d'une implémentation générique pour un type lui-même générique. Les deux doivent être spécifiés séparément.

source: It means these methods are defined for any `T`.
fr_fr: Cela signifie que ces méthodes sont définies pour tout type `T`.

source: It is possible to write `impl Point<u32> { .. }`.
fr_fr: Il est possible d’écrire `impl Point<u32> { .. }`.

source: `Point` is still generic and you can use `Point<f64>`, but methods in this block will only be available for `Point<u32>`.
fr_fr: `Point` reste un type générique, et vous pouvez l’utiliser avec `Point<f64>`, mais les méthodes de ce bloc ne seront disponibles que pour `Point<u32>`.

source: Try declaring a new variable `let p = Point { x: 5, y: 10.0 };`. Update the code to allow points that have elements of different types, by using two type variables, e.g., `T` and `U`.
fr_fr: Essayez de déclarer une nouvelle variable `let p = Point { x: 5, y: 10.0 };`. Modifiez le code pour permettre que les points aient des éléments de types différents, en utilisant deux variables de type, par exemple `T` et `U`.

source: Traits can also be generic, just like types and functions. A trait's parameters get concrete types when it is used.
fr_fr: Les traits peuvent aussi être génériques, tout comme les types et les fonctions. Les paramètres d’un trait prennent des types concrets lors de son utilisation.

source: "Converted from integer: {from}"
fr_fr: "Converti depuis un entier : {from}"

source: "Converted from bool: {from}"
fr_fr: "Converti depuis un booléen : {from}"

source: The `From` trait will be covered later in the course, but its [definition in the `std` docs](https://doc.rust-lang.org/std/convert/trait.From.html) is simple.
fr_fr: Le trait `From` sera abordé plus tard dans le cours, mais sa [définition dans la documentation standard](https://doc.rust-lang.org/std/convert/trait.From.html) est simple.

source: Implementations of the trait do not need to cover all possible type parameters. Here, `Foo::From("hello")` would not compile because there is no `From<&str>` implementation for `Foo`.
fr_fr: Les implémentations du trait n’ont pas besoin de couvrir tous les types possibles. Ici, `Foo::From("hello")` ne compilera pas car `Foo` ne possède pas d’implémentation de `From<&str>`.

source: Generic traits take types as "input", while associated types are a kind of "output type. A trait can have multiple implementations for different input types.
fr_fr: Les traits génériques reçoivent des types en « entrée », tandis que les types associés sont un genre de « type de sortie ». Un trait peut avoir plusieurs implémentations pour différents types d’entrée.

source: In fact, Rust requires that at most one implementation of a trait match for any type T. Unlike some other languages, Rust has no heuristic for choosing the "most specific" match. There is work on adding this support, called [specialization](https://rust-lang.github.io/rfcs/1210-impl-specialization.html).
fr_fr: En fait, Rust exige qu’au plus une seule implémentation d’un trait corresponde pour un type donné `T`. Contrairement à d’autres langages, Rust ne dispose pas d’une heuristique pour choisir la correspondance « la plus spécifique ». Un travail est en cours pour ajouter ce support, appelé [spécialisation](https://rust-lang.github.io/rfcs/1210-impl-specialization.html).

source: When working with generics, you often want to require the types to implement some trait, so that you can call this trait's methods.
fr_fr: Lorsque vous utilisez des types génériques, vous souhaitez souvent qu’ils implémentent un certain trait, afin de pouvoir appeler ses méthodes.

source: You can do this with `T: Trait` or `impl Trait`:
fr_fr: On peut faire cela avec `T: Trait` ou `impl Trait` :

source: Try making a `NonClonable` and passing it to `duplicate`.
fr_fr: Essayez de créer un `NonClonable` et de le passer à `duplicate`.

source: When multiple traits are necessary, use `+` to join them.
fr_fr: Quand plusieurs traits sont nécessaires, utilisez `+` pour les combiner.

source: Show a `where` clause, students will encounter it when reading code.
fr_fr: Présentez la clause `where`, car les étudiants la rencontreront fréquemment dans le code.

source: It declutters the function signature if you have many parameters.
fr_fr: Elle permet d’alléger la signature de la fonction lorsqu’elle comporte de nombreux paramètres.

source: It has additional features making it more powerful.
fr_fr: Elle offre aussi des fonctionnalités supplémentaires, ce qui la rend plus puissante.

source: If someone asks, the extra feature is that the type on the left of ":" can be arbitrary, like `Option<T>`.
fr_fr: Si la question est posée : cette syntaxe permet de spécifier n’importe quel type à gauche de `:` — comme `Option<T>` par exemple.

source: Note that Rust does not (yet) support specialization. For example, given the original `duplicate`, it is invalid to add a specialized `duplicate(a: u32)`.
fr_fr: Notez que Rust ne prend pas (encore) en charge la spécialisation. Par exemple, si on définit `duplicate` de manière générique, on ne peut pas ajouter une version spécialisée `duplicate(a: u32)`.

source: Similar to trait bounds, an `impl Trait` syntax can be used in function arguments and return values:
fr_fr: Comme pour les bornes de traits, la syntaxe `impl Trait` peut être utilisée dans les arguments et les valeurs de retour des fonctions :

source: // Syntactic sugar for: // fn add_42_millions<T: Into<i32>>(x: T) -> i32 {
fr_fr: // Sucre syntaxique pour : // fn add_42_millions<T: Into<i32>>(x: T) -> i32 {

source: "debuggable: {debuggable:?}"
fr_fr: "déboguable : {debuggable:?}"

source: `impl Trait` allows you to work with types which you cannot name. The meaning of `impl Trait` is a bit different in the different positions.
fr_fr: `impl Trait` permet de manipuler des types que l’on ne peut pas nommer explicitement. Sa signification varie légèrement selon sa position dans le code.

source: For a parameter, `impl Trait` is like an anonymous generic parameter with a trait bound.
fr_fr: Dans un paramètre, `impl Trait` équivaut à un paramètre générique anonyme contraint par un trait.

source: For a return type, it means that the return type is some concrete type that implements the trait, without naming the type. This can be useful when you don't want to expose the concrete type in a public API.
fr_fr: Dans un type de retour, cela signifie que la fonction renvoie un type concret implémentant le trait, sans en révéler le nom. C’est utile lorsqu’on ne souhaite pas exposer le type exact dans une API publique.

source: Inference is hard in return position. A function returning `impl Foo` picks the concrete type it returns, without writing it out in the source. A function returning a generic type like `collect<B>() -> B` can return any type satisfying `B`, and the caller may need to choose one, such as with `let x: Vec<_> = foo.collect()` or with the turbofish, `foo.collect::<Vec<_>>()`.
fr_fr: L'inférence est plus difficile en position de retour. Une fonction qui renvoie `impl Foo` choisit elle-même le type concret retourné, sans le spécifier dans le code source. En revanche, une fonction qui renvoie un type générique comme `collect<B>() -> B` peut retourner n'importe quel type qui satisfait `B`, et c'est à l'appelant de le préciser, par exemple avec `let x: Vec<_> = foo.collect()` ou bien avec la syntaxe turbofish : `foo.collect::<Vec<_>>()`.

source: What is the type of `debuggable`? Try `let debuggable: () = ..` to see what the error message shows.
fr_fr: Quel est le type de `debuggable` ? Essayez `let debuggable: () = ..` pour voir le message d’erreur affiché.

source: In this short exercise, you will implement a generic `min` function that determines the minimum of two values, using the [`Ord`](https://doc.rust-lang.org/stable/std/cmp/trait.Ord.html) trait.
fr_fr: Dans cet exercice court, vous implémenterez une fonction générique `min` qui détermine le minimum entre deux valeurs, en utilisant le trait [`Ord`](https://doc.rust-lang.org/stable/std/cmp/trait.Ord.html).

source: // TODO: implement the `min` function used in `main`.
fr_fr: // TODO : implémenter la fonction `min` utilisée dans `main`.

source: "goodbye"
fr_fr: "au revoir"

source: "bat"
fr_fr: "chauve-souris"

source: "armadillo"
fr_fr: "tatou"

source: Show students the [`Ord`](https://doc.rust-lang.org/stable/std/cmp/trait.Ord.html) trait and [`Ordering`](https://doc.rust-lang.org/stable/std/cmp/enum.Ordering.html) enum.
fr_fr: Présentez aux étudiants le trait [`Ord`](https://doc.rust-lang.org/stable/std/cmp/trait.Ord.html) ainsi que l'énumération [`Ordering`](https://doc.rust-lang.org/stable/std/cmp/enum.Ordering.html).

source: For each of the slides in this section, spend some time reviewing the documentation pages, highlighting some of the more common methods.
fr_fr: Pour chaque diapositive de cette section, prenez le temps de consulter la documentation, en mettant en avant les méthodes les plus courantes.

source: Rust comes with a standard library which helps establish a set of common types used by Rust libraries and programs. This way, two libraries can work together smoothly because they both use the same `String` type.
fr_fr: Rust est livré avec une bibliothèque standard qui définit un ensemble de types communs utilisés par les bibliothèques et les programmes Rust. Cela permet à deux bibliothèques de fonctionner ensemble sans accroc, car elles utilisent toutes deux le même type `String`.

source: In fact, Rust contains several layers of the Standard Library: `core`, `alloc` and `std`.
fr_fr: En réalité, la bibliothèque standard de Rust se compose de plusieurs couches : `core`, `alloc` et `std`.

source: `core` includes the most basic types and functions that don't depend on `libc`, allocator or even the presence of an operating system.
fr_fr: `core` contient les types et fonctions les plus fondamentaux, qui ne dépendent ni de `libc`, ni d’un allocateur, ni même de la présence d’un système d’exploitation.

source: `alloc` includes types which require a global heap allocator, such as `Vec`, `Box` and `Arc`.
fr_fr: `alloc` comprend les types qui nécessitent un allocateur global, tels que `Vec`, `Box` ou `Arc`.

source: Embedded Rust applications often only use `core`, and sometimes `alloc`.
fr_fr: Les applications embarquées en Rust utilisent souvent uniquement `core`, et parfois `alloc`.

source: Rust comes with extensive documentation. For example:
fr_fr: Rust est livré avec une documentation très complète. Par exemple :

source: All of the details about [loops](https://doc.rust-lang.org/stable/reference/expressions/loop-expr.html).
fr_fr: Tous les détails concernant les [boucles](https://doc.rust-lang.org/stable/reference/expressions/loop-expr.html).

source: Primitive types like [`u8`](https://doc.rust-lang.org/stable/std/primitive.u8.html).
fr_fr: Les types primitifs comme [`u8`](https://doc.rust-lang.org/stable/std/primitive.u8.html).
