Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: Patches should be kept in `third_party/rust/chromium_crates_io/patches/<crate>` - see for example the [patches against the `cxx` crate](https://source.chromium.org/chromium/chromium/src/+/main:third_party/rust/chromium_crates_io/patches/cxx/) - and will be applied automatically by `gnrt` each time it upgrades the crate.
fr_fr: Les correctifs doivent être placés dans `third_party/rust/chromium_crates_io/patches/<crate>` — voir par exemple les [patchs appliqués à la crate `cxx`](https://source.chromium.org/chromium/chromium/src/+/main:third_party/rust/chromium_crates_io/patches/cxx/) — et seront automatiquement appliqués par `gnrt` à chaque mise à jour de la crate.

source: Once you've added a third-party crate and generated build rules, depending on a crate is simple. Find your `rust_static_library` target, and add a `dep` on the `:lib` target within your crate.
fr_fr: Une fois que vous avez ajouté une crate tierce et généré les règles de build, l’utiliser devient simple. Il vous suffit d’ajouter une dépendance `dep` vers le `:lib` de la crate concernée dans votre cible `rust_static_library`.

source: Specifically,
fr_fr: Concrètement,

source: ```bob +------------+ +----------------------+ "//third_party/rust" | crate name | "/v" | major semver version | ":lib" +------------+ +----------------------+ ```
fr_fr: ```bob +----------------+ +--------------------------+ "//third_party/rust" | nom du crate | "/v" | version majeure semver | ":lib" +----------------+ +--------------------------+ ```

source: Auditing Third Party Crates
fr_fr: Audit des Crates Tierces

source: Adding new libraries is subject to Chromium's standard [policies](https://chromium.googlesource.com/chromium/src/+/refs/heads/main/docs/rust.md#Third_party-review), but of course also subject to security review. As you may be bringing in not just a single crate but also transitive dependencies, there may be a lot of code to review. On the other hand, safe Rust code can have limited negative side effects. How should you review it?
fr_fr: L’ajout de nouvelles bibliothèques est soumis aux [politiques standard de Chromium](https://chromium.googlesource.com/chromium/src/+/refs/heads/main/docs/rust.md#Third_party-review), ainsi qu’à un examen de sécurité. Comme vous n’ajoutez pas toujours qu’une seule crate, mais parfois aussi ses dépendances transitives, cela peut représenter beaucoup de code à examiner. Toutefois, le code Rust sûr présente généralement peu d’effets de bord. Comment procéder à l’audit ?

source: Over time Chromium aims to move to a process based around [cargo vet](https://mozilla.github.io/cargo-vet/).
fr_fr: À terme, Chromium vise à adopter un processus basé sur [cargo vet](https://mozilla.github.io/cargo-vet/).

source: Meanwhile, for each new crate addition, we are checking for the following:
fr_fr: En attendant, chaque ajout de crate fait l’objet des vérifications suivantes :

source: Understand why each crate is used. What's the relationship between crates? If the build system for each crate contains a `build.rs` or procedural macros, work out what they're for. Are they compatible with the way Chromium is normally built?
fr_fr: Comprendre pourquoi chaque crate est utilisée. Quelle est la relation entre les crates ? Si le système de build d’une crate inclut un `build.rs` ou des macros procédurales, identifier leur usage. Sont-elles compatibles avec le système de compilation de Chromium ?

source: Check each crate seems to be reasonably well maintained
fr_fr: Vérifier que chaque crate semble être raisonnablement maintenue

source: Use `cd third-party/rust/chromium_crates_io; cargo audit` to check for known vulnerabilities (first you'll need to `cargo install cargo-audit`, which ironically involves downloading lots of dependencies from the internet[2](../cargo.md))
fr_fr: Utiliser `cd third-party/rust/chromium_crates_io; cargo audit` pour vérifier la présence de vulnérabilités connues (vous devrez d’abord installer `cargo-audit`, ce qui, ironie du sort, télécharge de nombreuses dépendances depuis Internet[2](../cargo.md))

source: Ensure any `unsafe` code is good enough for the [Rule of Two](https://chromium.googlesource.com/chromium/src/+/main/docs/security/rule-of-2.md#unsafe-code-in-safe-languages)
fr_fr: S’assurer que tout code `unsafe` respecte la [règle des deux](https://chromium.googlesource.com/chromium/src/+/main/docs/security/rule-of-2.md#unsafe-code-in-safe-languages)

source: Check for any use of `fs` or `net` APIs
fr_fr: Vérifier l’usage éventuel des API `fs` ou `net`

source: Read all the code at a sufficient level to look for anything out of place that might have been maliciously inserted. (You can't realistically aim for 100% perfection here: there's often just too much code.)
fr_fr: Lire tout le code à un niveau suffisant pour détecter toute anomalie potentiellement malveillante. (Il est irréaliste de viser la perfection à 100 %, car il y a souvent trop de code.)

source: These are just guidelines --- work with reviewers from `security@chromium.org` to work out the right way to become confident of the crate.
fr_fr: Ce ne sont que des lignes directrices — collaborez avec les réviseurs de `security@chromium.org` pour déterminer la meilleure façon d'évaluer la fiabilité de la crate.

source: Checking Crates into Chromium Source Code
fr_fr: Ajouter des crates au code source de Chromium

source: `git status` should reveal:
fr_fr: `git status` devrait révéler :

source: Crate code in `//third_party/rust/chromium_crates_io`
fr_fr: Le code de la crate dans `//third_party/rust/chromium_crates_io`

source: Metadata (`BUILD.gn` and `README.chromium`) in `//third_party/rust/<crate>/<version>`
fr_fr: Les métadonnées (`BUILD.gn` et `README.chromium`) dans `//third_party/rust/<crate>/<version>`

source: Please also add an `OWNERS` file in the latter location.
fr_fr: Veuillez également ajouter un fichier `OWNERS` à cet emplacement.

source: You should land all this, along with your `Cargo.toml` and `gnrt_config.toml` changes, into the Chromium repo.
fr_fr: Vous devez intégrer tout cela dans le dépôt Chromium, y compris les modifications apportées à `Cargo.toml` et `gnrt_config.toml`.

source: **Important**: you need to use `git add -f` because otherwise `.gitignore` files may result in some files being skipped.
fr_fr: **Important** : utilisez `git add -f` car certains fichiers peuvent être ignorés à cause des fichiers `.gitignore`.

source: As you do so, you might find presubmit checks fail because of non-inclusive language. This is because Rust crate data tends to include names of git branches, and many projects still use non-inclusive terminology there. So you may need to run:
fr_fr: Lors de la soumission, certains contrôles peuvent échouer en raison d’un langage non inclusif. Cela vient du fait que les données des crates Rust incluent parfois des noms de branches git contenant des termes obsolètes. Vous devrez peut-être exécuter :

source: As the OWNER of any third party Chromium dependency, you are [expected to keep it up to date with any security fixes](https://chromium.googlesource.com/chromium/src/+/main/docs/adding_to_third_party.md#add-owners). It is hoped that we will soon automate this for Rust crates, but for now, it's still your responsibility just as it is for any other third party dependency.
fr_fr: En tant que propriétaire d'une dépendance tierce dans Chromium, vous êtes [responsable de son suivi et de son actualisation en matière de sécurité](https://chromium.googlesource.com/chromium/src/+/main/docs/adding_to_third_party.md#add-owners). On espère automatiser cela prochainement pour les crates Rust, mais pour l’instant, cette responsabilité vous incombe, comme pour toute autre dépendance externe.

source: Add [uwuify](https://crates.io/crates/uwuify) to Chromium, turning off the crate's [default features](https://doc.rust-lang.org/cargo/reference/features.html#the-default-feature). Assume that the crate will be used in shipping Chromium, but won't be used to handle untrustworthy input.
fr_fr: Ajoutez [uwuify](https://crates.io/crates/uwuify) à Chromium, en désactivant ses [fonctionnalités par défaut](https://doc.rust-lang.org/cargo/reference/features.html#the-default-feature). Supposons que cette crate soit utilisée dans la version distribuée de Chromium, mais qu’elle ne traite pas d’entrée non fiable.

source: (In the next exercise we'll use uwuify from Chromium, but feel free to skip ahead and do that now if you like. Or, you could create a new [`rust_executable` target](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/rust_executable.gni) which uses `uwuify`).
fr_fr: (Dans l’exercice suivant, nous utiliserons `uwuify` depuis Chromium, mais vous pouvez déjà le faire maintenant si vous préférez. Vous pouvez aussi créer une nouvelle cible [`rust_executable`](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/rust_executable.gni) qui utilise `uwuify`.)

source: Students will need to download lots of transitive dependencies.
fr_fr: Les étudiants devront télécharger de nombreuses dépendances transitives.

source: The total crates needed are:
fr_fr: Les crates nécessaires sont :

source: `smallvec`, and
fr_fr: `smallvec`, et

source: If students are downloading even more than that, they probably forgot to turn off the default features.
fr_fr: Si les étudiants téléchargent plus de crates que cela, ils ont probablement oublié de désactiver les fonctionnalités par défaut.

source: Thanks to [Daniel Liu](https://github.com/Daniel-Liu-c0deb0t) for this crate!
fr_fr: Merci à [Daniel Liu](https://github.com/Daniel-Liu-c0deb0t) pour cette crate !

source: Bringing It Together --- Exercise
fr_fr: Tout rassembler — exercice final

source: In this exercise, you're going to add a whole new Chromium feature, bringing together everything you already learned.
fr_fr: Dans cet exercice, vous allez ajouter une nouvelle fonctionnalité à Chromium, en mobilisant tout ce que vous avez appris jusqu’ici.

source: The Brief from Product Management
fr_fr: Le brief de l’équipe produit

source: A community of pixies has been discovered living in a remote rainforest. It's important that we get Chromium for Pixies delivered to them as soon as possible.
fr_fr: Une communauté de lutins a été découverte dans une forêt tropicale reculée. Il est impératif de leur livrer une version spéciale de Chromium dès que possible.

source: The requirement is to translate all Chromium's UI strings into Pixie language.
fr_fr: Il faut traduire toutes les chaînes de l’interface utilisateur de Chromium dans la langue des lutins.

source: There's not time to wait for proper translations, but fortunately pixie language is very close to English, and it turns out there's a Rust crate which does the translation.
fr_fr: Nous n’avons pas le temps d’attendre des traductions professionnelles, mais heureusement, la langue des lutins est très proche de l’anglais — et une crate Rust permet d’effectuer cette conversion.

source: In fact, you already [imported that crate in the previous exercise](https://crates.io/crates/uwuify).
fr_fr: En fait, vous avez déjà [importé cette crate dans l’exercice précédent](https://crates.io/crates/uwuify).

source: (Obviously, real translations of Chrome require incredible care and diligence. Don't ship this!)
fr_fr: (Évidemment, les traductions réelles de Chrome demandent énormément de rigueur. Ne publiez pas ce prototype !)

source: Steps
fr_fr: Étapes

source: Modify `ResourceBundle::MaybeMangleLocalizedString` so that it uwuifies all strings before display. In this special build of Chromium, it should always do this irrespective of the setting of `mangle_localized_strings_`.
fr_fr: Modifiez `ResourceBundle::MaybeMangleLocalizedString` pour qu’il applique l’effet uwuify à toutes les chaînes avant affichage. Dans cette version spéciale de Chromium, cela doit être fait systématiquement, quel que soit l’état de `mangle_localized_strings_`.

source: If you've done everything right across all these exercises, congratulations, you should have created Chrome for pixies!
fr_fr: Si vous avez bien suivi tous les exercices, félicitations, vous avez créé Chrome pour les lutins !

source: UTF16 vs UTF8. Students should be aware that Rust strings are always UTF8, and will probably decide that it's better to do the conversion on the C++ side using `base::UTF16ToUTF8` and back again.
fr_fr: UTF16 vs UTF8. Les étudiants doivent savoir que les chaînes de caractères en Rust sont toujours en UTF8, et concluront probablement qu’il est préférable d’effectuer la conversion côté C++ à l’aide de `base::UTF16ToUTF8`, puis de revenir à UTF16 si nécessaire.

source: If students decide to do the conversion on the Rust side, they'll need to consider [`String::from_utf16`](https://doc.rust-lang.org/std/string/struct.String.html#method.from_utf16), consider error handling, and consider which [CXX supported types can transfer a lot of u16s](https://cxx.rs/binding/slice.html).
fr_fr: Si les étudiants choisissent de faire la conversion côté Rust, ils devront utiliser [`String::from_utf16`](https://doc.rust-lang.org/std/string/struct.String.html#method.from_utf16), gérer les erreurs, et réfléchir aux [types compatibles avec CXX permettant de transférer de nombreux `u16`](https://cxx.rs/binding/slice.html).

source: Students may design the C++/Rust boundary in several different ways, e.g. taking and returning strings by value, or taking a mutable reference to a string. If a mutable reference is used, CXX will likely tell the student that they need to use [`Pin`](https://doc.rust-lang.org/std/pin/). You may need to explain what `Pin` does, and then explain why CXX needs it for mutable references to C++ data: the answer is that C++ data can't be moved around like Rust data, because it may contain self-referential pointers.
fr_fr: Les étudiants peuvent concevoir la frontière entre C++ et Rust de différentes manières, par exemple en prenant et retournant des chaînes par valeur, ou en passant une référence mutable. Si une référence mutable est utilisée, CXX exigera probablement l’usage de [`Pin`](https://doc.rust-lang.org/std/pin/). Il peut être utile d’expliquer ce que fait `Pin`, et pourquoi CXX en a besoin dans ce contexte : les objets C++ ne peuvent pas être déplacés comme en Rust, car ils peuvent contenir des pointeurs autoréférencés.

source: The C++ target containing `ResourceBundle::MaybeMangleLocalizedString` will need to depend on a `rust_static_library` target. The student probably already did this.
fr_fr: La cible C++ contenant `ResourceBundle::MaybeMangleLocalizedString` devra dépendre d’une cible `rust_static_library`. L’étudiant a probablement déjà effectué cette étape.

source: The `rust_static_library` target will need to depend on `//third_party/rust/uwuify/v0_2:lib`.
fr_fr: La cible `rust_static_library` devra dépendre de `//third_party/rust/uwuify/v0_2:lib`.

source: Solutions to the Chromium exercises can be found in [this series of CLs](https://chromium-review.googlesource.com/c/chromium/src/+/5096560).
fr_fr: Les solutions aux exercices Chromium sont disponibles dans [cette série de CLs](https://chromium-review.googlesource.com/c/chromium/src/+/5096560).

source: Welcome to Bare Metal Rust
fr_fr: Bienvenue dans Rust pour systèmes embarqués

source: This is a standalone one-day course about bare-metal Rust, aimed at people who are familiar with the basics of Rust (perhaps from completing the Comprehensive Rust course), and ideally also have some experience with bare-metal programming in some other language such as C.
fr_fr: Il s'agit d'un cours autonome d'une journée sur la bare-metal Rust, destiné aux personnes familiarisées avec le bases de Rust (peut-être après avoir terminé le cours Comprehensive Rust(le guide complet de Rust)), et idéalement aussi avoir quelques expérience de la programmation bare-metal dans un autre langage tel que C.

source: Today we will talk about 'bare-metal' Rust: running Rust code without an OS underneath us. This will be divided into several parts:
fr_fr: Aujourd’hui, nous allons parler de Rust « bare-metal » : exécuter du code Rust sans système d’exploitation sous-jacent. Cela sera divisé en plusieurs parties :

source: What is `no_std` Rust?
fr_fr: Qu’est-ce que Rust `no_std` ?

source: Writing firmware for microcontrollers.
fr_fr: Écriture de firmware pour microcontrôleurs.

source: Writing bootloader / kernel code for application processors.
fr_fr: Écriture de bootloaders ou de code noyau pour des processeurs applicatifs.

source: Some useful crates for bare-metal Rust development.
fr_fr: Quelques crates utiles pour le développement en Rust bare-metal.

source: For the microcontroller part of the course we will use the [BBC micro:bit](https://microbit.org/) v2 as an example. It's a [development board](https://tech.microbit.org/hardware/) based on the Nordic nRF51822 microcontroller with some LEDs and buttons, an I2C-connected accelerometer and compass, and an on-board SWD debugger.
fr_fr: Pour la partie microcontrôleur du cours, nous utiliserons le [BBC micro:bit](https://microbit.org/) v2 comme exemple. Il s’agit d’une [carte de développement](https://tech.microbit.org/hardware/) basée sur un microcontrôleur Nordic nRF51822, avec quelques LED et boutons, un accéléromètre et une boussole connectés via I2C, ainsi qu’un débogueur SWD intégré.

source: To get started, install some tools we'll need later. On gLinux or Debian:
fr_fr: Pour commencer, installez quelques outils dont nous aurons besoin plus tard. Sous gLinux ou Debian :

source: And give users in the `plugdev` group access to the micro:bit programmer:
fr_fr: Et donnez aux utilisateurs du groupe `plugdev` l’accès au programmateur du micro:bit :

source: On MacOS:
fr_fr: Sur macOS :

source: `NonNull` and all the usual pointer-related functions
fr_fr: `NonNull` et toutes les fonctions habituelles liées aux pointeurs

source: `Future` and `async`/`await`
fr_fr: `Future` et `async`/`await`

source: `File` and the rest of `fs`
fr_fr: `File` et le reste du module `fs`

source: `println!`, `Read`, `Write`, `Stdin`, `Stdout` and the rest of `io`
fr_fr: `println!`, `Read`, `Write`, `Stdin`, `Stdout` et le reste du module `io`

source: `spawn`, `sleep` and the rest of `thread`
fr_fr: `spawn`, `sleep` et le reste du module `thread`

source: `HashMap` depends on RNG.
fr_fr: `HashMap` dépend d’un générateur de nombres aléatoires (RNG).

source: `std` re-exports the contents of both `core` and `alloc`.
fr_fr: `std` réexporte le contenu des modules `core` et `alloc`.

source: A minimal `no_std` program
fr_fr: Un programme `no_std` minimal

source: This will compile to an empty binary.
fr_fr: Cela compilera un binaire vide.

source: `std` provides a panic handler; without it we must provide our own.
fr_fr: `std` fournit un gestionnaire de panic ; sans lui, nous devons en fournir un nous-mêmes.

source: It can also be provided by another crate, such as `panic-halt`.
fr_fr: Il peut également être fourni par une autre crate, comme `panic-halt`.

source: Depending on the target, you may need to compile with `panic = "abort"` to avoid an error about `eh_personality`.
fr_fr: Selon la cible, vous devrez peut-être compiler avec `panic = "abort"` pour éviter une erreur liée à `eh_personality`.

source: Note that there is no `main` or any other entry point; it's up to you to define your own entry point. This will typically involve a linker script and some assembly code to set things up ready for Rust code to run.
fr_fr: Notez qu’il n’y a pas de `main` ni de point d’entrée défini ; c’est à vous de définir votre propre point d’entrée. Cela implique généralement un script d’édition de liens et du code assembleur pour préparer l’exécution du code Rust.

source: To use `alloc` you must implement a [global (heap) allocator](https://doc.rust-lang.org/stable/std/alloc/trait.GlobalAlloc.html).
fr_fr: Pour utiliser `alloc`, vous devez implémenter un [allocateur global (tas)](https://doc.rust-lang.org/stable/std/alloc/trait.GlobalAlloc.html).

source: // Safe because `HEAP` is only used here and `entry` is only called once.
fr_fr: // Sûr car `HEAP` est utilisé uniquement ici et `entry` n’est appelé qu’une seule fois.

source: // Give the allocator some memory to allocate.
fr_fr: // Donne de la mémoire à l’allocateur.

source: // Now we can do things that require heap allocation.
fr_fr: // Nous pouvons maintenant effectuer des opérations nécessitant une allocation sur le tas.

source: "A string"
fr_fr: "Une chaîne"

source: `buddy_system_allocator` is a third-party crate implementing a basic buddy system allocator. Other crates are available, or you can write your own or hook into your existing allocator.
fr_fr: `buddy_system_allocator` est une crate tierce implémentant un allocateur basé sur le système buddy. D’autres crates existent, ou vous pouvez écrire la vôtre ou vous brancher à votre allocateur existant.

source: The const parameter of `LockedHeap` is the max order of the allocator; i.e. in this case it can allocate regions of up to 2\*\*32 bytes.
fr_fr: Le paramètre `const` de `LockedHeap` définit l’ordre maximal de l’allocateur ; ici, il peut allouer des régions allant jusqu’à 2\*\*32 octets.

source: If any crate in your dependency tree depends on `alloc` then you must have exactly one global allocator defined in your binary. Usually this is done in the top-level binary crate.
fr_fr: Si une crate dans votre graphe de dépendances dépend de `alloc`, alors un et un seul allocateur global doit être défini dans votre binaire. En général, cela se fait dans la crate binaire de plus haut niveau.

source: `extern crate panic_halt as _` is necessary to ensure that the `panic_halt` crate is linked in so we get its panic handler.
fr_fr: `extern crate panic_halt as _` est nécessaire pour s’assurer que la crate `panic_halt` est bien liée, afin que son gestionnaire de panic soit utilisé.

source: This example will build but not run, as it doesn't have an entry point.
fr_fr: Cet exemple se compilera, mais ne s’exécutera pas car il ne contient pas de point d’entrée.

source: The `cortex_m_rt` crate provides (among other things) a reset handler for Cortex M microcontrollers.
fr_fr: Le crate `cortex_m_rt` fournit (entre autres) un gestionnaire de réinitialisation pour les microcontrôleurs Cortex-M.

source: Next we'll look at how to access peripherals, with increasing levels of abstraction.
fr_fr: Nous allons maintenant voir comment accéder aux périphériques, avec des niveaux d’abstraction croissants.

source: The `cortex_m_rt::entry` macro requires that the function have type `fn() -> !`, because returning to the reset handler doesn't make sense.
fr_fr: La macro `cortex_m_rt::entry` exige que la fonction soit du type `fn() -> !`, car il n’est pas logique de retourner au gestionnaire de réinitialisation.

source: Run the example with `cargo embed --bin minimal`
fr_fr: Exécutez l'exemple avec `cargo embed --bin minimal`

source: Most microcontrollers access peripherals via memory-mapped IO. Let's try turning on an LED on our micro:bit:
fr_fr: La plupart des microcontrôleurs accèdent aux périphériques via des entrées/sorties mappées en mémoire (MMIO). Essayons d’allumer une LED sur notre micro:bit :

source: /// GPIO port 0 peripheral address
fr_fr: /// Adresse du périphérique GPIO port 0

source: // GPIO peripheral offsets
fr_fr: // Offsets des registres du périphérique GPIO

source: // PIN_CNF fields
fr_fr: // Champs de configuration des broches (PIN_CNF)

source: // Configure GPIO 0 pins 21 and 28 as push-pull outputs.
fr_fr: // Configure les broches 21 et 28 du GPIO 0 en sorties push-pull.

source: // Safe because the pointers are to valid peripheral control registers, and // no aliases exist.
fr_fr: // Sûr car les pointeurs ciblent des registres de contrôle valides, // et il n’existe aucune aliasation.
