Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: `PngReader` and `ResultOfPngReader` are Rust types --- objects of these types cannot cross the FFI boundary without indirection of a `Box<T>`. We can't have an `out_parameter: &mut PngReader`, because CXX doesn't allow C++ to store Rust objects by value.
fr_fr: `PngReader` et `ResultOfPngReader` sont des types Rust — ces objets ne peuvent pas franchir la frontière FFI sans passer par une indirection via `Box<T>`. On ne peut pas avoir de `out_parameter: &mut PngReader`, car CXX n’autorise pas C++ à stocker des objets Rust par valeur.

source: This example illustrates that even though CXX doesn't support arbitrary generics nor templates, we can still pass them across the FFI boundary by manually specializing / monomorphizing them into a non-generic type. In the example `ResultOfPngReader` is a non-generic type that forwards into appropriate methods of `Result<T, E>` (e.g. into `is_err`, `unwrap`, and/or `as_mut`).
fr_fr: Cet exemple montre que même si CXX ne prend pas en charge les génériques ou les templates arbitraires, on peut tout de même les passer via la frontière FFI en les spécialisant ou en les monomorphisant manuellement en un type non générique. Dans cet exemple, `ResultOfPngReader` est un type non générique qui redirige vers les méthodes appropriées de `Result<T, E>` (comme `is_err`, `unwrap`, et/ou `as_mut`).

source: Using cxx in Chromium
fr_fr: Utilisation de cxx dans Chromium

source: In Chromium, we define an independent `#[cxx::bridge] mod` for each leaf-node where we want to use Rust. You'd typically have one for each `rust_static_library`. Just add
fr_fr: Dans Chromium, on définit un `#[cxx::bridge] mod` indépendant pour chaque nœud terminal où l’on souhaite utiliser Rust. En général, il y en a un par `rust_static_library`. Il suffit d’ajouter

source: to your existing `rust_static_library` target alongside `crate_root` and `sources`.
fr_fr: à votre cible `rust_static_library` existante, en plus de `crate_root` et `sources`.

source: C++ headers will be generated at a sensible location, so you can just
fr_fr: Les en-têtes C++ seront générés à un emplacement approprié, vous pouvez donc simplement

source: You will find some utility functions in `//base` to convert to/from Chromium C++ types to CXX Rust types --- for example [`SpanToRustSlice`](https://source.chromium.org/chromium/chromium/src/+/main:base/containers/span_rust.h;l=21).
fr_fr: Vous trouverez des fonctions utilitaires dans `//base` pour convertir les types C++ de Chromium vers/depuis les types Rust de CXX — par exemple [`SpanToRustSlice`](https://source.chromium.org/chromium/chromium/src/+/main:base/containers/span_rust.h;l=21).

source: Students may ask --- why do we still need `allow_unsafe = true`?
fr_fr: Les étudiants peuvent demander — pourquoi avons-nous encore besoin de `allow_unsafe = true` ?

source: The broad answer is that no C/C++ code is "safe" by the normal Rust standards. Calling back and forth to C/C++ from Rust may do arbitrary things to memory, and compromise the safety of Rust's own data layouts. Presence of _too many_ `unsafe` keywords in C/C++ interop can harm the signal-to-noise ratio of such a keyword, and is [controversial](https://steveklabnik.com/writing/the-cxx-debate), but strictly, bringing any foreign code into a Rust binary can cause unexpected behavior from Rust's perspective.
fr_fr: La réponse générale est qu’aucun code C/C++ n’est « sûr » selon les standards de Rust. Les appels entre Rust et C/C++ peuvent entraîner des modifications arbitraires de la mémoire et compromettre la sécurité des structures de données Rust. La présence de _trop_ de mots-clés `unsafe` dans l’interopérabilité C/C++ peut nuire à leur pertinence, et cela reste [controversé](https://steveklabnik.com/writing/the-cxx-debate), mais dans les faits, intégrer du code étranger dans un binaire Rust peut causer un comportement inattendu.

source: The narrow answer lies in the diagram at the top of [this page](../interoperability-with-cpp.md) --- behind the scenes, CXX generates Rust `unsafe` and `extern "C"` functions just like we did manually in the previous section.
fr_fr: La réponse technique se trouve dans le schéma en haut de [cette page](../interoperability-with-cpp.md) — en coulisses, CXX génère des fonctions Rust `unsafe` et `extern "C"` tout comme nous l’avons fait manuellement précédemment.

source: Exercise: Interoperability with C++
fr_fr: Exercice : interopérabilité avec C++

source: Part one
fr_fr: Première partie

source: In the Rust file you previously created, add a `#[cxx::bridge]` which specifies a single function, to be called from C++, called `hello_from_rust`, taking no parameters and returning no value.
fr_fr: Dans le fichier Rust que vous avez créé précédemment, ajoutez un `#[cxx::bridge]` spécifiant une seule fonction, appelée depuis le C++, nommée `hello_from_rust`, sans paramètre et ne renvoyant rien.

source: Modify your previous `hello_from_rust` function to remove `extern "C"` and `#[no_mangle]`. This is now just a standard Rust function.
fr_fr: Modifiez votre fonction `hello_from_rust` précédente pour retirer `extern "C"` et `#[no_mangle]`. Il s’agit désormais d’une fonction Rust standard.

source: Modify your `gn` target to build these bindings.
fr_fr: Modifiez votre cible `gn` pour compiler ces liaisons.

source: In your C++ code, remove the forward-declaration of `hello_from_rust`. Instead, include the generated header file.
fr_fr: Dans votre code C++, supprimez la déclaration anticipée de `hello_from_rust`. Incluez à la place le fichier d’en-tête généré.

source: Build and run!
fr_fr: Compilez et exécutez !

source: Part two
fr_fr: Deuxième partie

source: It's a good idea to play with CXX a little. It helps you think about how flexible Rust in Chromium actually is.
fr_fr: C’est une bonne idée d’expérimenter un peu avec CXX. Cela permet de mieux comprendre la flexibilité de Rust dans Chromium.

source: Some things to try:
fr_fr: Quelques idées à essayer :

source: Call back into C++ from Rust. You will need:
fr_fr: Faites un appel depuis Rust vers du C++. Vous aurez besoin de :

source: An additional header file which you can `include!` from your `cxx::bridge`. You'll need to declare your C++ function in that new header file.
fr_fr: Un fichier d’en-tête supplémentaire que vous pourrez `include!` depuis votre `cxx::bridge`. Il faut y déclarer votre fonction C++.

source: An `unsafe` block to call such a function, or alternatively specify the `unsafe` keyword in your `#[cxx::bridge]` [as described here](https://cxx.rs/extern-c++.html#functions-and-member-functions).
fr_fr: Un bloc `unsafe` pour appeler cette fonction, ou bien ajouter le mot-clé `unsafe` dans votre `#[cxx::bridge]` [comme décrit ici](https://cxx.rs/extern-c++.html#functions-and-member-functions).

source: You may also need to `#include "third_party/rust/cxx/v1/crate/include/cxx.h"`
fr_fr: Vous devrez peut-être aussi ajouter `#include "third_party/rust/cxx/v1/crate/include/cxx.h"`

source: Pass a C++ string from C++ into Rust.
fr_fr: Passez une chaîne C++ depuis le C++ vers Rust.

source: Pass a reference to a C++ object into Rust.
fr_fr: Passez une référence vers un objet C++ vers Rust.

source: Intentionally get the Rust function signatures mismatched from the `#[cxx::bridge]`, and get used to the errors you see.
fr_fr: Faites volontairement une erreur dans la signature d’une fonction Rust vis-à-vis du `#[cxx::bridge]`, et habituez-vous aux messages d’erreur générés.

source: Intentionally get the C++ function signatures mismatched from the `#[cxx::bridge]`, and get used to the errors you see.
fr_fr: Faites volontairement une erreur dans la signature d’une fonction C++ vis-à-vis du `#[cxx::bridge]`, et habituez-vous aux erreurs obtenues.

source: Pass a `std::unique_ptr` of some type from C++ into Rust, so that Rust can own some C++ object.
fr_fr: Passez un `std::unique_ptr` de n’importe quel type depuis le C++ vers Rust, afin que Rust puisse posséder un objet C++.

source: Create a Rust object and pass it into C++, so that C++ owns it. (Hint: you need a `Box`).
fr_fr: Créez un objet Rust et passez-le vers le C++, pour qu’il en devienne propriétaire. (Astuce : utilisez un `Box`).

source: Declare some methods on a C++ type. Call them from Rust.
fr_fr: Déclarez quelques méthodes sur un type C++. Appelez-les depuis Rust.

source: Declare some methods on a Rust type. Call them from C++.
fr_fr: Déclarez quelques méthodes sur un type Rust. Appelez-les depuis le C++.

source: Part three
fr_fr: Troisième partie

source: Now you understand the strengths and limitations of CXX interop, think of a couple of use-cases for Rust in Chromium where the interface would be sufficiently simple. Sketch how you might define that interface.
fr_fr: Maintenant que vous comprenez les forces et limites de l’interopérabilité via CXX, imaginez quelques cas d’usage de Rust dans Chromium où l’interface serait suffisamment simple. Esquissez comment vous pourriez définir cette interface.

source: The [`cxx` binding reference](https://cxx.rs/bindings.html)
fr_fr: La [référence des liaisons `cxx`](https://cxx.rs/bindings.html)

source: The [`rust_static_library` gn template](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/rust_static_library.gni;l=16)
fr_fr: Le [template `rust_static_library` de gn](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/rust_static_library.gni;l=16)

source: Some of the questions you may encounter:
fr_fr: Voici quelques questions que vous pourriez rencontrer :

source: I'm seeing a problem initializing a variable of type X with type Y, where X and Y are both function types. This is because your C++ function doesn't quite match the declaration in your `cxx::bridge`.
fr_fr: J’ai un problème d’initialisation d’une variable de type X avec un type Y, alors que X et Y sont tous deux des types de fonction. Cela vient du fait que la fonction C++ ne correspond pas exactement à la déclaration dans votre `cxx::bridge`.

source: I seem to be able to freely convert C++ references into Rust references. Doesn't that risk UB? For CXX's _opaque_ types, no, because they are zero-sized. For CXX trivial types yes, it's _possible_ to cause UB, although CXX's design makes it quite difficult to craft such an example.
fr_fr: Il semble possible de convertir librement des références C++ en références Rust. N’y a-t-il pas un risque de comportement indéfini (UB) ? Pour les types _opaques_ de CXX, non, car ils sont de taille nulle. Pour les types triviaux, oui, il est _possible_ de provoquer un UB, même si la conception de CXX rend cela assez difficile à produire en pratique.

source: Rust libraries are called "crates" and are found at [crates.io](https://crates.io). It's _very easy_ for Rust crates to depend upon one another. So they do!
fr_fr: Les bibliothèques Rust sont appelées « crates » et se trouvent sur [crates.io](https://crates.io). Il est _très facile_ pour les crates de dépendre les unes des autres. Et elles le font souvent !

source: Property
fr_fr: Propriété

source: C++ library
fr_fr: Bibliothèque C++

source: Rust crate
fr_fr: Crate Rust

source: Build system
fr_fr: Système de compilation

source: Lots
fr_fr: Beaucoup

source: Consistent: `Cargo.toml`
fr_fr: Cohérent : `Cargo.toml`

source: Typical library size
fr_fr: Taille typique des bibliothèques

source: Large-ish
fr_fr: Plutôt grande

source: Small
fr_fr: Petite

source: Transitive dependencies
fr_fr: Dépendances transitives

source: Few
fr_fr: Peu

source: For a Chromium engineer, this has pros and cons:
fr_fr: Pour un·e ingénieur·e Chromium, cela présente des avantages et des inconvénients :

source: All crates use a common build system so we can automate their inclusion into Chromium...
fr_fr: Toutes les crates utilisent un système de compilation commun, ce qui permet d’automatiser leur inclusion dans Chromium...

source: ... but, crates typically have transitive dependencies, so you will likely have to bring in multiple libraries.
fr_fr: ... mais les crates ont souvent des dépendances transitives, donc vous devrez probablement importer plusieurs bibliothèques.

source: We'll discuss:
fr_fr: Nous allons aborder :

source: How to put a crate in the Chromium source code tree
fr_fr: Comment ajouter une crate dans l’arborescence du code source de Chromium

source: How to make `gn` build rules for it
fr_fr: Comment écrire des règles `gn` pour cette crate

source: How to audit its source code for sufficient safety.
fr_fr: Comment auditer son code source pour garantir un niveau de sécurité suffisant.

source: Configuring the `Cargo.toml` file to add crates
fr_fr: Configurer le fichier `Cargo.toml` pour ajouter des crates

source: Chromium has a single set of centrally-managed direct crate dependencies. These are managed through a single [`Cargo.toml`](https://source.chromium.org/chromium/chromium/src/+/main:third_party/rust/chromium_crates_io/Cargo.toml):
fr_fr: Chromium possède un ensemble centralisé de dépendances directes vers des crates, géré via un unique fichier [`Cargo.toml`](https://source.chromium.org/chromium/chromium/src/+/main:third_party/rust/chromium_crates_io/Cargo.toml) :

source: As with any other `Cargo.toml`, you can specify [more details about the dependencies](https://doc.rust-lang.org/cargo/reference/specifying-dependencies.html) --- most commonly, you'll want to specify the `features` that you wish to enable in the crate.
fr_fr: Comme pour n’importe quel autre fichier `Cargo.toml`, vous pouvez préciser [davantage de détails sur les dépendances](https://doc.rust-lang.org/cargo/reference/specifying-dependencies.html) — en particulier, vous souhaiterez souvent indiquer les `features` à activer dans la crate.

source: When adding a crate to Chromium, you'll often need to provide some extra information in an additional file, `gnrt_config.toml`, which we'll meet next.
fr_fr: Lors de l’ajout d’une crate à Chromium, vous devrez souvent fournir des informations supplémentaires dans un autre fichier, `gnrt_config.toml`, que nous allons découvrir ensuite.

source: Alongside `Cargo.toml` is [`gnrt_config.toml`](https://source.chromium.org/chromium/chromium/src/+/main:third_party/rust/chromium_crates_io/gnrt_config.toml). This contains Chromium-specific extensions to crate handling.
fr_fr: À côté de `Cargo.toml` se trouve [`gnrt_config.toml`](https://source.chromium.org/chromium/chromium/src/+/main:third_party/rust/chromium_crates_io/gnrt_config.toml). Ce fichier contient des extensions spécifiques à Chromium pour la gestion des crates.

source: If you add a new crate, you should specify at least the `group`. This is one of:
fr_fr: Si vous ajoutez une nouvelle crate, vous devez au minimum spécifier le champ `group`. Celui-ci peut être l’un des suivants :

source: For instance,
fr_fr: Par exemple,

source: Depending on the crate source code layout, you may also need to use this file to specify where its `LICENSE` file(s) can be found.
fr_fr: Selon l’organisation du code source de la crate, vous devrez peut-être également indiquer dans ce fichier où se trouvent les fichiers `LICENSE`.

source: Later, we'll see some other things you will need to configure in this file to resolve problems.
fr_fr: Nous verrons plus tard d’autres éléments que vous devrez configurer dans ce fichier pour résoudre certains problèmes.

source: A tool called `gnrt` knows how to download crates and how to generate `BUILD.gn` rules.
fr_fr: Un outil nommé `gnrt` permet de télécharger les crates et de générer les règles `BUILD.gn` associées.

source: To start, download the crate you want like this:
fr_fr: Pour commencer, téléchargez la crate souhaitée avec la commande suivante :

source: Although the `gnrt` tool is part of the Chromium source code, by running this command you will be downloading and running its dependencies from `crates.io`. See [the earlier section](../cargo.md) discussing this security decision.
fr_fr: Bien que l’outil `gnrt` fasse partie du code source de Chromium, l’exécution de cette commande entraîne le téléchargement et l’exécution de ses dépendances depuis `crates.io`. Voir [la section précédente](../cargo.md) pour en savoir plus sur cette décision de sécurité.

source: This `vendor` command may download:
fr_fr: Cette commande `vendor` peut télécharger :

source: Your crate
fr_fr: Votre crate

source: Direct and transitive dependencies
fr_fr: Des dépendances directes et transitives

source: New versions of other crates, as required by `cargo` to resolve the complete set of crates required by Chromium.
fr_fr: De nouvelles versions d’autres crates, si cela est nécessaire à `cargo` pour résoudre l’ensemble complet des dépendances requises par Chromium.

source: Chromium maintains patches for some crates, kept in `//third_party/rust/chromium_crates_io/patches`. These will be reapplied automatically, but if patching fails you may need to take manual action.
fr_fr: Chromium maintient des correctifs pour certaines crates, stockés dans `//third_party/rust/chromium_crates_io/patches`. Ces correctifs sont appliqués automatiquement, mais en cas d’échec, une intervention manuelle peut être nécessaire.

source: Once you've downloaded the crate, generate the `BUILD.gn` files like this:
fr_fr: Une fois la crate téléchargée, générez les fichiers `BUILD.gn` à l’aide de la commande suivante :

source: Now run `git status`. You should find:
fr_fr: Lancez maintenant `git status`. Vous devriez observer :

source: At least one new crate source code in `third_party/rust/chromium_crates_io/vendor`
fr_fr: Au moins un nouveau répertoire de code source de crate dans `third_party/rust/chromium_crates_io/vendor`

source: At least one new `BUILD.gn` in `third_party/rust/<crate name>/v<major semver version>`
fr_fr: Au moins un nouveau fichier `BUILD.gn` dans `third_party/rust/<nom de la crate>/v<version majeure>`

source: An appropriate `README.chromium`
fr_fr: Un fichier `README.chromium` adapté

source: The "major semver version" is a [Rust "semver" version number](https://doc.rust-lang.org/cargo/reference/semver.html).
fr_fr: La « version majeure semver » correspond à une [version semver de Rust](https://doc.rust-lang.org/cargo/reference/semver.html).

source: Take a close look, especially at the things generated in `third_party/rust`.
fr_fr: Examinez attentivement le contenu généré dans `third_party/rust`.

source: Talk a little about semver --- and specifically the way that in Chromium it's to allow multiple incompatible versions of a crate, which is discouraged but sometimes necessary in the Cargo ecosystem.
fr_fr: Dites un mot sur le versionnement sémantique (semver) — et plus précisément sur la manière dont Chromium autorise plusieurs versions incompatibles d’une même crate, ce qui est déconseillé mais parfois inévitable dans l’écosystème Cargo.

source: If your build fails, it may be because of a `build.rs`: programs which do arbitrary things at build time. This is fundamentally at odds with the design of `gn` and `ninja` which aim for static, deterministic, build rules to maximize parallelism and repeatability of builds.
fr_fr: Si votre compilation échoue, cela peut être dû à un fichier `build.rs` : des programmes qui exécutent des actions arbitraires au moment de la compilation. Cela va à l’encontre de la philosophie de `gn` et `ninja`, qui reposent sur des règles statiques et déterministes afin de maximiser le parallélisme et la reproductibilité des builds.

source: Some `build.rs` actions are automatically supported; others require action:
fr_fr: Certaines actions de `build.rs` sont prises en charge automatiquement ; d'autres nécessitent une intervention :

source: build script effect
fr_fr: effet du script de compilation

source: Supported by our gn templates
fr_fr: Pris en charge par nos templates `gn`

source: Work required by you
fr_fr: Travail requis de votre part

source: Checking rustc version to configure features on and off
fr_fr: Vérification de la version de `rustc` pour activer ou désactiver certaines fonctionnalités

source: Yes
fr_fr: Oui

source: None
fr_fr: Aucune

source: Checking platform or CPU to configure features on and off
fr_fr: Vérification de la plateforme ou du CPU pour activer ou désactiver des fonctionnalités

source: Generating code
fr_fr: Génération de code

source: Yes - specify in `gnrt_config.toml`
fr_fr: Oui – à spécifier dans `gnrt_config.toml`

source: Building C/C++
fr_fr: Compilation de code C/C++

source: No
fr_fr: Non

source: Patch around it
fr_fr: Contourner le problème avec un patch

source: Arbitrary other actions
fr_fr: Autres actions arbitraires

source: Fortunately, most crates don't contain a build script, and fortunately, most build scripts only do the top two actions.
fr_fr: Heureusement, la plupart des crates n'ont pas de script de compilation, et la majorité de ceux qui en ont ne font que les deux premières actions mentionnées.

source: If `ninja` complains about missing files, check the `build.rs` to see if it writes source code files.
fr_fr: Si `ninja` signale des fichiers manquants, vérifiez si le fichier `build.rs` génère des fichiers source.

source: If so, modify [`gnrt_config.toml`](../configuring-gnrt-config-toml.md) to add `build-script-outputs` to the crate. If this is a transitive dependency, that is, one on which Chromium code should not directly depend, also add `allow-first-party-usage=false`. There are several examples already in that file:
fr_fr: Le cas échéant, modifiez [`gnrt_config.toml`](../configuring-gnrt-config-toml.md) pour ajouter `build-script-outputs` à la crate concernée. Si c’est une dépendance transitive (c’est-à-dire que le code de Chromium ne doit pas l’utiliser directement), ajoutez également `allow-first-party-usage=false`. Il existe plusieurs exemples dans ce fichier :

source: Now rerun [`gnrt.py -- gen`](../generating-gn-build-rules.md) to regenerate `BUILD.gn` files to inform ninja that this particular output file is input to subsequent build steps.
fr_fr: Relancez ensuite [`gnrt.py -- gen`](../generating-gn-build-rules.md) pour régénérer les fichiers `BUILD.gn`, afin d’indiquer à `ninja` que ce fichier de sortie est requis pour les étapes suivantes du build.

source: Some crates use the [`cc`](https://crates.io/crates/cc) crate to build and link C/C++ libraries. Other crates parse C/C++ using [`bindgen`](https://crates.io/crates/bindgen) within their build scripts. These actions can't be supported in a Chromium context --- our gn, ninja and LLVM build system is very specific in expressing relationships between build actions.
fr_fr: Certaines crates utilisent la crate [`cc`](https://crates.io/crates/cc) pour compiler et lier des bibliothèques C/C++. D'autres utilisent [`bindgen`](https://crates.io/crates/bindgen) dans leur `build.rs` pour générer des liaisons à partir de code C/C++. Ces actions ne sont pas compatibles avec l’environnement de build de Chromium — `gn`, `ninja` et LLVM reposent sur une modélisation explicite et déterministe des dépendances entre étapes de compilation.

source: So, your options are:
fr_fr: Vous avez donc les options suivantes :

source: Avoid these crates
fr_fr: Éviter ces crates

source: Apply a patch to the crate.
fr_fr: Appliquer un patch à la crate.
