Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: Welcome to Comprehensive Rust 🦀
fr_fr: Bienvenue à Comprehensive Rust (le guide complet de Rust) 🦀

source: Running the Course
fr_fr: Comment présenter le cours

source: Course Structure
fr_fr: Structure du cours

source: Keyboard Shortcuts
fr_fr: Raccourcis clavier

source: Translations
fr_fr: Traductions

source: Using Cargo
fr_fr: Utiliser Cargo

source: Rust Ecosystem
fr_fr: Écosystème de Rust

source: Code Samples
fr_fr: Exemples de code

source: Running Cargo Locally
fr_fr: Exécuter Cargo localement

source: Day 1: Morning
fr_fr: Jour 1 : Matin

source: Welcome
fr_fr: Bienvenue

source: What is Rust?
fr_fr: Qu'est-ce que Rust ?

source: Benefits of Rust
fr_fr: Bénéfices de Rust

source: Playground
fr_fr: Aire de jeu

source: Types and Values
fr_fr: Types et Valeurs

source: Values
fr_fr: Valeurs

source: Arithmetic
fr_fr: Arithmétique

source: Type Inference
fr_fr: Inférence de type

source: Exercise: Fibonacci
fr_fr: Exercice : Fibonacci

source: Control Flow Basics
fr_fr: Bases du contrôle de flux

source: `if` Expressions
fr_fr: Expressions `if`

source: Loops
fr_fr: Boucles

source: `break` and `continue`
fr_fr: `break` et `continue`

source: Labels
fr_fr: Etiquettes

source: Blocks and Scopes
fr_fr: Blocs et portée

source: Scopes and Shadowing
fr_fr: Portée et masquage

source: Functions
fr_fr: Fonctions

source: Exercise: Collatz Sequence
fr_fr: Exercice : Suite de Collatz

source: Day 1: Afternoon
fr_fr: Jour 1 : Après-midi

source: Tuples and Arrays
fr_fr: Tuples et Tableaux

source: Arrays
fr_fr: Tableaux

source: Array Iteration
fr_fr: Parcours de tableaux

source: Patterns and Destructuring
fr_fr: Motifs et Déstructuration

source: Exercise: Nested Arrays
fr_fr: Exercice : Tableaux imbriqués

source: References
fr_fr: Références

source: Shared References
fr_fr: Références partagées

source: Exclusive References
fr_fr: Références exclusives

source: Slices: `&[T]`
fr_fr: Tranches : `&[T]`

source: Strings
fr_fr: Chaînes de caractères

source: Exercise: Geometry
fr_fr: Exercice : Géométrie

source: User-Defined Types
fr_fr: Types définis par l'utilisateur

source: Named Structs
fr_fr: Structs nommées

source: Tuple Structs
fr_fr: Structures tuple

source: Enums
fr_fr: Énumérations

source: Type Aliases
fr_fr: Alias de types

source: Exercise: Elevator Events
fr_fr: Exercice : Événements d'ascenseur

source: Day 2: Morning
fr_fr: Jour 2 : Matin

source: Pattern Matching
fr_fr: Filtrage par motif

source: Matching Values
fr_fr: Correspondance de valeurs

source: Destructuring
fr_fr: Déstructuration

source: Let Control Flow
fr_fr: Contrôle de Flux avec `let`

source: Exercise: Expression Evaluation
fr_fr: Exercice : Evaluation d'expressions

source: Methods and Traits
fr_fr: Méthodes et traits

source: Methods
fr_fr: Méthodes

source: Implementing Traits
fr_fr: Implémentation de traits

source: Associated Types
fr_fr: Types associés

source: Deriving
fr_fr: Dérivation

source: Exercise: Generic Logger
fr_fr: Exercice : journaliseur générique

source: Generics
fr_fr: Génériques

source: Generic Functions
fr_fr: Fonctions génériques

source: Generic Data Types
fr_fr: Types de données génériques

source: Generic Traits
fr_fr: Traits génériques

source: Trait Bounds
fr_fr: Contraintes de traits

source: Exercise: Generic `min`
fr_fr: Exercice : `min` générique

source: Day 2: Afternoon
fr_fr: Jour 2 : Après-midi

source: Standard Library Types
fr_fr: Types de la bibliothèque standard

source: Standard Library
fr_fr: Bibliothèque standard

source: Exercise: Counter
fr_fr: Exercice : compteur

source: Standard Library Traits
fr_fr: Traits de la bibliothèque strandard

source: Comparisons
fr_fr: Comparaisons

source: Operators
fr_fr: Opérateurs

source: `From` and `Into`
fr_fr: `From` et `Into`

source: Casting
fr_fr: Conversion de types

source: `Read` and `Write`
fr_fr: `Read` et `Write`

source: `Default`, struct update syntax
fr_fr: `Default`, syntaxe de mise à jour de struct

source: Closures
fr_fr: Fermetures

source: Exercise: ROT13
fr_fr: Exercice : ROT13

source: Day 3: Morning
fr_fr: Jour 3 : Matin

source: Memory Management
fr_fr: Gestion de la mémoire

source: Review of Program Memory
fr_fr: Rappel sur la mémoire d'un programme

source: Approaches to Memory Management
fr_fr: Approches de gestion de la mémoire

source: Ownership
fr_fr: Propriété

source: Move Semantics
fr_fr: Sémantique de déplacement

source: Copy Types
fr_fr: Types copiables

source: Exercise: Builder Type
fr_fr: Exercice : type builder

source: Smart Pointers
fr_fr: Pointeurs intelligents

source: Trait Objects
fr_fr: Objets traits

source: Exercise: Binary Tree
fr_fr: Exercice : Arbre binaire

source: Day 3: Afternoon
fr_fr: Jour 3 : Après-midi

source: Borrowing
fr_fr: Emprunts

source: Borrowing a Value
fr_fr: Emprunter une valeur

source: Borrow Checking
fr_fr: Vérification des emprunts

source: Interior Mutability
fr_fr: Mutabilité intérieure

source: Exercise: Health Statistics
fr_fr: Exercice : Statistiques de santé

source: Lifetimes
fr_fr: Durées de vie

source: Lifetime Annotations
fr_fr: Annotations de durée de vie

source: Lifetime Elision
fr_fr: Élimination des durées de vie

source: Struct Lifetimes
fr_fr: Durées de vie dans les structures

source: Exercise: Protobuf Parsing
fr_fr: Exercice : analyse de protobuf

source: Day 4: Morning
fr_fr: Jour 4 : Matin

source: Iterators
fr_fr: Itérateurs

source: Exercise: Iterator Method Chaining
fr_fr: Exercice : enchaînement de méthodes d’itérateur

source: Filesystem Hierarchy
fr_fr: Hiérarchie du système de fichiers

source: Visibility
fr_fr: Visibilité

source: Exercise: Modules for a GUI Library
fr_fr: Exercice : modules pour une bibliothèque d’interface graphique

source: Testing
fr_fr: Tests

source: Test Modules
fr_fr: Modules de test

source: Other Types of Tests
fr_fr: Autres types de tests

source: Compiler Lints and Clippy
fr_fr: Avertissements du compilateur et Clippy

source: Exercise: Luhn Algorithm
fr_fr: Exercice : algorithme de Luhn

source: Day 4: Afternoon
fr_fr: Jour 4 : Après-midi

source: Error Handling
fr_fr: Gestion des erreurs

source: Panics
fr_fr: Paniques

source: Try Operator
fr_fr: Opérateur `try`

source: Try Conversions
fr_fr: Conversions avec `try`

source: `Error` Trait
fr_fr: Trait `Error`

source: `thiserror` and `anyhow`
fr_fr: `thiserror` et `anyhow`

source: Exercise: Rewriting with `Result`
fr_fr: Exercice : réécriture avec `Result`

source: Unsafe Rust
fr_fr: Rust non sécurisé (_unsafe_)

source: Unsafe
fr_fr: Non sécurisé

source: Dereferencing Raw Pointers
fr_fr: Déréférencement des pointeurs bruts

source: Mutable Static Variables
fr_fr: Variables statiques mutables

source: Unsafe Functions
fr_fr: Fonctions non sécurisées

source: Unsafe Traits
fr_fr: Traits non sécurisés

source: Exercise: FFI Wrapper
fr_fr: Exercice : enveloppe FFI

source: Setup
fr_fr: Configuration

source: Build Rules
fr_fr: Règles de compilation

source: Binary
fr_fr: Binaire

source: Library
fr_fr: Bibliothèque

source: Birthday Service Tutorial
fr_fr: Tutoriel : service d’anniversaire

source: Service API
fr_fr: API du service

source: Server
fr_fr: Serveur

source: Deploy
fr_fr: Déployer

source: Changing API
fr_fr: Modification de l’API

source: Updating Implementations
fr_fr: Mise à jour des implémentations

source: AIDL Types
fr_fr: Types AIDL

source: Primitive Types
fr_fr: Types primitifs

source: Array Types
fr_fr: Types de tableaux

source: Sending Objects
fr_fr: Envoi d’objets

source: Sending Files
fr_fr: Envoi de fichiers

source: Logging
fr_fr: Journalisation

source: Interoperability
fr_fr: Interopérabilité

source: With C
fr_fr: Avec C

source: Calling C with Bindgen
fr_fr: Appel de C avec Bindgen

source: Calling Rust from C
fr_fr: Appel de Rust depuis C

source: With C++
fr_fr: Avec C++

source: The Bridge Module
fr_fr: Le module passerelle

source: Rust Bridge
fr_fr: Passerelle Rust

source: Generated C++
fr_fr: C++ généré

source: C++ Bridge
fr_fr: Passerelle C++

source: Shared Types
fr_fr: Types partagés

source: Shared Enums
fr_fr: Énumérations partagées

source: Rust Error Handling
fr_fr: Gestion des erreurs Rust

source: C++ Error Handling
fr_fr: Gestion des erreurs C++

source: Additional Types
fr_fr: Types supplémentaires

source: Building for Android: C++
fr_fr: Compilation pour Android : C++

source: Building for Android: Genrules
fr_fr: Compilation pour Android : Genrules

source: Building for Android: Rust
fr_fr: Compilation pour Android : Rust

source: With Java
fr_fr: Avec Java

source: Exercises
fr_fr: Exercices

source: Comparing Chromium and Cargo Ecosystems
fr_fr: Comparaison des écosystèmes Chromium et Cargo

source: Policy
fr_fr: Politique

source: Unsafe Code
fr_fr: Code non sécurisé

source: Depending on Rust Code from Chromium C++
fr_fr: Utilisation de code Rust depuis Chromium C++

source: Exercise
fr_fr: Exercice

source: `rust_gtest_interop` Library
fr_fr: Bibliothèque `rust_gtest_interop`

source: GN Rules for Rust Tests
fr_fr: Règles GN pour les tests Rust

source: `chromium::import!` Macro
fr_fr: Macro `chromium::import!`

source: Interoperability with C++
fr_fr: Interopérabilité avec C++

source: Example Bindings
fr_fr: Liaisons d'exemple

source: Limitations of CXX
fr_fr: Limites de CXX

source: CXX Error Handling
fr_fr: Gestion des erreurs CXX

source: Error Handling: QR Example
fr_fr: Gestion des erreurs : exemple QR

source: Error Handling: PNG Example
fr_fr: Gestion des erreurs : exemple PNG

source: Using CXX in Chromium
fr_fr: Utilisation de CXX dans Chromium

source: Adding Third Party Crates
fr_fr: Ajout de crates tierces

source: Configuring Cargo.toml
fr_fr: Configuration de Cargo.toml

source: Configuring `gnrt_config.toml`
fr_fr: Configuration de `gnrt_config.toml`

source: Downloading Crates
fr_fr: Téléchargement de crates

source: Generating `gn` Build Rules
fr_fr: Génération des règles de compilation `gn`

source: Resolving Problems
fr_fr: Résolution de problèmes

source: Build Scripts Which Generate Code
fr_fr: Scripts de compilation générant du code

source: Build Scripts Which Build C++ or Take Arbitrary Actions
fr_fr: Scripts de compilation qui construisent du C++ ou exécutent des actions arbitraires

source: Depending on a Crate
fr_fr: Dépendre d'une crate

source: Reviews and Audits
fr_fr: Examens et audits

source: Checking into Chromium Source Code
fr_fr: Ajout au code source de Chromium

source: Keeping Crates Up to Date
fr_fr: Maintien des crates à jour

source: Bringing It Together - Exercise
fr_fr: Mise en pratique – Exercice

source: Exercise Solutions
fr_fr: Solutions des exercices

source: Bare Metal: Morning
fr_fr: Bare Metal : Matin

source: A Minimal Example
fr_fr: Un exemple minimal

source: Microcontrollers
fr_fr: Microcontrôleurs

source: Raw MMIO
fr_fr: MMIO brut

source: HAL Crates
fr_fr: Crates HAL

source: Board Support Crates
fr_fr: Crates de support de carte

source: The Type State Pattern
fr_fr: Le motif de l'état de type

source: `probe-rs` and `cargo-embed`
fr_fr: `probe-rs` et `cargo-embed`

source: Debugging
fr_fr: Débogage

source: Other Projects
fr_fr: Autres projets

source: Compass
fr_fr: Boussole

source: Bare Metal: Afternoon
fr_fr: Bare Metal : Après-midi

source: Application Processors
fr_fr: Processeurs d’application

source: Getting Ready to Rust
fr_fr: Préparer l’environnement Rust

source: Inline Assembly
fr_fr: Assembleur en ligne

source: Let's Write a UART Driver
fr_fr: Écrivons un pilote UART

source: More Traits
fr_fr: Plus de traits

source: A Better UART Driver
fr_fr: Un meilleur pilote UART

source: Multiple Registers
fr_fr: Registres multiples

source: Driver
fr_fr: Pilote

source: Using It
fr_fr: Utilisation

source: Useful Crates
fr_fr: Crates utiles

source: RTC Driver
fr_fr: Pilote RTC

source: Concurrency: Morning
fr_fr: Concurrence : Matin

source: Scoped Threads
fr_fr: Threads délimités

source: Channels
fr_fr: Canaux

source: Unbounded Channels
fr_fr: Canaux non bornés

source: Bounded Channels
fr_fr: Canaux bornés

source: `Send` and `Sync`
fr_fr: `Send` et `Sync`

source: Examples
fr_fr: Exemples

source: Shared State
fr_fr: État partagé

source: Example
fr_fr: Exemple

source: Dining Philosophers
fr_fr: Dîner des philosophes

source: Multi-threaded Link Checker
fr_fr: Vérificateur de liens multi-thread

source: Concurrency: Afternoon
fr_fr: Concurrence : Après-midi

source: Async Basics
fr_fr: Bases de l’asynchrone

source: Tasks
fr_fr: Tâches

source: Async Channels
fr_fr: Canaux asynchrones

source: Control Flow
fr_fr: Flux de contrôle

source: Pitfalls
fr_fr: Pièges

source: Blocking the Executor
fr_fr: Blocage de l’exécuteur

source: Async Traits
fr_fr: Traits asynchrones

source: Cancellation
fr_fr: Annulation

source: Broadcast Chat Application
fr_fr: Application de messagerie en diffusion

source: Final Words
fr_fr: Mots de la fin

source: Thanks!
fr_fr: Merci !

source: Glossary
fr_fr: Glossaire

source: Other Resources
fr_fr: Autres ressources

source: Credits
fr_fr: Crédits

source: [![Build workflow](https://img.shields.io/github/actions/workflow/status/google/comprehensive-rust/build.yml?style=flat-square)](https://github.com/google/comprehensive-rust/actions/workflows/build.yml?query=branch%3Amain) [![GitHub contributors](https://img.shields.io/github/contributors/google/comprehensive-rust?style=flat-square)](https://github.com/google/comprehensive-rust/graphs/contributors) [![GitHub stars](https://img.shields.io/github/stars/google/comprehensive-rust?style=flat-square)](https://github.com/google/comprehensive-rust/stargazers)
fr_fr: [![Flux de construction](https://img.shields.io/github/actions/workflow/status/google/comprehensive-rust/build.yml?style=flat-square)](https://github.com/google/comprehensive-rust/actions/workflows/build.yml?query=branch%3Amain) [![Contributeurs GitHub](https://img.shields.io/github/contributors/google/comprehensive-rust?style=flat-square)](https://github.com/google/comprehensive-rust/graphs/contributors)

source: This is a free Rust course developed by the Android team at Google. The course covers the full spectrum of Rust, from basic syntax to advanced topics like generics and error handling.
fr_fr: Ce cours Rust gratuit a été développé par l'équipe Android de Google. Le cours couvre l'ensemble du langage Rust, de la syntaxe de base aux sujets avancés comme les génériques et la gestion des erreurs.

source: The latest version of the course can be found at <https://google.github.io/comprehensive-rust/>. If you are reading somewhere else, please check there for updates.
fr_fr: La version la plus à jour de ce cours se trouve à l'adresse suivante: <https://google.github.io/comprehensive-rust/>. Si vous lisez ce cours depuis une autre adresse, n'hésitez pas à suivre ce lien pour accéder à la dernière version.

source: The course is also available [as a PDF](comprehensive-rust.pdf).
fr_fr: Ce cours est également disponible [au format PDF](comprehensive-rust.pdf).

source: The goal of the course is to teach you Rust. We assume you don't know anything about Rust and hope to:
fr_fr: Le but du cours est de vous apprendre Rust. Nous supposons que vous découvrez ce langage et espérons :

source: Give you a comprehensive understanding of the Rust syntax and language.
fr_fr: Vous apporter une compréhension complète de la syntaxe et du langage Rust.

source: Enable you to modify existing programs and write new programs in Rust.
fr_fr: Vous permettre de modifier des programmes existants et d'en écrire de nouveaux en Rust.

source: Show you common Rust idioms.
fr_fr: Vous présenter les constructions idiomatiques courantes de Rust.

source: We call the first four course days Rust Fundamentals.
fr_fr: Nous appelons les quatre premiers jours de ce cours les « Fondamentaux de Rust ».

source: Building on this, you're invited to dive into one or more specialized topics:
fr_fr: Au-delà de ces quatre premiers jours de cours, nous vous invitons à approfondir un ou plusieurs des sujets suivant:

source: [Android](android.md): a half-day course on using Rust for Android platform development (AOSP). This includes interoperability with C, C++, and Java.
fr_fr: [Android](android.md): un cours d'une demi-journée consacré à l'utilisation de Rust dans le cadre du développement pour la plate-forme Android. Ce cours couvre également l'interopérabilité avec les langages C, C++ et Java.

source: [Chromium](chromium.md): a half-day course on using Rust within Chromium based browsers. This includes interoperability with C++ and how to include third-party crates in Chromium.
fr_fr: [Chromium](chromium.md): un cours d'une demi-journée consacré à l'utilisation de Rust dans le cadre du développement pour les navigateurs internet basés sur Chromium. Il inclut l'interopérabilité avec le langage C++ et explique comment inclure des crates tierces dans Chromium.

source: [Bare-metal](bare-metal.md): a whole-day class on using Rust for bare-metal (embedded) development. Both microcontrollers and application processors are covered.
fr_fr: [Bare-metal](bare-metal.md): un cours d'une journée consacré à l'utilisation de Rust pour le développement embarqué. Le cours touche à la fois aux microcontrôleurs et aux processeurs d'applications.

source: [Concurrency](concurrency.md): a whole-day class on concurrency in Rust. We cover both classical concurrency (preemptively scheduling using threads and mutexes) and async/await concurrency (cooperative multitasking using futures).
fr_fr: [Programmation concurrente](concurrency.md): un cours d'une journée consacré à la programmation concurrente en Rust. Nous couvrons la concurrence classique (planification à base de threads et mutex) ainsi que la concurrence async/await (multitâche coopératif à base de _futures_).

source: Non-Goals
fr_fr: Non-objectifs

source: Rust is a large language and we won't be able to cover all of it in a few days. Some non-goals of this course are:
fr_fr: Rust est un langage vaste que nous ne pourrons pas couvrir entièrement en quelques jours. Ce cours n'a donc pas pour objectifs :

source: Learning how to develop macros: please see [Chapter 19.5 in the Rust Book](https://doc.rust-lang.org/book/ch19-06-macros.html) and [Rust by Example](https://doc.rust-lang.org/rust-by-example/macros.html) instead.
fr_fr: Apprendre à développer des macros : pour cela, veuillez consulter le [Chapitre 19.5 du Rust Book](https://doc.rust-lang.org/book/ch19-06-macros.html) ou [Rust by Example](https://doc.rust-lang.org/rust-by-example/macros.html). Vous pouvez aussi lire [la traduction non officielle du chapitre 19.5](https://jimskapt.github.io/rust-book-fr/ch19-06-macros.html).

source: Assumptions
fr_fr: Hypothèses de départ

source: The course assumes that you already know how to program. Rust is a statically-typed language and we will sometimes make comparisons with C and C++ to better explain or contrast the Rust approach.
fr_fr: Ce cours part du principe que vous savez déjà programmer. Rust est un langage à typage statique, et nous ferons parfois des comparaisons avec C ou C++ pour mieux expliquer ou contraster l'approche de Rust.

source: If you know how to program in a dynamically-typed language such as Python or JavaScript, then you will be able to follow along just fine too.
fr_fr: Si vous programmez dans un langage à typage dynamique tel que Python ou JavaScript, vous pourrez également suivre sans difficulté.

source: This is an example of a _speaker note_. We will use these to add additional information to the slides. This could be key points which the instructor should cover as well as answers to typical questions which come up in class.
fr_fr: Voici un exemple de _note du formateur_. Nous les utilisons pour ajouter des informations supplémentaires aux diapositives, comme des points essentiels à aborder ou des réponses aux questions fréquentes posées en classe.

source: This page is for the course instructor.
fr_fr: Cette page est destinée au formateur.

source: Here is a bit of background information about how we've been running the course internally at Google.
fr_fr: Voici quelques informations générales sur la façon dont nous avons animé ce cours en interne chez Google.

source: We typically run classes from 9:00 am to 4:00 pm, with a 1 hour lunch break in the middle. This leaves 3 hours for the morning class and 3 hours for the afternoon class. Both sessions contain multiple breaks and time for students to work on exercises.
fr_fr: En général, les sessions se déroulent de 9h à 16h, avec une pause déjeuner d'une heure au milieu. Cela laisse 3 heures de cours le matin et 3 heures l'après-midi. Les deux séances comprennent plusieurs pauses et du temps pour les exercices.

source: Before you run the course, you will want to:
fr_fr: Avant d'animer le cours, vous devrez :

source: Make yourself familiar with the course material. We've included speaker notes to help highlight the key points (please help us by contributing more speaker notes!). When presenting, you should make sure to open the speaker notes in a popup (click the link with a little arrow next to "Speaker Notes"). This way you have a clean screen to present to the class.
fr_fr: Vous familiariser avec le contenu du cours. Des notes du formateur ont été ajoutées pour mettre en évidence les points clés (n'hésitez pas à en proposer d'autres !). Lors de la présentation, pensez à ouvrir ces notes dans une fenêtre séparée (cliquez sur le lien avec une petite flèche à côté de « Notes du formateur »). Cela vous permettra de projeter un écran clair à la classe tout en gardant les notes sous les yeux.

source: Decide on the dates. Since the course takes four days, we recommend that you schedule the days over two weeks. Course participants have said that they find it helpful to have a gap in the course since it helps them process all the information we give them.
fr_fr: Déterminer les dates. Comme le cours dure quatre jours, il est recommandé de les répartir sur deux semaines. Les participants ont indiqué qu'une pause entre les journées les aide à mieux assimiler les contenus abordés.

source: Find a room large enough for your in-person participants. We recommend a class size of 15-25 people. That's small enough that people are comfortable asking questions --- it's also small enough that one instructor will have time to answer the questions. Make sure the room has _desks_ for yourself and for the students: you will all need to be able to sit and work with your laptops. In particular, you will be doing a lot of live-coding as an instructor, so a lectern won't be very helpful for you.
fr_fr: Prévoir une salle suffisamment grande pour accueillir les participants en présentiel. Une taille de groupe de 15 à 25 personnes est idéale : cela permet aux apprenants d’être à l’aise pour poser des questions, et à l’instructeur de pouvoir répondre à chacun. Assurez-vous que la salle soit équipée de _bureaux_ pour tout le monde : vous aurez tous besoin d’un espace pour utiliser votre ordinateur portable. En tant que formateur, vous ferez beaucoup de démonstrations de code en direct, donc un pupitre ne vous sera pas très utile.
