Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: This example is unusual because it boils down to the lowest-common-denominator interop language, C. Both C++ and Rust can natively declare and call C ABI functions. Later in the course, we'll connect C++ directly to Rust.
fr_fr: Cet exemple est particulier car il repose sur le langage d’interopérabilité commun le plus simple : le C. C++ et Rust peuvent tous deux déclarer et appeler des fonctions avec une ABI C. Plus tard dans le cours, nous relierons directement C++ et Rust.

source: `allow_unsafe = true` is required here because `#[no_mangle]` might allow Rust to generate two functions with the same name, and Rust can no longer guarantee that the right one is called.
fr_fr: `allow_unsafe = true` est requis ici car `#[no_mangle]` pourrait permettre à Rust de générer deux fonctions portant le même nom, ce qui rend impossible pour le compilateur de garantir que la bonne fonction sera appelée.

source: If you need a pure Rust executable, you can also do that using the `rust_executable` gn template.
fr_fr: Si vous avez besoin d’un exécutable Rust pur, vous pouvez également utiliser le template GN `rust_executable`.

source: Rust community typically authors unit tests in a module placed in the same source file as the code being tested. This was covered [earlier](../testing.md) in the course and looks like this:
fr_fr: La communauté Rust écrit généralement les tests unitaires dans un module situé dans le même fichier source que le code testé. Cela a été abordé [plus tôt](../testing.md) dans le cours et ressemble à ceci :

source: In Chromium we place unit tests in a separate source file and we continue to follow this practice for Rust --- this makes tests consistently discoverable and helps to avoid rebuilding `.rs` files a second time (in the `test` configuration).
fr_fr: Dans Chromium, nous plaçons les tests unitaires dans un fichier source séparé, et nous continuons à appliquer cette pratique avec Rust — cela rend les tests plus facilement repérables et évite de recompiler les fichiers `.rs` une seconde fois (dans la configuration de test).

source: This results in the following options for testing Rust code in Chromium:
fr_fr: Cela aboutit aux options suivantes pour tester du code Rust dans Chromium :

source: Native Rust tests (i.e. `#[test]`). Discouraged outside of `//third_party/rust`.
fr_fr: Tests Rust natifs (c’est-à-dire `#[test]`). Déconseillés en dehors de `//third_party/rust`.

source: `gtest` tests authored in C++ and exercising Rust via FFI calls. Sufficient when Rust code is just a thin FFI layer and the existing unit tests provide sufficient coverage for the feature.
fr_fr: Tests `gtest` écrits en C++ et faisant appel au code Rust via des appels FFI. Suffisant lorsque le code Rust n’est qu’une fine couche FFI et que les tests existants assurent une couverture suffisante.

source: `gtest` tests authored in Rust and using the crate under test through its public API (using `pub mod for_testing { ... }` if needed). This is the subject of the next few slides.
fr_fr: Tests `gtest` écrits en Rust et utilisant la crate à tester via son API publique (en utilisant `pub mod for_testing { ... }` si nécessaire). Ce sera le sujet des prochaines diapositives.

source: Mention that native Rust tests of third-party crates should eventually be exercised by Chromium bots. (Such testing is needed rarely --- only after adding or updating third-party crates.)
fr_fr: Il faut préciser que les tests Rust natifs des crates tierces devraient être exécutés un jour par les bots Chromium. (Ces tests sont rarement nécessaires — seulement après l’ajout ou la mise à jour de crates tierces.)

source: Some examples may help illustrate when C++ `gtest` vs Rust `gtest` should be used:
fr_fr: Voici quelques exemples pour illustrer quand utiliser un `gtest` en C++ ou en Rust :

source: QR has very little functionality in the first-party Rust layer (it's just a thin FFI glue) and therefore uses the existing C++ unit tests for testing both the C++ and the Rust implementation (parameterizing the tests so they enable or disable Rust using a `ScopedFeatureList`).
fr_fr: Le module QR contient très peu de logique dans la couche Rust propriétaire (il s’agit seulement d’une fine couche FFI), et utilise donc les tests unitaires C++ existants pour tester à la fois l’implémentation C++ et Rust (en paramétrant les tests pour activer ou désactiver Rust via un `ScopedFeatureList`).

source: Hypothetical/WIP PNG integration may need to implement memory-safe implementation of pixel transformations that are provided by `libpng` but missing in the `png` crate - e.g. RGBA => BGRA, or gamma correction. Such functionality may benefit from separate tests authored in Rust.
fr_fr: Une intégration hypothétique/en cours de PNG pourrait nécessiter une implémentation sûre en mémoire de transformations de pixels fournies par `libpng` mais absentes de la crate `png` — par exemple, RGBA → BGRA ou correction gamma. Une telle fonctionnalité pourrait bénéficier de tests séparés écrits en Rust.

source: The [`rust_gtest_interop`](https://chromium.googlesource.com/chromium/src/+/main/testing/rust_gtest_interop/README.md) library provides a way to:
fr_fr: La bibliothèque [`rust_gtest_interop`](https://chromium.googlesource.com/chromium/src/+/main/testing/rust_gtest_interop/README.md) permet de :

source: Use a Rust function as a `gtest` testcase (using the `#[gtest(...)]` attribute)
fr_fr: Utiliser une fonction Rust comme cas de test `gtest` (en utilisant l’attribut `#[gtest(...)]`)

source: Use `expect_eq!` and similar macros (similar to `assert_eq!` but not panicking and not terminating the test when the assertion fails).
fr_fr: Utiliser les macros `expect_eq!` et similaires (semblables à `assert_eq!`, mais sans panique ni arrêt du test si l’assertion échoue).

source: Example:
fr_fr: Exemple :

source: The simplest way to build Rust `gtest` tests is to add them to an existing test binary that already contains tests authored in C++. For example:
fr_fr: La façon la plus simple de compiler des tests Rust `gtest` est de les ajouter à un binaire de test existant contenant déjà des tests écrits en C++. Par exemple :

source: Authoring Rust tests in a separate `static_library` also works, but requires manually declaring the dependency on the support libraries:
fr_fr: Écrire des tests Rust dans une `static_library` séparée fonctionne aussi, mais nécessite de déclarer manuellement les dépendances aux bibliothèques de support :

source: After adding `:my_rust_lib` to GN `deps`, we still need to learn how to import and use `my_rust_lib` from `my_rust_lib_unittest.rs`. We haven't provided an explicit `crate_name` for `my_rust_lib` so its crate name is computed based on the full target path and name. Fortunately we can avoid working with such an unwieldy name by using the `chromium::import!` macro from the automatically-imported `chromium` crate:
fr_fr: Après avoir ajouté `:my_rust_lib` aux dépendances GN, il faut encore apprendre à importer et utiliser `my_rust_lib` depuis `my_rust_lib_unittest.rs`. Aucun `crate_name` explicite n’a été défini, donc son nom est généré automatiquement à partir du chemin et du nom de la cible. Heureusement, on peut éviter d’utiliser un nom aussi peu pratique grâce à la macro `chromium::import!`, automatiquement disponible via la crate `chromium` :

source: Under the covers the macro expands to something similar to:
fr_fr: En coulisses, cette macro se développe en quelque chose de similaire à :

source: More information can be found in [the doc comment](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/chromium_prelude/chromium_prelude.rs?q=f:chromium_prelude.rs%20pub.use.*%5Cbimport%5Cb;%20-f:third_party&ss=chromium%2Fchromium%2Fsrc) of the `chromium::import` macro.
fr_fr: Plus d'informations sont disponibles dans [le commentaire de documentation](https://source.chromium.org/chromium/chromium/src/+/main:build/rust/chromium_prelude/chromium_prelude.rs?q=f:chromium_prelude.rs%20pub.use.*%5Cbimport%5Cb;%20-f:third_party&ss=chromium%2Fchromium%2Fsrc) de la macro `chromium::import`.

source: `rust_static_library` supports specifying an explicit name via `crate_name` property, but doing this is discouraged. And it is discouraged because the crate name has to be globally unique. crates.io guarantees uniqueness of its crate names so `cargo_crate` GN targets (generated by the `gnrt` tool covered in a later section) use short crate names.
fr_fr: `rust_static_library` permet de spécifier un nom explicite via la propriété `crate_name`, mais cela est déconseillé car le nom de crate doit être globalement unique. crates.io garantit cette unicité, c’est pourquoi les cibles GN de type `cargo_crate` (générées par l’outil `gnrt`, présenté plus tard) utilisent des noms de crate courts.

source: Testing exercise
fr_fr: Exercice : tests

source: Time for another exercise!
fr_fr: Il est temps de passer à un autre exercice !

source: In your Chromium build:
fr_fr: Dans votre build de Chromium :

source: Add a testable function next to `hello_from_rust`. Some suggestions: adding two integers received as arguments, computing the nth Fibonacci number, summing integers in a slice, etc.
fr_fr: Ajoutez une fonction testable à côté de `hello_from_rust`. Suggestions : additionner deux entiers en arguments, calculer le nième nombre de Fibonacci, sommer les entiers dans une tranche, etc.

source: Add a separate `..._unittest.rs` file with a test for the new function.
fr_fr: Ajoutez un fichier `..._unittest.rs` séparé contenant un test pour la nouvelle fonction.

source: Add the new tests to `BUILD.gn`.
fr_fr: Ajoutez les nouveaux tests dans le fichier `BUILD.gn`.

source: Build the tests, run them, and verify that the new test works.
fr_fr: Compilez les tests, exécutez-les et vérifiez que le nouveau test fonctionne correctement.

source: The Rust community offers multiple options for C++/Rust interop, with new tools being developed all the time. At the moment, Chromium uses a tool called CXX.
fr_fr: La communauté Rust propose plusieurs options pour l’interopérabilité C++/Rust, avec de nouveaux outils en développement en permanence. Actuellement, Chromium utilise un outil appelé CXX.

source: You describe your whole language boundary in an interface definition language (which looks a lot like Rust) and then CXX tools generate declarations for functions and types in both Rust and C++.
fr_fr: Vous décrivez l’ensemble de la frontière entre les langages dans un langage de définition d’interface (qui ressemble beaucoup à Rust), puis les outils CXX génèrent des déclarations de fonctions et de types en Rust et en C++.

source: See the [CXX tutorial](https://cxx.rs/tutorial.html) for a full example of using this.
fr_fr: Consultez le [tutoriel CXX](https://cxx.rs/tutorial.html) pour un exemple complet d’utilisation.

source: Talk through the diagram. Explain that behind the scenes, this is doing just the same as you previously did. Point out that automating the process has the following benefits:
fr_fr: Commentez le diagramme. Expliquez qu’en coulisses, cela effectue la même chose que ce que vous faisiez manuellement. Soulignez que l’automatisation de ce processus apporte les avantages suivants :

source: The tool guarantees that the C++ and Rust sides match (e.g. you get compile errors if the `#[cxx::bridge]` doesn't match the actual C++ or Rust definitions, but with out-of-sync manual bindings you'd get Undefined Behavior)
fr_fr: L’outil garantit que les côtés C++ et Rust correspondent (par exemple, vous obtenez des erreurs de compilation si le `#[cxx::bridge]` ne correspond pas aux définitions C++ ou Rust réelles, alors que des liaisons manuelles désynchronisées pourraient entraîner un comportement indéfini).

source: The tool automates generation of FFI thunks (small, C-ABI-compatible, free functions) for non-C features (e.g. enabling FFI calls into Rust or C++ methods; manual bindings would require authoring such top-level, free functions manually)
fr_fr: L’outil automatise la génération de fonctions FFI de type « thunk » (petites fonctions compatibles avec l’ABI C) pour les éléments non-C (par exemple, pour permettre des appels FFI vers des méthodes Rust ou C++ ; avec des liaisons manuelles, il faudrait écrire soi-même ces fonctions de niveau supérieur).

source: The tool and the library can handle a set of core types - for example:
fr_fr: L’outil et la bibliothèque gèrent un ensemble de types de base — par exemple :

source: `&[T]` can be passed across the FFI boundary, even though it doesn't guarantee any particular ABI or memory layout. With manual bindings `std::span<T>` / `&[T]` have to be manually destructured and rebuilt out of a pointer and length - this is error-prone given that each language represents empty slices slightly differently)
fr_fr: `&[T]` peut être passé à travers la frontière FFI, même si ce type ne garantit aucun ABI ni agencement mémoire particulier. Avec des liaisons manuelles, `std::span<T>` / `&[T]` doivent être désassemblés et reconstruits manuellement à partir d’un pointeur et d’une longueur — ce qui est source d’erreurs, car chaque langage représente les tranches vides différemment.

source: Smart pointers like `std::unique_ptr<T>`, `std::shared_ptr<T>`, and/or `Box` are natively supported. With manual bindings, one would have to pass C-ABI-compatible raw pointers, which would increase lifetime and memory-safety risks.
fr_fr: Les pointeurs intelligents comme `std::unique_ptr<T>`, `std::shared_ptr<T>` et/ou `Box` sont pris en charge nativement. Avec des liaisons manuelles, il faudrait utiliser des pointeurs bruts compatibles ABI C, ce qui augmenterait les risques liés à la durée de vie et à la sécurité mémoire.

source: `rust::String` and `CxxString` types understand and maintain differences in string representation across the languages (e.g. `rust::String::lossy` can build a Rust string from non-UTF8 input and `rust::String::c_str` can NUL-terminate a string).
fr_fr: Les types `rust::String` et `CxxString` tiennent compte des différences de représentation des chaînes entre les langages (par exemple, `rust::String::lossy` peut construire une chaîne Rust à partir d’une entrée non UTF-8, et `rust::String::c_str` peut terminer une chaîne par un caractère NUL).

source: CXX requires that the whole C++/Rust boundary is declared in `cxx::bridge` modules inside `.rs` source code.
fr_fr: CXX exige que toute la frontière C++/Rust soit déclarée dans des modules `cxx::bridge` à l’intérieur du code source `.rs`.

source: // Definitions of Rust types and functions go here
fr_fr: // Les définitions des types et fonctions Rust vont ici

source: Point out:
fr_fr: Remarque :

source: Although this looks like a regular Rust `mod`, the `#[cxx::bridge]` procedural macro does complex things to it. The generated code is quite a bit more sophisticated - though this does still result in a `mod` called `ffi` in your code.
fr_fr: Même si cela ressemble à un simple `mod` Rust, la macro procédurale `#[cxx::bridge]` réalise des opérations complexes. Le code généré est bien plus sophistiqué — même si cela aboutit bien à un `mod` nommé `ffi` dans votre code.

source: Native support for C++'s `std::unique_ptr` in Rust
fr_fr: Prise en charge native du `std::unique_ptr` de C++ dans Rust

source: Native support for Rust slices in C++
fr_fr: Prise en charge native des tranches Rust en C++

source: Calls from C++ to Rust, and Rust types (in the top part)
fr_fr: Appels de C++ vers Rust, et types Rust (dans la partie supérieure)

source: Calls from Rust to C++, and C++ types (in the bottom part)
fr_fr: Appels de Rust vers C++, et types C++ (dans la partie inférieure)

source: **Common misconception**: It _looks_ like a C++ header is being parsed by Rust, but this is misleading. This header is never interpreted by Rust, but simply `#include`d in the generated C++ code for the benefit of C++ compilers.
fr_fr: **Idée reçue courante** : on pourrait croire que Rust interprète un fichier header C++, mais c’est faux. Ce header n’est jamais analysé par Rust, il est simplement inclus (`#include`) dans le code C++ généré, à l’intention des compilateurs C++.

source: By far the most useful page when using CXX is the [type reference](https://cxx.rs/bindings.html).
fr_fr: La page la plus utile lorsqu’on utilise CXX est sans doute la [référence des types](https://cxx.rs/bindings.html).

source: CXX fundamentally suits cases where:
fr_fr: CXX est fondamentalement adapté aux cas où :

source: Your Rust-C++ interface is sufficiently simple that you can declare all of it.
fr_fr: L’interface entre Rust et C++ est suffisamment simple pour que vous puissiez tout déclarer.

source: You're using only the types natively supported by CXX already, for example `std::unique_ptr`, `std::string`, `&[u8]` etc.
fr_fr: Vous utilisez uniquement les types déjà pris en charge nativement par CXX, comme `std::unique_ptr`, `std::string`, `&[u8]`, etc.

source: It has many limitations --- for example lack of support for Rust's `Option` type.
fr_fr: Il comporte de nombreuses limitations — par exemple l’absence de prise en charge du type `Option` de Rust.

source: These limitations constrain us to using Rust in Chromium only for well isolated "leaf nodes" rather than for arbitrary Rust-C++ interop. When considering a use-case for Rust in Chromium, a good starting point is to draft the CXX bindings for the language boundary to see if it appears simple enough.
fr_fr: Ces limitations nous contraignent à utiliser Rust dans Chromium uniquement pour des « nœuds feuilles » bien isolés, et non pour une interopérabilité Rust-C++ généralisée. Lorsqu’on envisage un cas d’usage de Rust dans Chromium, un bon point de départ est de rédiger les liaisons CXX pour la frontière entre les langages et de vérifier si cela semble suffisamment simple.

source: You should also discuss some of the other sticky points with CXX, for example:
fr_fr: Il convient aussi d’aborder certains points sensibles liés à CXX, par exemple :

source: Its error handling is based around C++ exceptions (given on the next slide)
fr_fr: La gestion des erreurs repose sur les exceptions C++ (expliqué dans la diapositive suivante)

source: Function pointers are awkward to use.
fr_fr: Les pointeurs de fonction sont difficiles à utiliser.

source: CXX's [support for `Result<T,E>`](https://cxx.rs/binding/result.html) relies on C++ exceptions, so we can't use that in Chromium. Alternatives:
fr_fr: La [prise en charge de `Result<T,E>` par CXX](https://cxx.rs/binding/result.html) repose sur les exceptions C++, ce qui empêche son utilisation dans Chromium. Alternatives :

source: The `T` part of `Result<T, E>` can be:
fr_fr: La partie `T` de `Result<T, E>` peut être :

source: Returned via out parameters (e.g. via `&mut T`). This requires that `T` can be passed across the FFI boundary - for example `T` has to be:
fr_fr: Renvoyée via des paramètres de sortie (par exemple via `&mut T`). Cela suppose que `T` puisse être passé à travers la frontière FFI — par exemple, `T` doit être :

source: A primitive type (like `u32` or `usize`)
fr_fr: Un type primitif (comme `u32` ou `usize`)

source: A type natively supported by `cxx` (like `UniquePtr<T>`) that has a suitable default value to use in a failure case (_unlike_ `Box<T>`).
fr_fr: Un type pris en charge nativement par `cxx` (comme `UniquePtr<T>`) qui dispose d’une valeur par défaut appropriée en cas d’échec (contrairement à `Box<T>`).

source: Retained on the Rust side, and exposed via reference. This may be needed when `T` is a Rust type, which cannot be passed across the FFI boundary, and cannot be stored in `UniquePtr<T>`.
fr_fr: Conservé côté Rust et exposé par référence. Cela peut être nécessaire si `T` est un type Rust, qui ne peut pas être passé à travers la frontière FFI, ni stocké dans un `UniquePtr<T>`.

source: The `E` part of `Result<T, E>` can be:
fr_fr: La partie `E` de `Result<T, E>` peut être :

source: Returned as a boolean (e.g. `true` representing success, and `false` representing failure)
fr_fr: Renvoyée comme un booléen (par exemple `true` pour le succès, `false` pour l’échec)

source: Preserving error details is in theory possible, but so far hasn't been needed in practice.
fr_fr: Préserver les détails d’erreur est théoriquement possible, mais cela n’a jusqu’à présent pas été nécessaire en pratique.

source: CXX Error Handling: QR Example
fr_fr: Gestion des erreurs avec CXX : exemple QR

source: The QR code generator is [an example](https://source.chromium.org/chromium/chromium/src/+/main:components/qr_code_generator/qr_code_generator_ffi_glue.rs;l=13-18;drc=7bf1b75b910ca430501b9c6a74c1d18a0223ecca) where a boolean is used to communicate success vs failure, and where the successful result can be passed across the FFI boundary:
fr_fr: Le générateur de QR codes est [un exemple](https://source.chromium.org/chromium/chromium/src/+/main:components/qr_code_generator/qr_code_generator_ffi_glue.rs;l=13-18;drc=7bf1b75b910ca430501b9c6a74c1d18a0223ecca) où un booléen sert à indiquer le succès ou l’échec, et où le résultat réussi peut être transmis via la frontière FFI :

source: Students may be curious about the semantics of the `out_qr_size` output. This is not the size of the vector, but the size of the QR code (and admittedly it is a bit redundant - this is the square root of the size of the vector).
fr_fr: Les étudiants pourraient se demander ce que représente `out_qr_size`. Ce n’est pas la taille du vecteur, mais la taille du QR code (et c’est un peu redondant — il s’agit de la racine carrée de la taille du vecteur).

source: It may be worth pointing out the importance of initializing `out_qr_size` before calling into the Rust function. Creation of a Rust reference that points to uninitialized memory results in Undefined Behavior (unlike in C++, when only the act of dereferencing such memory results in UB).
fr_fr: Il est important de signaler qu’il faut initialiser `out_qr_size` avant d’appeler la fonction Rust. Créer une référence Rust vers une mémoire non initialisée entraîne un comportement indéfini (contrairement au C++ où seul le déréférencement entraîne ce comportement).

source: If students ask about `Pin`, then explain why CXX needs it for mutable references to C++ data: the answer is that C++ data can’t be moved around like Rust data, because it may contain self-referential pointers.
fr_fr: Si les étudiants posent des questions sur `Pin`, expliquez que CXX en a besoin pour les références mutables vers des données C++ : les données C++ ne peuvent pas être déplacées comme en Rust, car elles peuvent contenir des pointeurs auto-référencés.

source: CXX Error Handling: PNG Example
fr_fr: Gestion des erreurs avec CXX : exemple PNG

source: A prototype of a PNG decoder illustrates what can be done when the successful result cannot be passed across the FFI boundary:
fr_fr: Un prototype de décodeur PNG illustre ce qu’on peut faire lorsque le résultat réussi ne peut pas être transmis via la frontière FFI :

source: /// This returns an FFI-friendly equivalent of `Result<PngReader<'a>, /// ()>`.
fr_fr: /// Ceci renvoie un équivalent FFI-compatible de `Result<PngReader<'a>, ()>`.

source: /// C++ bindings for the `crate::png::ResultOfPngReader` type.
fr_fr: /// Liaisons C++ pour le type `crate::png::ResultOfPngReader`.

source: /// C++ bindings for the `crate::png::PngReader` type.
fr_fr: /// Liaisons C++ pour le type `crate::png::PngReader`.
