Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: Note that `select!` drops unmatched branches, which cancels their futures. It is easiest to use when every execution of `select!` creates new futures.
fr_fr: Notez que `select!` abandonne les branches non sélectionnées, ce qui annule les futures associés. Il est plus simple de l’utiliser si chaque appel à `select!` crée de nouveaux futures.

source: An alternative is to pass `&mut future` instead of the future itself, but this can lead to issues, further discussed in the pinning slide.
fr_fr: Une alternative consiste à passer `&mut future` au lieu du future lui-même, mais cela peut poser des problèmes — nous y reviendrons dans la partie sur le `pin`.

source: Pitfalls of async/await
fr_fr: Pièges de l’async/await

source: Async / await provides convenient and efficient abstraction for concurrent asynchronous programming. However, the async/await model in Rust also comes with its share of pitfalls and footguns. We illustrate some of them in this chapter:
fr_fr: L’async/await fournit une abstraction pratique et efficace pour la programmation asynchrone concurrente. Cependant, le modèle async/await de Rust comporte aussi son lot de pièges. Ce chapitre en illustre quelques-uns :

source: [Blocking the Executor](pitfalls/blocking-executor.md)
fr_fr: [Blocage de l’exécuteur](pitfalls/blocking-executor.md)

source: [Async Traits](pitfalls/async-traits.md)
fr_fr: [Traits Async](pitfalls/async-traits.md)

source: [Cancellation](pitfalls/cancellation.md)
fr_fr: [Annulation](pitfalls/cancellation.md)

source: Blocking the executor
fr_fr: Blocage de l’exécuteur

source: Most async runtimes only allow IO tasks to run concurrently. This means that CPU blocking tasks will block the executor and prevent other tasks from being executed. An easy workaround is to use async equivalent methods where possible.
fr_fr: La plupart des runtimes async ne permettent que l’exécution concurrente des tâches d’E/S. Une tâche CPU bloquante va donc bloquer l’exécuteur et empêcher l’exécution des autres tâches. Une solution simple est d’utiliser les méthodes asynchrones équivalentes lorsque c’est possible.

source: "future {id} slept for {duration_ms}ms, finished after {}ms"
fr_fr: "le future {id} a dormi pendant {duration_ms} ms, terminé après {} ms"

source: Run the code and see that the sleeps happen consecutively rather than concurrently.
fr_fr: Exécutez le code et constatez que les pauses (`sleep`) s’effectuent l’une après l’autre au lieu de se faire en parallèle.

source: The `"current_thread"` flavor puts all tasks on a single thread. This makes the effect more obvious, but the bug is still present in the multi-threaded flavor.
fr_fr: La version `"current_thread"` place toutes les tâches sur un seul thread, ce qui rend l’effet plus visible — mais le bug reste présent même en mode multi-thread.

source: Switch the `std::thread::sleep` to `tokio::time::sleep` and await its result.
fr_fr: Remplacez le `std::thread::sleep` par `tokio::time::sleep` et utilisez `await` sur le résultat.

source: Another fix would be to `tokio::task::spawn_blocking` which spawns an actual thread and transforms its handle into a future without blocking the executor.
fr_fr: Une autre solution consiste à utiliser `tokio::task::spawn_blocking`, qui lance un vrai thread et en transforme le handle en future, sans bloquer l’exécuteur.

source: You should not think of tasks as OS threads. They do not map 1 to 1 and most executors will allow many tasks to run on a single OS thread. This is particularly problematic when interacting with other libraries via FFI, where that library might depend on thread-local storage or map to specific OS threads (e.g., CUDA). Prefer `tokio::task::spawn_blocking` in such situations.
fr_fr: Ne considérez pas les tâches comme des threads du système d’exploitation : il n’y a pas de correspondance 1:1, et la plupart des exécuteurs permettent à plusieurs tâches de s’exécuter sur un même thread système. Cela pose problème avec les bibliothèques externes (FFI), qui peuvent dépendre de variables thread-locales ou exiger un thread spécifique (ex. CUDA). Dans ces cas, préférez `tokio::task::spawn_blocking`.

source: Use sync mutexes with care. Holding a mutex over an `.await` may cause another task to block, and that task may be running on the same thread.
fr_fr: Attention à l’usage des mutex synchrones. Maintenir un mutex verrouillé pendant un `.await` peut bloquer une autre tâche — qui peut s’exécuter sur le même thread.

source: Async blocks and functions return types implementing the `Future` trait. The type returned is the result of a compiler transformation which turns local variables into data stored inside the future.
fr_fr: Les blocs et fonctions async retournent des types implémentant le trait `Future`. Le type retourné est le résultat d’une transformation effectuée par le compilateur, qui transforme les variables locales en données stockées à l’intérieur du future.

source: Some of those variables can hold pointers to other local variables. Because of that, the future should never be moved to a different memory location, as it would invalidate those pointers.
fr_fr: Certaines de ces variables peuvent contenir des pointeurs vers d’autres variables locales. Pour cette raison, le future ne doit jamais être déplacé en mémoire, au risque d’invalider ces pointeurs.

source: To prevent moving the future type in memory, it can only be polled through a pinned pointer. `Pin` is a wrapper around a reference that disallows all operations that would move the instance it points to into a different memory location.
fr_fr: Pour éviter de déplacer un future en mémoire, celui-ci ne peut être interrogé (`poll`) qu’au travers d’un pointeur fixé (`pinned`). `Pin` est un wrapper autour d’une référence qui empêche toute opération susceptible de déplacer l’objet qu’il pointe vers une autre adresse mémoire.

source: // A work item. In this case, just sleep for the given time and respond // with a message on the `respond_on` channel.
fr_fr: // Une tâche de travail. Dans ce cas, elle attend un certain temps puis répond // avec un message sur le canal `respond_on`.

source: // A worker which listens for work on a queue and performs it.
fr_fr: // Un travailleur qui écoute une file de tâches et les exécute.

source: // Pretend to work.
fr_fr: // Faire semblant de travailler.

source: "failed to send response"
fr_fr: "échec lors de l’envoi de la réponse"

source: // TODO: report number of iterations every 100ms
fr_fr: // TODO : afficher le nombre d’itérations toutes les 100 ms

source: // A requester which requests work and waits for it to complete.
fr_fr: // Un demandeur qui envoie des requêtes de travail et attend leur réponse.

source: "failed to send on work queue"
fr_fr: "échec de l’envoi dans la file de travail"

source: "failed waiting for response"
fr_fr: "échec en attente de réponse"

source: "work result for iteration {i}: {resp}"
fr_fr: "résultat de la tâche à l’itération {i} : {resp}"

source: You may recognize this as an example of the actor pattern. Actors typically call `select!` in a loop.
fr_fr: Vous reconnaîtrez peut-être ici un exemple du modèle acteur. Les acteurs utilisent généralement une boucle avec `select!`.

source: This serves as a summation of a few of the previous lessons, so take your time with it.
fr_fr: Cet exemple sert de récapitulatif à plusieurs leçons précédentes — prenez donc le temps de bien le comprendre.

source: Naively add a `_ = sleep(Duration::from_millis(100)) => { println!(..) }` to the `select!`. This will never execute. Why?
fr_fr: Ajoutez naïvement un `_ = sleep(Duration::from_millis(100)) => { println!(..) }` dans le `select!`. Cela ne s’exécutera jamais. Pourquoi ?

source: Instead, add a `timeout_fut` containing that future outside of the `loop`:
fr_fr: À la place, définissez un `timeout_fut` contenant ce future en dehors de la `loop` :

source: This still doesn't work. Follow the compiler errors, adding `&mut` to the `timeout_fut` in the `select!` to work around the move, then using `Box::pin`:
fr_fr: Cela ne fonctionne toujours pas. Suivez les erreurs du compilateur : ajoutez `&mut` à `timeout_fut` dans le `select!` pour éviter le déplacement, puis utilisez `Box::pin` :

source: This compiles, but once the timeout expires it is `Poll::Ready` on every iteration (a fused future would help with this). Update to reset `timeout_fut` every time it expires.
fr_fr: Cela compile, mais une fois le délai dépassé, le future reste à l’état `Poll::Ready` à chaque itération (un future « fusionné » corrigerait ce problème). Modifiez le code pour réinitialiser `timeout_fut` à chaque expiration.

source: Box allocates on the heap. In some cases, `std::pin::pin!` (only recently stabilized, with older code often using `tokio::pin!`) is also an option, but that is difficult to use for a future that is reassigned.
fr_fr: `Box` alloue sur le tas. Dans certains cas, on peut utiliser `std::pin::pin!` (récemment stabilisé, remplacé auparavant par `tokio::pin!`), mais cela reste difficile à utiliser si le future est réaffecté.

source: Another alternative is to not use `pin` at all but spawn another task that will send to a `oneshot` channel every 100ms.
fr_fr: Une autre solution consiste à ne pas utiliser `pin` du tout, mais à lancer une autre tâche qui envoie sur un canal `oneshot` toutes les 100 ms.

source: Data that contains pointers to itself is called self-referential. Normally, the Rust borrow checker would prevent self-referential data from being moved, as the references cannot outlive the data they point to. However, the code transformation for async blocks and functions is not verified by the borrow checker.
fr_fr: Les données contenant des pointeurs vers elles-mêmes sont dites *auto-référencées*. Normalement, le *borrow checker* de Rust empêche leur déplacement, car leurs références ne peuvent pas survivre à l’objet pointé. Cependant, les transformations des blocs et fonctions `async` ne sont pas vérifiées par le borrow checker.

source: `Pin` is a wrapper around a reference. An object cannot be moved from its place using a pinned pointer. However, it can still be moved through an unpinned pointer.
fr_fr: `Pin` est un wrapper autour d’une référence. Il empêche le déplacement de l’objet qu’il pointe. Cependant, cet objet peut encore être déplacé à l’aide d’un pointeur non *pinned*.

source: The `poll` method of the `Future` trait uses `Pin<&mut Self>` instead of `&mut Self` to refer to the instance. That's why it can only be called on a pinned pointer.
fr_fr: La méthode `poll` du trait `Future` utilise `Pin<&mut Self>` au lieu de `&mut Self` pour référencer l’instance. C’est pourquoi elle ne peut être appelée qu’à partir d’un pointeur `pinned`.

source: Async methods in traits are were stabilized only recently, in the 1.75 release. This required support for using return-position `impl Trait` (RPIT) in traits, as the desugaring for `async fn` includes `-> impl Future<Output = ...>`.
fr_fr: Les méthodes `async` dans les traits ont été stabilisées récemment, dans la version 1.75. Cela a nécessité la prise en charge de `impl Trait` en position de retour (RPIT) dans les traits, car le sucre syntaxique de `async fn` inclut `-> impl Future<Output = ...>`.

source: However, even with the native support today there are some pitfalls around `async fn` and RPIT in traits:
fr_fr: Cependant, même avec la prise en charge native aujourd’hui, certaines difficultés persistent autour des `async fn` et de RPIT dans les traits :

source: Return-position impl Trait captures all in-scope lifetimes (so some patterns of borrowing cannot be expressed)
fr_fr: `impl Trait` en position de retour capture toutes les durées de vie en cours (ce qui empêche certains schémas d’emprunt d’être exprimés)

source: Traits whose methods use return-position `impl trait` or `async` are not `dyn` compatible.
fr_fr: Les traits dont les méthodes utilisent `impl trait` ou `async` en position de retour ne sont pas compatibles avec `dyn`.

source: If we do need `dyn` support, the crate [async_trait](https://docs.rs/async-trait/latest/async_trait/) provides a workaround through a macro, with some caveats:
fr_fr: Si l’on a besoin de compatibilité avec `dyn`, la crate [async_trait](https://docs.rs/async-trait/latest/async_trait/) propose une solution via une macro, avec certaines limites :

source: "running all sleepers.."
fr_fr: "exécution de tous les dormeurs..."

source: "slept for {}ms"
fr_fr: "a dormi pendant {}ms"

source: `async_trait` is easy to use, but note that it's using heap allocations to achieve this. This heap allocation has performance overhead.
fr_fr: `async_trait` est simple à utiliser, mais utilise des allocations sur le tas pour fonctionner. Ces allocations ont un coût en performance.

source: The challenges in language support for `async trait` are deep Rust and probably not worth describing in-depth. Niko Matsakis did a good job of explaining them in [this post](https://smallcultfollowing.com/babysteps/blog/2019/10/26/async-fn-in-traits-are-hard/) if you are interested in digging deeper.
fr_fr: Les défis liés au support des `async trait` sont profondément liés aux mécanismes internes de Rust et ne valent sans doute pas la peine d’être détaillés ici. Niko Matsakis les a très bien expliqués dans [cet article](https://smallcultfollowing.com/babysteps/blog/2019/10/26/async-fn-in-traits-are-hard/), si tu souhaites en savoir plus.

source: Try creating a new sleeper struct that will sleep for a random amount of time and adding it to the Vec.
fr_fr: Essaie de créer une nouvelle structure `Sleeper` qui dort pendant une durée aléatoire, puis ajoute-la au `Vec`.

source: Dropping a future implies it can never be polled again. This is called _cancellation_ and it can occur at any `await` point. Care is needed to ensure the system works correctly even when futures are cancelled. For example, it shouldn't deadlock or lose data.
fr_fr: Abandonner (`drop`) un future signifie qu’il ne pourra plus jamais être interrogé (`poll`). Cela s’appelle une _annulation_ (*cancellation*), et cela peut survenir à n’importe quel point `await`. Il faut donc s’assurer que le système fonctionne correctement même lorsque des futures sont annulés : il ne doit ni se bloquer, ni perdre de données.

source: "not UTF-8"
fr_fr: "pas du UTF-8"

source: "hi\nthere\n"
fr_fr: "salut\nça va\n"

source: "tick!"
fr_fr: "tic !"

source: The compiler doesn't help with cancellation-safety. You need to read API documentation and consider what state your `async fn` holds.
fr_fr: Le compilateur n’aide pas à garantir la sécurité face aux annulations. Il faut lire la documentation des API et réfléchir à l’état maintenu par ta fonction `async fn`.

source: Unlike `panic` and `?`, cancellation is part of normal control flow (vs error-handling).
fr_fr: Contrairement à `panic` ou `?`, l’annulation fait partie du flux de contrôle normal (et non de la gestion d’erreur).

source: The example loses parts of the string.
fr_fr: Cet exemple perd une partie de la chaîne de caractères.

source: Whenever the `tick()` branch finishes first, `next()` and its `buf` are dropped.
fr_fr: Chaque fois que la branche `tick()` termine en premier, `next()` et son `buf` sont supprimés.

source: `LinesReader` can be made cancellation-safe by making `buf` part of the struct:
fr_fr: `LinesReader` peut être rendu résistant aux annulations en intégrant `buf` à la structure elle-même :

source: // prefix buf and bytes with self.
fr_fr: // préfixer `buf` et `bytes` avec `self.`

source: [`Interval::tick`](https://docs.rs/tokio/latest/tokio/time/struct.Interval.html#method.tick) is cancellation-safe because it keeps track of whether a tick has been 'delivered'.
fr_fr: [`Interval::tick`](https://docs.rs/tokio/latest/tokio/time/struct.Interval.html#method.tick) est sûr vis-à-vis des annulations car il garde en mémoire si un tick a été « livré ».

source: [`AsyncReadExt::read`](https://docs.rs/tokio/latest/tokio/io/trait.AsyncReadExt.html#method.read) is cancellation-safe because it either returns or doesn't read data.
fr_fr: [`AsyncReadExt::read`](https://docs.rs/tokio/latest/tokio/io/trait.AsyncReadExt.html#method.read) est sûr vis-à-vis des annulations car il renvoie soit une valeur, soit ne lit rien.

source: [`AsyncBufReadExt::read_line`](https://docs.rs/tokio/latest/tokio/io/trait.AsyncBufReadExt.html#method.read_line) is similar to the example and _isn't_ cancellation-safe. See its documentation for details and alternatives.
fr_fr: [`AsyncBufReadExt::read_line`](https://docs.rs/tokio/latest/tokio/io/trait.AsyncBufReadExt.html#method.read_line) fonctionne comme l’exemple et n’est _pas_ sûr face aux annulations. Consulte sa documentation pour plus de détails et des alternatives.

source: To practice your Async Rust skills, we have again two exercises for you:
fr_fr: Pour vous exercer à Async Rust, nous vous proposons à nouveau deux exercices :

source: Dining philosophers: we already saw this problem in the morning. This time you are going to implement it with Async Rust.
fr_fr: Les philosophes dînatoires : nous avons déjà vu ce problème ce matin. Cette fois, vous allez l’implémenter avec Async Rust.

source: A Broadcast Chat Application: this is a larger project that allows you experiment with more advanced Async Rust features.
fr_fr: Une application de chat en diffusion : il s’agit d’un projet plus conséquent, qui vous permet d’expérimenter des fonctionnalités Async Rust plus avancées.

source: Dining Philosophers --- Async
fr_fr: Philosophes dînant — Asynchrone

source: See [dining philosophers](dining-philosophers.md) for a description of the problem.
fr_fr: Voir [les philosophes dînatoires](dining-philosophers.md) pour la description du problème.

source: As before, you will need a local [Cargo installation](../../cargo/running-locally.md) for this exercise. Copy the code below to a file called `src/main.rs`, fill out the blanks, and test that `cargo run` does not deadlock:
fr_fr: Comme précédemment, vous aurez besoin d’une [installation locale de Cargo](../../cargo/running-locally.md) pour cet exercice. Copiez le code ci-dessous dans un fichier nommé `src/main.rs`, complétez les parties manquantes, et vérifiez que `cargo run` ne se bloque pas :

source: // Keep trying until we have both forks
fr_fr: // Réessayer jusqu’à ce que les deux fourchettes soient disponibles

source: // Make them think and eat
fr_fr: // Les faire penser et manger

source: Since this time you are using Async Rust, you'll need a `tokio` dependency. You can use the following `Cargo.toml`:
fr_fr: Puisque vous utilisez Async Rust, vous aurez besoin de la dépendance `tokio`. Vous pouvez utiliser ce `Cargo.toml` :

source: Also note that this time you have to use the `Mutex` and the `mpsc` module from the `tokio` crate.
fr_fr: Notez également que cette fois, vous devez utiliser le `Mutex` et le module `mpsc` de la crate `tokio`.

source: Can you make your implementation single-threaded?
fr_fr: Pouvez-vous rendre votre implémentation monothreadée ?

source: In this exercise, we want to use our new knowledge to implement a broadcast chat application. We have a chat server that the clients connect to and publish their messages. The client reads user messages from the standard input, and sends them to the server. The chat server broadcasts each message that it receives to all the clients.
fr_fr: Dans cet exercice, nous allons utiliser nos nouvelles connaissances pour implémenter une application de chat en diffusion. Un serveur de chat reçoit les connexions des clients et leurs messages. Le client lit les messages de l’utilisateur depuis l’entrée standard et les envoie au serveur. Le serveur diffuse ensuite chaque message reçu à tous les clients.

source: For this, we use [a broadcast channel](https://docs.rs/tokio/latest/tokio/sync/broadcast/fn.channel.html) on the server, and [`tokio_websockets`](https://docs.rs/tokio-websockets/) for the communication between the client and the server.
fr_fr: Pour cela, nous utilisons [un canal de diffusion](https://docs.rs/tokio/latest/tokio/sync/broadcast/fn.channel.html) sur le serveur, et [`tokio_websockets`](https://docs.rs/tokio-websockets/) pour la communication entre le client et le serveur.

source: Create a new Cargo project and add the following dependencies:
fr_fr: Créez un nouveau projet Cargo et ajoutez les dépendances suivantes :

source: The required APIs
fr_fr: Les API nécessaires

source: You are going to need the following functions from `tokio` and [`tokio_websockets`](https://docs.rs/tokio-websockets/). Spend a few minutes to familiarize yourself with the API.
fr_fr: Vous aurez besoin des fonctions suivantes de `tokio` et de [`tokio_websockets`](https://docs.rs/tokio-websockets/). Prenez quelques minutes pour vous familiariser avec leur API.

source: [StreamExt::next()](https://docs.rs/futures-util/0.3.28/futures_util/stream/trait.StreamExt.html#method.next) implemented by `WebSocketStream`: for asynchronously reading messages from a Websocket Stream.
fr_fr: [StreamExt::next()](https://docs.rs/futures-util/0.3.28/futures_util/stream/trait.StreamExt.html#method.next), implémentée par `WebSocketStream` : pour lire des messages de façon asynchrone à partir d’un flux WebSocket.

source: [SinkExt::send()](https://docs.rs/futures-util/0.3.28/futures_util/sink/trait.SinkExt.html#method.send) implemented by `WebSocketStream`: for asynchronously sending messages on a Websocket Stream.
fr_fr: [SinkExt::send()](https://docs.rs/futures-util/0.3.28/futures_util/sink/trait.SinkExt.html#method.send), implémentée par `WebSocketStream` : pour envoyer des messages de façon asynchrone sur un flux WebSocket.

source: [Lines::next_line()](https://docs.rs/tokio/latest/tokio/io/struct.Lines.html#method.next_line): for asynchronously reading user messages from the standard input.
fr_fr: [Lines::next_line()](https://docs.rs/tokio/latest/tokio/io/struct.Lines.html#method.next_line) : pour lire les messages utilisateur depuis l’entrée standard de manière asynchrone.

source: [Sender::subscribe()](https://docs.rs/tokio/latest/tokio/sync/broadcast/struct.Sender.html#method.subscribe): for subscribing to a broadcast channel.
fr_fr: [Sender::subscribe()](https://docs.rs/tokio/latest/tokio/sync/broadcast/struct.Sender.html#method.subscribe) : pour s’abonner à un canal de diffusion.

source: Two binaries
fr_fr: Deux binaires

source: Normally in a Cargo project, you can have only one binary, and one `src/main.rs` file. In this project, we need two binaries. One for the client, and one for the server. You could potentially make them two separate Cargo projects, but we are going to put them in a single Cargo project with two binaries. For this to work, the client and the server code should go under `src/bin` (see the [documentation](https://doc.rust-lang.org/cargo/reference/cargo-targets.html#binaries)).
fr_fr: Normalement, un projet Cargo contient un seul binaire avec un fichier `src/main.rs`. Ici, nous avons besoin de deux binaires : un pour le client et un pour le serveur. Vous pourriez en faire deux projets Cargo distincts, mais nous allons les inclure dans un même projet Cargo avec deux binaires. Pour cela, les fichiers du client et du serveur doivent être placés dans `src/bin` (voir la [documentation](https://doc.rust-lang.org/cargo/reference/cargo-targets.html#binaries)).

source: Copy the following server and client code into `src/bin/server.rs` and `src/bin/client.rs`, respectively. Your task is to complete these files as described below.
fr_fr: Copiez le code du serveur et du client ci-dessous dans `src/bin/server.rs` et `src/bin/client.rs` respectivement. Votre tâche est de compléter ces fichiers comme décrit ci-dessous.

source: // TODO: For a hint, see the description of the task below.
fr_fr: // TODO : Pour un indice, voir la description de la tâche ci-dessous.
