Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: // Set pin 28 low and pin 21 high to turn the LED on.
fr_fr: // Met la broche 28 à l'état bas et la broche 21 à l'état haut pour allumer la LED.

source: GPIO 0 pin 21 is connected to the first column of the LED matrix, and pin 28 to the first row.
fr_fr: La broche 21 du GPIO 0 est connectée à la première colonne de la matrice de LED, et la broche 28 à la première ligne.

source: Run the example with:
fr_fr: Exécutez l’exemple avec :

source: Peripheral Access Crates
fr_fr: Crates d’accès aux périphériques

source: [`svd2rust`](https://crates.io/crates/svd2rust) generates mostly-safe Rust wrappers for memory-mapped peripherals from [CMSIS-SVD](https://www.keil.com/pack/doc/CMSIS/SVD/html/index.html) files.
fr_fr: [`svd2rust`](https://crates.io/crates/svd2rust) génère des wrappers Rust relativement sûrs pour les périphériques mappés en mémoire à partir de fichiers [CMSIS-SVD](https://www.keil.com/pack/doc/CMSIS/SVD/html/index.html).

source: SVD (System View Description) files are XML files typically provided by silicon vendors which describe the memory map of the device.
fr_fr: Les fichiers SVD (System View Description) sont des fichiers XML, généralement fournis par les fabricants de puces, qui décrivent la carte mémoire du périphérique.

source: They are organised by peripheral, register, field and value, with names, descriptions, addresses and so on.
fr_fr: Ils sont organisés par périphérique, registre, champ et valeur, avec des noms, descriptions, adresses, etc.

source: SVD files are often buggy and incomplete, so there are various projects which patch the mistakes, add missing details, and publish the generated crates.
fr_fr: Les fichiers SVD sont souvent incomplets ou comportent des erreurs. Divers projets existent pour corriger ces défauts, ajouter les détails manquants et publier les crates générées.

source: `cortex-m-rt` provides the vector table, among other things.
fr_fr: `cortex-m-rt` fournit notamment la table des vecteurs.

source: If you `cargo install cargo-binutils` then you can run `cargo objdump --bin pac -- -d --no-show-raw-insn` to see the resulting binary.
fr_fr: Si vous exécutez `cargo install cargo-binutils`, vous pouvez ensuite lancer `cargo objdump --bin pac -- -d --no-show-raw-insn` pour voir le binaire généré.

source: HAL crates
fr_fr: Crates HAL

source: [HAL crates](https://github.com/rust-embedded/awesome-embedded-rust#hal-implementation-crates) for many microcontrollers provide wrappers around various peripherals. These generally implement traits from [`embedded-hal`](https://crates.io/crates/embedded-hal).
fr_fr: Les [crates HAL](https://github.com/rust-embedded/awesome-embedded-rust#hal-implementation-crates) pour de nombreux microcontrôleurs fournissent des wrappers autour de divers périphériques. Ils implémentent généralement les traits du crate [`embedded-hal`](https://crates.io/crates/embedded-hal).

source: // Create HAL wrapper for GPIO port 0.
fr_fr: // Crée un wrapper HAL pour le port GPIO 0.

source: `set_low` and `set_high` are methods on the `embedded_hal` `OutputPin` trait.
fr_fr: `set_low` et `set_high` sont des méthodes du trait `OutputPin` de `embedded-hal`.

source: HAL crates exist for many Cortex-M and RISC-V devices, including various STM32, GD32, nRF, NXP, MSP430, AVR and PIC microcontrollers.
fr_fr: Il existe des crates HAL pour de nombreux microcontrôleurs Cortex-M et RISC-V, y compris les gammes STM32, GD32, nRF, NXP, MSP430, AVR et PIC.

source: Board support crates
fr_fr: Crates de support de carte

source: Board support crates provide a further level of wrapping for a specific board for convenience.
fr_fr: Les crates de support de carte fournissent un niveau d’abstraction supplémentaire pour une carte spécifique, afin de faciliter son utilisation.

source: In this case the board support crate is just providing more useful names, and a bit of initialisation.
fr_fr: Dans ce cas, la crate de support se contente de fournir des noms plus explicites et un peu de code d’initialisation.

source: The crate may also include drivers for some on-board devices outside of the microcontroller itself.
fr_fr: La crate peut également inclure des pilotes pour certains composants intégrés à la carte mais externes au microcontrôleur lui-même.

source: `microbit-v2` includes a simple driver for the LED matrix.
fr_fr: `microbit-v2` inclut un pilote simple pour la matrice de LED.

source: The type state pattern
fr_fr: Le pattern d’état typé (type-state)

source: // let gpio0_01_again = gpio0.p0_01; // Error, moved.
fr_fr: // let gpio0_01_again = gpio0.p0_01; // Erreur, ownership déplacé.

source: // pin_input.is_high(); // Error, moved.
fr_fr: // pin_input.is_high(); // Erreur, ownership déplacé.

source: Pins don't implement `Copy` or `Clone`, so only one instance of each can exist. Once a pin is moved out of the port struct nobody else can take it.
fr_fr: Les broches n’implémentent pas `Copy` ou `Clone`, donc une seule instance de chaque peut exister. Une fois qu’une broche est déplacée hors de la structure du port, elle ne peut plus être utilisée ailleurs.

source: Changing the configuration of a pin consumes the old pin instance, so you can’t keep use the old instance afterwards.
fr_fr: Changer la configuration d’une broche consomme l’ancienne instance, ce qui empêche toute réutilisation de celle-ci.

source: The type of a value indicates the state that it is in: e.g. in this case, the configuration state of a GPIO pin. This encodes the state machine into the type system, and ensures that you don't try to use a pin in a certain way without properly configuring it first. Illegal state transitions are caught at compile time.
fr_fr: Le type d’une valeur reflète l’état dans lequel elle se trouve : dans ce cas, l’état de configuration d’une broche GPIO. Cela permet d’encoder la machine à états dans le système de types, empêchant l’utilisation d’une broche de manière incorrecte si elle n’a pas été configurée comme il faut. Les transitions d’état invalides sont ainsi détectées à la compilation.

source: You can call `is_high` on an input pin and `set_high` on an output pin, but not vice-versa.
fr_fr: On peut appeler `is_high` sur une broche configurée en entrée et `set_high` sur une broche configurée en sortie, mais pas l’inverse.

source: Many HAL crates follow this pattern.
fr_fr: De nombreuses crates HAL suivent ce pattern.

source: The [`embedded-hal`](https://crates.io/crates/embedded-hal) crate provides a number of traits covering common microcontroller peripherals.
fr_fr: Le crate [`embedded-hal`](https://crates.io/crates/embedded-hal) fournit un ensemble de traits couvrant les périphériques courants des microcontrôleurs.

source: Other crates then implement [drivers](https://github.com/rust-embedded/awesome-embedded-rust#driver-crates) in terms of these traits, e.g. an accelerometer driver might need an I2C or SPI bus implementation.
fr_fr: D'autres crates implémentent ensuite des [pilotes](https://github.com/rust-embedded/awesome-embedded-rust#driver-crates) à l'aide de ces traits. Par exemple, un pilote d'accéléromètre peut nécessiter une implémentation de bus I2C ou SPI.

source: There are implementations for many microcontrollers, as well as other platforms such as Linux on Raspberry Pi.
fr_fr: Il existe des implémentations pour de nombreux microcontrôleurs, ainsi que pour d'autres plateformes comme Linux sur Raspberry Pi.

source: There is work in progress on an `async` version of `embedded-hal`, but it isn't stable yet.
fr_fr: Une version `async` de `embedded-hal` est en cours de développement, mais elle n’est pas encore stable.

source: [probe-rs](https://probe.rs/) is a handy toolset for embedded debugging, like OpenOCD but better integrated.
fr_fr: [probe-rs](https://probe.rs/) est une boîte à outils pratique pour le débogage embarqué, similaire à OpenOCD mais mieux intégrée.

source: SWD (Serial Wire Debug) and JTAG via CMSIS-DAP, ST-Link and J-Link probes
fr_fr: SWD (Serial Wire Debug) et JTAG via les sondes CMSIS-DAP, ST-Link et J-Link

source: GDB stub and Microsoft DAP (Debug Adapter Protocol) server
fr_fr: Stub GDB et serveur DAP (Debug Adapter Protocol) de Microsoft

source: Cargo integration
fr_fr: Intégration avec Cargo

source: `cargo-embed` is a cargo subcommand to build and flash binaries, log RTT (Real Time Transfers) output and connect GDB. It's configured by an `Embed.toml` file in your project directory.
fr_fr: `cargo-embed` est une sous-commande de cargo permettant de compiler et flasher les binaires, de lire les journaux RTT (Real Time Transfers) et de se connecter à GDB. Il se configure via un fichier `Embed.toml` dans le répertoire du projet.

source: [CMSIS-DAP](https://arm-software.github.io/CMSIS_5/DAP/html/index.html) is an Arm standard protocol over USB for an in-circuit debugger to access the CoreSight Debug Access Port of various Arm Cortex processors. It's what the on-board debugger on the BBC micro:bit uses.
fr_fr: [CMSIS-DAP](https://arm-software.github.io/CMSIS_5/DAP/html/index.html) est un protocole standard Arm via USB permettant à un débogueur en circuit d’accéder au port de débogage CoreSight de différents processeurs Arm Cortex. C’est ce qu’utilise le débogueur intégré du BBC micro:bit.

source: ST-Link is a range of in-circuit debuggers from ST Microelectronics, J-Link is a range from SEGGER.
fr_fr: ST-Link est une gamme de débogueurs en circuit de STMicroelectronics, J-Link est une gamme proposée par SEGGER.

source: The Debug Access Port is usually either a 5-pin JTAG interface or 2-pin Serial Wire Debug.
fr_fr: Le port d’accès au débogage est généralement une interface JTAG à 5 broches ou un port SWD (Serial Wire Debug) à 2 broches.

source: probe-rs is a library which you can integrate into your own tools if you want to.
fr_fr: probe-rs est une bibliothèque que vous pouvez intégrer à vos propres outils si vous le souhaitez.

source: The [Microsoft Debug Adapter Protocol](https://microsoft.github.io/debug-adapter-protocol/) lets VSCode and other IDEs debug code running on any supported microcontroller.
fr_fr: Le [Debug Adapter Protocol](https://microsoft.github.io/debug-adapter-protocol/) de Microsoft permet à VSCode et à d'autres IDE de déboguer du code s'exécutant sur n’importe quel microcontrôleur compatible.

source: cargo-embed is a binary built using the probe-rs library.
fr_fr: `cargo-embed` est un binaire construit à l’aide de la bibliothèque probe-rs.

source: RTT (Real Time Transfers) is a mechanism to transfer data between the debug host and the target through a number of ringbuffers.
fr_fr: RTT (Real Time Transfers) est un mécanisme permettant de transférer des données entre l’hôte de débogage et la cible via des buffers circulaires.

source: In one terminal under `src/bare-metal/microcontrollers/examples/`:
fr_fr: Dans un terminal, sous `src/bare-metal/microcontrollers/examples/` :

source: In another terminal in the same directory:
fr_fr: Dans un autre terminal, dans le même répertoire :

source: On gLinux or Debian:
fr_fr: Sur gLinux ou Debian :

source: In GDB, try running:
fr_fr: Dans GDB, essayez d’exécuter :

source: Other projects
fr_fr: Autres projets

source: "Real-Time Interrupt-driven Concurrency"
fr_fr: "Concurrence en temps réel pilotée par interruptions"

source: Shared resource management, message passing, task scheduling, timer queue
fr_fr: Gestion des ressources partagées, échange de messages, planification des tâches, file d’attente de minuteries

source: `async` executors with priorities, timers, networking, USB
fr_fr: Exécuteurs `async` avec gestion des priorités, minuteries, réseau et USB

source: Security-focused RTOS with preemptive scheduling and Memory Protection Unit support
fr_fr: RTOS axé sur la sécurité avec planification préemptive et prise en charge de l’unité de protection mémoire (MPU)

source: Microkernel RTOS from Oxide Computer Company with memory protection, unprivileged drivers, IPC
fr_fr: RTOS à micro-noyau développé par Oxide Computer Company, avec protection mémoire, pilotes non privilégiés et communication inter-processus (IPC)

source: [Bindings for FreeRTOS](https://github.com/lobaro/FreeRTOS-rust)
fr_fr: [Bindings pour FreeRTOS](https://github.com/lobaro/FreeRTOS-rust)

source: Some platforms have `std` implementations, e.g. [esp-idf](https://esp-rs.github.io/book/overview/using-the-standard-library.html).
fr_fr: Certaines plateformes disposent d’implémentations de `std`, par exemple [esp-idf](https://esp-rs.github.io/book/overview/using-the-standard-library.html).

source: RTIC can be considered either an RTOS or a concurrency framework.
fr_fr: RTIC peut être considéré comme un RTOS ou comme un framework de concurrence.

source: It doesn't include any HALs.
fr_fr: Il n’inclut aucun HAL.

source: It uses the Cortex-M NVIC (Nested Virtual Interrupt Controller) for scheduling rather than a proper kernel.
fr_fr: Il utilise le NVIC (Nested Vectored Interrupt Controller) du Cortex-M pour la planification, au lieu d’un véritable noyau.

source: Cortex-M only.
fr_fr: Uniquement pour Cortex-M.

source: Google uses TockOS on the Haven microcontroller for Titan security keys.
fr_fr: Google utilise TockOS sur le microcontrôleur Haven pour ses clés de sécurité Titan.

source: FreeRTOS is mostly written in C, but there are Rust bindings for writing applications.
fr_fr: FreeRTOS est principalement écrit en C, mais il existe des bindings en Rust pour écrire des applications.

source: We will read the direction from an I2C compass, and log the readings to a serial port.
fr_fr: Nous allons lire la direction à partir d’une boussole I2C, et consigner les lectures sur un port série.

source: After looking at the exercises, you can look at the [solutions](solutions-morning.md) provided.
fr_fr: Après avoir consulté les exercices, vous pouvez regarder les [solutions](solutions-morning.md) proposées.

source: We will read the direction from an I2C compass, and log the readings to a serial port. If you have time, try displaying it on the LEDs somehow too, or use the buttons somehow.
fr_fr: Nous allons lire la direction depuis une boussole I2C et enregistrer les mesures sur un port série. Si vous avez le temps, essayez aussi de les afficher sur les LEDs d’une façon ou d’une autre, ou d’utiliser les boutons.

source: Hints:
fr_fr: Conseils :

source: Check the documentation for the [`lsm303agr`](https://docs.rs/lsm303agr/latest/lsm303agr/) and [`microbit-v2`](https://docs.rs/microbit-v2/latest/microbit/) crates, as well as the [micro:bit hardware](https://tech.microbit.org/hardware/).
fr_fr: Consultez la documentation des crates [`lsm303agr`](https://docs.rs/lsm303agr/latest/lsm303agr/) et [`microbit-v2`](https://docs.rs/microbit-v2/latest/microbit/), ainsi que celle du [matériel micro:bit](https://tech.microbit.org/hardware/).

source: The LSM303AGR Inertial Measurement Unit is connected to the internal I2C bus.
fr_fr: L’unité de mesure inertielle LSM303AGR est connectée au bus I2C interne.

source: TWI is another name for I2C, so the I2C master peripheral is called TWIM.
fr_fr: TWI est un autre nom pour I2C, donc le contrôleur maître I2C est appelé TWIM.

source: The LSM303AGR driver needs something implementing the `embedded_hal::blocking::i2c::WriteRead` trait. The [`microbit::hal::Twim`](https://docs.rs/microbit-v2/latest/microbit/hal/struct.Twim.html) struct implements this.
fr_fr: Le pilote LSM303AGR a besoin d’un objet implémentant le trait `embedded_hal::blocking::i2c::WriteRead`. La structure [`microbit::hal::Twim`](https://docs.rs/microbit-v2/latest/microbit/hal/struct.Twim.html) l’implémente.

source: You have a [`microbit::Board`](https://docs.rs/microbit-v2/latest/microbit/struct.Board.html) struct with fields for the various pins and peripherals.
fr_fr: Vous disposez d’une structure [`microbit::Board`](https://docs.rs/microbit-v2/latest/microbit/struct.Board.html) avec des champs représentant les différentes broches et périphériques.

source: You can also look at the [nRF52833 datasheet](https://infocenter.nordicsemi.com/pdf/nRF52833_PS_v1.5.pdf) if you want, but it shouldn't be necessary for this exercise.
fr_fr: Vous pouvez également consulter la [fiche technique du nRF52833](https://infocenter.nordicsemi.com/pdf/nRF52833_PS_v1.5.pdf) si vous le souhaitez, mais cela ne devrait pas être nécessaire pour cet exercice.

source: Download the [exercise template](../../comprehensive-rust-exercises.zip) and look in the `compass` directory for the following files.
fr_fr: Téléchargez le [modèle d’exercice](../../comprehensive-rust-exercises.zip) et examinez les fichiers dans le dossier `compass`.

source: _Cargo.toml_ (you shouldn't need to change this):
fr_fr: `Cargo.toml` (vous ne devriez pas avoir besoin de le modifier) :

source: _Embed.toml_ (you shouldn't need to change this):
fr_fr: _Embed.toml_ (vous ne devriez pas avoir besoin de le modifier) :

source: _.cargo/config.toml_ (you shouldn't need to change this):
fr_fr: `.cargo/config.toml` (vous ne devriez pas avoir besoin de le modifier) :

source: See the serial output on Linux with:
fr_fr: Affichez la sortie série sous Linux avec :

source: Or on Mac OS something like (the device name may be slightly different):
fr_fr: Ou sous macOS avec une commande semblable (le nom du périphérique peut légèrement varier) :

source: Use Ctrl+A Ctrl+Q to quit picocom.
fr_fr: Utilisez Ctrl+A suivi de Ctrl+Q pour quitter picocom.

source: Bare Metal Rust Morning Exercise
fr_fr: Exercice du matin avec Rust sur bare metal

source: ([back to exercise](compass.md))
fr_fr: ([retour à l'exercice](compass.md))

source: // Configure serial port.
fr_fr: // Configure le port série.

source: // Use the system timer as a delay provider.
fr_fr: // Utilise le timer système pour fournir un délai.

source: // Set up the I2C controller and Inertial Measurement Unit.
fr_fr: // Initialise le contrôleur I2C et l’unité de mesure inertielle (IMU).

source: "Setting up IMU..."
fr_fr: "Initialisation de l’IMU..."

source: // Set up display and timer.
fr_fr: // Initialise l’affichage et le timer.

source: "Ready."
fr_fr: "Prêt."

source: // Read compass data and log it to the serial port.
fr_fr: // Lit les données de la boussole et les envoie sur le port série.

source: // If button A is pressed, switch to the next mode and briefly blink all LEDs // on.
fr_fr: // Si le bouton A est pressé, passe au mode suivant et allume brièvement toutes les LEDs.

source: Application processors
fr_fr: Processeurs d’application

source: So far we've talked about microcontrollers, such as the Arm Cortex-M series. Now let's try writing something for Cortex-A. For simplicity we'll just work with QEMU's aarch64 ['virt'](https://qemu-project.gitlab.io/qemu/system/arm/virt.html) board.
fr_fr: Jusqu’à présent, nous avons parlé de microcontrôleurs comme la série Arm Cortex-M. Essayons maintenant d’écrire quelque chose pour Cortex-A. Pour simplifier, nous allons utiliser la carte aarch64 ['virt'](https://qemu-project.gitlab.io/qemu/system/arm/virt.html) de QEMU.

source: Broadly speaking, microcontrollers don't have an MMU or multiple levels of privilege (exception levels on Arm CPUs, rings on x86), while application processors do.
fr_fr: De manière générale, les microcontrôleurs ne disposent pas de MMU ni de plusieurs niveaux de privilèges (niveaux d’exception sur les CPU Arm, anneaux sur x86), contrairement aux processeurs d’application.

source: QEMU supports emulating various different machines or board models for each architecture. The 'virt' board doesn't correspond to any particular real hardware, but is designed purely for virtual machines.
fr_fr: QEMU permet d’émuler divers modèles de cartes pour chaque architecture. La carte 'virt' ne correspond à aucun matériel réel spécifique, elle est conçue uniquement pour les machines virtuelles.

source: Before we can start running Rust code, we need to do some initialisation.
fr_fr: Avant de pouvoir exécuter du code Rust, nous devons effectuer une initialisation.

source: ```armasm .section .init.entry, "ax" .global entry entry: /* * Load and apply the memory management configuration, ready to enable MMU and * caches. */ adrp x30, idmap msr ttbr0_el1, x30 mov_i x30, .Lmairval msr mair_el1, x30 mov_i x30, .Ltcrval /* Copy the supported PA range into TCR_EL1.IPS. */ mrs x29, id_aa64mmfr0_el1 bfi x30, x29, #32, #4 msr tcr_el1, x30 mov_i x30, .Lsctlrval /* * Ensure everything before this point has completed, then invalidate any * potentially stale local TLB entries before they start being used. */ isb tlbi vmalle1 ic iallu dsb nsh isb /* * Configure sctlr_el1 to enable MMU and cache and don't proceed until this * has completed. */ msr sctlr_el1, x30 isb /* Disable trapping floating point access in EL1. */ mrs x30, cpacr_el1 orr x30, x30, #(0x3 << 20) msr cpacr_el1, x30 isb /* Zero out the bss section. */ adr_l x29, bss_begin adr_l x30, bss_end 0: cmp x29, x30 b.hs 1f stp xzr, xzr, [x29], #16 b 0b 1: /* Prepare the stack. */ adr_l x30, boot_stack_end mov sp, x30 /* Set up exception vector. */ adr x30, vector_table_el1 msr vbar_el1, x30 /* Call into Rust code. */ bl main /* Loop forever waiting for interrupts. */ 2: wfi b 2b ```
fr_fr: ```armasm .section .init.entry, "ax" .global entry entry: /* * Charger et appliquer la configuration de gestion mémoire, prêt à activer la MMU et * les caches. */ adrp x30, idmap msr ttbr0_el1, x30 mov_i x30, .Lmairval msr mair_el1, x30 mov_i x30, .Ltcrval /* Copier l'étendue PA prise en charge dans TCR_EL1.IPS. */ mrs x29, id_aa64mmfr0_el1 bfi x30, x29, #32, #4 msr tcr_el1, x30 mov_i x30, .Lsctlrval /* * S'assurer que tout ce qui précède est terminé, puis invalider les * éventuelles entrées TLB locales obsolètes avant qu'elles ne soient utilisées. */ isb tlbi vmalle1 ic iallu dsb nsh isb /* * Configurer sctlr_el1 pour activer la MMU et le cache, et ne pas continuer avant que cela * ne soit terminé. */ msr sctlr_el1, x30 isb /* Désactiver le piégeage de l'accès aux flottants en EL1. */ mrs x30, cpacr_el1 orr x30, x30, #(0x3 << 20) msr cpacr_el1, x30 isb /* Remettre à zéro la section bss. */ adr_l x29, bss_begin adr_l x30, bss_end 0: cmp x29, x30 b.hs 1f stp xzr, xzr, [x29], #16 b 0b 1: /* Préparer la pile. */ adr_l x30, boot_stack_end mov sp, x30 /* Configurer le vecteur d’exceptions. */ adr x30, vector_table_el1 msr vbar_el1, x30 /* Appeler le code Rust. */ bl main /* Boucle infinie en attente d’interruptions. */ 2: wfi b 2b ```

source: This is the same as it would be for C: initialising the processor state, zeroing the BSS, and setting up the stack pointer.
fr_fr: C’est identique à ce que l’on ferait en C : initialiser l’état du processeur, mettre à zéro la section BSS et configurer le pointeur de pile.

source: The BSS (block starting symbol, for historical reasons) is the part of the object file which containing statically allocated variables which are initialised to zero. They are omitted from the image, to avoid wasting space on zeroes. The compiler assumes that the loader will take care of zeroing them.
fr_fr: La BSS (block starting symbol, pour des raisons historiques) est la section du fichier objet contenant les variables statiques initialisées à zéro. Elle est omise dans l’image binaire pour ne pas gaspiller d’espace avec des zéros. Le compilateur suppose que le chargeur s’occupera de les remettre à zéro.

source: The BSS may already be zeroed, depending on how memory is initialised and the image is loaded, but we zero it to be sure.
fr_fr: La BSS peut déjà être mise à zéro, selon la manière dont la mémoire est initialisée et l’image chargée, mais nous la réinitialisons pour garantir la cohérence.

source: We need to enable the MMU and cache before reading or writing any memory. If we don't:
fr_fr: Nous devons activer la MMU et le cache avant de lire ou d’écrire en mémoire. Sinon :
