Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: "Based on the wire type, build a Field, consuming as many bytes as necessary."
fr_fr: "En fonction du type d’encodage, construit un champ en consommant le nombre d’octets requis."

source: "Return the field, and any un-consumed bytes."
fr_fr: "Retourne le champ et les octets non consommés."

source: /// Parse a message in the given data, calling `T::add_field` for each field in /// the message. /// /// The entire input is consumed.
fr_fr: /// Analyse un message dans les données fournies, appelant `T::add_field` pour chaque champ du message. /// /// L’entrée entière est consommée.

source: // TODO: Implement ProtoMessage for Person and PhoneNumber.
fr_fr: // TODO : implémenter ProtoMessage pour Person et PhoneNumber.

source: // Unwrap error because `value` is definitely 4 bytes long.
fr_fr: // Pas d’erreur attendue car `value` contient bien 4 octets.

source: // skip everything else
fr_fr: // ignorer tout le reste

source: Welcome to Day 4
fr_fr: Bienvenue au jour 4

source: Today we will cover topics relating to building large-scale software in Rust:
fr_fr: Aujourd’hui, nous aborderons des sujets liés à la construction de logiciels à grande échelle en Rust :

source: Iterators: a deep dive on the `Iterator` trait.
fr_fr: Itérateurs : plongée approfondie dans le trait `Iterator`.

source: Modules and visibility.
fr_fr: Modules et visibilité.

source: Testing.
fr_fr: Tests.

source: Error handling: panics, `Result`, and the try operator `?`.
fr_fr: Gestion des erreurs : panique (`panic`), `Result`, et l’opérateur `?`.

source: Unsafe Rust: the escape hatch when you can't express yourself in safe Rust.
fr_fr: Rust non sécurisé (`unsafe`) : l’échappatoire quand le Rust sécurisé est insuffisant.

source: The [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html) trait supports iterating over values in a collection. It requires a `next` method and provides lots of methods. Many standard library types implement `Iterator`, and you can implement it yourself, too:
fr_fr: Le trait [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html) permet d’itérer sur les valeurs d’une collection. Il nécessite une méthode `next` et fournit de nombreuses méthodes. De nombreux types de la bibliothèque standard implémentent `Iterator`, et vous pouvez en définir un vous-même :

source: The `Iterator` trait implements many common functional programming operations over collections (e.g. `map`, `filter`, `reduce`, etc). This is the trait where you can find all the documentation about them. In Rust these functions should produce the code as efficient as equivalent imperative implementations.
fr_fr: Le trait `Iterator` implémente de nombreuses opérations classiques de programmation fonctionnelle sur des collections (par exemple `map`, `filter`, `reduce`, etc.). C’est dans ce trait que vous trouverez toute la documentation les concernant. En Rust, ces fonctions doivent produire un code aussi efficace que les implémentations impératives équivalentes.

source: `IntoIterator` is the trait that makes for loops work. It is implemented by collection types such as `Vec<T>` and references to them such as `&Vec<T>` and `&[T]`. Ranges also implement it. This is why you can iterate over a vector with `for i in some_vec { .. }` but `some_vec.next()` doesn't exist.
fr_fr: `IntoIterator` est le trait qui permet aux boucles `for` de fonctionner. Il est implémenté par les types de collection comme `Vec<T>` ainsi que par leurs références (`&Vec<T>`, `&[T]`). Les plages (`Ranges`) l’implémentent aussi. C’est pourquoi vous pouvez itérer sur un vecteur avec `for i in some_vec { .. }` alors que `some_vec.next()` n’existe pas.

source: The `Iterator` trait tells you how to _iterate_ once you have created an iterator. The related trait [`IntoIterator`](https://doc.rust-lang.org/std/iter/trait.IntoIterator.html) defines how to create an iterator for a type. It is used automatically by the `for` loop.
fr_fr: Le trait `Iterator` décrit comment _itérer_ une fois l’itérateur créé. Le trait associé [`IntoIterator`](https://doc.rust-lang.org/std/iter/trait.IntoIterator.html) définit comment créer un itérateur pour un type. Il est utilisé automatiquement par la boucle `for`.

source: Click through to the docs for `IntoIterator`. Every implementation of `IntoIterator` must declare two types:
fr_fr: Consultez la documentation de `IntoIterator`. Chaque implémentation de ce trait doit déclarer deux types :

source: `Item`: the type to iterate over, such as `i8`,
fr_fr: `Item` : le type à itérer, par exemple `i8`,

source: `IntoIter`: the `Iterator` type returned by the `into_iter` method.
fr_fr: `IntoIter` : le type `Iterator` renvoyé par la méthode `into_iter`.

source: Note that `IntoIter` and `Item` are linked: the iterator must have the same `Item` type, which means that it returns `Option<Item>`
fr_fr: Notez que `IntoIter` et `Item` sont liés : l’itérateur doit avoir le même type `Item`, ce qui signifie qu’il retourne `Option<Item>`

source: The example iterates over all combinations of x and y coordinates.
fr_fr: Cet exemple itère sur toutes les combinaisons des coordonnées x et y.

source: Try iterating over the grid twice in `main`. Why does this fail? Note that `IntoIterator::into_iter` takes ownership of `self`.
fr_fr: Essayez d’itérer deux fois sur la grille dans `main`. Pourquoi cela échoue-t-il ? Remarquez que `IntoIterator::into_iter` prend possession de `self`.

source: Fix this issue by implementing `IntoIterator` for `&Grid` and storing a reference to the `Grid` in `GridIter`.
fr_fr: Corrigez cela en implémentant `IntoIterator` pour `&Grid` et en stockant une référence vers `Grid` dans `GridIter`.

source: The same problem can occur for standard library types: `for e in some_vector` will take ownership of `some_vector` and iterate over owned elements from that vector. Use `for e in &some_vector` instead, to iterate over references to elements of `some_vector`.
fr_fr: Le même problème peut survenir avec les types de la bibliothèque standard : `for e in some_vector` prend possession de `some_vector` et itère sur ses éléments. Utilisez `for e in &some_vector` pour itérer sur des références aux éléments.

source: [`FromIterator`](https://doc.rust-lang.org/std/iter/trait.FromIterator.html) lets you build a collection from an [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html).
fr_fr: [`FromIterator`](https://doc.rust-lang.org/std/iter/trait.FromIterator.html) vous permet de construire une collection à partir d’un [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html).

source: `Iterator` implements
fr_fr: `Iterator` implémente

source: There are two ways to specify `B` for this method:
fr_fr: Il existe deux façons de spécifier `B` pour cette méthode :

source: With the "turbofish": `some_iterator.collect::<COLLECTION_TYPE>()`, as shown. The `_` shorthand used here lets Rust infer the type of the `Vec` elements.
fr_fr: Avec la notation dite « turbofish » : `some_iterator.collect::<COLLECTION_TYPE>()`, comme illustré. Le raccourci `_` permet à Rust d’inférer le type des éléments du `Vec`.

source: With type inference: `let prime_squares: Vec<_> = some_iterator.collect()`. Rewrite the example to use this form.
fr_fr: En utilisant l’inférence : `let prime_squares: Vec<_> = some_iterator.collect()`. Réécrivez l’exemple avec cette forme.

source: There are basic implementations of `FromIterator` for `Vec`, `HashMap`, etc. There are also more specialized implementations which let you do cool things like convert an `Iterator<Item = Result<V, E>>` into a `Result<Vec<V>, E>`.
fr_fr: Il existe des implémentations de base de `FromIterator` pour `Vec`, `HashMap`, etc. Il existe aussi des implémentations plus spécialisées permettant par exemple de convertir un `Iterator<Item = Result<V, E>>` en un `Result<Vec<V>, E>`.

source: In this exercise, you will need to find and use some of the provided methods in the [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html) trait to implement a complex calculation.
fr_fr: Dans cet exercice, vous devrez trouver et utiliser certaines des méthodes fournies par le trait [`Iterator`](https://doc.rust-lang.org/std/iter/trait.Iterator.html) pour implémenter un calcul complexe.

source: Copy the following code to <https://play.rust-lang.org/> and make the tests pass. Use an iterator expression and `collect` the result to construct the return value.
fr_fr: Copiez le code suivant sur <https://play.rust-lang.org/> et faites passer les tests. Utilisez une expression d’itérateur et `collect` pour construire la valeur de retour.

source: /// Calculate the differences between elements of `values` offset by `offset`, /// wrapping around from the end of `values` to the beginning. /// /// Element `n` of the result is `values[(n+offset)%len] - values[n]`.
fr_fr: /// Calcule les différences entre les éléments de `values` avec un décalage `offset`, /// en revenant au début après la fin de `values`. /// /// L’élément `n` du résultat est `values[(n+offset)%len] - values[n]`.

source: We have seen how `impl` blocks let us namespace functions to a type.
fr_fr: Nous avons vu comment les blocs `impl` nous permettent d’associer des fonctions à un type.

source: Similarly, `mod` lets us namespace types and functions:
fr_fr: De même, `mod` nous permet d’organiser les types et fonctions dans des espaces de noms :

source: "In the foo module"
fr_fr: "Dans le module foo"

source: "In the bar module"
fr_fr: "Dans le module bar"

source: Packages provide functionality and include a `Cargo.toml` file that describes how to build a bundle of 1+ crates.
fr_fr: Les paquets fournissent des fonctionnalités et incluent un fichier `Cargo.toml` qui décrit comment construire un ensemble d’un ou plusieurs crates.

source: Crates are a tree of modules, where a binary crate creates an executable and a library crate compiles to a library.
fr_fr: Les crates sont des arbres de modules : un crate binaire produit un exécutable, et un crate bibliothèque est compilé en une bibliothèque.

source: Modules define organization, scope, and are the focus of this section.
fr_fr: Les modules définissent l’organisation, la portée, et constituent le sujet principal de cette section.

source: Omitting the module content will tell Rust to look for it in another file:
fr_fr: Omettre le contenu d’un module indique à Rust de le chercher dans un autre fichier :

source: This tells rust that the `garden` module content is found at `src/garden.rs`. Similarly, a `garden::vegetables` module can be found at `src/garden/vegetables.rs`.
fr_fr: Cela indique à Rust que le contenu du module `garden` se trouve dans `src/garden.rs`. De même, le module `garden::vegetables` se trouve dans `src/garden/vegetables.rs`.

source: The `crate` root is in:
fr_fr: La racine du crate se trouve dans :

source: `src/lib.rs` (for a library crate)
fr_fr: `src/lib.rs` (pour un crate bibliothèque)

source: `src/main.rs` (for a binary crate)
fr_fr: `src/main.rs` (pour un crate binaire)

source: Modules defined in files can be documented, too, using "inner doc comments". These document the item that contains them -- in this case, a module.
fr_fr: Les modules définis dans des fichiers peuvent aussi être documentés à l’aide de « commentaires de documentation internes ». Ceux-ci documentent l’élément qui les contient — ici, un module.

source: //! This module implements the garden, including a highly performant germination //! implementation.
fr_fr: //! Ce module implémente le jardin, y compris une germination très //! performante.

source: // Re-export types from this module.
fr_fr: // Réexporter les types de ce module.

source: /// Sow the given seed packets.
fr_fr: /// Sème les paquets de graines fournis.

source: /// Harvest the produce in the garden that is ready.
fr_fr: /// Récolte les produits du jardin qui sont prêts.

source: Before Rust 2018, modules needed to be located at `module/mod.rs` instead of `module.rs`, and this is still a working alternative for editions after 2018.
fr_fr: Avant Rust 2018, les modules devaient se trouver dans `module/mod.rs` au lieu de `module.rs`, et cela reste une alternative valable dans les éditions postérieures.

source: The main reason to introduce `filename.rs` as alternative to `filename/mod.rs` was because many files named `mod.rs` can be hard to distinguish in IDEs.
fr_fr: La raison principale d’introduire `nom_fichier.rs` comme alternative à `nom_fichier/mod.rs` est que les nombreux fichiers `mod.rs` sont difficiles à différencier dans les IDE.

source: Deeper nesting can use folders, even if the main module is a file:
fr_fr: Une structure plus profonde peut utiliser des dossiers, même si le module principal est un fichier :

source: The place rust will look for modules can be changed with a compiler directive:
fr_fr: L’endroit où Rust cherche les modules peut être modifié avec une directive du compilateur :

source: This is useful, for example, if you would like to place tests for a module in a file named `some_module_test.rs`, similar to the convention in Go.
fr_fr: Ceci est utile, par exemple, si vous souhaitez placer des tests pour un module dans un fichier nommé `some_module_test.rs`, comme c’est courant en Go.

source: Modules are a privacy boundary:
fr_fr: Les modules définissent une frontière de visibilité :

source: Module items are private by default (hides implementation details).
fr_fr: Les éléments d’un module sont privés par défaut (ce qui masque les détails d’implémentation).

source: Parent and sibling items are always visible.
fr_fr: Les éléments parents et frères sont toujours visibles entre eux.

source: In other words, if an item is visible in module `foo`, it's visible in all the descendants of `foo`.
fr_fr: Autrement dit, si un élément est visible dans le module `foo`, il est visible dans tous les modules descendants de `foo`.

source: Use the `pub` keyword to make modules public.
fr_fr: Utilisez le mot-clé `pub` pour rendre des modules publics.

source: Additionally, there are advanced `pub(...)` specifiers to restrict the scope of public visibility.
fr_fr: Il existe aussi des spécificateurs avancés `pub(...)` pour restreindre la portée de la visibilité publique.

source: See the [Rust Reference](https://doc.rust-lang.org/reference/visibility-and-privacy.html#pubin-path-pubcrate-pubsuper-and-pubself).
fr_fr: Voir la [Référence Rust](https://doc.rust-lang.org/reference/visibility-and-privacy.html#pubin-path-pubcrate-pubsuper-and-pubself).

source: Configuring `pub(crate)` visibility is a common pattern.
fr_fr: Configurer la visibilité avec `pub(crate)` est une pratique courante.

source: Less commonly, you can give visibility to a specific path.
fr_fr: Plus rarement, il est possible de donner une visibilité à un chemin spécifique.

source: In any case, visibility must be granted to an ancestor module (and all of its descendants).
fr_fr: Dans tous les cas, la visibilité doit être accordée à un module ancêtre (et à tous ses descendants).

source: A module can bring symbols from another module into scope with `use`. You will typically see something like this at the top of each module:
fr_fr: Un module peut importer des symboles d’un autre module dans sa portée avec `use`. On voit souvent ce genre d’instruction en haut des modules :

source: Paths
fr_fr: Chemins

source: Paths are resolved as follows:
fr_fr: Les chemins sont résolus comme suit :

source: As a relative path:
fr_fr: Comme chemin relatif :

source: `foo` or `self::foo` refers to `foo` in the current module,
fr_fr: `foo` ou `self::foo` fait référence à `foo` dans le module actuel,

source: `super::foo` refers to `foo` in the parent module.
fr_fr: `super::foo` fait référence à `foo` dans le module parent.

source: As an absolute path:
fr_fr: Comme chemin absolu :

source: `crate::foo` refers to `foo` in the root of the current crate,
fr_fr: `crate::foo` fait référence à `foo` à la racine du crate actuel,

source: `bar::foo` refers to `foo` in the `bar` crate.
fr_fr: `bar::foo` fait référence à `foo` dans le crate `bar`.

source: It is common to "re-export" symbols at a shorter path. For example, the top-level `lib.rs` in a crate might have
fr_fr: Il est courant de « réexporter » des symboles via un chemin plus court. Par exemple, le fichier `lib.rs` à la racine d’un crate peut contenir

source: making `DiskStorage` and `NetworkStorage` available to other crates with a convenient, short path.
fr_fr: ce qui rend `DiskStorage` et `NetworkStorage` disponibles pour d’autres crates avec un chemin pratique et court.

source: For the most part, only items that appear in a module need to be `use`'d. However, a trait must be in scope to call any methods on that trait, even if a type implementing that trait is already in scope. For example, to use the `read_to_string` method on a type implementing the `Read` trait, you need to `use std::io::Read`.
fr_fr: En général, seuls les éléments définis dans un module doivent être importés avec `use`. Toutefois, un trait doit être en portée pour pouvoir appeler ses méthodes, même si un type l’implémente déjà. Par exemple, pour utiliser `read_to_string` sur un type implémentant le trait `Read`, vous devez ajouter `use std::io::Read`.

source: The `use` statement can have a wildcard: `use std::io::*`. This is discouraged because it is not clear which items are imported, and those might change over time.
fr_fr: L’instruction `use` peut utiliser un joker : `use std::io::*`. Cela est déconseillé, car on ne voit pas clairement quels éléments sont importés, et cela peut évoluer.

source: In this exercise, you will reorganize a small GUI Library implementation. This library defines a `Widget` trait and a few implementations of that trait, as well as a `main` function.
fr_fr: Dans cet exercice, vous allez réorganiser une petite bibliothèque GUI. Elle définit un trait `Widget` et quelques implémentations, ainsi qu’une fonction `main`.

source: It is typical to put each type or set of closely-related types into its own module, so each widget type should get its own module.
fr_fr: Il est courant de placer chaque type, ou groupe de types liés, dans son propre module ; chaque type de widget devrait donc avoir son propre module.

source: Cargo Setup
fr_fr: Configuration de Cargo

source: The Rust playground only supports one file, so you will need to make a Cargo project on your local filesystem:
fr_fr: Le Rust Playground ne supporte qu’un seul fichier, vous devrez donc créer un projet Cargo sur votre système local :

source: Edit the resulting `src/main.rs` to add `mod` statements, and add additional files in the `src` directory.
fr_fr: Modifiez le `src/main.rs` pour y ajouter les instructions `mod`, et ajoutez des fichiers dans le dossier `src`.

source: Here's the single-module implementation of the GUI library:
fr_fr: Voici l’implémentation monofichier de la bibliothèque GUI :

source: /// Natural width of `self`.
fr_fr: /// Largeur naturelle de `self`.

source: /// Draw the widget into a buffer.
fr_fr: /// Dessine le widget dans un tampon.

source: /// Draw the widget on standard output.
fr_fr: /// Dessine le widget sur la sortie standard.

source: // Add 4 paddings for borders
fr_fr: // Ajouter 4 espaces pour les bordures

source: // TODO: Change draw_into to return Result<(), std::fmt::Error>. Then use the // ?-operator here instead of .unwrap().
fr_fr: // TODO : Modifier draw_into pour qu’il retourne Result<(), std::fmt::Error>. // Utiliser ensuite l’opérateur `?` au lieu de `.unwrap()`.

source: // add a bit of padding
fr_fr: // ajouter un peu d’espace

source: "This is a small text GUI demo."
fr_fr: "Ceci est une petite démo d’interface graphique en mode texte."

source: "Click me!"
fr_fr: "Clique-moi !"

source: Encourage students to divide the code in a way that feels natural for them, and get accustomed to the required `mod`, `use`, and `pub` declarations. Afterward, discuss what organizations are most idiomatic.
fr_fr: Encourager les étudiants à organiser le code comme cela leur semble naturel, et à se familiariser avec les instructions `mod`, `use` et `pub`. Ensuite, discuter des organisations les plus idiomatiques.

source: // ANCHOR_END: Window-width // Add 4 paddings for borders
fr_fr: // ANCHOR_END: Window-width // Ajouter 4 espacements pour les bordures

source: // TODO: after learning about error handling, you can change // draw_into to return Result<(), std::fmt::Error>. Then use // the ?-operator here instead of .unwrap().
fr_fr: // TODO : après avoir appris la gestion des erreurs, vous pouvez modifier // draw_into pour qu’elle retourne Result<(), std::fmt::Error>, // puis utiliser l’opérateur ? ici à la place de .unwrap().

source: Unit Tests
fr_fr: Tests unitaires

source: Rust and Cargo come with a simple unit test framework:
fr_fr: Rust et Cargo incluent un framework de tests unitaires simple :

source: Unit tests are supported throughout your code.
fr_fr: Les tests unitaires sont pris en charge dans tout votre code.

source: Integration tests are supported via the `tests/` directory.
fr_fr: Les tests d’intégration sont pris en charge via le répertoire `tests/`.

source: Tests are marked with `#[test]`. Unit tests are often put in a nested `tests` module, using `#[cfg(test)]` to conditionally compile them only when building tests.
fr_fr: Les tests sont marqués avec `#[test]`. Les tests unitaires sont souvent placés dans un module `tests` imbriqué, en utilisant `#[cfg(test)]` pour les compiler uniquement lors des tests.

source: This lets you unit test private helpers.
fr_fr: Cela permet de tester unitairement les fonctions auxiliaires privées.

source: The `#[cfg(test)]` attribute is only active when you run `cargo test`.
fr_fr: L’attribut `#[cfg(test)]` n’est actif que lorsque vous exécutez `cargo test`.

source: Run the tests in the playground in order to show their results.
fr_fr: Exécuter les tests dans le playground pour afficher leurs résultats.

source: Integration Tests
fr_fr: Tests d'intégration

source: If you want to test your library as a client, use an integration test.
fr_fr: Pour tester votre bibliothèque comme un client, utilisez un test d’intégration.

source: Create a `.rs` file under `tests/`:
fr_fr: Créez un fichier `.rs` dans le répertoire `tests/` :

source: These tests only have access to the public API of your crate.
fr_fr: Ces tests ont uniquement accès à l’API publique de votre crate.

source: Documentation Tests
fr_fr: Tests de documentation

source: Rust has built-in support for documentation tests:
fr_fr: Rust prend en charge nativement les tests de documentation :

source: /// Shortens a string to the given length. /// /// ``` /// # use playground::shorten_string; /// assert_eq!(shorten_string("Hello World", 5), "Hello"); /// assert_eq!(shorten_string("Hello World", 20), "Hello World"); /// ```
fr_fr: /// Raccourcit une chaîne à la longueur donnée. /// /// ``` /// # use playground::shorten_string; /// assert_eq!(shorten_string(\Hello World\, 5), \Hello\); /// assert_eq!(shorten_string(\Hello World\, 20), \Hello World\); /// ```

source: Code blocks in `///` comments are automatically seen as Rust code.
fr_fr: Les blocs de code dans les commentaires `///` sont automatiquement interprétés comme du code Rust.

source: The code will be compiled and executed as part of `cargo test`.
fr_fr: Ce code sera compilé et exécuté dans le cadre de `cargo test`.

source: Adding `#` in the code will hide it from the docs, but will still compile/run it.
fr_fr: Ajouter `#` dans le code le masquera dans la documentation, mais il sera toujours compilé/exécuté.
