Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: On the day of your course, show up to the room a little early to set things up. We recommend presenting directly using `mdbook serve` running on your laptop (see the [installation instructions](https://github.com/google/comprehensive-rust#building)). This ensures optimal performance with no lag as you change pages. Using your laptop will also allow you to fix typos as you or the course participants spot them.
fr_fr: Le jour J, arrivez un peu en avance pour installer votre environnement. Il est recommandé de présenter directement avec `mdbook serve` depuis votre ordinateur portable (voir les [instructions d’installation](https://github.com/google/comprehensive-rust#building)). Cela garantit une performance optimale sans décalage lors du changement de page. En utilisant votre ordinateur, vous pourrez aussi corriger les éventuelles fautes repérées pendant la session.

source: Let people solve the exercises by themselves or in small groups. We typically spend 30-45 minutes on exercises in the morning and in the afternoon (including time to review the solutions). Make sure to ask people if they're stuck or if there is anything you can help with. When you see that several people have the same problem, call it out to the class and offer a solution, e.g., by showing people where to find the relevant information in the standard library.
fr_fr: Laissez les participants résoudre les exercices seuls ou en petits groupes. En général, 30 à 45 minutes sont consacrées aux exercices le matin et l’après-midi (révision des solutions comprise). N’hésitez pas à aller vers les participants pour vérifier s’ils sont bloqués ou s’ils ont besoin d’aide. Si un problème revient fréquemment, signalez-le à toute la classe et proposez une solution, par exemple en montrant où trouver l’information pertinente dans la bibliothèque standard.

source: That is all, good luck running the course! We hope it will be as much fun for you as it has been for us!
fr_fr: C’est tout, bon courage pour l’animation du cours ! Nous espérons que vous prendrez autant de plaisir que nous !

source: Please [provide feedback](https://github.com/google/comprehensive-rust/discussions/86) afterwards so that we can keep improving the course. We would love to hear what worked well for you and what can be made better. Your students are also very welcome to [send us feedback](https://github.com/google/comprehensive-rust/discussions/100)!
fr_fr: Merci de bien vouloir [nous faire part de vos retours](https://github.com/google/comprehensive-rust/discussions/86) afin que nous puissions continuer à améliorer le cours. Nous serions ravis de savoir ce qui a bien fonctionné et ce qui pourrait être amélioré. Vos étudiants peuvent également [nous envoyer leurs retours](https://github.com/google/comprehensive-rust/discussions/100) !

source: Rust Fundamentals
fr_fr: Fondamentaux de Rust

source: The first four days make up [Rust Fundamentals](../welcome-day-1.md). The days are fast paced and we cover a lot of ground!
fr_fr: Les quatre premiers jours forment le module [Fondamentaux de Rust](../welcome-day-1.md). Le rythme y est soutenu et nous abordons une grande quantité de sujets !

source: Deep Dives
fr_fr: Approfondissements

source: In addition to the 4-day class on Rust Fundamentals, we cover some more specialized topics:
fr_fr: En plus des quatre jours consacrés aux Fondamentaux de Rust, nous abordons également certains sujets plus spécialisés :

source: Rust in Android
fr_fr: Rust pour Android

source: The [Rust in Android](../android.md) deep dive is a half-day course on using Rust for Android platform development. This includes interoperability with C, C++, and Java.
fr_fr: [Rust pour Android](../android.md) est une session de formation d’une demi-journée consacrée à l’usage de Rust dans le développement sur la plateforme Android. Elle couvre notamment l’interopérabilité avec C, C++ et Java.

source: You will need an [AOSP checkout](https://source.android.com/docs/setup/download/downloading). Make a checkout of the [course repository](https://github.com/google/comprehensive-rust) on the same machine and move the `src/android/` directory into the root of your AOSP checkout. This will ensure that the Android build system sees the `Android.bp` files in `src/android/`.
fr_fr: Vous aurez besoin d’un [checkout AOSP](https://source.android.com/docs/setup/download/downloading). Clonez également le [dépôt du cours](https://github.com/google/comprehensive-rust) sur la même machine, puis déplacez le dossier `src/android/` à la racine de votre checkout AOSP. Cela permettra au système de compilation Android de trouver les fichiers `Android.bp` dans `src/android/`.

source: Ensure that `adb sync` works with your emulator or real device and pre-build all Android examples using `src/android/build_all.sh`. Read the script to see the commands it runs and make sure they work when you run them by hand.
fr_fr: Assurez-vous que la commande `adb sync` fonctionne avec votre émulateur ou appareil réel, et précompilez tous les exemples Android via le script `src/android/build_all.sh`. Examinez le script pour comprendre les commandes exécutées et vérifiez qu’elles fonctionnent également lorsque vous les exécutez manuellement.

source: Rust in Chromium
fr_fr: Rust pour Chromium

source: The [Rust in Chromium](../chromium.md) deep dive is a half-day course on using Rust as part of the Chromium browser. It includes using Rust in Chromium's `gn` build system, bringing in third-party libraries ("crates") and C++ interoperability.
fr_fr: [Rust pour Chromium](../chromium.md) est une formation d’une demi-journée sur l’intégration de Rust dans le navigateur Chromium. Elle couvre l’usage de Rust dans le système de build `gn`, l’ajout de bibliothèques tierces (crates), et l’interopérabilité avec C++.

source: You will need to be able to build Chromium --- a debug, component build is [recommended](../chromium/setup.md) for speed but any build will work. Ensure that you can run the Chromium browser that you've built.
fr_fr: Vous devez être en mesure de compiler Chromium. Une compilation en mode débogage et par composants est [recommandée](../chromium/setup.md) pour plus de rapidité, mais toute compilation fonctionnera. Assurez-vous que le navigateur Chromium compilé fonctionne correctement.

source: The [Bare-Metal Rust](../bare-metal.md) deep dive is a full day class on using Rust for bare-metal (embedded) development. Both microcontrollers and application processors are covered.
fr_fr: [Bare-metal Rust](../bare-metal.md) est un cours d'une journée consacré à l'utilisation de Rust pour le développement embarqué. Le cours touche à la fois aux microcontrôleurs et aux processeurs d'applications.

source: For the microcontroller part, you will need to buy the [BBC micro:bit](https://microbit.org/) v2 development board ahead of time. Everybody will need to install a number of packages as described on the [welcome page](../bare-metal.md).
fr_fr: Pour la partie microcontrôleurs, vous devrez acheter la carte de développement [BBC micro:bit](https://microbit.org/) v2 avant de commencer. Tous les participants à ce cours devront installer les paquets listés sur [la page de bienvenue](../bare-metal.md) du cours.

source: Concurrency in Rust
fr_fr: Programmation concurrente en Rust

source: The [Concurrency in Rust](../concurrency.md) deep dive is a full day class on classical as well as `async`/`await` concurrency.
fr_fr: [La programmation concurrente en Rust](../concurrency.md) est un cours d'une journée portant sur la programmation concurrente classique ainsi que `async`/`await`.

source: You will need a fresh crate set up and the dependencies downloaded and ready to go. You can then copy/paste the examples into `src/main.rs` to experiment with them:
fr_fr: Il faudra que vous ayez préparé une crate à jour et que vous ayez téléchargé et installé les dépendances. Vous pourrez ensuite copier/coller les exemples dans `src/main.rs` et les modifier:

source: Format
fr_fr: Format du cours

source: The course is meant to be very interactive and we recommend letting the questions drive the exploration of Rust!
fr_fr: Le cours se veut très interactif et nous recommandons de laisser les questions guider l'exploration de Rust !

source: There are several useful keyboard shortcuts in mdBook:
fr_fr: Il existe plusieurs raccourcis clavier utiles dans mdBook :

source: Arrow-Left
fr_fr: Flèche vers la gauche

source: : Navigate to the previous page.
fr_fr: : Navigue à la page précédente.

source: Arrow-Right
fr_fr: Flèche vers la droite

source: : Navigate to the next page.
fr_fr: : Navigue à la page suivante.

source: Ctrl + Enter
fr_fr: Ctrl + Entrée

source: : Execute the code sample that has focus.
fr_fr: : Exécute l'exemple de code qui a le focus.

source: : Activate the search bar.
fr_fr: : Active la barre de recherche.

source: The course has been translated into other languages by a set of wonderful volunteers:
fr_fr: Le cours a été traduit dans d'autres langues par un ensemble de merveilleux bénévoles:

source: [Brazilian Portuguese](https://google.github.io/comprehensive-rust/pt-BR/) by [@rastringer](https://github.com/rastringer), [@hugojacob](https://github.com/hugojacob), [@joaovicmendes](https://github.com/joaovicmendes), and [@henrif75](https://github.com/henrif75).
fr_fr: [portugais brésilien](https://google.github.io/comprehensive-rust/pt-BR/) par [@rastringer](https://github.com/rastringer), [@hugojacob](https://github.com/hugojacob), [@joaovicmendes](https://github.com/joaovicmendes), et [@henrif75](https://github.com/henrif75).

source: [Chinese (Simplified)](https://google.github.io/comprehensive-rust/zh-CN/) by [@suetfei](https://github.com/suetfei), [@wnghl](https://github.com/wnghl), [@anlunx](https://github.com/anlunx), [@kongy](https://github.com/kongy), [@noahdragon](https://github.com/noahdragon), [@superwhd](https://github.com/superwhd), [@SketchK](https://github.com/SketchK), and [@nodmp](https://github.com/nodmp).
fr_fr: [chinois (simplifié)](https://google.github.io/comprehensive-rust/zh-CN/) par [@suetfei](https://github.com/suetfei), [@wnghl](https://github.com/wnghl), [@anlunx](https://github.com/anlunx), [@kongy](https://github.com/kongy), [@noahdragon](https://github.com/noahdragon), [@superwhd](https://github.com/superwhd), [@SketchK](https://github.com/SketchK), et [@nodmp](https://github.com/nodmp).

source: [Chinese (Traditional)](https://google.github.io/comprehensive-rust/zh-TW/) by [@hueich](https://github.com/hueich), [@victorhsieh](https://github.com/victorhsieh), [@mingyc](https://github.com/mingyc), [@kuanhungchen](https://github.com/kuanhungchen), and [@johnathan79717](https://github.com/johnathan79717).
fr_fr: [chinois (traditionnel)](https://google.github.io/comprehensive-rust/zh-TW/) par [@hueich](https://github.com/hueich), [@victorhsieh](https://github.com/victorhsieh), [@mingyc](https://github.com/mingyc), [@kuanhungchen](https://github.com/kuanhungchen), et [@johnathan79717](https://github.com/johnathan79717).

source: [Korean](https://google.github.io/comprehensive-rust/ko/) by [@keispace](https://github.com/keispace), [@jiyongp](https://github.com/jiyongp), [@jooyunghan](https://github.com/jooyunghan), and [@namhyung](https://github.com/namhyung).
fr_fr: [coréen](https://google.github.io/comprehensive-rust/ko/) par [@keispace](https://github.com/keispace), [@jiyongp](https://github.com/jiyongp), [@jooyunghan](https://github.com/jooyunghan), et [@namhyung](https://github.com/namhyung).

source: [Spanish](https://google.github.io/comprehensive-rust/es/) by [@deavid](https://github.com/deavid).
fr_fr: [espagnol](https://google.github.io/comprehensive-rust/es/) by [@deavid](https://github.com/deavid).

source: Use the language picker in the top-right corner to switch between languages.
fr_fr: Utilisez le sélecteur de langue dans le coin supérieur droit pour basculer entre les langues.

source: Incomplete Translations
fr_fr: Traductions incomplètes

source: There is a large number of in-progress translations. We link to the most recently updated translations:
fr_fr: Il y a beaucoup de traductions en cours d'élaboration. Nous listons ci-dessous celles ayant été mises à jour le plus récemment:

source: [Bengali](https://google.github.io/comprehensive-rust/bn/) by [@raselmandol](https://github.com/raselmandol).
fr_fr: [bengali](https://google.github.io/comprehensive-rust/bn/) par [@raselmandol](https://github.com/raselmandol).

source: [French](https://google.github.io/comprehensive-rust/fr/) by [@KookaS](https://github.com/KookaS) and [@vcaen](https://github.com/vcaen).
fr_fr: [francais](https://google.github.io/comprehensive-rust/fr/) par [@KookaS](https://github.com/KookaS), [@vcaen](https://github.com/vcaen) et [@AdrienBaudemont](https://github.com/AdrienBaudemont).

source: [German](https://google.github.io/comprehensive-rust/de/) by [@Throvn](https://github.com/Throvn) and [@ronaldfw](https://github.com/ronaldfw).
fr_fr: [allemand](https://google.github.io/comprehensive-rust/de/) par [@Throvn](https://github.com/Throvn) et [@ronaldfw](https://github.com/ronaldfw).

source: [Japanese](https://google.github.io/comprehensive-rust/ja/) by [@CoinEZ-JPN](https://github.com/CoinEZ) and [@momotaro1105](https://github.com/momotaro1105).
fr_fr: [japonais](https://google.github.io/comprehensive-rust/ja/) par [@CoinEZ-JPN](https://github.com/CoinEZ) et [@momotaro1105](https://github.com/momotaro1105).

source: [Italian](https://google.github.io/comprehensive-rust/it/) by [@henrythebuilder](https://github.com/henrythebuilder) and [@detro](https://github.com/detro).
fr_fr: [italien](https://google.github.io/comprehensive-rust/it/) par [@henrythebuilder](https://github.com/henrythebuilder) et [@detro](https://github.com/detro).

source: If you want to help with this effort, please see [our instructions](https://github.com/google/comprehensive-rust/blob/main/TRANSLATIONS.md) for how to get going. Translations are coordinated on the [issue tracker](https://github.com/google/comprehensive-rust/issues/282).
fr_fr: Si vous souhaitez contribuer à cet effort, veuillez consulter [nos instructions - en anglais](https://github.com/google/comprehensive-rust/blob/main/TRANSLATIONS.md) pour savoir comment se lancer. Les traductions sont coordonnées sur le [suivi de bogues - en anglais](https://github.com/google/comprehensive-rust/issues/282).

source: When you start reading about Rust, you will soon meet [Cargo](https://doc.rust-lang.org/cargo/), the standard tool used in the Rust ecosystem to build and run Rust applications. Here we want to give a brief overview of what Cargo is and how it fits into the wider ecosystem and how it fits into this training.
fr_fr: Lorsque vous commencerez à vous documenter sur Rust, vous rencontrerez rapidement [Cargo](https://doc.rust-lang.org/cargo/), l'outil standard utilisé dans l'écosystème Rust pour créer et exécuter des applications Rust. Dans cette section, nous voulons donner un bref aperçu de ce qu'est Cargo, comment il s'intègre dans le large écosystème de Rust et comment il s'inscrit dans cette formation.

source: **Please follow the instructions on <https://rustup.rs/>.**
fr_fr: **Veuillez suivre les instructions sur <https://rustup.rs/>.**

source: This will give you the Cargo build tool (`cargo`) and the Rust compiler (`rustc`). You will also get `rustup`, a command line utility that you can use to install to different compiler versions.
fr_fr: Une fois que vous aurez suivi ces instructions, vous disposerez du gestionnaire de dépendances et système de compilation `cargo` et du compilateur `rustc`. `rustup` sera également installé : il s'agit d'un utilitaire en ligne de commande que vous pourrez utiliser pour installer différentes versions du compilateur.

source: After installing Rust, you should configure your editor or IDE to work with Rust. Most editors do this by talking to [rust-analyzer](https://rust-analyzer.github.io/), which provides auto-completion and jump-to-definition functionality for [VS Code](https://code.visualstudio.com/), [Emacs](https://rust-analyzer.github.io/manual.html#emacs), [Vim/Neovim](https://rust-analyzer.github.io/manual.html#vimneovim), and many others. There is also a different IDE available called [RustRover](https://www.jetbrains.com/rust/).
fr_fr: Après avoir installé Rust, il vous faudra configurer votre éditeur de texte ou votre IDE (environnement de développement) pour travailler avec Rust. La plupart des éditeurs reposent, pour ce faire, sur le [rust-analyzer](https://rust-analyzer.github.io/), un outil qui fournit les fonctionnalités de complétion automatique et de lien vers les définitions des symboles, notamment pour [VS Code](https://code.visualstudio.com/), [Emacs](https://rust-analyzer.github.io/manual.html#emacs), [Vim/Neovim](https://rust-analyzer.github.io/manual.html#vimneovim), et bien d'autres. Il existe également un IDE appelé [RustRover](https://www.jetbrains.com/rust/).

source: On Debian/Ubuntu, you can also install Cargo, the Rust source and the [Rust formatter](https://github.com/rust-lang/rustfmt) via `apt`. However, this gets you an outdated rust version and may lead to unexpected behavior. The command would be:
fr_fr: Sur Debian/Ubuntu, vous pouvez installer Cargo, les sources Rust (`rust-src`: compilateur et bibliothèques standards) et l'outil de [formatage Rust](https://github.com/rust-lang/rustfmt) via `apt`. Veuillez noter toutefois que l'installation via `apt` ne vous procurera pas la dernière version de Rust, ce qui pourrait conduire à des problèmes de comportement indéterminé (undefined behavior). La ligne de commande à utiliser serait :

source: The Rust Ecosystem
fr_fr: L'écosystème de Rust

source: The Rust ecosystem consists of a number of tools, of which the main ones are:
fr_fr: L'écosystème de Rust est composé d'un certain nombre d'outils, dont les principaux sont :

source: `rustc`: the Rust compiler which turns `.rs` files into binaries and other intermediate formats.
fr_fr: `rustc` : le compilateur Rust qui transforme les fichiers `.rs` en binaires et autres formats intermédiaires.

source: `cargo`: the Rust dependency manager and build tool. Cargo knows how to download dependencies, usually hosted on <https://crates.io>, and it will pass them to `rustc` when building your project. Cargo also comes with a built-in test runner which is used to execute unit tests.
fr_fr: `cargo` : le gestionnaire de dépendances Rust et l'outil de compilation. Cargo peut télécharger les dépendances, en général hébergées sur <https://crates.io>, et les rendre disponibles pour `rustc` lors de la compilation de votre projet. Cargo intègre également un outil pour exécuter des tests unitaires.

source: `rustup`: the Rust toolchain installer and updater. This tool is used to install and update `rustc` and `cargo` when new versions of Rust are released. In addition, `rustup` can also download documentation for the standard library. You can have multiple versions of Rust installed at once and `rustup` will let you switch between them as needed.
fr_fr: `rustup` : le programme d'installation et de mise à jour de la chaîne d'outils Rust. Cet outil sert à installer et mettre à jour `rustc` et `cargo` lorsque de nouvelles versions de Rust sont publiées. De plus, `rustup` peut également télécharger la documentation de la bibliothèque standard. Vous pouvez avoir plusieurs versions de Rust installées à la fois et `rustup` vous permettra de basculer entre elles au besoin.

source: Key points:
fr_fr: Points clés:

source: Rust has a rapid release schedule with a new release coming out every six weeks. New releases maintain backwards compatibility with old releases --- plus they enable new functionality.
fr_fr: Rust a un calendrier de publication rapide : une nouvelle version est disponible toutes les six semaines. Les nouvelles versions maintiennent la rétrocompatibilité avec les anciennes versions --- en plus, elles proposent de nouvelles fonctionnalités.

source: There are three release channels: "stable", "beta", and "nightly".
fr_fr: Il existe trois types de publication : "stable", "beta" et "nightly".

source: New features are being tested on "nightly", "beta" is what becomes "stable" every six weeks.
fr_fr: Les nouvelles fonctionnalités sont testées sur "nightly". "beta" est ce qui devient "stable" toutes les six semaines.

source: Dependencies can also be resolved from alternative [registries](https://doc.rust-lang.org/cargo/reference/registries.html), git, folders, and more.
fr_fr: Les dépendances peuvent aussi être obtenues sur des [dépôts alternatifs](https://doc.rust-lang.org/cargo/reference/registries.html), via `git`, dans des répertoires système, et autres.

source: Rust also has [editions](https://doc.rust-lang.org/edition-guide/): the current edition is Rust 2021. Previous editions were Rust 2015 and Rust 2018.
fr_fr: Rust a également des [éditions](https://doc.rust-lang.org/edition-guide/) : l'édition actuelle est Rust 2021. Les éditions passées étaient Rust 2015 et Rust 2018.

source: The editions are allowed to make backwards incompatible changes to the language.
fr_fr: Les éditions sont autorisées à apporter des modifications **non** rétrocompatibles au langage.

source: To prevent breaking code, editions are opt-in: you select the edition for your crate via the `Cargo.toml` file.
fr_fr: Pour éviter de casser vos dépendances et empêcher la compilation de votre projet, les éditions sont laissées au choix : vous sélectionnez l'édition pour chaque crate via le fichier `Cargo.toml`.

source: To avoid splitting the ecosystem, Rust compilers can mix code written for different editions.
fr_fr: Pour éviter de diviser l'écosystème, les compilateurs Rust peuvent mélanger du code écrit pour différentes éditions.

source: Mention that it is quite rare to ever use the compiler directly not through `cargo` (most users never do).
fr_fr: Veuillez noter qu'il est assez rare d'utiliser le compilateur directement et non via `cargo` (la plupart des utilisateurs ne le font jamais).

source: It might be worth alluding that Cargo itself is an extremely powerful and comprehensive tool. It is capable of many advanced features including but not limited to:
fr_fr: Il peut être utile de mentionner que Cargo est un outil extrêmement puissant et complet. Il est capable de nombreuses fonctionnalités avancées, y compris, mais sans s'y limiter :

source: Project/package structure
fr_fr: Structure du projet/paquets

source: [workspaces](https://doc.rust-lang.org/cargo/reference/workspaces.html)
fr_fr: [Espaces de travail](https://doc.rust-lang.org/cargo/reference/workspaces.html)

source: Dev Dependencies and Runtime Dependency management/caching
fr_fr: Gestion/mise en cache des dépendances de développement et des dépendances d'exécution

source: [build scripting](https://doc.rust-lang.org/cargo/reference/build-scripts.html)
fr_fr: [Créer des scripts](https://doc.rust-lang.org/cargo/reference/build-scripts.html)

source: [global installation](https://doc.rust-lang.org/cargo/commands/cargo-install.html)
fr_fr: [Installation globale](https://doc.rust-lang.org/cargo/commands/cargo-install.html)

source: It is also extensible with sub command plugins as well (such as [cargo clippy](https://github.com/rust-lang/rust-clippy)).
fr_fr: Il est également extensible avec des plugins de sous-commande (tels que [cargo clippy](https://github.com/rust-lang/rust-clippy)).

source: Read more from the [official Cargo Book](https://doc.rust-lang.org/cargo/)
fr_fr: Pour en savoir plus, vous pouvez lire le [livre officiel de Cargo - en anglais](https://doc.rust-lang.org/cargo/)

source: Code Samples in This Training
fr_fr: Échantillons de code dans cette formation
