Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: Similarly, many web frameworks allow you to start an in-process server which binds to a random port on `localhost`. Always prefer this over mocking away the framework since it helps you test your code in the real environment.
fr_fr: De même, beaucoup de frameworks web permettent de démarrer un serveur local en mémoire sur un port aléatoire de `localhost`. C’est préférable au mocking, car cela permet de tester dans un environnement réel.

source: Mockall is not part of the Rust Playground, so you need to run this example in a local environment. Use `cargo add mockall` to quickly add Mockall to an existing Cargo project.
fr_fr: Mockall n’est pas disponible dans le Rust Playground. Lancez l’exemple en local. Utilisez `cargo add mockall` pour l’ajouter rapidement à un projet existant.

source: Mockall has a lot more functionality. In particular, you can set up expectations which depend on the arguments passed. Here we use this to mock a cat which becomes hungry 3 hours after the last time it was fed:
fr_fr: Mockall offre bien plus de fonctionnalités. Par exemple, on peut définir des attentes selon les arguments passés. Ici, on simule un chat qui a faim 3 heures après avoir été nourri :

source: You can use `.times(n)` to limit the number of times a mock method can be called to `n` --- the mock will automatically panic when dropped if this isn't satisfied.
fr_fr: Utilisez `.times(n)` pour limiter le nombre d’appels d’une méthode mockée à `n` — le mock provoquera un panic s’il est abandonné sans avoir respecté cette contrainte.

source: You should use the `log` crate to automatically log to `logcat` (on-device) or `stdout` (on-host):
fr_fr: Vous devriez utiliser la crate `log` pour enregistrer automatiquement dans `logcat` (sur l’appareil) ou `stdout` (sur l’hôte) :

source: //! Rust logging demo.
fr_fr: //! Démonstration de journalisation en Rust.

source: /// Logs a greeting.
fr_fr: /// Enregistre un message de salutation.

source: "Starting program."
fr_fr: "Démarrage du programme."

source: "Things are going fine."
fr_fr: "Tout se passe bien."

source: "Something went wrong!"
fr_fr: "Quelque chose s'est mal passé !"

source: Build, push, and run the binary on your device:
fr_fr: Compilez, transférez et exécutez le binaire sur votre appareil :

source: The logs show up in `adb logcat`:
fr_fr: Les journaux s'affichent dans `adb logcat` :

source: Rust has excellent support for interoperability with other languages. This means that you can:
fr_fr: Rust offre un excellent support pour l’interopérabilité avec d’autres langages. Cela signifie que vous pouvez :

source: Call Rust functions from other languages.
fr_fr: Appeler des fonctions Rust depuis d'autres langages.

source: Call functions written in other languages from Rust.
fr_fr: Appeler des fonctions écrites dans d’autres langages depuis Rust.

source: When you call functions in a foreign language we say that you're using a _foreign function interface_, also known as FFI.
fr_fr: Lorsque vous appelez des fonctions dans un langage étranger, on parle d’_interface de fonction étrangère_ (FFI).

source: Interoperability with C
fr_fr: Interopérabilité avec C

source: Rust has full support for linking object files with a C calling convention. Similarly, you can export Rust functions and call them from C.
fr_fr: Rust prend entièrement en charge la liaison de fichiers objets selon la convention d'appel C. De même, vous pouvez exporter des fonctions Rust et les appeler depuis C.

source: You can do it by hand if you want:
fr_fr: Vous pouvez le faire manuellement si vous le souhaitez :

source: We already saw this in the [Safe FFI Wrapper exercise](../../exercises/day-3/safe-ffi-wrapper.md).
fr_fr: Nous avons déjà vu cela dans l’[exercice sur le wrapper FFI sécurisé](../../exercises/day-3/safe-ffi-wrapper.md).

source: This assumes full knowledge of the target platform. Not recommended for production.
fr_fr: Cela suppose une connaissance approfondie de la plateforme cible. Non recommandé en production.

source: We will look at better options next.
fr_fr: Nous allons maintenant examiner de meilleures options.

source: Using Bindgen
fr_fr: Utiliser Bindgen

source: The [bindgen](https://rust-lang.github.io/rust-bindgen/introduction.html) tool can auto-generate bindings from a C header file.
fr_fr: L’outil [bindgen](https://rust-lang.github.io/rust-bindgen/introduction.html) permet de générer automatiquement des liaisons à partir d’un fichier d’en-tête C.

source: First create a small C library:
fr_fr: Commencez par créer une petite bibliothèque C :

source: "| Happy Birthday %s!\n"
fr_fr: "| Joyeux anniversaire %s !\n"

source: "| Congratulations with the %i years!\n"
fr_fr: "| Félicitations pour ces %i années !\n"

source: Add this to your `Android.bp` file:
fr_fr: Ajoutez ceci à votre fichier `Android.bp` :

source: Create a wrapper header file for the library (not strictly needed in this example):
fr_fr: Créez un fichier d’en-tête wrapper pour la bibliothèque (non strictement nécessaire dans cet exemple) :

source: You can now auto-generate the bindings:
fr_fr: Vous pouvez maintenant générer automatiquement les liaisons :

source: Finally, we can use the bindings in our Rust program:
fr_fr: Enfin, nous pouvons utiliser les liaisons dans notre programme Rust :

source: //! Bindgen demo.
fr_fr: //! Démo de bindgen.

source: // SAFETY: `print_card` is safe to call with a valid `card` pointer.
fr_fr: // SÉCURITÉ : `print_card` est sûr si on l'appelle avec un pointeur `card` valide.

source: Finally, we can run auto-generated tests to ensure the bindings work:
fr_fr: Enfin, nous pouvons exécuter des tests générés automatiquement pour vérifier que les liaisons fonctionnent :

source: // Generated file, skip linting
fr_fr: // Fichier généré, ignorer le linting

source: Calling Rust
fr_fr: Appeler du Rust

source: Exporting Rust functions and types to C is easy:
fr_fr: Exporter des fonctions et types Rust vers C est facile :

source: //! Rust FFI demo.
fr_fr: //! Démonstration de FFI avec Rust.

source: /// Analyze the numbers.
fr_fr: /// Analyse les nombres.

source: "x ({x}) is smallest!"
fr_fr: "x ({x}) est le plus petit !"

source: "y ({y}) is probably larger than x ({x})"
fr_fr: "y ({y}) est probablement plus grand que x ({x})"

source: We can now call this from a C binary:
fr_fr: Nous pouvons maintenant appeler cette fonction depuis un binaire C :

source: `#[no_mangle]` disables Rust's usual name mangling, so the exported symbol will just be the name of the function. You can also use `#[export_name = "some_name"]` to specify whatever name you want.
fr_fr: `#[no_mangle]` désactive le renommage automatique des symboles par Rust, de sorte que le symbole exporté correspond exactement au nom de la fonction. Vous pouvez aussi utiliser `#[export_name = "nom"]` pour choisir un nom personnalisé.

source: The [CXX crate](https://cxx.rs/) makes it possible to do safe interoperability between Rust and C++.
fr_fr: La [crate CXX](https://cxx.rs/) permet une interopérabilité sécurisée entre Rust et C++.

source: The overall approach looks like this:
fr_fr: L’approche générale ressemble à ceci :

source: CXX relies on a description of the function signatures that will be exposed from each language to the other. You provide this description using extern blocks in a Rust module annotated with the `#[cxx::bridge]` attribute macro.
fr_fr: CXX repose sur une description des signatures de fonctions exposées d’un langage à l’autre. Cette description se fait via des blocs extern dans un module Rust annoté avec la macro d’attribut `#[cxx::bridge]`.

source: // Shared structs with fields visible to both languages.
fr_fr: // Structures partagées avec des champs visibles pour les deux langages.

source: // Rust types and signatures exposed to C++.
fr_fr: // Types et signatures Rust exposés à C++.

source: "Rust"
fr_fr: Rustdoc

source: // C++ types and signatures exposed to Rust.
fr_fr: // Types et signatures C++ exposés à Rust.

source: The bridge is generally declared in an `ffi` module within your crate.
fr_fr: Le pont est généralement déclaré dans un module `ffi` au sein de votre crate.

source: From the declarations made in the bridge module, CXX will generate matching Rust and C++ type/function definitions in order to expose those items to both languages.
fr_fr: À partir des déclarations dans le module de pont, CXX génère les définitions de types/fonctions correspondantes en Rust et C++ afin de les exposer aux deux langages.

source: To view the generated Rust code, use [cargo-expand](https://github.com/dtolnay/cargo-expand) to view the expanded proc macro. For most of the examples you would use `cargo expand ::ffi` to expand just the `ffi` module (though this doesn't apply for Android projects).
fr_fr: Pour voir le code Rust généré, utilisez [cargo-expand](https://github.com/dtolnay/cargo-expand) pour développer la macro proc. Pour la plupart des exemples, utilisez `cargo expand ::ffi` afin de développer uniquement le module `ffi` (non applicable aux projets Android).

source: To view the generated C++ code, look in `target/cxxbridge`.
fr_fr: Pour consulter le code C++ généré, regardez dans `target/cxxbridge`.

source: Rust Bridge Declarations
fr_fr: Déclarations Rust du pont

source: // Opaque type
fr_fr: // Type opaque

source: // Method on `MyType`
fr_fr: // Méthode sur `MyType`

source: // Free function
fr_fr: // Fonction libre

source: Items declared in the `extern "Rust"` reference items that are in scope in the parent module.
fr_fr: Les éléments déclarés dans `extern "Rust"` font référence à ceux accessibles dans le module parent.

source: The CXX code generator uses your `extern "Rust"` section(s) to produce a C++ header file containing the corresponding C++ declarations. The generated header has the same path as the Rust source file containing the bridge, except with a .rs.h file extension.
fr_fr: Le générateur de code CXX utilise vos sections `extern "Rust"` pour produire un fichier d'en-tête C++ contenant les déclarations correspondantes. Ce fichier possède le même chemin que le fichier source Rust contenant le pont, mais avec l'extension `.rs.h`.

source: Results in (roughly) the following C++:
fr_fr: Produit (en gros) le C++ suivant :

source: C++ Bridge Declarations
fr_fr: Déclarations C++ du pont

source: Results in (roughly) the following Rust:
fr_fr: Produit (en gros) le Rust suivant :

source: The programmer does not need to promise that the signatures they have typed in are accurate. CXX performs static assertions that the signatures exactly correspond with what is declared in C++.
fr_fr: Le programmeur n’a pas à garantir que les signatures saisies sont exactes. CXX effectue des assertions statiques pour s’assurer qu’elles correspondent exactement à ce qui est déclaré en C++.

source: `unsafe extern` blocks allow you to declare C++ functions that are safe to call from Rust.
fr_fr: Les blocs `unsafe extern` permettent de déclarer des fonctions C++ sûres à appeler depuis Rust.

source: Only C-like (unit) enums are supported.
fr_fr: Seuls les enums de type C (unitaires) sont pris en charge.

source: A limited number of traits are supported for `#[derive()]` on shared types. Corresponding functionality is also generated for the C++ code, e.g. if you derive `Hash` also generates an implementation of `std::hash` for the corresponding C++ type.
fr_fr: Un nombre limité de traits est pris en charge pour `#[derive()]` sur les types partagés. Une fonctionnalité équivalente est aussi générée pour le code C++ : par exemple, `derive(Hash)` produit une implémentation de `std::hash` pour le type C++ correspondant.

source: Generated Rust:
fr_fr: Rust généré :

source: Generated C++:
fr_fr: C++ généré :

source: On the Rust side, the code generated for shared enums is actually a struct wrapping a numeric value. This is because it is not UB in C++ for an enum class to hold a value different from all of the listed variants, and our Rust representation needs to have the same behavior.
fr_fr: Côté Rust, le code généré pour les enums partagés est en fait une structure encapsulant une valeur numérique. Cela s'explique par le fait qu'en C++, une `enum class` peut contenir une valeur différente des variantes listées, et que la représentation Rust doit se comporter de la même manière.

source: "fallible1 requires depth > 0"
fr_fr: "fallible1 nécessite une profondeur > 0"

source: "Success!"
fr_fr: "Succès !"

source: Rust functions that return `Result` are translated to exceptions on the C++ side.
fr_fr: Les fonctions Rust retournant un `Result` sont traduites en exceptions côté C++.

source: The exception thrown will always be of type `rust::Error`, which primarily exposes a way to get the error message string. The error message will come from the error type's `Display` impl.
fr_fr: L’exception levée sera toujours de type `rust::Error`, qui fournit principalement un accès au message d’erreur. Ce message est dérivé de l’implémentation de `Display` du type d’erreur.

source: A panic unwinding from Rust to C++ will always cause the process to immediately terminate.
fr_fr: Un panic se propageant de Rust à C++ entraînera toujours l'arrêt immédiat du processus.

source: "Error: {}"
fr_fr: "Erreur : {}"

source: C++ functions declared to return a `Result` will catch any thrown exception on the C++ side and return it as an `Err` value to the calling Rust function.
fr_fr: Les fonctions C++ déclarées avec un retour de type `Result` capturent toute exception levée côté C++ et la renvoient en tant que valeur `Err` à la fonction Rust appelante.

source: If an exception is thrown from an extern "C++" function that is not declared by the CXX bridge to return `Result`, the program calls C++'s `std::terminate`. The behavior is equivalent to the same exception being thrown through a `noexcept` C++ function.
fr_fr: Si une exception est levée depuis une fonction `extern "C++"` non déclarée avec un retour `Result` via le pont CXX, le programme appelle `std::terminate`. Le comportement est équivalent à une exception lancée à travers une fonction `noexcept` en C++.

source: C++ Type
fr_fr: Type C++

source: These types can be used in the fields of shared structs and the arguments and returns of extern functions.
fr_fr: Ces types peuvent être utilisés dans les champs des structures partagées ainsi que comme arguments et retours des fonctions `extern`.

source: Note that Rust's `String` does not map directly to `std::string`. There are a few reasons for this:
fr_fr: Notez que le `String` de Rust ne correspond pas directement à `std::string`. Cela s’explique par plusieurs raisons :

source: `std::string` does not uphold the UTF-8 invariant that `String` requires.
fr_fr: `std::string` ne garantit pas l’invariant UTF-8 exigé par `String` en Rust.

source: The two types have different layouts in memory and so can't be passed directly between languages.
fr_fr: Les deux types ont des dispositions en mémoire différentes et ne peuvent donc pas être transmis directement entre langages.

source: `std::string` requires move constructors that don't match Rust's move semantics, so a `std::string` can't be passed by value to Rust.
fr_fr: `std::string` nécessite des constructeurs de déplacement incompatibles avec la sémantique de déplacement de Rust ; il ne peut donc pas être passé par valeur vers Rust.

source: Building in Android
fr_fr: Compilation sous Android

source: Create a `cc_library_static` to build the C++ library, including the CXX generated header and source file.
fr_fr: Créez une `cc_library_static` pour compiler la bibliothèque C++, incluant l’en-tête et le fichier source générés par CXX.

source: Point out that `libcxx_test_bridge_header` and `libcxx_test_bridge_code` are the dependencies for the CXX-generated C++ bindings. We'll show how these are setup on the next slide.
fr_fr: Soulignez que `libcxx_test_bridge_header` et `libcxx_test_bridge_code` sont les dépendances des liaisons C++ générées par CXX. Nous verrons comment elles sont configurées à la diapositive suivante.

source: Note that you also need to depend on the `cxx-bridge-header` library in order to pull in common CXX definitions.
fr_fr: Notez que vous devez également dépendre de la bibliothèque `cxx-bridge-header` afin d’inclure les définitions CXX communes.

source: Full docs for using CXX in Android can be found in [the Android docs](https://source.android.com/docs/setup/build/rust/building-rust-modules/android-rust-patterns#rust-cpp-interop-using-cxx). You may want to share that link with the class so that students know where they can find these instructions again in the future.
fr_fr: La documentation complète pour utiliser CXX dans Android se trouve dans [la documentation Android](https://source.android.com/docs/setup/build/rust/building-rust-modules/android-rust-patterns#rust-cpp-interop-using-cxx). Il peut être utile de partager ce lien avec la classe afin que les étudiants sachent où retrouver ces instructions ultérieurement.

source: Create two genrules: One to generate the CXX header, and one to generate the CXX source file. These are then used as inputs to the `cc_library_static`.
fr_fr: Créez deux règles `genrule` : l'une pour générer l’en-tête CXX, l’autre pour générer le fichier source CXX. Ces fichiers sont ensuite utilisés comme entrées de la bibliothèque statique `cc_library_static`.

source: // Generate a C++ header containing the C++ bindings // to the Rust exported functions in lib.rs.
fr_fr: // Génère un en-tête C++ contenant les liaisons C++ // vers les fonctions Rust exportées dans lib.rs.

source: // Generate the C++ code that Rust calls into.
fr_fr: // Génère le code C++ dans lequel Rust effectue des appels.

source: The `cxxbridge` tool is a standalone tool that generates the C++ side of the bridge module. It is included in Android and available as a Soong tool.
fr_fr: L’outil `cxxbridge` est un outil autonome qui génère la partie C++ du module passerelle. Il est inclus dans Android et disponible en tant qu’outil Soong.

source: By convention, if your Rust source file is `lib.rs` your header file will be named `lib.rs.h` and your source file will be named `lib.rs.cc`. This naming convention isn't enforced, though.
fr_fr: Par convention, si votre fichier source Rust s’appelle `lib.rs`, le fichier d’en-tête généré sera `lib.rs.h` et le fichier source C++ sera `lib.rs.cc`. Cette convention de nommage n’est cependant pas obligatoire.

source: Create a `rust_binary` that depends on `libcxx` and your `cc_library_static`.
fr_fr: Créez un `rust_binary` qui dépend de `libcxx` et de votre `cc_library_static`.

source: Interoperability with Java
fr_fr: Interopérabilité avec Java

source: Java can load shared objects via [Java Native Interface (JNI)](https://en.wikipedia.org/wiki/Java_Native_Interface). The [`jni` crate](https://docs.rs/jni/) allows you to create a compatible library.
fr_fr: Java peut charger des objets partagés via le [Java Native Interface (JNI)](https://en.wikipedia.org/wiki/Java_Native_Interface). La crate [`jni`](https://docs.rs/jni/) permet de créer une bibliothèque compatible.

source: First, we create a Rust function to export to Java:
fr_fr: Nous commençons par créer une fonction Rust à exporter vers Java :

source: //! Rust <-> Java FFI demo.
fr_fr: //! Démonstration FFI Rust <-> Java.

source: /// HelloWorld::hello method implementation.
fr_fr: /// Implémentation de la méthode HelloWorld::hello.

source: "Hello, {input}!"
fr_fr: "Bonjour, {input} !"

source: We then call this function from Java:
fr_fr: Nous appelons ensuite cette fonction depuis Java :

source: Finally, you can build, sync, and run the binary:
fr_fr: Enfin, vous pouvez compiler, synchroniser et exécuter le binaire :

source: This is a group exercise: We will look at one of the projects you work with and try to integrate some Rust into it. Some suggestions:
fr_fr: Il s'agit d'un exercice de groupe : nous allons examiner l’un de vos projets et essayer d’y intégrer un peu de Rust. Quelques suggestions :

source: Call your AIDL service with a client written in Rust.
fr_fr: Appelez votre service AIDL avec un client écrit en Rust.

source: Move a function from your project to Rust and call it.
fr_fr: Déplacez une fonction de votre projet vers Rust et appelez-la.

source: No solution is provided here since this is open-ended: it relies on someone in the class having a piece of code which you can turn in to Rust on the fly.
fr_fr: Aucune solution n’est fournie ici car l’exercice est ouvert : il repose sur le fait qu’un membre du groupe dispose d’un bout de code que l’on peut convertir en Rust à la volée.

source: Welcome to Rust in Chromium
fr_fr: Bienvenue dans Rust pour Chromium

source: Rust is supported for third-party libraries in Chromium, with first-party glue code to connect between Rust and existing Chromium C++ code.
fr_fr: Rust est pris en charge pour les bibliothèques tierces dans Chromium, avec du code d’interfaçage maison pour relier Rust au code C++ existant de Chromium.

source: Today, we'll call into Rust to do something silly with strings. If you've got a corner of the code where you're displaying a UTF8 string to the user, feel free to follow this recipe in your part of the codebase instead of the exact part we talk about.
fr_fr: Aujourd’hui, nous allons utiliser Rust pour faire quelque chose d’amusant avec des chaînes de caractères. Si vous avez une portion du code où une chaîne UTF-8 est affichée à l’utilisateur, n’hésitez pas à adapter cette approche à votre contexte, même si ce n’est pas exactement la même partie du code.

source: Make sure you can build and run Chromium. Any platform and set of build flags is OK, so long as your code is relatively recent (commit position 1223636 onwards, corresponding to November 2023):
fr_fr: Assurez-vous de pouvoir compiler et exécuter Chromium. N’importe quelle plateforme et configuration de compilation convient, du moment que votre version est relativement récente (position de commit 1223636 ou plus, soit novembre 2023) :

source: (A component, debug build is recommended for quickest iteration time. This is the default!)
fr_fr: (Une compilation en mode composant et debug est recommandée pour des itérations plus rapides. C’est le mode par défaut !)

source: See [How to build Chromium](https://www.chromium.org/developers/how-tos/get-the-code/) if you aren't already at that point. Be warned: setting up to build Chromium takes time.
fr_fr: Consultez [Comment compiler Chromium](https://www.chromium.org/developers/how-tos/get-the-code/) si vous n’en êtes pas encore là. Attention : la configuration pour compiler Chromium peut prendre du temps.

source: It's also recommended that you have Visual Studio code installed.
fr_fr: Il est également recommandé d’avoir Visual Studio Code installé.

source: About the exercises
fr_fr: À propos des exercices

source: This part of the course has a series of exercises which build on each other. We'll be doing them spread throughout the course instead of just at the end. If you don't have time to complete a certain part, don't worry: you can catch up in the next slot.
fr_fr: Cette partie du cours propose une série d’exercices progressifs. Nous les aborderons tout au long du cours et non uniquement à la fin. Si vous n’avez pas le temps d’en terminer un, ne vous inquiétez pas : vous pourrez rattraper lors de l’activité suivante.

source: The Rust community typically uses `cargo` and libraries from [crates.io](https://crates.io/). Chromium is built using `gn` and `ninja` and a curated set of dependencies.
fr_fr: La communauté Rust utilise généralement `cargo` et des bibliothèques issues de [crates.io](https://crates.io/). Chromium est quant à lui compilé avec `gn` et `ninja` et utilise un ensemble de dépendances sélectionnées.
