Repository: google/comprehensive-rust
Catalog: src/translations/*/*.po
Languages: fr_fr

source: A reference provides a way to access another value without taking responsibility for the value, and is also called "borrowing". Shared references are read-only, and the referenced data cannot change.
fr_fr: Une référence permet d'accéder à une autre valeur sans en assumer la propriété, on parle aussi d'« emprunt ». Les références partagées sont en lecture seule, et les données référencées ne peuvent pas être modifiées.

source: A shared reference to a type `T` has type `&T`. A reference value is made with the `&` operator. The `*` operator "dereferences" a reference, yielding its value.
fr_fr: Une référence partagée à un type `T` a le type `&T`. Une valeur de référence est créée avec l'opérateur `&`. L'opérateur `*` permet de « déréférencer » une référence et d'obtenir sa valeur.

source: Rust will statically forbid dangling references:
fr_fr: Rust interdit statiquement les références pendantes :

source: A reference is said to "borrow" the value it refers to, and this is a good model for students not familiar with pointers: code can use the reference to access the value, but is still "owned" by the original variable. The course will get into more detail on ownership in day 3.
fr_fr: On dit qu'une référence « emprunte » la valeur à laquelle elle fait référence, ce qui est une bonne analogie pour les élèves qui ne connaissent pas les pointeurs : le code peut utiliser la référence pour accéder à la valeur, mais celle-ci appartient toujours à la variable d’origine. La notion de propriété sera abordée plus en détail au jour 3.

source: References are implemented as pointers, and a key advantage is that they can be much smaller than the thing they point to. Students familiar with C or C++ will recognize references as pointers. Later parts of the course will cover how Rust prevents the memory-safety bugs that come from using raw pointers.
fr_fr: Les références sont implémentées comme des pointeurs, avec l’avantage notable d’être bien plus petites que ce qu’elles pointent. Les étudiants familiers avec le C ou le C++ reconnaîtront les références comme des pointeurs. Plus loin dans le cours, nous verrons comment Rust empêche les erreurs de sécurité mémoire liées aux pointeurs bruts.

source: Rust does not automatically create references for you - the `&` is always required.
fr_fr: Rust ne crée pas automatiquement de référence — il faut toujours utiliser `&`.

source: Rust will auto-dereference in some cases, in particular when invoking methods (try `r.is_ascii()`). There is no need for an `->` operator like in C++.
fr_fr: Rust effectue automatiquement le déréférencement dans certains cas, en particulier lors de l’appel de méthodes (essayez `r.is_ascii()`). Il n’y a pas besoin d’un opérateur `->` comme en C++.

source: In this example, `r` is mutable so that it can be reassigned (`r = &b`). Note that this re-binds `r`, so that it refers to something else. This is different from C++, where assignment to a reference changes the referenced value.
fr_fr: Dans cet exemple, `r` est mutable pour pouvoir être réaffecté (`r = &b`). Cela re-binde `r` pour qu’il fasse référence à une autre valeur. C’est différent de C++, où l’affectation à une référence modifie la valeur référencée.

source: A shared reference does not allow modifying the value it refers to, even if that value was mutable. Try `*r = 'X'`.
fr_fr: Une référence partagée ne permet pas de modifier la valeur référencée, même si cette dernière était mutable. Essayez `*r = 'X'`.

source: Rust is tracking the lifetimes of all references to ensure they live long enough. Dangling references cannot occur in safe Rust. `x_axis` would return a reference to `point`, but `point` will be deallocated when the function returns, so this will not compile.
fr_fr: Rust suit les durées de vie de toutes les références pour s’assurer qu’elles vivent suffisamment longtemps. Les références pendantes ne peuvent pas exister en Rust sûr. `x_axis` retournerait une référence vers `point`, mais `point` serait désalloué à la fin de la fonction, donc cela ne compilera pas.

source: We will talk more about borrowing when we get to ownership.
fr_fr: Nous parlerons davantage de l’emprunt lorsque nous aborderons la notion de possession.

source: Exclusive references, also known as mutable references, allow changing the value they refer to. They have type `&mut T`.
fr_fr: Les références exclusives, aussi appelées références mutables, permettent de modifier la valeur à laquelle elles font référence. Elles ont le type `&mut T`.

source: "Exclusive" means that only this reference can be used to access the value. No other references (shared or exclusive) can exist at the same time, and the referenced value cannot be accessed while the exclusive reference exists. Try making an `&point.0` or changing `point.0` while `x_coord` is alive.
fr_fr: "Exclusive" signifie que seule cette référence peut être utilisée pour accéder à la valeur. Aucune autre référence (partagée ou exclusive) ne peut exister en même temps, et la valeur référencée ne peut pas être accédée tant que la référence exclusive existe. Essayez de faire un `&point.0` ou de modifier `point.0` pendant que `x_coord` est actif.

source: Be sure to note the difference between `let mut x_coord: &i32` and `let x_coord: &mut i32`. The first one represents a shared reference which can be bound to different values, while the second represents an exclusive reference to a mutable value.
fr_fr: Notez bien la différence entre `let mut x_coord: &i32` et `let x_coord: &mut i32`. Le premier est une référence partagée mutable, tandis que le second est une référence exclusive vers une valeur mutable.

source: Slices
fr_fr: Tranches

source: A slice gives you a view into a larger collection:
fr_fr: Une tranche (slice) donne une vue sur une collection plus grande :

source: Slices borrow data from the sliced type.
fr_fr: Les tranches empruntent les données du type découpé.

source: Question: What happens if you modify `a[3]` right before printing `s`?
fr_fr: Question : Que se passe-t-il si vous modifiez `a[3]` juste avant d’imprimer `s` ?

source: We create a slice by borrowing `a` and specifying the starting and ending indexes in brackets.
fr_fr: On crée une tranche en empruntant `a` et en spécifiant les indices de début et de fin entre crochets.

source: If the slice starts at index 0, Rust’s range syntax allows us to drop the starting index, meaning that `&a[0..a.len()]` and `&a[..a.len()]` are identical.
fr_fr: Si la tranche commence à l’indice 0, la syntaxe des plages en Rust permet d’omettre cet indice. Ainsi, `&a[0..a.len()]` et `&a[..a.len()]` sont équivalents.

source: The same is true for the last index, so `&a[2..a.len()]` and `&a[2..]` are identical.
fr_fr: Il en va de même pour l’indice de fin : `&a[2..a.len()]` et `&a[2..]` sont identiques.

source: To easily create a slice of the full array, we can therefore use `&a[..]`.
fr_fr: Pour créer facilement une tranche du tableau entier, on peut utiliser `&a[..]`.

source: `s` is a reference to a slice of `i32`s. Notice that the type of `s` (`&[i32]`) no longer mentions the array length. This allows us to perform computation on slices of different sizes.
fr_fr: `s` est une référence à une tranche de `i32`. Notez que son type (`&[i32]`) ne mentionne plus la taille du tableau. Cela permet d’effectuer des calculs sur des tranches de tailles variées.

source: Slices always borrow from another object. In this example, `a` has to remain 'alive' (in scope) for at least as long as our slice.
fr_fr: Les tranches empruntent toujours à un autre objet. Dans cet exemple, `a` doit rester « vivant » (dans la portée) au moins aussi longtemps que notre tranche.

source: The question about modifying `a[3]` can spark an interesting discussion, but the answer is that for memory safety reasons you cannot do it through `a` at this point in the execution, but you can read the data from both `a` and `s` safely. It works before you created the slice, and again after the `println`, when the slice is no longer used.
fr_fr: La question de la modification de `a[3]` peut donner lieu à une discussion intéressante, mais la réponse est que, pour des raisons de sécurité mémoire, cela n’est plus possible via `a` à ce stade de l’exécution. Il est toutefois possible de lire les données depuis `a` et `s` en toute sécurité. Cela fonctionne avant la création de la tranche, puis à nouveau après le `println`, lorsque la tranche n’est plus utilisée.

source: We can now understand the two string types in Rust:
fr_fr: Nous pouvons maintenant comprendre les deux types de chaînes de caractères en Rust :

source: `&str` is a slice of UTF-8 encoded bytes, similar to `&[u8]`.
fr_fr: `&str` est une tranche d’octets encodés en UTF-8, similaire à `&[u8]`.

source: `String` is an owned, heap-allocated buffer of UTF-8 bytes.
fr_fr: `String` est un tampon alloué sur le tas contenant des octets UTF-8 et dont la propriété est détenue.

source: `&str` introduces a string slice, which is an immutable reference to UTF-8 encoded string data stored in a block of memory. String literals (`"Hello"`), are stored in the program’s binary.
fr_fr: `&str` introduit une tranche de chaîne, qui est une référence immuable à des données de chaîne encodées en UTF-8 stockées dans un bloc mémoire. Les littéraux de chaînes (`"Hello"`) sont stockés dans le binaire du programme.

source: Rust's `String` type is a wrapper around a vector of bytes. As with a `Vec<T>`, it is owned.
fr_fr: Le type `String` de Rust est une enveloppe autour d’un vecteur d’octets. Comme pour un `Vec<T>`, il en possède la propriété.

source: As with many other types `String::from()` creates a string from a string literal; `String::new()` creates a new empty string, to which string data can be added using the `push()` and `push_str()` methods.
fr_fr: Comme pour beaucoup d’autres types, `String::from()` crée une chaîne à partir d’un littéral ; `String::new()` crée une nouvelle chaîne vide, à laquelle on peut ajouter des données avec les méthodes `push()` et `push_str()`.

source: The `format!()` macro is a convenient way to generate an owned string from dynamic values. It accepts the same format specification as `println!()`.
fr_fr: La macro `format!()` est un moyen pratique de générer une chaîne possédée à partir de valeurs dynamiques. Elle accepte la même syntaxe de format que `println!()`.

source: You can borrow `&str` slices from `String` via `&` and optionally range selection. If you select a byte range that is not aligned to character boundaries, the expression will panic. The `chars` iterator iterates over characters and is preferred over trying to get character boundaries right.
fr_fr: Vous pouvez emprunter des tranches `&str` depuis une `String` via `&` et éventuellement une sélection de plage. Si vous sélectionnez une plage d’octets qui ne correspond pas aux limites des caractères, l’expression générera une panique. L’itérateur `chars` parcourt les caractères et est préférable à la gestion manuelle des limites.

source: For C++ programmers: think of `&str` as `std::string_view` from C++, but the one that always points to a valid string in memory. Rust `String` is a rough equivalent of `std::string` from C++ (main difference: it can only contain UTF-8 encoded bytes and will never use a small-string optimization).
fr_fr: Pour les programmeurs C++ : considérez `&str` comme un `std::string_view` de C++, mais qui pointe toujours vers une chaîne valide en mémoire. `String` en Rust est un équivalent approximatif de `std::string` (principale différence : elle ne peut contenir que des octets encodés en UTF-8 et n’utilisera jamais l’optimisation des petites chaînes).

source: Byte strings literals allow you to create a `&[u8]` value directly:
fr_fr: Les littéraux de chaînes d’octets permettent de créer directement une valeur `&[u8]` :

source: Raw strings allow you to create a `&str` value with escapes disabled: `r"\n" == "\\n"`. You can embed double-quotes by using an equal amount of `#` on either side of the quotes:
fr_fr: Les chaînes brutes permettent de créer une valeur `&str` sans échappement : `r"\n" == "\\n"`. Vous pouvez inclure des guillemets doubles en utilisant le même nombre de `#` de chaque côté des guillemets :

source: We will create a few utility functions for 3-dimensional geometry, representing a point as `[f64;3]`. It is up to you to determine the function signatures.
fr_fr: Nous allons créer quelques fonctions utilitaires pour de la géométrie en 3 dimensions, en représentant un point comme `[f64;3]`. C’est à vous de déterminer les signatures des fonctions.

source: // Calculate the magnitude of a vector by summing the squares of its coordinates // and taking the square root. Use the `sqrt()` method to calculate the square // root, like `v.sqrt()`.
fr_fr: // Calculez la norme d’un vecteur en sommant les carrés de ses coordonnées // puis en prenant la racine carrée. Utilisez la méthode `sqrt()` pour calculer // la racine carrée, comme `v.sqrt()`.

source: // Normalize a vector by calculating its magnitude and dividing all of its // coordinates by that magnitude.
fr_fr: // Normalisez un vecteur en calculant sa norme puis en divisant toutes ses // coordonnées par cette norme.

source: // Use the following `main` to test your work.
fr_fr: // Utilisez le `main` suivant pour tester votre travail.

source: "Magnitude of a unit vector: {}"
fr_fr: "Norme d'un vecteur unitaire : {}"

source: "Magnitude of {v:?}: {}"
fr_fr: "Norme de {v:?} : {}"

source: "Magnitude of {v:?} after normalization: {}"
fr_fr: "Norme de {v:?} après normalisation : {}"

source: /// Calculate the magnitude of the given vector.
fr_fr: /// Calcule la norme du vecteur donné.

source: /// Change the magnitude of the vector to 1.0 without changing its direction.
fr_fr: /// Change la norme du vecteur à 1.0 sans changer sa direction.\

source: Like C and C++, Rust has support for custom structs:
fr_fr: Comme en C et C++, Rust prend en charge les structures personnalisées :

source: "{} is {} years old"
fr_fr: "{} a {} ans"

source: Key Points:
fr_fr: Points clés :

source: Structs work like in C or C++.
fr_fr: Les structs fonctionnent comme en C ou en C++.

source: Like in C++, and unlike in C, no typedef is needed to define a type.
fr_fr: Comme en C++, et contrairement au C, aucun `typedef` n'est nécessaire pour définir un type.

source: Unlike in C++, there is no inheritance between structs.
fr_fr: Contrairement au C++, il n'y a pas d'héritage entre les structs.

source: This may be a good time to let people know there are different types of structs.
fr_fr: Cela pourrait être une bonne occasion pour faire savoir aux gens qu'il y a différents types de structs.

source: Zero-sized structs (e.g. `struct Foo;`) might be used when implementing a trait on some type but don’t have any data that you want to store in the value itself.
fr_fr: Les structures de taille nulle (par exemple `struct Foo;`) peuvent être utilisées lors de l’implémentation d’un trait sur un type, sans contenir de données à stocker dans la valeur elle-même.

source: The next slide will introduce Tuple structs, used when the field names are not important.
fr_fr: La prochaine diapositive présentera les structures en tuples, utilisées lorsque les noms des champs ne sont pas importants.

source: If you already have variables with the right names, then you can create the struct using a shorthand.
fr_fr: Si vous avez déjà des variables portant les bons noms, vous pouvez créer la structure à l’aide d’une syntaxe raccourcie.

source: The syntax `..avery` allows us to copy the majority of the fields from the old struct without having to explicitly type it all out. It must always be the last element.
fr_fr: La syntaxe `..avery` permet de copier la majorité des champs d’une structure existante sans devoir les écrire explicitement. Elle doit toujours apparaître en dernier.

source: If the field names are unimportant, you can use a tuple struct:
fr_fr: Si les noms des champs sont sans importance, vous pouvez utiliser une structure tuple :

source: This is often used for single-field wrappers (called newtypes):
fr_fr: C’est souvent utilisé pour des enveloppes à champ unique (appelées *newtypes*) :

source: "Ask a rocket scientist at NASA"
fr_fr: "Demandez à un ingénieur spatial de la NASA"

source: Newtypes are a great way to encode additional information about the value in a primitive type, for example:
fr_fr: Les *newtypes* sont un excellent moyen d’encoder des informations supplémentaires sur une valeur dans un type primitif, par exemple :

source: The number is measured in some units: `Newtons` in the example above.
fr_fr: Le nombre est exprimé dans une unité : `Newtons` dans l’exemple ci-dessus.

source: The value passed some validation when it was created, so you no longer have to validate it again at every use: `PhoneNumber(String)` or `OddNumber(u32)`.
fr_fr: La valeur a été validée lors de sa création, il n’est donc plus nécessaire de la valider à chaque utilisation : `PhoneNumber(String)` ou `OddNumber(u32)`.

source: Demonstrate how to add a `f64` value to a `Newtons` type by accessing the single field in the newtype.
fr_fr: Montrez comment ajouter une valeur de type `f64` à un type `Newtons` en accédant à son unique champ.

source: Rust generally doesn’t like inexplicit things, like automatic unwrapping or for instance using booleans as integers.
fr_fr: Rust évite en général les comportements implicites, comme le déballage automatique ou l’utilisation de booléens comme des entiers.

source: Operator overloading is discussed on Day 3 (generics).
fr_fr: La surcharge d’opérateurs est abordée le jour 3 (génériques).

source: The example is a subtle reference to the [Mars Climate Orbiter](https://en.wikipedia.org/wiki/Mars_Climate_Orbiter) failure.
fr_fr: Cet exemple fait subtilement référence à l’échec de la mission [Mars Climate Orbiter](https://en.wikipedia.org/wiki/Mars_Climate_Orbiter).

source: The `enum` keyword allows the creation of a type which has a few different variants:
fr_fr: Le mot-clé `enum` permet de créer un type qui possède plusieurs variantes différentes :

source: // Simple variant
fr_fr: // Variante simple

source: // Tuple variant
fr_fr: // Variante en tuple

source: // Struct variant
fr_fr: // Variante en struct

source: "On this turn: {:?}"
fr_fr: "À ce tour : {:?}"

source: Enumerations allow you to collect a set of values under one type.
fr_fr: Les énumérations permettent de regrouper un ensemble de valeurs sous un même type.

source: `Direction` is a type with variants. There are two values of `Direction`: `Direction::Left` and `Direction::Right`.
fr_fr: `Direction` est un type avec des variantes. Il existe deux valeurs pour `Direction` : `Direction::Left` et `Direction::Right`.

source: `PlayerMove` is a type with three variants. In addition to the payloads, Rust will store a discriminant so that it knows at runtime which variant is in a `PlayerMove` value.
fr_fr: `PlayerMove` est un type avec trois variantes. En plus des données embarquées, Rust stocke un discriminant pour déterminer à l’exécution quelle variante est présente dans une valeur `PlayerMove`.

source: This might be a good time to compare structs and enums:
fr_fr: C’est peut-être un bon moment pour comparer les structures et les énumérations :

source: In both, you can have a simple version without fields (unit struct) or one with different types of fields (variant payloads).
fr_fr: Dans les deux cas, il est possible d’avoir une version simple sans champs (*unit struct*) ou une version contenant différents types de champs (*variant payloads*).

source: You could even implement the different variants of an enum with separate structs but then they wouldn’t be the same type as they would if they were all defined in an enum.
fr_fr: Il est possible d’implémenter les différentes variantes d’une énumération avec des structures séparées, mais dans ce cas elles n’appartiendraient pas toutes au même type, contrairement à une énumération.

source: Rust uses minimal space to store the discriminant.
fr_fr: Rust utilise un espace minimal pour stocker le discriminant.

source: If necessary, it stores an integer of the smallest required size
fr_fr: Si nécessaire, il stocke un entier de la taille minimale requise

source: If the allowed variant values do not cover all bit patterns, it will use invalid bit patterns to encode the discriminant (the "niche optimization"). For example, `Option<&u8>` stores either a pointer to an integer or `NULL` for the `None` variant.
fr_fr: Si les variantes possibles ne couvrent pas tous les motifs binaires, Rust utilise des motifs invalides pour encoder le discriminant (l’« optimisation de niche »). Par exemple, `Option<&u8>` stocke soit un pointeur vers un entier, soit `NULL` pour la variante `None`.

source: You can control the discriminant if needed (e.g., for compatibility with C):
fr_fr: Il est possible de contrôler le discriminant si nécessaire (par exemple pour la compatibilité avec le langage C) :

source: Without `repr`, the discriminant type takes 2 bytes, because 10001 fits 2 bytes.
fr_fr: Sans `repr`, le type du discriminant prend 2 octets, car la valeur 10001 tient dans 2 octets.

source: More to Explore
fr_fr: Pour aller plus loin

source: Rust has several optimizations it can employ to make enums take up less space.
fr_fr: Rust dispose de plusieurs optimisations pour réduire l’espace occupé par les énumérations.

source: Null pointer optimization: For [some types](https://doc.rust-lang.org/std/option/#representation), Rust guarantees that `size_of::<T>()` equals `size_of::<Option<T>>()`.
fr_fr: Optimisation par pointeur nul : pour [certains types](https://doc.rust-lang.org/std/option/#representation), Rust garantit que `size_of::<T>()` est égal à `size_of::<Option<T>>()`.

source: Example code if you want to show how the bitwise representation _may_ look like in practice. It's important to note that the compiler provides no guarantees regarding this representation, therefore this is totally unsafe.
fr_fr: Exemple de code pour illustrer comment la représentation binaire _pourrait_ apparaître en pratique. Il est important de noter que le compilateur ne fournit aucune garantie à ce sujet : cette approche est donc totalement non sécurisée.

source: Static variables will live during the whole execution of the program, and therefore will not move:
fr_fr: Les variables statiques vivent pendant toute l’exécution du programme et ne sont donc jamais déplacées :

source: As noted in the [Rust RFC Book](https://rust-lang.github.io/rfcs/0246-const-vs-static.html), these are not inlined upon use and have an actual associated memory location. This is useful for unsafe and embedded code, and the variable lives through the entirety of the program execution. When a globally-scoped value does not have a reason to need object identity, `const` is generally preferred.
fr_fr: Comme indiqué dans le [Rust RFC Book](https://rust-lang.github.io/rfcs/0246-const-vs-static.html), ces variables ne sont pas intégrées directement lors de l’utilisation et possèdent un emplacement mémoire réel. Cela est utile dans du code non sécurisé ou embarqué, et la variable reste en vie pendant toute la durée d’exécution du programme. Si une valeur globale n’a pas besoin d’identité d’objet, on préfère généralement `const`.

source: `static` is similar to mutable global variables in C++.
fr_fr: `static` est similaire à une variable globale mutable en C++.

source: `static` provides object identity: an address in memory and state as required by types with interior mutability such as `Mutex<T>`.
fr_fr: `static` fournit une identité d’objet : une adresse mémoire et un état, comme requis par les types avec mutabilité interne tels que `Mutex<T>`.
